{
  "content": "Alone In London\nHesba Stretton\n\nCHAPTER I. NOT ALONE.\n\n\nIt had been a close and sultry day--one of the hottest of the\ndog-days--even out in the open country, where the dusky green leaves had\nnever stirred upon their stems since the sunrise, and where the birds had\nfound themselves too languid for any songs beyond a faint chirp now and\nthen. All day long the sun had shone down steadily upon the streets of\nLondon, with a fierce glare and glowing heat, until the barefooted\nchildren had felt the dusty pavement burn under their tread almost as\npainfully as the icy pavement had frozen their naked feet in the winter.\nIn the parks, and in every open space, especially about the cool splash\nof the fountains at Charing Cross, the people, who had escaped from the\ncrowded and unventilated back streets, basked in the sunshine, or sought\nevery corner where a shadow could be found. But in the alleys and slums\nthe air was heavy with heat and dust, and thick vapours floated up and\ndown, charged with sickening smells from the refuse of fish and\nvegetables decaying in the gutters. Overhead the small, straight strip of\nsky was almost white, and the light, as it fell, seemed to quiver with\nthe burden of its own burning heat.\n\nOut of one of the smaller thoroughfares lying between Holborn and the\nStrand, there opens a narrow alley, not more than six or seven feet\nacross, with high buildings on each side. In the most part the ground\nfloors consist of small shops; for the alley is not a blind one, but\nleads from the thoroughfare to another street, and forms, indeed, a short\ncut to it, pretty often used. These shops are not of any size or\nimportance--a greengrocer's, with a somewhat scanty choice of vegetables\nand fruit, a broker's, displaying queer odds and ends of household goods,\ntwo or three others, and at the end farthest from the chief thoroughfare,\nbut nearest to the quiet and respectable street beyond, a very\nmodest-looking little shop-window, containing a few newspapers, some\nrather yellow packets of stationery, and two or three books of ballads.\nAbove the door was painted, in very small, dingy letters, the words,\n\"James Oliver, News Agent.\"\n\nThe shop was even smaller, in proportion, than its window. After two\ncustomers had entered--if such an event could ever come to pass--it would\nhave been almost impossible to find room for a third. Along the end ran a\nlittle counter, with a falling flap by which admission could be gained to\nthe living-room lying behind the shop. This evening the flap was down--a\ncertain sign that James Oliver, the news agent, had some guest within,\nfor otherwise there would have been no occasion to lessen the scanty size\nof the counter. The room beyond was dark, very dark indeed, for the time\nof day; for, though the evening was coming on, and the sun was hastening\nto go down at last, it had not yet ceased to shine brilliantly upon the\ngreat city. But inside James Oliver's house the gas was already lighted\nin a little steady flame, which never flickered in the still, hot air,\nthough both door and window were wide open. For there was a window,\nthough it was easy to overlook it, opening into a passage four feet wide,\nwhich led darkly up into a still closer and hotter court, lying in the\nvery core of the maze of streets. As the houses were four stories high,\nit is easy to understand that very little sunlight could penetrate to\nOliver's room behind his shop, and that even at noonday it was twilight\nthere. This room was of a better size altogether than a stranger might\nhave supposed, having two or three queer little nooks and recesses\nborrowed from the space belonging to the adjoining house; for the\nbuildings were old, and had probably been one large dwelling in former\ntimes. It was plainly the only apartment the owner had; and all its\narrangements were those of a man living alone, for there was something\nalmost desolate about the look of the scanty furniture, though it was\nclean and whole. There had been a fire, but it had died out, and the\ncoals were black in the grate, while the kettle still sat upon the top\nbar with a melancholy expression of neglect about it.\n\nJames Oliver himself had placed his chair near to the open door, where he\ncould keep his eye upon the shop--a needless precaution, as at this hour\nno customers ever turned into it. He was an old man, and seemed very old\nand infirm by the dim light. He was thin and spare, with that peculiar\nspareness which results from the habit of always eating less than one\ncan. His teeth, which had never had too much to do, had gone some years\nago, and his cheeks fell in rather deeply. A fine network of wrinkles\npuckered about the corners of his eyes and mouth. He stooped a good deal,\nand moved about with the slowness and deliberation of age. Yet his face\nwas very pleasant--a cheery, gentle, placid face, lighted up with a smile\nnow and then, but with sufficient rareness to make it the more welcome\nand the more noticed when it came.\n\nOld Oliver had a visitor this hot evening, a neat, small, dapper woman,\nwith a little likeness to himself, who had been putting his room to\nrights, and looking to the repairs needed by his linen. She was just\nreplacing her needle, cotton, and buttons in an old-fashioned housewife,\nwhich she always carried in her pocket, and was then going to put on her\nblack silk bonnet and coloured shawl, before bidding him goodbye.\n\n\"Eh, Charlotte,\" said Oliver, after drawing a long and toilsome breath,\n\"what would I give to be a-top of the Wrekin, seeing the sun set this\nevening! Many and many's the summer afternoon we've spent there when we\nwere young, and all of us alive. Dost remember how many a mile of country\nwe could see all round us, and how fresh the air blew across the\nthousands of green fields? Why, I saw Snowdon once, more than sixty miles\noff, when my eyes were young and it was a clear sunset. I always think of\nthe top of the Wrekin when I read of Moses going up Mount Pisgah and\nseeing all the land about him, north and south, east and west. Eh, lass!\nthere's a change in us all now!\"\n\n\"Ah! it's like another world!\" said the old woman, shaking her head\nslowly. \"All the folks I used to sew for at Aston, and Uppington, and\nOverlehill, they'd mostly be gone or dead by now. It wouldn't seem like\nthe same place at all. And now there's none but you and me left, brother\nJames. Well, well! its lonesome, growing old.\"\n\n\"Yes, lonesome, yet not exactly lonesome,\" replied old Oliver, in a\ndreamy voice. \"I'm growing dark a little, and just a trifle deaf, and I\ndon't feel quite myself like I used to do; but I've got something I\ndidn't use to have. Sometimes of an evening, before I've lit the gas,\nI've a sort of a feeling as if I could almost see the Lord Jesus, and\nhear him talking to me. He looks to me something like our eldest brother,\nhim that died when we were little. Charlotte, thee remembers him? A\nwhite, quiet, patient face, with a smile like the sun shining behind\nclouds. Well, whether it's only a dream or no I cannot tell, but there's\na face looks at me, or seems to look at me out of the dusk; and I think\nto myself, maybe the Lord Jesus says, 'Old Oliver's lonesome down there\nin the dark, and his eyes growing dim. I'll make myself half-plain to\nhim.' Then he comes and sits here with me for a little while.\"\n\n\"Oh, that's all fancy as comes with you living quite alone,\" said\nCharlotte, sharply.\n\n\"Perhaps so! perhaps so!\" answered the old man, with a meek sigh; \"but I\nshould be very lonesome without that.\"\n\nThey did not speak again until Charlotte had given a final shake to the\nbed in the corner, upon which her bonnet and shawl had been lying. She\nput them on neatly and primly; and when she was ready to go she spoke\nagain in a constrained and mysterious manner.\n\n\"Heard nothing of Susan, I suppose?\" she said.\n\n\"Not a word,\" answered old Oliver, sadly. \"It's the only trouble I've\ngot. That were the last passion I ever went into, and I was hot and\nhasty, I know.\"\n\n\"So you always used to be at times,\" said his sister.\n\n\"Ah! but that passion was the worst of all,\" he went on, speaking\nslowly. \"I told her if she married young Raleigh, she should never darken\nmy doors again--never again. And she took me at my word though she might\nhave known it was nothing but father's hot temper. Darken my doors! Why,\nthe brightest sunshine I could have 'ud be to see her come smiling into\nmy shop, like she used to do at home.\"\n\n\"Well, I think Susan ought to have humbled herself,\" said Charlotte.\n\"It's going on for six years now, and she's had time enough to see her\nfolly. Do you know where she is?\"\n\n\"I know nothing about her,\" he answered, shaking his head sorrowfully.\n\"Young Raleigh was wild, very wild, and that was my objection to him;\nbut I didn't mean Susan to take me at my word. I shouldn't speak so\nhasty and hot now.\"\n\n\"And to think. I'd helped to bring her up so genteel, and with such\npretty manners!\" cried the old woman, indignantly. \"She might have done\nso much better with her cleverness too. Such a milliner as she might have\nturned out! Well good-bye, brother James, and don't go having any more of\nthose visions; they're not wholesome for you.\"\n\n\"I should be very lonesome without them,\" answered Oliver. \"Good-bye,\nCharlotte, good-bye, and God bless you. Come again as soon as you can.\"\n\nHe went with her to the door, and stayed to watch her along the quiet\nalley, till she turned into the street. Then, with a last nod to the back\nof her bonnet, as she passed out of his sight, he returned slowly into\nhis dark shop, put up the flap of the counter, and retreated to the\ndarker room within. Hot as it was, he fancied it was growing a little\nchilly with the coming of the night, and he drew on his old coat, and\nthrew a handkerchief over his white head, and then sat down in the dusk,\nlooking out into his shop and the alley beyond it. He must have fallen\ninto a doze after a while, being overcome with the heat, and lulled by\nthe constant hum of the streets, which reached his dull ear in a softened\nmurmur; for at length he started up almost in a fright, and found that\ncomplete darkness had fallen upon him suddenly, as it seemed to him. A\nchurch clock was striking nine, and his shop was not closed yet. He went\nout hurriedly to put the shutters up.\n\n\n\n\nCHAPTER II. WAIFS AND STRAYS.\n\n\nIn the shop it was not yet so dark but that old Oliver could see his way\nout with the shutters, which during the day occupied a place behind the\ndoor. He lifted the flap of the counter, and was about to go on with his\nusual business, when a small voice, trembling a little, and speaking from\nthe floor at his very feet, caused him to pause suddenly.\n\n\"Please, rere's a little girl here,\" said the voice.\n\nOliver stooped down to bring his eyes nearer to the ground, until he\ncould make out the indistinct outline of the figure of a child, seated on\nhis shop floor, and closely hugging a dog in her arms. Her face looked\nsmall to him; it was pale, as if she had been crying quietly, and though\nhe could not see them, a large tear stood on each of her cheeks.\n\n\"What little girl are you?\" he asked, almost timidly.\n\n\"Rey called me Dolly,\" answered the child.\n\n\"Haven't you any other name?\" inquired old Oliver\n\n\"Nosing else but Poppet,\" she said; \"rey call me Dolly sometimes, and\nPoppet sometimes. Ris is my little dog, Beppo.\"\n\nShe introduced the dog by pushing its nose into his hand, and Beppo\ncomplacently wagged his tail and licked the old man's withered fingers.\n\n\"What brings you here in my shop, my little woman?\" asked Oliver.\n\n\"Mammy brought me,\" she said, with a stifled sob; \"she told me run in\nrere, Dolly, and stay till mammy comes back, and be a good girl always.\nAm I a good girl?\"\n\n\"Yes, yes,\" he answered, soothingly; \"you're a very good little girl, I'm\nsure; and mother 'ill come back soon, very soon. Let us go to the door,\nand look for her.\"\n\nHe took her little hand in his own; such a little hand it felt, that he\ncould not help tightening his fingers fondly over it; and then they stood\nfor a few minutes on the door-sill, while old Oliver looked anxiously up\nand down the alley. At the greengrocer's next door there flared a bright\njet of gas, and the light shone well into the deepening darkness. But\nthere was no woman in sight, and the only person about was a ragged boy,\nbarefoot and bareheaded with no clothing but a torn pair of trousers,\nvery jagged about the ankles, and a jacket through which his thin\nshoulders displayed themselves. He was lolling in the lowest window-sill\nof the house opposite, and watched Oliver and the little girl looking\nabout them with sundry signs of interest and amusement.\n\n\"She ain't nowhere in sight,\" he called across to them after a while,\n\"nor won't be, neither, I'll bet you. You're looking out for the little\nun's mother, ain't you, old master?\"\n\n\"Yes,\" answered Oliver; \"do you know anything about her, my boy?\"\n\n\"Nothink,\" he said, with a laugh; \"only she looked as if she were up to\nsome move, and as I'd nothink particular on hand, I just followed her.\nShe was somethink like my mother, as is dead, not fat or rosy, you know,\nwith a bit of a bruise about her eye, as if somebody had been fighting\nwith her. I thought there'd be a lark when she left the little 'un in\nyour shop, so I just stopped to see. She bolted as if the bobbies were\nafter her.\"\n\n\"How long ago?\" asked Oliver, anxiously.\n\n\"The clocks had just gone eight,\" he answered; \"I've been watching for\nyou ever since.\"\n\n\"Why! that's a full hour ago,\" said the old man, looking wistfully down\nthe alley; \"it's time she was come back again for her little girl.\"\n\n[THE LITTLE STRANGER.]\n\nBut there was no symptom of anybody coming to claim the little girl, who\nstood very quietly at his side, one hand holding the dog fast by his ear,\nand the other still lying in Oliver's grasp. The boy hopped on one foot\nacross the narrow alley, and looked up with bright, eager eyes into the\nold man's face.\n\n\"I say,\" he said, earnestly, \"don't you go to give her up to the p'lice.\nThey'd take her to the house, and that's worse than the jail. Bless yer!\nthey'd never take up a little thing like that to jail for a wagrant. You\njust give her to me, and I'll take care of her. It 'ud be easy enough to\nfind victuals for such a pretty little thing as her. You give her up to\nme, I say.\"\n\n\"What's your name?\" asked Oliver, clasping the little hand tighter, \"and\nwhere do you come from?\"\n\n\"From nowhere particular,\" answered the boy; \"and my name's Antony; Tony,\nfor short. I used to have another name; mother told it me afore she died,\nbut it's gone clean out o' my head. Tony I am, anyhow, and you can call\nme by it, if you choose.\"\n\n\"How old are you, Tony?\" inquired Oliver, still lingering on the\nthreshold, and looking up and down with his dim eyes.\n\n\"Bless yer! I don't know,\" replied Tony; \"I weren't much bigger nor\nher when mother died, and I've found myself ever since. I never had\nany father.\"\n\n\"Found yourself!\" repeated the old man, absently.\n\n\"Ah, it's not bad in the summer,\" said Tony, more earnestly than before:\n\"and I could find for the little 'un easy enough. I sleep anywhere, in\nCovent Garden sometimes, and the parks--anywhere as the p'lice 'ill let\nme alone. You won't go to give her up to them p'lice, will you now, and\nshe so pretty?\"\n\nHe spoke in a beseeching tone, and old Oliver looked down upon him\nthrough his spectacles, with a closer survey than he had given to him\nbefore. The boy's face was pale and meagre, with an unboyish sharpness\nabout it, though he did not seem more than nine or ten years old. His\nglittering eyes were filled with tears, and his colourless lips quivered.\nHe wiped away the tears roughly upon the ragged sleeve of his jacket.\n\n\"I never were such a baby before,\" said Tony, \"only she is such a nice\nlittle thing, and such a tiny little 'un. You'll keep her, master, won't\nyou? or give her up to me?\"\n\n\"Ay, ay! I'll take care of her,\" answered Oliver, \"till her mother comes\nback for her. She'll come pretty soon, I know. But she wants her supper\nnow, doesn't she?\"\n\nHe stooped down to bring his face nearer to the child's, and she raised\nher hand to it, and stroked his cheek with her warm, soft fingers.\n\n\"Beppo wants his supper, too,\" she said, in a clear, shrill, little\nvoice, which penetrated easily through old Oliver's deafened hearing.\n\n\"And Beppo shall have some supper as well as the little woman,\" he\nanswered. \"I'll put the shutters up now, and leave the door ajar, and the\ngas lit for mother to see when she comes back; and if mother shouldn't\ncome back to night, the little woman will sleep in my bed, won't she?\"\n\n\"Dolly's to be a good girl till mammy comes back,\" said the child,\nplaintively, and holding harder by Beppo's ear.\n\n\"Let me put the shutters up, master,\" cried Tony, eagerly; \"I won't\ncharge you nothink, and I'll just look round in the morning to see how\nyou're getting along. She is such a very little thing.\"\n\nThe shutters were put up briskly, and then Tony took a long, farewell\ngaze of the old man and the little child, but he could not offer to touch\neither of them. He glanced at his hands, and Oliver did the same; but\nthey both shook their heads.\n\n\"I'll have a wash in the morning afore I come,\" he said, nodding\nresolutely; \"good-bye, guv'ner; goodbye, little 'un.\"\n\nOld Oliver went in, leaving his door ajar, and his gas lit, as he had\nsaid. He fed the hungry child with bread and butter, and used up his\nhalf-pennyworth of milk, which he bought for himself every evening. Then\nhe lifted her on to his knee, with Beppo in her arms, and sat for a long\nwhile waiting. The little head nodded, and Dolly sat up, unsteadily\nstriving hard to keep awake; but at last she let Beppo drop to the floor,\nwhile she herself fell upon the old man's breast, and lay there without\nmoving. It chimed eleven o'clock at last, and Oliver knew it was of no\nuse to watch any longer.\n\nHe managed to undress his little charge with gentle, though trembling\nhands, and then he laid her down on his bed, putting his only pillow\nagainst the wall to make a soft nest for the tender and sleepy child. She\nroused herself for a minute, and stared about her, gazing steadily, with\nlarge, tearful eyes, into his face. Then as he sat down on the bedstead\nbeside her, to comfort her as well as he could, she lifted herself up,\nand knelt down, with her folded hands laid against his shoulder.\n\n\"Dolly vewy seepy,\" she lisped, \"but must say her prayers always.\"\n\n\"What are your prayers, my dear?\" he asked.\n\n\"On'y God bless gan-pa, and father, and mammy, and poor Beppo, and make\nme a good girl,\" murmured the drowsy voice, as Dolly closed her eyes\nagain, and fell off into a deep sleep the next moment.\n\n\n\n\nCHAPTER III. A LITTLE PEACEMAKER.\n\n\nIt was a very strange event which had befallen old Oliver. He went back\nto his own chair, where he smoked his Broseley pipe every night, and sank\ndown in it, rubbing his legs softly; for it was a long time since he had\nnursed any child, and even Dolly's small weight was a burden to him. Her\ntiny clothes were scattered up and down, and there was no one beside\nhimself to gather them together, and fold them straight. In shaking out\nher frock a letter fell from it, and Oliver picked it up wondering\nwhoever it could be for. It was directed to himself, \"Mr. James Oliver,\nNews-agent,\" and he broke the seal with eager expectation. The contents\nwere these, written in a handwriting which he knew at first sight to be\nhis daughter's:--\n\n\"DEAR FATHER,\n\n\"I am very very sorry I ever did anything to make you angry with me. This\nis your poor Susan's little girl, as is come to be a little peacemaker\nbetwixt you and me. I'm certain sure you'll never turn her away from your\ndoor. I'm going down to Portsmouth for three days, because he listed five\nmonths ago, and his regiment's ordered out to India, and he sails on\nFriday. So I thought I wouldn't take my little girl to be in the way, and\nI said I'll leave her with father till I come back, and her pretty little\nways will soften him towards me, and we'll live all together in peace and\nplenty till his regiment comes home again, poor fellow. For he's very\ngood to me when he's not in liquor, which is seldom for a man. Please do\nforgive me for pity's sake, and for Christ's sake, if I'm worthy to use\nhis name, and do take care of my little girl till I come home to you both\non Friday, From your now dutiful daughter,\n\n\"POOR SUSAN.\"\n\nThe tears rolled fast down old Oliver's cheeks as he read this letter\nthrough twice, speaking the words half aloud to himself. Why! this was\nhis own little grandchild, then--his very own! And no doubt Susan had\nchristened her Dorothy, after her own mother, his dear wife, who had died\nso many years ago. Dolly was the short for Dorothy, and in early times he\nhad often called his wife by that name. He had turned his gas off and\nlighted a candle, and now he took it up and went to the bedside to look\nat his new treasure. The tiny face lying upon his pillow was rosy with\nsleep, and the fair curly hair was tossed about in pretty disorder. His\nspectacles grew very dim indeed, and he was obliged to polish them\ncarefully on his cotton handkerchief before he could see his\ngrand-daughter plainly enough. Then he touched her dimpled cheek\ntremblingly with the end of his finger, and sobbed out, \"Bless her! bless\nher!\" He returned to his chair, his head shaking a good deal before he\ncould regain his composure; and it was not until he had kindled his pipe,\nand was smoking it, with his face turned towards the sleeping child, that\nhe felt at all like himself again.\n\n\"Dear Lord!\" he said, half aloud, between the whiffs of his pipe, \"dear\nLord! how very good thou art to me! Didst thee not say, 'I'll not leave\nthee comfortless, I'll come to thee?' I know what that means, bless thy\nname; and the good Spirit has many a time brought me comfort, and cheered\nmy heart. I know thou didst not leave me alone before. No, no! that was\nfar from thee, Lord. Alone!--why, thou'rt always here; and now there's\nthe little lass as well. Lonesome!--they don't know thee, Lord, and they\ndon't know me. Thou'rt here, with the little lass and me. Yes,\nyes,--yes.\"\n\nHe murmured the word \"yes\" in a tone of contentment over and over again,\nuntil, the pipe being finished, he prepared for sleep also. But no sleep\ncame to the old man. He was too full of thought, and too fearful of the\nchild waking in the night and wanting something. The air was close and\nhot, and now and then a peal of thunder broke overhead; but a profound\npeace and tranquillity, slightly troubled by his new joy, held possession\nof him. His grandchild was there, and his daughter was coming back to him\nin three days.\n\nOh, how he would welcome her! He would not let her speak one word of her\nwilfulness and disobedience, and the long, cruel neglect which had left\nhim in ignorance of where she lived, and what had become of her. It was\npartly his fault, for having been too hard upon her, and too hasty and\nhot-tempered. He had learnt better since then.\n\n\n\n\nCHAPTER IV. OLD OLIVER'S MASTER.\n\n\nVery early in the morning, before the tardy daylight could creep into the\ndarkened room, old Oliver was up and busy. He had been in the habit of\ndoing for himself, as he called it, ever since his daughter had forsaken\nhim, and he was by nature fastidiously clean and neat. But now there\nwould be additional duties for him during the next three days; for there\nwould be Dolly to wash, and dress, and provide breakfast for. Every few\nminutes he stole a look at her lying still asleep; and as soon as he\ndiscovered symptoms of awaking, he hastily lifted Beppo on to the bed,\nthat her opening eyes should be greeted by some familiar sight. She\nstretched out her wonderful little hands, and caught hold of the dog's\nrough head before venturing to lift her eyelids, while Oliver looked on\nin speechless delight. At length she ventured to peep slyly at him, and\nthen addressed herself to Beppo.\n\n\"What am I to call ris funny old man, Beppo?\" she asked.\n\n\"I am your grandpa, my darling,\" said Oliver, in his softest voice.\n\n\"Are you God-bless-gan-pa?\" inquired Dolly, sitting up on her pillow, and\nstaring very hard with her blue eyes into his wrinkled face.\n\n\"Yes, I am,\" he answered, looking at her anxiously.\n\n\"Dolly knows,\" she said, counting upon her little fingers; \"rere's\nfather, and mammy, and Beppo; and now rere's gan-pa. Dolly'll get up\nnow.\"\n\nShe flung her arms suddenly about his neck and kissed him, while old\nOliver trembled with intense joy. It was quite a marvel to him how she\nhelped him to dress her, laughing merrily at the strange mistakes he made\nin putting on her clothes the wrong side before; and when he assured her\nthat her mother would come back very soon, she seemed satisfied to put up\nwith any passing inconvenience. The shop, with its duties, and the\nnecessity of getting in his daily stock of newspapers, entirely slipped\nhis memory; and he was only recalled to it by a very loud rapping at the\ndoor as he was pouring out Dolly's breakfast. To his great surprise he\ndiscovered that he had forgotten to take down his shutters, though it was\npast the hour when his best customers passed by.\n\nThe person knocking proved to be none other than Tony, who greeted the\nold man's appearance with a prolonged whistle, and a grave and\nreproachful stare.\n\n\"Come,\" he said, in a tone of remonstrance, \"this'll never do, you know.\nBusiness is business, and must be minded. You pretty nearly frightened\nme into fits; anybody could have knocked me down with a straw when I see\nthe shutters up. How is she?\"\n\n\"She's very well, thank you, my boy,\" answered Oliver, meekly.\n\n\"Mother not turned up, I guess?\" said Tony.\n\n\"No; she comes on Friday,\" he replied.\n\nTony winked, and put his tongue into his cheek; but he gave utterance to\nno remark until after the shutters were in their place. Then he surveyed\nhimself as well as he could, with an air of satisfaction. His face and\nhands were clean, and his skin looked very white through the holes in his\ntattered clothes; even his feet, except for an unavoidable under surface\nof dust, were unsoiled. His jacket and trousers appeared somewhat more\ntorn than the evening before; but they bore every mark of having been\nwashed also.\n\n\"Washed myself early in the morning, afore the bobbies were much about,\"\nremarked Tony, \"in the fountains at Charing Cross; but I hadn't time to\nget my rags done, so I did 'em down under the bridge, when the tide were\ngoing down; but I could only give 'em a bit of a swill and a ring out.\nAnyhow, I'm a bit cleaner this morning than last night, master.\"\n\n\"To be sure, to be sure,\" answered Oliver. \"Come in, my boy, and I'll\ngive you a bit of breakfast with her and me.\"\n\n\"You haven't got sich a thing as a daily paper, have you?\" asked Tony, in\na patronizing tone.\n\n\"Not to-day's paper, I'm afraid,\" he said.\n\n\"I'm afraid not,\" continued Tony; \"overslept yourself, eh? Not as I can\nread myself; but there are folks going by as can, and might p'raps buy\none here as well as anywhere else. Shall I run and get 'em for you, now\nI'm on my legs?\"\n\nOliver looked questioningly at the boy, who returned a frank, honest\ngaze, and said, \"Honour bright!\" as he held out his hand for the money.\nThere was some doubt in the old man's mind after Tony had disappeared as\nto whether he had not done a very foolish thing; but he soon forgot it\nwhen he returned to the breakfast-table; and long before he himself could\nhave reached the place and returned, Tony was back again with his right\nnumber of papers.\n\nBefore many minutes Tony was sitting upon an old box at a little distance\nfrom the table, where Oliver sat with his grandchild. A basin of coffee\nand a large hunch of bread rested upon his knees, and Beppo was sniffing\nround him with a doubtful air. Dolly was shy in this strange company,\nand ate her breakfast with a sedate gravity which filled both her\ncompanions with astonishment and admiration. When the meal was finished,\nold Oliver took his daughter's letter from his waistcoat pocket and read\nit aloud to Tony, who listened with undivided interest.\n\n\"Then she's your own little 'un,\" he said, with a sigh of disappointment.\n\"You'll never give her up to me, if you get tired of her,--nor to the\np'lice neither,\" he added, with a brightening face.\n\n\"No, no, no!\" answered Oliver, emphatically. \"Besides, her mother's\ncoming on Friday. I wouldn't give her up for all the world, bless her!\"\n\n\"And he's 'listed!\" said Tony, in a tone of envy. \"They wouldn't take me\nyet a while, if I offered to go. But who's that she speaks of?--'for\nChrist's sake, if I am worthy to use his name.' Who is he?\"\n\n\"Don't you know?\" asked Oliver.\n\n\"No, never heard tell of him before,\" he answered. \"Is he any friend o'\nyours?\" [A]\n\n[Footnote A: It may be necessary to assure some readers that this\nignorance is not exaggerated. The City Mission Reports, and similar\nrecords, show that such cases are too frequent.]\n\n\"Ay!\" said Oliver; \"he's my only friend, my best friend. And he's my\nmaster, besides.\"\n\n\"And she thinks he'd be angry if you turned the little girl away?\"\npursued Tony.\n\n\"Yes, yes; he'd be very angry,\" said old Oliver, thoughtfully; \"it 'ud\ngrieve him to his heart. Why, he's always loved little children, and\nnever had them turned away from himself, whatever he was doing. If she\nhadn't been my own little girl, I daren't have turned her out of my\ndoors. No, no, dear Lord, thee knows as I'd have taken care of her, for\nthy sake.\"\n\nHe spoke absently, in a low voice, as though talking to some person\nwhom Tony could not see, and the boy was silent a minute or two,\nthinking busily.\n\n\"How long have you worked for that master o' yours?\" he asked, at last.\n\n\"Not very long,\" replied Oliver, regretfully. \"I used to fancy I was\nworking for him years and years ago; but, dear me! it was poor sort\no'work; and now I can't do very much. Only he knows how old I am, and he\ndoesn't care so that I love him, which I do, Tony.\"\n\n\"I should think so!\" said the boy, falling again into busy thought, from\nwhich he aroused himself by getting up from his box, and rubbing his\nfingers through his wet and tangled hair.\n\n\"He takes to children and little 'uns?\" he said, in a questioning tone.\n\n\"Ay, dearly!\" answered old Oliver.\n\n\"I reckon he'd scarcely take me for a man yet,\" said Tony, at the same\ntime drawing himself up to his full height; \"though I don't know as I\nshould care to work for him. I'd rather have a crossing, and be my own\nmaster. But if I get hard up, do you think he'd take to me, if you spoke\na word for me?\"\n\n\"Are you sure you don't know anything about him?\" asked Oliver.\n\n\"Not I; how should I?\" answered Tony. \"Why, you don't s'pose as I know\nall the great folks in London, though I've seen sights and sights of 'em\nriding about in their carriages. I told you I weren't much bigger nor her\nthere when mother died, and I've picked up my living up and down the\nstreets anyhow, and other lads have helped me on, till I can help 'em on\nnow. It don't cost much to keep a boy on the streets. There's nothink to\npay for coals, or rent, or beds, or furniture, or anythink; only your\nvictuals, and a rag now and then. All I want's a broom and a crossing,\nand then shouldn't I get along just? But I don't know how to get 'em.\"\n\n\"Perhaps the Lord Jesus would give them to you, if you'd ask him,\" said\nOliver, earnestly.\n\n\"Who's he?\" inquired Tony, with an eager face.\n\n\"Him--Christ. It's his other name,\" answered the old man.\n\n\"Ah! I see,\" he said, nodding. \"Well, if I can't get 'em myself,\nI'll think about it. He'll want me to work for him, you know. Where\ndoes he live?\"\n\n\"I'll tell you all about him, if you'll come to see me,\" replied Oliver.\n\n\"Well,\" said the boy, \"I'll just look in after Friday, and see if the\nlittle 'un's mother's come back. Goodbye,--good-bye, little miss.\"\n\nHe could take Dolly's hand into his own this morning, and he looked down\ncuriously at it,--a small, rosy, dimpled hand, such as he had never seen\nbefore so closely. A lump rose in his throat, and his eyelids smarted\nwith tears again. It was such a little thing, such a pretty little thing,\nhe said to himself, covering it fondly with his other hand. There was no\nfear that Tony would forget to come back to old Oliver's house.\n\n\"Thank you for my breakfast,\" he said, with a choking voice; \"only if\nI do come to see you, it'll be to see her again--not for anythink as\nI can get.\"\n\n\n\n\nCHAPTER V. FORSAKEN AGAIN.\n\n\nThe next three days were a season of unmixed happiness to old Oliver. The\nlittle child was so merry, yet withal so gentle and sweet-tempered, that\nshe kept him in a state of unwearied delight, without any alloy of\nanxiety or trouble. She trotted at his side with short, running\nfootsteps, when he went out early in the morning to fetch his daily stock\nof newspapers. She watched him set his room tidy, and made believe to\nhelp him by dusting the legs and seats of his two chairs. She stood with\nfolded hands and serious face, looking on as he was busy with his\ncooking. When she was not thus engaged she played contentedly with Beppo,\nprattling to him in such a manner, that Oliver often forgot what he was\nabout while listening to her. She played with him, too, frolicsome little\ngames of hide-and-seek, in which he grew as eager as herself; and\nsometimes she stole his spectacles, or handkerchief, or anything she\ncould lay her mischievous fingers upon to hide away in some unthought-of\nspot; while her shrewd, cunning little face put on an expression of\nprofound gravity as old Oliver sought everywhere for them.\n\nAs Friday evening drew near, the old man's gladness took a shade of\nanxiety. His daughter was coming home to him, and his heart was full of\nunutterable joy and gratitude; but he did not know exactly how they\nshould go on in the future. He was averse to change; yet this little\nhouse, with its single room, to which he had moved when she forsook him,\nwas too scanty in its accommodation. He had made up a rude sort of bed\nfor himself under the counter in the shop, and was quite ready to give up\nhis own to Susan and his little love, as he called Dolly; but would Susan\nlet him have his own way in this, and many other things? He provided a\nsumptuous tea, and added a fresh salad to it from the greengrocer's next\ndoor; but though he and Dolly waited and watched till long after the\nchild's bed-time, taking occasional snatches of bread and butter, still\nSusan did not arrive. At length a postman entered the little shop with a\nnoise which made Oliver's heart beat violently, and tossed a letter down\nupon the counter. He carried it to the door, where there was still light\nenough to read it, and saw that it was in Susan's handwriting.\n\n\"MY DEAR AND DEAREST FATHER,\n\n\"My heart is almost broke, betwixt one thing and another. His regiment\nis to set sail immediate, and the colonel's lady has offered me very\nhandsome wages to go out with her as lady's maid, her own having\ndisappointed her at the last moment; which I could do very well, knowing\nthe dressmaking. He said, 'Do come, Susan, and I'll never get drunk\nagain, so help me God; and if you don't, I shall go to the bad\naltogether; for I do love you, Susan.' I said, 'Oh my child!' And the\ncolonel's lady said, 'She's safe with her grandfather; and if he's a\ngood man, as you say he is, he'll take the best of care of her. I'll\ngive you three pounds to send him from here, and we'll send more from\nCalcutta.' So they overpersuaded me, and there isn't even time to come\nback to London, for we are going in a few hours. You'll take care of my\nlittle dear, I know, you and aunt Charlotte. I've sent a little box of\nclothes for her by the railway, and what more she wants aunt Charlotte\nwill see to, I'm sure, and do her mending, and see to her manners till I\ncome home. Oh! if I could only hear you say 'Susan, my dear, I forgive\nyou, and love you almost as much as ever,' I'd go with a lighter heart,\nand be almost glad to leave Dolly to be a comfort to you. She will be a\ncomfort to you, though she is so little, I'm sure. Tell her mammy says\nshe must be a good girl always till mammy comes back. A hundred thousand\nkisses for my dear father and my little girl. We shall come home as soon\nas ever we can; but I don't rightly know where India is. I think it's my\nbounden duty to go with him, as things have turned out. Pray God take\ncare of us all.\n\n\"Your loving, sorrowful daughter,\n\n\"SUSAN RALEIGH.\"\n\n\n\n\nCHAPTER VI. THE GRASSHOPPER A BURDEN.\n\n\nIt was some time before the full meaning of Susan's letter penetrated\nto her father's brain; but when it did, he was not at first altogether\npained by it. True, it was both a grief and disappointment to think\nthat his daughter, instead of returning to him, was already on her way\nacross the sea to a very distant land. But as this came slowly to his\nmind, there came also the thought that there would now be no one to\ndivide with him the treasure committed to his charge. The little child\nwould belong to him alone. They might go on still, living as they had\ndone these last three days, and being all in all to one another. If he\ncould have chosen, his will would certainly have been for Susan to\nreturn to them; but, since he could not have his choice, he felt that\nthere were some things which would be all the happier for him because\nof her absence.\n\nHe put Dolly to bed, and then went out to shut up the shop for the night.\nAs he carried in his feeble arms a single shutter at a time, he heard\nhimself hailed by a boy's voice, which was lowered to a low and\nmysterious whisper, and which belonged to Tony, who took the shutter out\nof his hands.\n\n\"S'pose the mother turned up all right?\" he said, pointing with his thumb\nthrough the half open door.\n\n\"No,\" answered Oliver. \"I've had another letter from her, and she's\ngone out to India with her husband, and left the little love to live\nalone with me.\"\n\n\"But whatever'll the Master say to that?\" inquired Tony.\n\n\"What master?\" asked old Oliver.\n\n\"Him--Lord Jesus Christ. What'll he say to her leaving you and the\nlittle 'un again?\" said Tony, with an eager face.\n\n\"Oh! he says a woman ought to leave her father, and keep to her husband,\"\nhe answered, somewhat sadly. \"It's all right, that is.\"\n\n\"I s'pose he'll help you to take care of the little girl,\" said Tony.\n\n\"Ay will he; him and me,\" replied old Oliver; \"there's no fear of that.\nYou never read the Testament, of course, my boy?\"\n\n\"Can't read, I told you,\" he answered. \"But what's that?\"\n\n\"A book all about him, the Lord Jesus,\" said Oliver, \"what he's done, and\nwhat he's willing to do for people. If you'll come of an evening, I'll\nread it aloud to you and my little love. She'll listen as quiet and good\nas any angel.\"\n\n\"I'll come to-morrow,\" answered Tony, readily; and he lingered about the\ndoorway until he heard the old man inside fasten the bolts and locks, and\nsaw the light go out in the pane of glass over the door. Then he\nscampered noiselessly with his naked feet along the alley in the\ndirection of Covent Garden, where he purposed to spend the night, if left\nundisturbed.\n\nOld Oliver went back into his room, where the tea-table was still set\nout for his Susan's welcome; but he had no heart to clear the things\naway. A chill came over his spirit as his eye fell upon the preparations\nhe had made to give her such a cordial greeting, that she would know at\nonce he had forgiven her fully. He lit his pipe, and sat pondering\nsorrowfully over all the changes that had happened to him since those\nold, far-away days when he was a boy, in the pleasant, fresh, healthy\nhomestead at the foot of the Wrekin. He felt all of a sudden how very old\nhe was; a poor, infirm, hoary old man. His sight was growing dim even,\nand his hearing duller every day; he was sure of it. His limbs ached\noftener, and he was earlier wearied in the evening; yet he could not\nsleep soundly at nights, as he had been used to do. But, worst of all,\nhis memory was not half as good as it had been. Sometimes, of late, he\nhad caught himself reading a newspaper quite a fortnight old, and he had\nnot found it out till he happened to see the date at the top. He could\nnot recollect the names of people as he did once; for many of his\ncustomers to whom he supplied the monthly magazines were obliged to tell\nhim their names and the book they wanted every time, before he could\nremember them. And now there was this young child cast upon him to be\nthought of, and cared and worked for. It was very thoughtless and\nreckless of Susan! Suppose he should forget or neglect any of her tender\nwants! Suppose his dull ear should grow too deaf to catch the pretty\nwords she said when she asked for something! Suppose he should not see\nwhen the tears were rolling down her cheeks, and nobody would comfort\nher! It might very easily be so. He was not the hale man he was when\nSusan was just such another little darling, and he could toss her up to\nthe ceiling in his strong hands. It was as much as he could do to lift\nDolly on to his feeble knee, and nurse her quietly, not even giving her a\nride to market upon it; and how stiff he felt if she sat there long!\n\nOld Oliver laid aside his pipe, and rested his worn face upon his hands,\nwhile the heavy tears came slowly and painfully to his eyes, and\ntrickled down his withered cheeks. His joy had fled, and his unmingled\ngladness had faded quite away. He was a very poor, very old man; and the\nlittle child was very, very young. What would become of them both, alone\nin London?\n\nHe did not know whether it was a voice speaking within himself in his own\nheart, or words whispered very softly into his ear; but he heard a low,\nquiet, still, small voice, which said, \"Even to your old age I am he,\nand even to hoar hairs I will carry you: I have made, and I will bear;\neven I will carry, and will deliver you.\" And old Oliver answered, with a\nsob, \"Yes, Lord, yes!\"\n\n\n\n\nCHAPTER VII. THE PRINCE OF LIFE.\n\n\nIn the new life which had now fairly begun for Oliver, it was partly as\nhe had foreseen; he was apt to forget many things, and he had a fretting\nconsciousness of this forgetfulness. When he was in the house playing\nwith Dolly, or reading to her, the shop altogether slipped away from his\nmemory, and he was only recalled to it by the loud knocking or shouting\nof some customer in it. On the other hand, when he was sitting behind the\ncounter looking for news from India in the papers, news in which he was\nalready profoundly concerned, though it was impossible that Susan could\nyet have reached it, he grew so absorbed, that he did not know how the\ntime was passing by, and both he and his little grand-daughter were\nhungry before he had thought of getting ready any meal. He tried all\nkinds of devices for strengthening his failing memory; but in vain. He\neven forgot that he did forget; and when Dolly was laughing and\nfrolicking about him he grew a child again, and felt himself the happiest\nman in London.\n\nThe person who took upon himself the heaviest weight of anxiety and\nresponsibility about Dolly was Tony, who began to make it his daily\ncustom to pass by the house at the hour when old Oliver ought to be going\nfor his morning papers; and if he found no symptom of life about the\nplace, he did not leave off kicking and butting at the shop-door until\nthe owner appeared. It was very much the same thing at night, when the\ntime for shutting up came; though it generally happened now that the boy\nwas paying his friends an evening visit, and was therefore at hand to put\nup the shutters for Oliver. Tony could not keep away from the place.\nThough he felt a boy's contemptuous pity for the poor old man's declining\nfaculties as regarded business, he had a very high veneration for his\nlearning. Nothing pleased him better than to sit upon the old box near\nthe door, his elbows on his knees, and his chin upon his hands, while\nOliver read aloud, with Dolly upon his knee, her curly hair and small\npretty features making a strange contrast to his white head and withered,\nhollow face. Tony, who had never had anything to love except a stray cur\nor two, which he had always lost after a few days' friendship, felt as if\nhe could have suffered himself to be put to death for either of these\ntwo; while Beppo came in for a large share of his unclaimed affections.\nThe chief subject of their reading was the life of the Master, who was so\nintimately dear to the heart of old Oliver. Tony was very eager to learn\nall he could of this great friend who did so much for the old man, and\nwho might perhaps be persuaded some day or other to take a little notice\nof him, if he should fail to get a crossing for himself. Oliver, in his\nlong, unbroken solitude of six years, had fallen into a notion, amounting\nto a firm belief, that his Lord was not dead and far off, as most of the\nworld believed, but was a very present, living friend, always ready to\nlisten to the meanest of his words. He had a vague suspicion that his\nfaith had got into a different course from that of most other people; and\nhe bore meekly the rebukes of his sister Charlotte for the\nunwholesomeness of his visions. But none the less, when he was alone, he\ntalked and prayed to, and spoke to Tony of this Master, as one who was\nalways very near at hand.\n\n\"I s'pose he takes a bit o' notice o' the little un,\" said Tony, \"when he\ncomes in now and then of an evening.\"\n\n\"Ay, does he!\" answered Oliver, earnestly. \"My boy, he loves every child\nas if it was his very own, and it is his own in one sense. Didn't I read\nyou last night how he said, 'Suffer the little children to come unto me,\nand forbid them not.' Why, he'd love all the young children in the world,\nif they weren't hindered from coming to him.\"\n\n\"I should very much like to see him some day,\" pursued Tony,\nreflectively, \"and the rest of them,--Peter, and John, and them. I s'pose\nthey are getting pretty old by now, aren't they?\"\n\n\"They are dead,\" said Oliver.\n\n\"All of 'em?\" asked Tony.\n\n\"All of them,\" he repeated.\n\n\"Dear, dear!\" cried Tony, his eyes glistening. \"Whatever did the Master\ndo when they all died? I'm very sorry for him now. He's had a many\ntroubles, hasn't he?\"\n\n\"Yes, yes,\" replied old Oliver, with a faltering voice. \"He was called a\nman of sorrows, and acquainted with grief. Nobody ever bore so many\ntroubles as him.\"\n\n\"How long is it ago since they all died?\" asked Tony.\n\n\"I can't rightly say,\" he answered. \"I heard once, but it is gone out of\nmy head. I only know it was the same when I was a boy. It must have been\na long, long time ago.\"\n\n\"The same when you was a boy!\" repeated Tony, in a tone of\ndisappointment. \"It must ha' been a long while ago. I thought all along\nas the Master was alive now.\"\n\n\"So he is, so he is!\" exclaimed old Oliver, eagerly. \"I'll read to you\nall about it. They put him to death on the cross, and buried him in a\nrocky grave; but he is the Prince of Life, and he came to life again\nthree days after, and now he can die no more. His own words to John\nwere, 'I am he that liveth, and was dead; and behold, I am alive\nforevermore.' What else can it mean but that he is living now, and will\nnever die again?\"\n\nTony made no answer. He sat with his sharp, unboyish face gazing intently\ninto the fire; for by this time autumn had set in, and the old man was\nchilly of an evening. A very uncertain, dim idea was dawning upon him\nthat this master and friend of old Oliver's was a being very different\nfrom an ordinary man, however great and rich he might be. He had grown to\nlove the thought of him, and to listen attentively to the book which told\nthe manner of life he led; but it was a chill to find out that he could\nnot look into his face, and hear his voice, as he could Oliver's. His\nheart was heavy, and very sad.\n\n\"I s'pose I can't see him, then,\" he murmured to himself, at last.\n\n\"Not exactly like other folks,\" said Oliver. \"I think sometimes that\nperhaps there's a little darkness of the grave where he was buried about\nhim still. But he sees us, and hears us. He himself says, 'Behold, I am\nwith you always.' I don't know whatever I should do, even with my little\nlove here, if I wasn't sure Jesus was with me as well.\"\n\n\"I'll tell you what I'll do,\" said Tony, after another pause. \"I'm going\nto ask him to give me somethink, and then if he does, I shall know he\nhears me--I should very much like to have a broom and a crossing, and get\nmy living a bit more easy, if you please.\"\n\nHe had turned his face away from Oliver, and looked across into the\ndarkest corner of the room, where he could see nothing but shadow. The\nold man felt puzzled, and somewhat troubled, but he only sighed softly to\nhimself; and opening the Testament, he read aloud in it till he was\ncalmed again, and Tony was listening in rapt attention.\n\n\"My boy,\" he said, as the hour came for Tony to go, \"where are you\nsleeping now?\"\n\n\"Anywhere as I can get out o' the wind,\" he answered. \"It's cold now,\nnights--wery cold, master. But I must get along a bit farder on. Lodgings\nis wery dear.\"\n\n\"I've been thinking,\" said Oliver, \"that you'd find it better to have\nsome sort of a shake-down under my counter. I've heard say that\nnewspapers stitched together make a coverlid pretty near as warm as a\nblanket; and we could do no harm by trying them, Tony. Look here, and see\nhow you'd like it.\"\n\nIt looked very much like a long box, and was not much larger. Two or\nthree beetles crawled sluggishly away as the light fell upon them, and\ndusty cobwebs festooned all the corners; but to Tony it seemed so\nmagnificent an accommodation for sleeping, that he could scarcely\nbelieve he heard old Oliver aright. He looked up into his face with a\nsharp, incredulous gaze, ready to wink and thrust his tongue into his\ncheek, if there was the least sign of making game of him. But the old\nman was simply in earnest, and without a word Tony slipped down upon a\nheap of paper shavings strewed within, drew his ragged jacket up about\nhis ears, and turned his face away, lest his tears should be seen. He\nfelt, a minute or two after, that a piece of an old rug was laid over\nhim, but he could say nothing; and old Oliver could not hear the sob\nwhich broke from his lips.\n\n\n\n\nCHAPTER VIII. NO PIPE FOR OLD OLIVER.\n\n\nAs some weeks went by, and no crossing and broom had been given to Tony,\nhe began to suspect that Oliver was imposing upon him. Now that he slept\nunder the counter, he could often hear the old man talking aloud to his\ninvisible Friend as he smoked his pipe; and once or twice Tony crept\nnoiselessly to the door and watched him, after he had finished smoking,\nkneel down and hide his face in his hands for some minutes together. But\nthe boy could see nothing, and his wish had not been granted; even\nthough, as he grew more instructed, he followed Oliver's example, and,\nkneeling down behind the counter, whispered out a prayer for it. To be\nsure his life was easier, especially the nights of it; for he never now\nwent hungry and starved to bed upon some cold, hard door-step. But it was\nold Oliver who did that for him, not old Oliver's Master. So far as he\nknew, the Lord Jesus had taken no notice whatever of him; and the\nfeeling, at first angry, softened down into a kind of patient grief,\nwhich was quickly dying away into indifference.\n\nOliver had done himself no bad turn by offering a shelter to the solitary\nlad. Tony always woke early in the morning, and if it rained he would run\nfor the papers, before turning out to \"find for himself\" in the streets.\nHe generally took care to be out of the way at meal-times; for it was as\nmuch as the old man could do to provide for himself and Dolly. Sometimes\nTony saw him at the till, counting over his pence with rather a troubled\nface. Once, after receiving a silver fourpenny piece, an extraordinary\nand undreamed of event, Tony dropped it, almost with a feeling of guilt,\nthrough the slit in the counter which communicated with the till. But\nOliver was so bewildered by its presence among the coppers, that he was\ncompelled to confess what he had done, saying it would have cost him\nmore than that for lodgings these cold nights.\n\n\"No, no, Tony,\" said Oliver; \"you're very useful, fetching my papers, and\ntaking my little love out a-walking when the weather's fine. I ought to\npay you something, instead of taking it of you.\"\n\n\"Keep it for Dolly,\" said Tony, bashfully, and pushing the coin into her\nlittle hand.\n\n\"Sank 'oo,\" answered Dolly, accepting it promptly; \"me'll give 'oo twenty\nkisses for it.\"\n\nIt seemed ample payment to Tony, who went down on his knees to have the\nkisses pressed upon his face, which had never felt a kiss since his\nmother died. But Oliver was not satisfied with the bargain, though he\ndrew Dolly to him fondly, and left the money in her hand.\n\n\"It 'ud buy you a broom, Tony,\" he said.\n\n\"Oh, I've give up asking for a crossing,\" he answered, dejectedly; \"for\nhe never heard, or if he heard, he never cared; so it were no use going\non teazing either him or me.\"\n\n\"But this money 'ud buy the broom,\" said Oliver; \"and if you looked\nabout you, you'd find the crossing. You never got such a bit of money\nbefore, did you?\"\n\n\"No, never,\" replied Tony. \"A tall, thin gentleman, with a dark face and\nvery sharp eyes, gave it me for holding his horse, near Temple Bar. He\nsays, 'Mind you spend that well, my lad.' I'd know him again anywhere.\"\n\n\"You ought to have bought a broom,\" said Oliver, looking down at Dolly's\ntightly-closed hand.\n\n\"Don't you go to take it of her,\" cried Tony. \"Bless you! I'll get\nanother some way. I never thought that were the way he'd give me a broom\nand a crossing. I thought it 'ud be sure to come direct.\"\n\n\"Well,\" said Oliver, after a little pause, \"I'll save the fourpence for\nyou. It'll only be going without my pipe for a few nights, that's all.\nThat's nothing, Tony.\"\n\nIt did not seem much to Tony, who had no idea as yet of the pleasures of\nsmoking; yet he roused up just before falling into his deep sleep at\nnight to step softly to the door, and look in upon Oliver. He was sitting\nin his arm-chair, with his pipe between his lips, but there was no\ntobacco in it; and he was holding more eager converse than ever with his\nunseen companion.\n\n\"Dear Lord!\" he said, \"I'd do ten times more than this for thee. Thou\nhast said, 'Inasmuch as ye did it to one of the least of these, ye did it\nunto me.' Tony's one of thy little ones. Dear Lord, do thee give him a\ncrossing, if it be thy blessed will. Do thee now, Lord.\"\n\nTony could hear no more, and he stole back to bed, his mind full of new\nand vague hopes. He dreamed of the fourpenny piece, and the gentleman who\nhad given it, and of Dolly, who bought a wondrous broom with it, in his\ndream, which swept a beautiful crossing of itself. But old Oliver sat\nstill a long time, talking half aloud; for his usual drowsiness did not\ncome to him. It was nearly five months now since Dolly was left to him,\nand he felt his deafness and blindness growing upon him slowly. His\ninfirmities were not yet so burdensome as to make him dependent upon\nothers; but he felt himself gradually drawing near to such a state.\nDolly's clothes were getting sadly in want of mending; there was scarcely\na fastening left upon them, and neither he nor Tony could sew on a button\nor tape. It was a long time--a very long time--since his sister had been\nto see him; and, with the reluctancy of old age to any active exertion,\nhe had put off from week to week the task of writing to her to tell her\nof Susan's departure, and the charge he had in his little grandchild. He\nmade up his mind that he would do it tomorrow.\n\n\n\n\nCHAPTER IX. A NEW BROOM AND A CROSSING.\n\n\nThe morning was a fine soft, sunny December day, such as comes sometimes\nafter a long season of rain and fog, and Tony proposed taking Dolly out\nfor a walk through the streets, to which Oliver gladly consented, as it\nwould give to him exactly the undisturbed leisure he needed for writing\nhis letter to Charlotte. But Dolly was not in her usual spirits; on the\ncontrary, she was grave and sober, and at length Tony, thinking she was\ntired, sat down on a door-step, and took her upon his knee, to tell her\nhis dream of the wonderful broom which swept beautifully all by itself.\nDolly grew more and more pensive after hearing this, and sat silent for a\nlong time, with her small head resting thoughtfully upon her hand, as she\nlooked up and down the street.\n\n\"Dolly 'ud like to buy a boom,\" she said, at last, \"a great, big boom;\nand gan-pa 'ill smoke his pipe again to-night. Dolly's growing a big\ngirl; and me must be a good girl till mammy comes back. Let us go and buy\na big boom, Tony.\"\n\nFor a few minutes Tony tried to shake her resolution, and persuade her\nto change her mind. He even tempted her with the sight of a doll in a\nshop-window; but she remained steadfast, and he was not sorry to give in\nat last. Since the idea had entered his head that the money had been\ngiven to him for the purpose of buying a broom, he had rather regretted\nparting with it, and he felt some anxiety lest he should not be allowed\na second chance. Dolly's light-heartedness had returned, and she\ntrotted cheerfully by his side as they walked on in search of a shop\nwhere they could make their purchase. It was some time before they\nfound one, and they had already left behind them the busier\nthoroughfares, and had reached a knot of quieter streets where there\nwere more foot-passengers, for the fine morning had tempted many people\nout for pleasure as well as business. Tony was particular in his choice\nof a broom, but once bought, he carried it over his shoulder, and went\non his way with Dolly in triumph.\n\nThey were passing along chattering busily, when Tony's eyes fell upon a\nchild about as old as Dolly, standing on the kerb-stone with a lady, who\nlooked anxiously across to the other side of the broad and very dirty\nroad, for the day before had been rainy. They were both finely dressed,\nand the little girl had on new boots of shining leather, which it was\nevident she was very much afraid of soiling. For a minute Tony only\nlooked on at their perplexity, but then he went up to them, holding Dolly\nby the hand.\n\n[A NEW BROOM AND A CROSSING]\n\n\"If you'll take care of my little girl,\" he said, \"I'll carry your\nlittle girl across the road. I'm wery clean for a street-boy, all but my\nfeet, 'cos I've got this little girl to take care of; and I'll do it\nwery gentle.\"\n\nBoth the lady and the child looked very searchingly into Tony's face. It\nwas pale and meagre; but there was a pleasant smile upon it, and his\neyes shone down upon the two children with a very loving light in them.\nThe lady took Dolly's hand in hers, nodding permission for him to carry\nher little child over to the other side, and she waited for him to come\nback to his own charge. Then she took out her purse, and put twopence\ninto his hand.\n\n\"Thank ye, my lady,\" said Tony; \"but I didn't do it for that. I'm only\nlooking out for a crossing. Me and Dolly have bought this broom, and I'm\nlooking out for a place to make a good crossing in.\"\n\n\"Why not make one here?\" asked the lady.\n\nIt seemed a good place to try one in; there were four roads meeting, and\na cab-stand close by. Plenty of people were passing to and fro, and the\nmiddle of the road was very muddy. Tony begged a wisp of straw from a\ncabman, to make a seat for Dolly in the sunshine under a blank bit of\nwall, while he set to work with a will, feeling rather pleased than not\nthat the broom would not sweep of itself. A crossing was speedily made,\nand for two or three hours Tony kept it well swept. By that time it was\ntwelve o'clock, and Dolly's dinner would be ready for her before they\ncould reach home, if old Oliver had not forgotten it. It seemed a great\npity to leave his new post so early. Most passers-by, certainly, had\nappeared not to see him at all; but he had already received fivepence\nhalfpenny, chiefly in halfpence, from ladies who were out for their\nmorning's walk; and Dolly was enjoying herself very much in the sunshine,\nreceiving all the attention which he could spare from his crossing.\nHowever a beginning was made. The broom and the crossing were his\nproperty; and Tony's heart, beat fast with pride and gladness as he\ncarried the weary little Dolly all the way home again. He resolved to put\nby half of his morning's earnings towards replacing the fourpenny-piece\nshe had given back to him; or perhaps he would buy her a beautiful doll,\ndressed like a real lady.\n\n\n\n\nCHAPTER X. HIGHLY RESPECTABLE.\n\n\nAs old Oliver was stooping over his desk on the counter, and bringing his\ndim eyes as close as he could to the letter he was writing, his shop-door\nwas darkened by the unexpected entrance of his sister Charlotte herself.\nShe was dressed with her usual extreme neatness, bordering upon\ngentility, and she carried upon her arm a small fancy reticule, which\ncontained some fresh eggs, and a few russet apples, brought up expressly\nfrom the country. Oliver welcomed her with more than ordinary pleasure,\nand led her at once into his room behind. Charlotte's quick eyes detected\nin an instant the traces of a child's dwelling there; and before Oliver\ncould utter a word, she picked up a little frock, and was holding it out\nat arm's length, with an air of utter surprise and misgiving.\n\n\"Brother James!\" she exclaimed, and her questioning voice, with its tone\nof amazement, rang very clearly into his ears.\n\n\"It's my little Dolly's,\" he answered, in haste; \"poor Susan's little\ngirl, who's gone out with her husband, young Raleigh, to India, because\nhe's 'listed, and left her little girl with me, her grandfather. She came\non the very last day you were here.\"\n\n\"Well, to be sure!\" cried his sister, sinking down on a chair, but still\nkeeping the torn little frock in her hand.\n\n\"I've had two letters from poor Susan,\" he continued, in a tremulous\nvoice, \"and I'll read them to you. The child's such a precious treasure\nto me, Charlotte--such a little love, a hundred times better than any\ngold; and now you're come to mend up her clothes a bit, and see what she\nwants for me, there's nothing else that I desire. I was writing about her\nto you when you came in.\"\n\n\"I thought you'd gone and picked up a lost child out of the streets,\"\nsaid Charlotte, with a sigh of relief.\n\n\"No, no; she's my own,\" he answered. \"You hearken while I read poor\nSusan's letters, and then you'll understand all about it. I couldn't give\nher up for a hundred gold guineas--not for a deal more than that.\"\n\nHe knew Susan's letters off by heart, and did not need his spectacles,\nnor a good light to read them by. Charlotte listened with emphatic nods,\nand many exclamations of astonishment.\n\n\"That's very pretty of Susan,\" she remarked, \"saying as Aunt Charlotte'll\ndo her sewing, and see to her manners. Ay, that I will! for who should\nknow manners better than me, who used to work for the Staniers, and dine\nat the housekeeper's table, with the butler and all the head servants? to\nbe sure I'll take care that she does not grow up ungenteel. Where is the\ndear child, brother James?\"\n\n\"She's gone out for a walk this fine morning,\" he answered.\n\n\"Not alone?\" cried Charlotte. \"Who's gone out with her? A child under\nfive years old could never go out all alone in London: at least I should\nthink not. She might get run over and killed a score of times.\"\n\n\"Oh! there's a person with her I've every confidence in,\" replied Oliver.\n\n\"What sort of person; man or woman; male or female?\" inquired Charlotte.\n\n\"A boy,\" he answered, in some confusion.\n\n\"A boy!\" repeated his sister, as if he had said a monster. \"What boy?\"\n\n\"His name's Tony,\" he replied.\n\n\"But where does he come from? Is he respectable?\" she pursued, fixing\nhim with her glittering eyes in a manner which did not tend to restore\nhis composure.\n\n\"I don't know, sister,\" he said in a feeble tone.\n\n\"Don't know, brother James!\" she exclaimed. \"Don't you know where\nhe lives?\"\n\n\"He lives here,\" stammered old Oliver; \"at least he sleeps here under the\ncounter; but he finds his own food about the streets.\"\n\nCharlotte's consternation was past all powers of speech. Here was her\nbrother, a respectable man, who had seen better days, and whose sister\nhad been a dressmaker in good families, harbouring in his own house a\ncommon boy off the streets, who, no doubt, was a thief and pickpocket,\nwith all sorts of low ways and bad language. At the same time there was\npoor Susan's little girl dwelling under the same roof; the child whose\npretty manners she was to attend to, living in constant companionship\nwith a vulgar and vicious boy! What she might have said upon recovering\nher speech, neither she nor Oliver ever knew; for at this crisis Tony\nhimself appeared, carrying Dolly and his new broom in his arms, and\nlooking very haggard and tattered himself, his bare feet black with mud,\nand his bare head in a hopeless condition of confusion, and tangle.\n\n\"We've bought a geat big boom, gan-pa,\" shouted Dolly, as she came\nthrough the shop, and before she perceived the presence of a stranger;\n\"and Tony and Dolly made a great big crossing, and dot ever so much\nmoney--\"\n\nShe was suddenly silent as soon as her eye fell upon the stranger; but\nAunt Charlotte had heard enough. She rose with great dignity from her\nchair, and was about to address herself vehemently to Tony, when old\nOliver interrupted her.\n\n\"Charlotte,\" he said, \"the boy's a good boy, and he's a help to me. I\ncouldn't send him away. He's one of the Lord's poor little ones as are\nscattered up and down in this great city, without father or mother, and I\nmust do all I can for him. It isn't much; it's only a bed under the\ncounter, and a crust now and then, and he more than pays for it. You\nmusn't come betwixt me and Tony.\"\n\nOld Oliver spoke so emphatically, that his sister was impressed and\nsilenced for a minute. She took the little girl away from Tony, and\nglared at him with a sternness which made him feel very uncomfortable;\nbut her eye softened a little, and her face grew less harsh.\n\n\"You can't read or write?\" she said, in a sharp voice.\n\n\"No,\" he answered.\n\n\"And you've not got any manners, or boots, or a cap on your head. You are\nragged and ignorant, and not fit to live with this little girl,\" she\ncontinued, with energy. \"If this little girl's mother saw her going about\nwith a boy in bare feet and a bare head, it 'ud break her heart I know.\nSo if you wish to stay here with my brother, Mr. Oliver, and this little\ngirl, Miss Dorothy Raleigh, as I suppose her name is, you must get all\nthese things. You must begin to learn to read and write, and talk\nproperly. I shall come here again in a month's time--I shall come every\nmonth now--and if you haven't got some shoes for your feet, and a cap for\nyour head, before I see you again, I shall just take the little girl away\ndown into the country, where I live, and you'll never see her again. Do\nyou understand?\"\n\n\"Yes,\" answered Tony, nodding his head.\n\n\"Then you may take yourself away now,\" said the sharp old woman, \"I don't\nwant to be too hard upon you; but I've got this little girl to look after\nfor her mother, and you must do as I say, or I shall carry her right off\nto be out of your way. Take your broom and go; and never you think of\nsuch a thing as taking this little girl to sweep a crossing again. I\nnever heard of such a thing. There, go!\"\n\nTony slunk away sadly, with a sudden down-heartedness. He returned so\njoyous and triumphant, in spite of his weariness, that this unexpected\nand unpleasant greeting had been a very severe shock to him. With his\nbroom over his shoulder, and with his listless, slouching steps, he\nsauntered slowly back to his crossing; but he had no heart for it now.\n\n\n\n\nCHAPTER XI. AMONG THIEVES.\n\n\nThe night fell early, for a thick fog came on in the afternoon. Tony\ncowered down upon his broom under the wall where Dolly had sat in the\nsunshine all the morning to watch him sweep his crossing. It was all over\nnow. She was lost to him; for he should never dare to go back to old\nOliver's house, and face that terrible old woman again. There was nothing\nfor him but to return to his old life and his old haunts; and a chill ran\nthrough him, body and spirit, as he thought of it. His heap of paper\nshavings under the counter, where the biting winds could not reach him,\ncame to his mind, and the tears rushed to his eyes. But to-night, at\nleast, there would be no need to sleep out of doors, for he had some\nmoney in the safest corner of his ragged pocket, tied up in it securely\nwith a bit of string. He could afford to pay for a night's lodging, and\nhe knew very well where he could get one.\n\nAbout nine o'clock Tony turned his weary feet towards a slum he knew\nof in Westminster, where there was a cellar open to everybody who could\npay two-pence for a night's shelter. His heart was very full and heavy\nwith resentment against his enemy, and a great longing to see Dolly. He\nloitered about the door of the cellar, reluctant and almost afraid to\nventure in; for it was so long since he had been driven to any of these\nplaces that he felt nearly like a stranger among them. Besides, in former\ntimes he had been kicked, and beaten, and driven from the fire, and\nfought with by the bigger boys; and he had become unaccustomed to such\ntreatment of late. How different this lodging-house was to the quiet\npeaceful home where Dolly knelt down every evening at her grandfather's\nknee, and prayed for him; for now she always put Tony's name into her\nchildish prayers! He should never, never hear her again, nor see old\nOliver seated in his arm-chair, smoking his long pipe, while he talked\nwith that strange friend and master of his. Ah! he would never hear or\nknow any more of that unseen Christ, who was so willing to be his master\nand friend, for the Lord Jesus Christ could never come into such a wicked\nplace as this, which was the only home he had. He had given him the\ncrossing and the broom, and that was the end of it. He must take care of\nhimself now, and keep out of gaol if he could, and if not, why then he\nhad better make a business of thieving, and become as good a pickpocket\nas \"Clever Dog Tom,\" who had once stolen a watch from a policeman\nhimself.\n\nClever Dog Tom was the first to greet Tony when he slipped in at last,\nand he seemed inclined to make much of him; but Tony was too troubled\nfor receiving any consolation from Tom's friendly advances. He crept\naway into the darkest corner, and stretched himself on the thin straw\nwhich covered the damp and dirty floor, but he could not fall asleep.\nThere was a good deal of quarreling among the boys, and the men who\nwished to sleep swore long and loudly at them. Then there followed a\nfight, which grew so exciting at last that every person in the place,\nexcept Tony, gathered about the boys in a ring, encouraging and cheering\nthem. It was long after midnight before silence and rest came, and then\nhe fell into a broken slumber, dreaming of Dolly and old Oliver, until\nhe awoke and found his face wet with tears. He got up before any of his\nbed-fellows were aroused, and made his way out into the fresh keen air\nof a December morning.\n\nDay after day went by, and night after night Tony was growing more\nindifferent again to the swearing and fighting of his old comrades. He\nbegan to listen with delight to the tales of Clever Dog Tom, who told him\nthat hands like his would work well in his line, and his innocent-looking\nface would go a long way towards softening any judge and jury, or would\nbring him favour with the chaplain, and easy times in gaol. He kept his\ncrossing still, and did tolerably well, earning enough to keep himself in\nfood, and to pay for his night's shelter; but he was beginning to hanker\nafter something more. If he could not be good, and be on the same side as\nold Oliver and Dolly, he thought it would be better to be altogether on\nthe other side, like Tom, who dressed well, and lived well, and was\nlooked up to by other boys. It was a week after he had left old Oliver's\nhouse, and he was about to leave his crossing for the night, when a\ngentleman stopped him suddenly, and looked keenly into his face.\n\n\"Hollo, my lad!\" he said, \"you're the boy I gave fourpence to a week\nago for holding my horse. I told you to lay it out well. What did you\ndo with it?\"\n\n\"Me and Dolly bought this broom,\" he answered, \"and I've kept this\ncrossing ever since.\"\n\n\"Well done!\" said the gentleman. \"And who is Dolly?\"\n\n\"It's a little girl as I was very fond of,\" replied Tony, with a deep\nsigh. It seemed so long ago that he spoke of his love for her as if it\nwas a thing altogether passed away and dead, yet his heart still ached at\nthe memory of it.\n\n\"Well, here's another fourpenny-bit for you,\" said his friend, \"quite a\nnew one. See how bright it is; no one has ever bought anything with it\nyet. Dolly will like to see it.\"\n\nTony held it in the palm of his hand long after the gentleman was out of\nsight, gazing at it in the lamplight. It was very beautiful and shining;\nand oh! how Dolly's eyes would shine and sparkle if she could only see\nit! And she ought to see it. By right it belonged to her; for had he not\ngiven her his first fourpenny-piece freely, and had twenty kisses for it,\nand then had she not given it him back to buy a broom with? she had never\nhad a single farthing of all his earnings. How he would like to show her\nthis beautiful piece of silver, and feel her soft little arms round his\nneck, when he said it was to be her very own! He felt that he dare not\npass the night in the cellar with such a treasure about him, for Tom, who\nwas so clever, would be sure to find out that his pocket was worth the\npicking, and Tony had not found that there was much honour among thieves.\nWhat was he to do? Where was he to go?\n\n\n\n\nCHAPTER XII. TONY'S WELCOME.\n\n\nAlmost without knowing where his feet were carrying him, Tony sauntered\nthrough the streets until he found himself at the turn into the alley\nwithin a few yards of Oliver's home, and his beloved Dolly. At any rate\nhe could pass down it, and, if the shop-door was not shut, he would wrap\nhis beautiful silver coin in a rag, and throw it into the inside; they\nwould be sure to guess who had done it, and what it was for. It was dark\ndown the alley, only one lamp and the greengrocer's gas lighting it up,\nand Tony stole along quietly in the shadow. It was nearly time for Dolly\nto be going to bed, he thought, and old Oliver was sure to be with her in\nthe inner room; but just as he came into the revealing glare of the\ngreengrocer's stall, his ears rang and his heart throbbed violently at\nthe sound of a shrill little scream of gladness, and the next moment he\nfelt himself caught by Dolly's arms, and dragged into the house by them.\n\n\"Tony's come home, Tony's come home, gan-pa!\" she shouted with all her\nmight. \"Dolly's found Tony at last!\"\n\nDolly's voice quivered, and broke down into quick, childish sobs, while\nshe held Tony very fast, lest he should escape from her once again; and\nold Oliver came quickly from the room beyond, and laid his hand fondly\nupon the boy's shoulder.\n\n\"Why have you kept away from us so long, Tony?\" he asked.\n\n\"Oh, master!\" he cried, \"I've been a wicked boy, and a miserable boy. Do\nforgive me, and I'll never do so no more. I s'pose you'll never let me\nsleep under the counter again?\"\n\n\"Come in, come in!\" answered Oliver, pushing him gently before him into\nthe house. \"We've been waiting and watching for you every night, me and\nmy little love. You ought not to have served us so, my lad; but we're too\nglad to be angry with you. Charlotte's sharp, and she's very much afraid\nof low ways and manners; but she isn't a hard woman, and she didn't know\nanything about you. When I told her as you'd been left no bigger than my\nlittle love here to take care of yourself, alone, in London,--mother\ndead, and no father,--she shed tears about you, she did. And she left you\nthe biggest of her eggs to be kept for your supper, with her kind love;\nand we've put it by for you. You shall have it this very night. Dolly, my\nlove, bring me the little saucepan.\"\n\n\"I'm not so clean as I could wish,\" said Tony, mournfully; for he had\nneglected himself during the last week, and looked very much like what he\nhad done when he had first seen old Oliver and his little grand-daughter.\n\n\"Take a bowl full of water into the shop, then,\" answered Oliver, \"and\nwash yourself, while I boil the egg. Dolly'll find you a bit of soap and\na towel; she's learning to be grand-pa's little housekeeper, she is.\"\n\nWhen Tony returned to the kitchen he looked a different being; the gloom\nwas gone as well as the grime. He felt as if he had come to himself after\na long and very miserable dream. Here was old Oliver again, looking at\nhim with a kindly light in his dim eyes, and Dolly dancing about, with\nher pretty merry little ways; and Beppo wagging his tail in joyous\nwelcome, as he sniffed round and round him. Even the egg was a token of\nforgiveness and friendliness. That terrible old woman was not his enemy,\nafter all. He recollected what she had said he must do, and he resolved\nto do it for Dolly's sake, and old Oliver's. He would learn to read and\nwrite, and he would pinch himself hard to buy some better clothing, lest\nhe should continue to be a disgrace to them; shoes he must have first of\nall, as those were what the sharp but friendly old woman had particularly\nmentioned. At any rate, he could never run away again from this home,\nwhere he was so loved and cared for.\n\nOliver told him how sadly Dolly had fretted after him, and watched for\nhim at the door, hour after hour, to see him come home again. He said\nthat in the same way, only with a far greater longing and love, his\nMaster, the Lord Jesus Christ, was waiting for Tony to go to him. He\ncould not half understand it, but a vague feeling of a love passing all\nunderstanding sank deeply into his heart. He fell asleep that night under\nthe counter with the tranquil peacefulness of one who has been tossed\nabout in a great storm and tempest, and has been brought safely to the\ndesired haven.\n\n\n\n\nCHAPTER XIII. NEW BOOTS.\n\n\nIt was several weeks before Tony could scrape together enough money for\nhis new boots, though he pinched and starved himself with heroic courage\nand endurance. He did not mean to buy them at a shop; for he knew a place\nin Whitechapel where boots quite good enough for him were to be had for\ntwo or three shillings. He was neither ambitious nor fastidious; old\nboots patched up would do very well to start with, if he could only\nmanage to get them before aunt Charlotte came up to town again. She had\nsent word she was coming the last Saturday in January; and early in the\nafternoon of that day, before the train could come in from Stratford,\nTony started off to the place where he intended to make his purchase.\n\nIt was a small open space in one of the streets of Whitechapel, where\nthere was an area of flags, lying off the pavement. Several traders held\npossession of this square, sitting on low stools, or cross-legged on the\nground, with their stock in trade around them. One dealer bought and sold\nall kinds of old and rusty pieces of iron; another, a woman, ill clad and\nwith red eyes, displayed before her a dingy assortment of ragged clothes,\nwhich were cheapened by other spare and red-eyed women, who held almost\nnaked children by the hand. It was cold, and a bitter, keen east wind was\nsearching every corner of London streets. The salesman Tony was come to\ndeal with had a tolerable selection of old boots, very few of them pairs,\nsome with pretty good upper-leathers, but with no soles worth speaking\nof; and others thickly cobbled and patched, but good enough to keep the\nfeet dry, without presenting a very creditable appearance. For the first\ntime in his life Tony found out the perplexity of having a choice to\nmake. There were none which exactly fitted him; but a good fit is a\nluxury for richer folks than Tony, and he was not troubled about it. His\nchief anxiety was to look well in the eyes of Dolly's aunt, who might\npossibly let him see her on her way back to the station, if she approved\nof him; and who would not now be obliged to carry Dolly off with her, to\nbe out of the way of his naked feet.\n\nHe fixed upon a pair at last, urged and coaxed to them by the dealer.\nThey were a good deal too large, and his feet slipped about in them\nuncomfortably; but the man assured him that was how everybody, even\ngentlefolks, bought them, to leave room for growing. There was an\nawkward, uneven patch under one of the soles, and the other heel was worn\ndown at the side; but at least they covered his feet well. He shambled\naway in them slowly and toilsomely, hardly knowing how to lift one foot\nafter another, yet full of pride in his new possessions. It was a long\nway home to old Oliver's alley, between Holborn and the Strand; but he\nwas in no hurry to arrive there before they had finished and cleared away\ntheir tea; so he travelled painfully in that direction, stopping now and\nthen to regale himself at the attractive windows of tripe and cow-heel\nshops. He watched the lamplighters kindling the lamps, and the\nshopkeepers lighting up their gas; and then he heard the great solemn\nclock of St. Paul's strike six. Tea would be quite over now, and Tony\nturned down a narrow back street, which would prove a nearer way home\nthan the thronged thoroughfares, and set off to run as fast as he could\nin his awkward and unaccustomed boots.\n\nIt was not long before he came to a sudden and sharp fall off the\nkerb-stone, as he trod upon a bit of orange-peel, and slipped upon it. He\nfelt stunned for a few seconds, and sat still rubbing his forehead. These\nback streets were very quiet, for the buildings were mostly offices and\nwarehouses, and most of them were already closed for the night. He lifted\nhimself up at length, and set his foot upon the flags; but a shrill cry\nof pain broke from his lips, and rang loudly through the quiet street. He\nfell back upon the pavement, quivering and trembling, with a chilly\nmoisture breaking out upon his skin. What hurt had been done to him? How\nwas it that he could not bear to walk? He took off his new boots, and\ntried once more, but with no better success. He could not endure the\nagony of standing or moving.\n\nYet he must move; he must get up and walk. If he did not go home, they\nwould think he had run away again, for fear of meeting Dolly's aunt. At\nthat thought he set off to crawl homewards upon his hands and knees, with\nsuppressed groans, as his foot trailed uselessly along the ground. Yet he\nknew he could not advance very far in this manner. What if he should have\nto lie all night upon the hard paving-stones! for he could not remember\never having seen a policeman in these back streets; and there did not\nseem to be anybody else likely to pass that way. It was freezing fast,\nnow the sun was gone down, and his hands scraped up the frosty mud as he\ndragged himself along. If he stayed out all night, he must die of cold\nand pain before morning.\n\nBut if that was true which old Oliver said so often, that the Lord Jesus\nChrist loved him, and that he was always with those whom he loved, then\nhe was not alone and helpless even here, in the deserted street, with the\nice and darkness of a winter's night about him. Oh! if he could but feel\nthe hand of Christ touching him, or hear the lowest whisper of his voice,\nor catch the dimmest sight of his face! Perhaps it was he who was helping\nhim to crawl towards the stir and light of a more frequented street,\nwhich he could see afar off, though the pain he felt made him giddy and\nsick. It became too much for him at last, however, and he drew himself\ninto the shelter of a warehouse door, and crouched down in a corner,\ncrying, with clasped hands, and sobbing voice, \"Oh! Lord Jesus Christ!\nLord Jesus Christ!\"\n\nAfter uttering this cry Tony lay there for some minutes, his eyes growing\nglazed and his ears dull, when a footstep came briskly up the street, and\nsome one, whom he could not now see for the strange dimness of his\nsight, stopped opposite to him, and then stooped to touch him on the arm.\n\n\"Why,\" said a voice he seemed to know, \"you're my young friend of the\ncrossing,--my little fourpenny-bit, I call you. What brings you sitting\nhere this cold night?\"\n\n\"I've fell down and hurt myself,\" answered Tony, faintly.\n\n\"Where?\" asked the stranger.\n\n\"My leg,\" he answered.\n\nThe gentleman stooped down yet lower, and passed his hand gently along\nTony's leg till he came to the place where his touch gave him the most\nacute pain.\n\n\"Broken!\" he said to himself. \"My boy, where's your home?\"\n\n\"I haven't got any right home,\" answered Tony, more faintly than before.\nHe felt a strange numbness creeping over him, and his lips were too\nparched and his tongue too heavy for speaking. The gentleman took off his\nown great-coat and wrapped it well about him, placing him at the same\ntime in a more comfortable position. Then he ran quickly to the nearest\nstreet, hailed the first cab, and drove back to where Tony was lying.\n\n[TONY'S ACCIDENT.]\n\n\n\n\nCHAPTER XIV. IN HOSPITAL.\n\n\nThe pain Tony was suffering kept him partially conscious of what was\nhappening to him. He knew that he was carried gently into a large hall,\nand that two or three persons came to look at him, to whom his new friend\nspoke in eager and rapid tones.\n\n\"I know you do not take in accidents,\" he said; \"but what could I do\nwith the little fellow? He told me he had no home, and that was all he\ncould say. You have two or three cots empty; and I'll double my\nsubscription if it's necessary, rather than take him away. Come, doctor,\nyou'll admit my patient?\"\n\n\"I don't think I could send him away, Mr. Ross,\" answered another hearty\nvoice. \"We must get him into bed as soon as possible.\"\n\nTony felt himself carried up stairs into a large room, where there were a\nnumber of small beds, with a pale little face lying on every pillow.\nThere was a vacant cot at the end, and he was laid upon it, after having\nhis tattered clothes taken off him. His new boots were gone altogether,\nhaving been left behind on the steps of the warehouse. His hands and\nknees, bruised with crawling along the frosty stones, were gently bathed\nwith a soft sponge and warm water. He was surrounded by kind faces,\nlooking pitifully down upon him, and the gentleman who had brought him\nthere spoke to him in a very pleasant and cheering voice.\n\n\"My boy,\" he said, \"you have broken your leg in your fall; but the doctor\nhere, who is a great friend of mine, is going to mend it for you. It will\ngive you a good deal of pain for a few minutes; but you'll bear it like a\nman, I know.\"\n\n\"Yes,\" murmured Tony; \"but will you let me go as soon as it's done?\"\n\n\"You could not do that,\" answered Mr. Ross, smiling. \"It will be some\nweeks before you will be well enough to go; but you will be very happy\nhere, I promise you.\"\n\n\"Oh! but I must go!\" cried Tony, starting up, but falling back again with\na groan. \"There's Dolly and Mr. Oliver,--they'll think I've run away\nagain, and I were trying all I could to get back to 'em. She'll be\nwatching for me, and she'll fret ever so. Oh! Dolly, Dolly!\"\n\nHe spoke in a tone of so much grief, that the smile quite passed away\nfrom the face of Mr. Ross, and he laid his hand upon his, and answered\nhim very earnestly:\n\n\"If you will tell me where they live,\" he said, \"I will go at once and\nlet them know all about your accident; and they shall come to see you\nto-morrow if you are well enough to see them.\"\n\nTony gave him very minute and urgent directions where to find old\nOliver's shop; and then he resigned himself, with the patience and\nfortitude of most of the little sufferers in that hospital, to the\nnecessary pain he had to bear.\n\nIt was Sunday afternoon when old Oliver and Dolly entered the hall of the\nChildren's Hospital and inquired for Tony. There was something about the\nold man's look of age and the little child's sweet face which found them\nfavour, even in a place where everybody was received with kindness. A\nnurse, who met them slowly climbing the broad staircase, turned back with\nthem, taking Dolly's hand in hers, and led them up to the room where\nthey would find Tony. There were many windows in it, and the sunshine,\nwhich never shone into their own home, was lighting it up gaily. The cots\nwere all covered with white counterpanes, and most of the little\npatients, who had been asleep the night before, were now awake, and\nsitting up in bed, with little tables before them, which they could slide\nup and down as they wished along the sides of their cots. There was no\nsign of medicine, and nothing painful to see, except the wan faces of the\nchildren themselves. But Oliver and Dolly had no eyes but for Tony, and\nthey hurried on to the corner where he was lying. His face was very\nwhite, and his eyelids were closed, and his lips drawn in as if he were\nstill in pain. But at the very gentle and almost frightened touch of\nDolly's fingers his eyes opened quickly, and then how his face changed!\nIt looked as if all the sunshine in the room had centred upon it, and his\nvoice shook with gladness.\n\n\"Dolly hasn't had to fret for Tony this time,\" he said.\n\n\"But Dolly will fret till Tony gets well again,\" she answered, clasping\nboth her small hands round his.\n\n\"No, no!\" said old Oliver; \"Dolly's going to be a very good girl, and\nhelp grand-pa to mind shop till Tony comes home again.\"\n\nThis promise of promotion partly satisfied Dolly, and she sat still upon\nOliver's knee beside Tony's cot, where his eyes could rest with\ncontentment and pleasure upon them both, though the nurse would not let\nthem talk much. When they went away she took them through the girls'\nwards in the story below; for the girls were more sumptuously lodged than\nthe boys. These rooms were very lofty, with windows reaching to the\ncornice of the ceiling, and with grand marble chimney-pieces about the\nfireplaces; for in former times, the nurse told them, this had been a\ngentleman's mansion, where gay parties and assemblies had been held; but\nnever had there been such a party and assembly as the one now in it.\n\nOld Oliver walked down between the rows of cots, with his little love\nclinging shyly to his hand, smiling tenderly upon each poor little face\nturned to look at them. Some of the children smiled back to him, and\nnodded cheerfully to Dolly, lifting up their dolls for her to see, and\ncalling to her to listen to the pretty tunes their musical boxes were\nplaying. But others lay quietly upon their pillows half asleep, with\nbeautiful pictures hanging over their feeble heads,--pictures of Christ\ncarrying a lamb in his arms; and again, of Christ with a little child\nupon his knee; and again, of Christ holding the hand of the young girl\nwho seemed dead, but whose ear heard his voice saying \"Arise!\" and she\ncame to life again in her father's and mother's house. The tears stood in\nold Oliver's eyes, and his white head trembled a great deal before he had\nseen all, and given one of his tender glances to each child.\n\n\"I wonder whatever the Lord 'ud have said,\" he exclaimed, \"if there'd\nbeen such a place as this in his days! He'd have come here very often. He\ndoes come, I know, and walks to and fro here of nights when the little\nones are asleep, or may be awake through pain, and he blesses every one\nof them. Ah, bless them! Bless the little children, and the good folks\nwho keep a place like this. Bless them everyone!\"\n\nHe felt reluctant to go away; but his time was gone, and the nurse was\nneeded elsewhere. She kissed Dolly before she went, putting a biscuit in\nher hand, and told Oliver the house was open every Sunday afternoon for\nthe friends of the children, if he chose to come again; and then they\nwalked home with slow, short footsteps, and all the Sunday evening they\ntalked together of the beautiful place they had seen, and how happy Tony\nwould be in the Children's Hospital.\n\n\n\n\nCHAPTER XV. TONY'S FUTURE PROSPECTS.\n\n\nOld Oliver and Dolly made several visits to Tony while he was in the\nhospital. Every Sunday afternoon they went back to it, until its great\ndoor, and wide staircase, and sunny ward, became almost as familiar to\nthem as their own dull little house. Tony recovered quickly, yet he was\nthere some weeks before the doctor pronounced him strong enough to turn\nout again to rough it in the world. As he grew better he learned a number\nof things which were making him a wiser, as well as a stronger boy,\nbefore the time came for him to leave.\n\nThe day before he was to go out of hospital, his friend, Mr. Ross, who\nhad been often to see him, called for the last time, and found him in the\nroom where the little patients who were nearly well were at play\ntogether. Some of them were making believe to have a feast, with a small\ndinner-service of wooden plates and dishes, and a few bits of\norange-peel, and biscuits; but Tony was sitting quietly and gravely on\none side, looking on from a distance. He had never learned to play.\n\n\"Antony,\" said Mr. Ross--he was the only person who ever called him\nAntony, and it seemed to make more of a man of him--\"what are you\nthinking to do when you leave here to-morrow?\"\n\n\"I s'pose I must go back to my crossing,\" answered Tony, looking\nvery grave.\n\n\"No, I think I can do better for you than that,\" said his friend, \"I\nhave a sister living out in the country, about fifty miles from London;\nand she wants a boy to help the gardener, and run on errands for the\nhouse. She has promised to provide you with a home, and clothing, and to\nsend you to school for two years, till you are about twelve, for we\nthink you must be about ten years old now; and after that you shall have\nsettled wages.\"\n\nTony listened with a quick throbbing of his heart and a contraction in\nhis throat, which hindered him from speaking all at once when Mr. Ross\nhad finished. What a grand thing it would be for himself! But then there\nwere old Oliver and Dolly to be remembered.\n\n\"It 'ud do first-rate for me,\" he said at last, \"and I'd try my best to\nhelp in the garden; but I couldn't never leave Mr. Oliver and the little\ngirl. She'd fret ever so; and he's gone so forgetful he'd lose his own\nhead, if he could anyhow. Why! of a morning they sell him any papers as\nthey've too many of. Sometimes it's all the 'Star,' and sometimes it's\nall the 'Standard;' and them as buys one won't have the other. I don't\nknow why, I'm sure. But you see when I go for 'em I say twenty-five this,\nand thirteen that, and I count 'em over pretty sharp, I can tell you;\nthough I couldn't read at all afore I came here, but I could tell which\nwas which easy enough. Then he'd never think to open his shop some\nmornings; and other mornings he'd open at four or five o'clock, just when\nhe woke of hisself. No. I must stay and take care of 'em a bit; but thank\nyou, sir, all the same.\"\n\nHe had spoken so gravely and thoughtfully that his reasons went directly\nto the heart of Mr. Ross; but he asked him one more question, before he\ncould let his good plan for the boy drop.\n\n\"What has he done for you, Antony? Is he any relation of yours?\"\n\n\"No, no!\" cried Tony, his eyes growing bright, \"I haven't got any\nrelation in all the world; but he took me in out of love, and let me\nsleep comfortable under the counter, instead of in the streets. I love\nhim, and Dolly, I do. I'll stay by 'em as long as ever I live, if I have\nto sweep a crossing till I'm an old man like him. Besides, I hear him\nspeak a good word for me often and often to his Master; and I s'pose\nnobody else 'ud do that.\"\n\n\"What master?\" inquired Mr. Ross.\n\n\"Him,\" answered Tony, pointing to a picture of the Saviour blessing young\nchildren, \"he's always talking to him as if he could see him, and he\ntells him everythink. No, it 'ud be better for me to stay with him and\nDolly, and keep hard by my crossing, than go away from 'em, and have\nclothes, and lodging, and schooling for nothink.\"\n\n\"I think it would,\" said Mr. Ross, \"so you must go on as you are, Antony,\ntill I can find you something better than a crossing. You are looking\nvery well, my boy; that's a nice, warm suit of clothes you have on,\nbetter than the rags you came in by a long way.\"\n\nIt was a sailor's suit, sent to the hospital by some mother, whose boy\nhad perhaps outgrown it; or, it may be, whose boy had been taken away\nfrom all her tender care for him. It was of good, rough, thick blue\ncloth, and fitted Tony well. He had grown a good deal during his\nillness, and his face had become whiter and more refined; his hair, too,\nwas cut to a proper length, and parted down the side, no longer lying\nabout his head in a tangled mass. He coloured up with pleasure as Mr.\nRoss looked approvingly at him.\n\n\"They've lent it me till I go out,\" he said, with a tone slightly\nregretful in his voice, \"I only wish Dolly could have seen me in it, and\nher aunt Charlotte. My own things were too ragged for me to wear 'em in a\nplace like this.\"\n\n\"They've given it to you, Antony,\" replied Mr. Ross, \"those are the\nclothes you will go home in to-morrow.\"\n\nIt seemed too much for Tony to believe, though a nurse who was sitting by\nand sewing away busily, told him it was quite true. He was intensely\nhappy all the rest of the day, often standing up, and almost straining\nhis neck to get a satisfactory view of his own back, and stroking the nap\nof his blue trousers with a fondling touch. They would all see him in it;\nold Oliver, Dolly, and aunt Charlotte. There would be no question now as\nto his fitness for taking Dolly out for a walk; he would be dressed well\nenough to attend upon a princess. This made famous amends for the pair\nof old boots he had lost the night he broke his leg; a loss he had often\nsilently lamented over in his own mind. The nurse told him she was\npatching up his old clothes, and making him a cap, to wear when he was at\nwork on his crossing, for the new ones were much too good for that; and\nTony felt as rich as if a large fortune had been left to him.\n\nIt was a very joyful thing to go home again. Dolly was a little shy at\nfirst of this new Tony, so different from the poor, ragged, wild-looking\nold Tony; but a very short time was enough to make her familiar with his\nnice blue suit, and the anchor-buttons upon it. He found his place under\nthe counter all nicely papered to keep the draughts out; and a little\nchaff mattress, made by aunt Charlotte, laid down instead of the shavings\nupon the floor. It was even pleasanter to be here than in the hospital.\n\nBut Tony found it hard work to go back to his crossing in the morning;\nand he could not make out what was the matter with himself, he felt so\ncross and idle. His old clothes seemed really such horrid rags that he\ncould scarcely bear to feel them about him; and if any passer-by looked\nclosely at him, he went red and hot all over. He was not so successful\nas he thought he had been before his accident, or as he thought he ought\nto be; for the roads were getting cleaner with the drier weather, and few\npersons considered it necessary to give him a copper for his almost\nneedless labour. Worst of all,--Clever Dog Tom found him out, and would\ncome often to see him; sometimes jeering him for his poor spirit in being\ncontent with such low work, and sometimes boasting of the fine things he\ncould do, and displaying the fine clothes he could wear. It was truly\nvery hard work for Tony, after his long holiday at the hospital, where he\nhad had as much luxury and attention as a rich man's son.\n\nBut at home in the evening Tony felt all right again. Old Oliver set him\nto learn to read and write, and he was making rapid progress, more rapid\nthan Dolly, who began at the same time, but who was apt to look upon it\nall as only another kind of game, of which she grew more quickly tired\nthan of hide-and-seek. There was no one to check her, or to make her\nunderstand it was real, serious work: neither old Oliver nor Tony could\nfind any fault with their darling. Now and then there came letters from\nher mother, full of anxious questions about her, and loving messages to\nher, telling her to be a good girl till she came back, but never saying\na word as to when there was any chance of her returning to England. In\none of these letters she sent word that a little sister was come for her\nout in India, who was just like what Dolly herself had been when she was\na baby; but neither Oliver nor Tony could quite believe that. There never\nhad been such a child as Dolly; there never would be again.\n\n\n\n\nCHAPTER XVI. A BUD FADING.\n\n\nA second summer went by with its long, hot days, when the sun seemed to\nstand still in the sky, and to dart down its most sultry beams into the\ndustiest and closest streets. Out in the parks, and in the broad\nthoroughfares where the fresh breeze could sweep along early in the\nmorning, and in the evening as soon as the air grew cooler, it was very\npleasant weather; and the people who could put on light summer dresses\nenjoyed it very much. But away among the thickly-built and crowded\nhouses, where there were thousands of persons breathing over and over\nagain the same hot and stagnant atmosphere, it seemed as if the most\ndelicate and weakly among them must be suffocated by the breathless heat.\nOld Oliver suffered very greatly, but he said nothing about it; indeed he\ngenerally forgot the cause of his languor and feebleness. He never knew\nnow the day of the week, nor the month of the year. If any one had told\nhim in the dog-days of July that it was still April, he would only have\nanswered gently that it was bright, warm weather for the time of year.\n\nBut about old times his memory was good enough; he could tell long\nstories of his boyhood, and describe the hills of his native place in\nsuch a manner as to set Tony full of longings after the country, with its\ncornfields, and meadows, and hedge-rows, which he had never seen. He\nremembered his Bible, too, and could repeat chapter after chapter\ndescribing his Master's life, as they sat together in the perpetual\ntwilight of their room; for now that it was summer-time it did not seem\nright to keep the gas burning.\n\nTony's crossing had failed him altogether, for in dry weather nobody\nwanted it; but in this extremity Mr. Ross came to his aid, and procured\nhim a place as errand-boy, where he was wanted from eight o'clock in the\nmorning till seven at night; so that he could still open old Oliver's\nshop, and fetch him his right papers before he went out, and put the\nshutters up when he came back. To become an errand-boy was a good step\nforwards, and Tony was more than content. He never ran about bare-headed\nand barefooted now as he had done twelve months before; and he had made\nsuch good progress in reading and writing that he could already make out\nthe directions upon the parcels he had to deliver, after they had been\nonce read over to him. He did not object to the dry weather and clean\nstreets as he had done when his living depended upon his crossing; on the\ncontrary, he enjoyed the sunshine, and the crowds of gaily-dressed\npeople, for he could hold up his head amongst them, and no longer went\nprowling about in the gutters searching after bits of orange-peel. He\nkicked them into the gutters instead, mindful of that accident which had\nbefallen him, but which turned out so full of good for him.\n\n[DOLLY'S MONTHLY REGISTER.]\n\nBut, if there had been any eye to see it, a very slow, and very sad\nchange was creeping over Dolly; so slowly indeed, that perhaps none but\nher mother's eye could have seen it at first. On the first of every\nmonth, which old Oliver knew by the magazines coming in, he marked how\nmuch his little love had grown by placing her against the side-post of\nthe door, and making a thick pencil line where her curly head reached to.\nHe looked at this record often, smiling at the rate his little woman was\ngrowing taller; but it was really no wonder that his dim eyes, loving as\nthey were, never saw how the rosy colour was dying away out of her\ncheeks, as gradually as the red glow fades away in the west after the sun\nhas set, nor how the light grew fainter and fainter in her blue eyes,\nuntil they looked at him very heavily from under her drooping eyelids.\nThe house was too dark for any sight to see very clearly; the full,\nstrong, healthy light of the sun, could not find its way into it, and day\nafter day Dolly became more like one of those plants growing in shady\nplaces, which live and shoot up, but only put out pale and sickly leaves,\nand feeble buds. One by one, and by little and little, with degrees as\nsmall as her own tiny footsteps, she lost all her merry ways, dropping\nthem, here one and there another, upon the path she was silently\ntreading; as little children let fall the flowers they have gathered in\nthe meadows, along their road homewards. Yet all the time old Oliver was\nloving and cherishing her as the dearest of all treasures, second only to\nthe Master whom he loved so fully; but he never discovered that there\nwas any change in her. Dolly fell into very quiet ways, and would sit\nstill for hours together, her arm around Beppo, and her sweet, patient\nlittle face, which was growing thin and hollow, turned towards the\nflickering light of the fire, while Oliver pottered toilsomely about his\nhouse, forgetting many things, but always ready with a smile and a fond\nword for his grand-daughter.\n\nJust as Oliver was too old to feel any anxiety about Dolly, so Tony was\ntoo young, and knew too little of sickness and death. Moreover, when he\ncame home in the evening, full of the business of the day, with a number\nof stories to tell of what had happened to him, and what he had seen,\nDolly was always more lively, and had a feverish colour on her face, and\na brilliant light in her eyes. He seemed to bring life and strength with\nhim, and she liked him to nurse her on his knee, which did not grow tired\nand stiff like her grandfather's. How should Tony detect anything amiss\nwith her? She never complained of feeling any pain, and he was glad for\nher to be very quiet and still while he was busy with his lessons.\n\nBut when the summer was ended, and after the damp warm fogs of November\nwere over, and a keen, black frost set in sharply before Christmas--a\nfrost which had none of the beauty of white lime and clear blue skies,\nbut which hung over the city like a pall, and penetrated to every\nfireside with an icy breath; when only the strong and the healthy, who\nwere well clothed and well fed, could meet it bravely, while the\ndelicate, and sickly, and poverty-stricken, shrank before it, and were\nchilled through and through, then Dolly drooped and failed altogether.\nEven old Oliver's dull ears began to hear a little cough, which seemed to\necho from some grave not very far away; and when he drew his little love\nbetween his knees, and put on his spectacles to gaze into her face, the\ndearest face in all the world to him, even his eyes saw something of its\nwanness, and the hollow lines which had come upon it since the summer had\npassed away. The old man felt troubled about her, yet he scarcely knew\nwhat to do. He bought sweetmeats to soothe her cough, and thought\nsometimes that he must ask somebody or other about a doctor for her; but\nhis treacherous memory always let the thought slip out of his mind. He\nintended to take counsel with his sister when she came to see him; but\naunt Charlotte was herself very ill with an attack of rheumatism, and\ncould not get up to old Oliver's house.\n\n\n\n\nCHAPTER XVII. A VERY DARK SHADOW.\n\n\nThe Christmas week passed by, and the new year came in, cold and bleak,\nbut Tony was well secured against the weather, and liked the frosty air,\nwhich made it pleasant to run as fast as he could from place to place as\nhe delivered his parcels. When boxing day came, which was half-holiday\nfor him, he returned to the house at mid-day, carrying with him three\nmince-pies, which he had felt himself rich enough to buy in honour of the\nholiday. He had for a long time been reckoning upon shutting up shop for\nthe whole afternoon, and upon going out for a long stroll through the\nstreets with old Oliver and Dolly; and now that the hour was positively\ncome he felt very light-hearted and full of spirits, defying the wind\nwhich wrestled with him at every turn. Dolly must be wrapped up well, he\nsaid to himself, and old Oliver must put on his drab great coat, with\nmother o' pearl buttons, which he had brought up from the country forty\nyears ago, and which was still good for keeping out the cold. He ran\ndown the alley, and passed through the shop whistling cheerily, and\ndisdaining to lift the flap of the counter, he took a running vault over\nit, and landed at once inside the open kitchen-door.\n\nBut there was old Oliver sitting close to the fire, with Dolly on his\nknee, and her little head lying upon his breast, while the tears trickled\nslowly down his furrowed cheeks on to her pretty curls. Beppo was\nstanding between his legs, licking Dolly's small hand, which hung\nlanguidly by her side. Her eyelids were closed, and her face was deadly\nwhite; but when Tony uttered a great cry of trouble, and fell on his\nknees before her, she opened her heavy eyes, and stretched out her cold\nthin hand to stroke his cheeks. \"Dolly's so very ill, Tony,\" she\nmurmured, \"poor Dolly's very ill indeed.\"\n\n\"I don't know whatever is the matter with my little love,\" said the old\nman, in a low and trembling voice; \"she fell down all of a sudden, and I\nthought she was dead, Tony; but she's coming round again now. Isn't my\nlittle love better now?\"\n\n\"Yes, gan-pa, yes; Dolly's better,\" she answered faintly.\n\n\"Let me hold her, master,\" said Tony, his heart beating fast; \"I can\nhold her stronger and more comfortable, maybe, than you. You're tired\never so, and you'd better get yourself a bit of dinner. Shall Tony nurse\nyou now, Dolly?\"\n\nThe little girl raised her arms to him, and Tony took her gently into his\nown, sitting down upon the old box in the chimney-corner, and putting her\nto nestle comfortably against him. Dolly closed her eyes again, and\nby-and-bye he knew that she had fallen into a light sleep, while old\nOliver moved noiselessly to and fro, only now and then saying half aloud,\nin a tone of strange earnestness and entreaty, \"Lord! dear Lord!\"\n\nAfter awhile the old man came and bent over them both, taking Dolly's arm\nsoftly between his withered fingers, and looking down at it with a\nshaking head.\n\n\"She's very thin, Tony; look at this little arm,\" he said, \"wasting away!\nwasting away! I've watched all my little ones waste away except my poor\nSusan. Couldn't there anything be done to save her?\"\n\n\"Ay!\" answered Tony, in an energetic whisper, while he clasped Dolly a\nlittle tighter in his arms; \"ay! they could cure her easily at the\nhospital. Bless yer! there were little 'uns ten times worse than her as\nthey sent home cured. Let us take her there as soon as ever she wakes\nup, and she'll be quite well directly, I promise you. The doctor knows\nme, and I'll speak to Mr. Ross for her. Do you get a bit of dinner, and\nhearten yourself up for it; and we'll set off as soon as she's awake.\"\n\nOld Oliver turned away comforted, and prepared his own and Tony's dinner,\nand put a mince-pie into the oven to be ready to tempt Dolly's appetite\nwhen she awoke. But she slept heavily all the afternoon till it was\nalmost dark outside, and the lamps were being lit, when she awoke,\nrestless and feverish.\n\n\"Would Dolly like to go to that nice place, where the little girls had\nthe dolls and the music?\" asked Tony, in a quavering voice which he could\nscarcely keep from sobs; \"the good place where Tony got well again, and\nthey gave him his new clothes? Everybody 'ud be so wery kind to poor\nlittle Dolly, and she'd come home again, quite cured and strong, like\nTony was.\"\n\n\"Yes, yes!\" cried Dolly, eagerly, raising herself up in his arms; \"it's a\nnice place, and the sun shines, and Dolly 'ud like to go. Only she'll be\nsure to come back to gan-pa.\"\n\nIt was some time yet before they were quite ready to start, though Dolly\ncould not be coaxed to eat the hot mince-pie, or anything else. Old\nOliver had to get himself into his drab overcoat, and the ailing child\nhad to be protected in the best way they could against the searching\nwind. After they had put on all her own warmest clothing, Tony wrapped\nhis own thick blue jacket about her, and lifting her very tenderly in his\narms, they turned out into the streets, closely followed by Beppo.\n\nIt was now quite night, but the streets were well lighted from the shop\nwindows, and throngs of people were hurrying hither and thither; for it\nwas boxing-night, and all the lower classes of the inhabitants were\ntaking holiday. But old Oliver saw and heard nothing of the crowd. He\nwalked on by Tony's side; with feeble and tottering steps, deaf and\nblind, but whispering all the while, with trembling lips, to One whom no\none else could see or hear. Once or twice Tony saw a solemn smile flit\nacross his face, and he nodded his head and raised his hand, as one who\ngives his assent to what is said to him. So they passed on through the\nnoisy streets till they reached quieter ones, were there were neither\nshops nor many passers-by, and there they found the home where they were\ngoing to leave their treasure for a time.\n\n\n\n\nCHAPTER XVIII. NO ROOM FOR DOLLY.\n\n\nOld Oliver rang the house-bell very quietly, for Dolly seemed to be\nasleep again, and lay quite still in Tony's arms, which were growing\nstiff, and benumbed by the cold. The door was opened by a porter, whose\nface was strange to them both, for he had only come in for the day while\nthe usual one took holiday. Old Oliver presented himself in front, and\npointed at his little grandchild as Tony held her in his arms while he\nspoke to the porter in a voice which trembled greatly.\n\n\"We've brought you our little girl, who is very ill,\" he said, \"but\nshe'll soon get well in here, I know. I'd like to see the doctor, and\ntell him all about her.\"\n\n\"We're quite full,\" answered the porter, filling up the doorway.\n\n\"Full?\" repeated old Oliver, in a tone of questioning.\n\n\"Ay! all our cots are full,\" he replied, \"chockfull. There ain't no more\nroom. We've turned two or three away this morning, when they came at the\nright time. This isn't the right time to bring any child here.\"\n\n\"But my little love is very ill,\" continued old Oliver; \"this is the\nright place, isn't it? The place where they nurse little children\nwho are ill?\"\n\n\"It's all right,\" said the porter, \"it's the right place enough, only\nit's brimful, and running over, as you may say. We couldn't take in one\nmore, if it was ever so. But you may come in and sit down in the hall for\na minute or two, while I fetch one of the ladies.\"\n\nOld Oliver and Tony entered, and sat down upon a bench inside. There was\nthe broad staircase, with its shallow steps, which Dolly's tiny feet had\nclimbed so easily, and it led up to the warm, pleasant nurseries, where\nlittle children were already falling asleep, almost painlessly, in their\ncosy cots. Tony could not believe that there was not room for their\ndarling, who had been so willing to come to the place she knew so well,\nyet a sob broke from his lips, which disturbed Dolly in her sleep, for\nshe moaned once or twice, and stirred uneasily in his arms. The old man\nleaned his hands upon the top of his stick, and rested his white head\nupon them, until they heard light footsteps, and the rustling of a\ndress, and they saw a lady coming down stairs to them.\n\n\"I think there's some mistake here, ma'am,\" said Oliver, his eye\nwandering absently about the large entrance-hall; \"this is the Hospital\nfor Sick Children, I think, and I've brought my little grandchild here,\nwho is very ill indeed, yet the man at the door says there's no room for\nher. I think it must be a mistake.\"\n\n\"No,\" said the lady; \"I am sorry to say it is no mistake. We are quite\nfull; there is not room for even one more. Indeed, we have been obliged\nto send cases away before to-day. Who is your recommendation from?\"\n\n\"I didn't know you'd want any recommendation,\" answered old Oliver, very\nmournfully; \"she's very ill, and you could cure her here, and take\nbetter care of her than Tony and me, and I thought that was enough. I\nnever thought of getting any recommendation, and I don't know where I\ncould get one.\"\n\n\"Mr. Ross 'ud give us one,\" said Tony, eagerly.\n\n\"Yet even then,\" answered the lady, \"we could not take her in until some\nof the cots are empty.\"\n\n\"You don't know me,\" interrupted Tony, eagerly; \"but Mr. Ross brought\nme here, a year ago now, and they cured me, and set me up stronger\nthan ever. They was so wery kind to me, that I couldn't think of\nanythink else save bringing our little girl to 'em. I'm sure they'd\ntake her in, if they only knew it was her. You jest say as it's Tony\nand Dolly, as everybody took such notice of, and they'll never turn her\naway, I'm sure.\"\n\n\"I wish we could take her,\" said the lady, with tears in her eyes; \"but\nit is impossible. We should be obliged to turn some other child out, and\nthat could not be done to-night. You had better bring her again in the\nmorning, and we'll see if there is any one well enough to make room for\nher. Let me look at the poor child for a minute.\"\n\nShe lifted up the collar of Tony's blue jacket, which covered Dolly's\nface, and looked down at it pitifully. It was quite white now, and was\npinched and hollow, with large blue eyes shining too brightly. She\nstretched out her arms to the lady, and made a great effort to smile.\n\n\"Put Dolly into a pretty bed,\" she murmured, \"where the sun shines, and\nshe'll soon get well and go home again to gan-pa.\"\n\n\"What can I do?\" cried the lady, the tears now running down her face.\n\"The place is quite full; we cannot take in one more, not one. Bring her\nhere again in the morning, and we will see what can be done.\"\n\n\"How many children have you got here?\" asked old Oliver.\n\n\"We have only seventy-five cots,\" she answered, sobbing; \"and in a winter\nlike this they're always full.\"\n\n\"Only seventy-five!\" repeated the old man, very sorrowfully. \"Only\nseventy-five, and there are hundreds and hundreds of little children ill\nin London! They are ill in houses like mine, where the sun never shines.\nIs there no other place like this we could take our little love to?\"\n\n\"There are two or three other Hospitals,\" she answered, \"but they are a\nlong way off, and none of them as large as ours. They are sure to be full\njust now. I think there are not more than a hundred and fifty cots in all\nLondon for sick children.\"\n\n\"Then there's no room for my Dolly?\" he said.\n\nThe lady shook her head without speaking, for she had her handkerchief up\nto her face.\n\n\"Eh!\" cried old Oliver in a wailing voice, \"I don't know whatever the\ndear Lord 'ill say to that.\"\n\nHe made a sign to Tony that they must be going home again; and the boy\nraised himself up with a strange weight and burden upon his heart. Old\nOliver put his stick down, and took Dolly into his own arms, and laid her\nhead down on his breast.\n\n\"Let me carry her a little way, Tony,\" he said. \"She's as light as a\nfeather, even to poor old grandpa. I'd like to carry my little love a bit\nof the way home.\"\n\n\"I'll tell you what I can do,\" said the lady, wrapping Dolly up and\nkissing her before she covered her pale face, \"if you will tell me where\nyou live I will speak to the doctor as soon as he comes in--for he is out\njust now--and perhaps he will come to see her. He knows a great deal\nabout children, and is fond of them.\"\n\n\"Thank you, thank you kindly, ma'am,\" answered old Oliver, feeling a\nlittle comforted. But when they stood outside, and the bleak wind blew\nabout them, and he could see the soft glimmer of the light in the\nwindows, within which other children were safely sheltered and\ncarefully tended, his spirit sank again. He tottered now and then under\nhis light burden; but he could not be persuaded to give up his little\nchild to Tony again. These streets were quiet, with handsome houses on\neach side, and from one and another there came bursts of music and\nlaughter as they passed by; yet Tony could catch most of the words\nwhich the old man was speaking.\n\n[NO ROOM FOR DOLLY]\n\n\"Dear Lord,\" he said, \"there's only room for seventy-five of thy little\nlambs that are pining and wasting away in every dark street and alley\nlike mine. Whatever can thy people be thinking about? They've got their\nown dear little children, who are ill sometimes, spite of all their\ncare; and they can send for the doctor, and do all that's possible,\nnever looking at the money it costs; but when they are well again they\nnever think of the poor little ones who are sick and dying, with nobody\nto help them or care for them as I care for this little one. Oh, Lord,\nLord! let my little love live! Yet thou knows what is best, and thou'lt\ndo what is best. Thou loves her more than I do; and see, Lord, she is\nvery ill indeed.\"\n\nThey reached home at last, after a weary and heartbroken journey, and\ncarried Dolly in and laid her upon old Oliver's bed. She was wide awake\nnow, and looked very peaceful, smiling quietly into both their faces as\nthey bent over her. Tony gazed deep down into her eyes, and met a glance\nfrom them which sent a strange tremor through him. He crept silently\naway, and stole into his dark bed under the counter, where he stretched\nhimself upon his face, and buried his mouth in the chaff pillow to choke\nhis sobs. What was going to happen to Dolly? What could it be that made\nhim afraid of looking again into her patient and tranquil little face?\n\n\n\n\nCHAPTER XIX. THE GOLDEN CITY.\n\n\nTony lay there in the dark, overwhelmed by his unusual terror and sorrow,\nuntil he heard the voice of old Oliver calling his name feebly. He\nhurried to him, and found him still beside the bed where Dolly was lying.\nHe had taken off most of her clothes, and put her white nightgown over\nthe rest, that she might sleep warmly in them all the night, for her\nlittle hands and feet felt very chilly to his touch. The fire had gone\nout while they were away, and the grate looked very black and cheerless.\nThe room was in great disorder, just as they had left it, and the gas,\nwhich was burning high, cast a cruel glare upon it all. But Tony saw\nnothing except the dear face of Dolly, resting on one check upon the\npillow, with her curly hair tossed about it in confusion, and her open\neyes gathering a strange film. Beppo had made his way to her side, and\npushed his head under her lifeless little hand, which tried to pat it now\nand then. Old Oliver was sitting on the bedstead, his eyes fastened upon\nher, and his whole body trembled violently. Tony sank down upon his\nknees, and flung his arm over Dolly, as if to save her from the unseen\npower which threatened to take her away from them.\n\n\"Don't ky, gan-pa,\" she said, softly; \"don't ky more than a minute. Nor\nTony. Are I going to die, gan-pa?\"\n\n\"Yes, my little love,\" cried old Oliver, moaning as he said it.\n\n\"Where are I going to?\" asked Dolly, very faintly.\n\n\"You're going to see my Lord and Master,\" he said; \"him as loves little\nchildren so, and carries them in his arms, and never lets them be\nsorrowful or ill or die again.\"\n\n\"Does he live in a bootiful place?\" she asked, again.\n\n\"It's a more beautiful place than I can tell,\" answered old Oliver. \"The\nLord Jesus gives them light brighter than the sun; and the streets are\nall of gold, and there are many little children there, who always see the\nface of their Father.\"\n\n\"Dolly's going rere,\" said the little child, solemnly.\n\nShe smiled for a minute or two, holding Beppo's ear between her failing\nfingers, and playing with it. Tony's eyes were dim with tears, yet he\ncould see her clear face clearly through them. What could he do? Was\nthere no one to help?\n\n\"Master, master!\" he cried. \"If the Lord Jesus is here he can save her.\nAsk him, master.\"\n\nBut old Oliver paid no heed to him. For the child who was passing away\nfrom him he was all eye and ear, watching and listening as keenly as in\nhis best and strongest days; but he was blind and deaf to everything else\naround him. Tony's voice could not reach his brain.\n\n\"Will gan-pa come rere?\" whispered the failing and faltering voice of\nDolly.\n\n\"Very soon,\" he answered; a radiant smile coming to his face, which made\nher smile as her eyes caught the glory of it. \"Very, very soon, my little\nlove. You'll be there to meet me when I come.\"\n\n\"Dolly'll watch for gan-pa,\" she murmured, with long pauses between the\nwords, which seemed to drop one by one upon Tony's ear; \"and Dolly'll\nwatch at the door for Tony to come home; and she'll fret ever so if he\nnever comes.\"\n\nTony felt her stir restlessly under his arm, and stretch her tiny limbs\nupon the bed as if she were very tired, and the languid eyelids drooped\nslowly till they quite hid her blue eyes, and she sighed softly as\nchildren sigh when they fall asleep, weary of their play. Old Oliver laid\nhis shaking hand tenderly upon her head.\n\n\"Dear Lord!\" he said, \"take my little love to thyself. I give her\nup to thee.\"\n\nIt seemed to Tony as if a thick mist of darkness fell all about him, and\nas if he were sinking down, down, very low into some horrible pit where\nhe would never see the light of day again. But by-and-bye he came to\nhimself, and found old Oliver sobbing in short, heavy sobs, and swaying\nhimself to and fro, while Beppo was licking Dolly's hand, and barking\nwith a sharp, quiet bark, as he had been wont to do when he wanted her to\nplay with him. The child's small features were quite still, but there was\nan awful smile upon them such as there had never been before, and Tony\ncould not bear to look upon it. He crossed her tiny hands lightly over\none another upon her breast, and then he lifted Beppo away gently, and\ndrew the bed-clothes about her, so as to hide her smiling face.\n\n\"Master,\" he cried, \"master, is she gone?\"\n\nOld Oliver only answered by a deep moan; and Tony put his arm about him,\nand raised him up.\n\n\"Come to your own chair, master,\" he said.\n\nHe yielded to Tony like a child, and seated himself in the chair, where\nhe had so often sat and watched Dolly while he smoked his pipe. The boy\nput his pipe between his fingers; but he only let it fall to the ground,\nwhere it broke into many pieces. Tony did not know what to do, nor where\nto go for any help.\n\n\"Lord,\" he said, \"if you really love the old master, do something for\nhim; for I don't know whatever to do, now little Dolly's gone.\"\n\nHe sat down on his old box, staring at Oliver and the motionless form on\nthe bed, with a feeling of despair tugging at his heart. He could\nscarcely believe it was all true; for it was not very long since--only it\nseemed like long years--since he had leaped over the counter in his\nlight-heartedness. But he had not sat there many minutes before he heard\na distinct, rather loud knock at the shop-door, and he ran hastily to ask\nwho was there.\n\n\"Antony,\" said a voice he knew very well, \"I have come with the doctor,\nto see what we can do for your little girl.\"\n\nIn an instant Tony opened the door, and as Mr. Ross entered the boy flung\nhis arms round him, and hid his face against him, sobbing bitterly.\n\n\"Oh! you've come too late,\" he cried, \"you've come too late! Dolly's\ndead, and I'm afraid the master's going away from me as well. They\ncouldn't take her in, and she died after we had brought her home.\"\n\nThe doctor and Mr. Ross went on into the inner room, and Tony pointed\nsilently to the bed where Dolly lay. Old Oliver roused himself at the\nsound of strange voices, and, leaning upon Tony's shoulder, he staggered\nto the bedside, and drew the clothes away from her dear, smiling face.\n\n\"I don't murmur,\" he said. \"My dear Lord can't do anything unkind. He'll\ncome and speak to me presently, and comfort me; but just now I'm deaf and\nblind, even to him. I've not forgot him, and he hasn't forgot me; but\nthere's a many things ought to be done, and I cannot think what.\"\n\n\"Leave it all to us,\" said Mr. Ross, leading him back to his chair. \"But\nhave you no neighbour you can go and stay with for to-night? You are an\nold man, and you must not lose your night's sleep.\"\n\n\"No,\" he answered, shaking his head; \"I'd rather stay here in my own\nplace, if I'd a hundred other places to go to. I'm not afraid of my\nlittle love,--no, no! When everything is done as ought to be done,\nI'll lie in my own bed and watch her. It won't be lonesome, as long as\nshe's here.\"\n\nIn an hour's time all was settled for that night. A little resting-place\nhad been made for the dead child in a corner of the room, where she lay\ncovered with a coarse white sheet, which was the last one left of those\nwhich old Oliver's wife had spun in her girlhood. The old man had given\nhis promise to go to bed when Mr. Ross and the doctor were gone; and he\nslept lightly, his face turned towards the place where his little love\nwas sleeping. A faint light burnt all night in the room, and Tony, who\ncould not fall asleep, sat in the chimney-corner, with Beppo upon his\nknees. There was an unutterable, quiet sorrow within him, mingled with a\nstrange awe. That little child, who had played with him, and kissed him\nonly a day since, was already gone into the unseen world, which was so\nvery near to him now, though it had seemed so very far away and so empty\nbefore. It must be very near, since she had gone to it so quickly; and\nit was no longer empty, for Dolly was there; and she had said she would\nwatch at the door till he came home.\n\n\n\n\nCHAPTER XX. A FRESH DAY DAWNS.\n\n\nOld Oliver and Tony saw their darling buried in a little grave in a\ncemetery miles away from their own home, and then they returned, desolate\nand bereaved, to the deserted city, which seemed empty indeed to them.\nThe house had never looked so very dark and dreary before. Yet from time\nto time old Oliver forgot that Dolly was gone altogether, and could never\ncome back; for he would call her in his eager, quavering tones, or search\nfor her in some of the hiding-places, where she had often played at\nhide-and-seek with him. When mealtimes came round he would put out\nDolly's plate and cup, which had been bought on purpose for her, with gay\nflowers painted upon them; and in the evening, over his pipe, when he had\nbeen used to talk to his Lord, he now very often said nothing but repeat\nagain and again Dolly's little prayer, which he had himself taught her,\n\"Gentle Jesus, meek and mild.\" It was quite plain to Tony that it would\nnever do to leave him alone in his house and shop.\n\n\"I've give up my place as errand-boy,\" he said to Mr. Ross, \"'cause the\nold master grows worse and worse for forgetting, and I must mind shop for\nhim now as well as I can. He's not off his head, as you may say; he's\nsharp enough sometimes; but there's no trusting to him being sharp\nalways. He talks to Dolly as if she was here, and could hear him, till I\ncan't hardly bear it. But I'm very fond of him,--fonder of him than\nanythink else, 'cept my little Dolly; and I've made up my mind as his\nMaster shall be my master, and he's always ready to tell me all he knows\nabout him. I'm no ways afeared of not getting along.\"\n\nTony found that they got along very well. Mr. Ross made a point of going\nin to visit them every week, and of seeing how the business prospered in\nthe boy's hands; and he put as much as he could in his way. Sad and\nsorrowful as the days were, they passed over, one after another, bringing\nwith them at least the habit of living without Dolly. Every Sunday\nafternoon, however, old Oliver and Tony walked slowly through the\nstreets, for the old man could only creep along with Tony's help, till\nthey reached the Children's Hospital; but they never passed the door, nor\nentered in through it. Old Oliver would stand for a few minutes leaning\nheavily on Tony's shoulder, and trembling from head to foot, as his eyes\nwandered over all the front of the building; and then a low, wailing cry\nwould break from his lips, \"Dear Lord! there was no room for my little\nlove, but thou hast found room for her!\"\n\nIt was a reopening of Tony's sorrow when Aunt Charlotte came up from the\ncountry to find that the little child had gone away altogether, leaving\nonly her tiny frocks and clothes, which were neatly folded up in a\ndrawer, where old Oliver treasured up a keepsake or two of his wife's.\nShe discovered, too, that old Oliver had forgotten to write to\nSusan,--indeed, his hand had become too trembling to hold a pen,--and she\nwrote herself; but her letter did not reach Calcutta before Susan and her\nhusband had left it, being homeward bound.\n\nIt was as nearly two years as it could well be since the summer evening\nwhen Susan Raleigh had sent her little girl into old Oliver's shop,\nbidding her be a good girl till she came home, and thinking it would be\nonly three days before she saw her again. It was nearly two years, and an\nevening something like it, when the door was darkened by the entrance of\na tall, fine-looking man, dressed as a soldier, but with one empty sleeve\nlooped up across his chest. Tony was busy behind the counter wrapping up\nmagazines, which he was going to take out the next morning, and the\nsoldier looked very inquisitively at him.\n\n\"Hallo! my lad, who are you?\" he asked, in a tone of surprise.\n\n\"I'm Antony Oliver,\" he said; for of late he had taken to call himself by\nhis old master's name.\n\n\"Antony Oliver!\" repeated the stranger; \"I never heard of you before.\"\n\n\"Well, I'm only Tony,\" he answered; \"but I live with old Mr. Oliver now,\nand call him grandfather. He likes it, and it does me good. It's like\nsomebody belonging to me.\"\n\n\"Why! how long have you called him grandfather?\" asked the soldier again.\n\n\"Ever since our little Dolly died,\" said Tony, in a faltering voice.\n\n\"Dolly dead!\" exclaimed the man, looking ready to fall down; for his\nface went very white, and he leaned upon the counter with his one hand.\n\"Oh! my poor Susan!--my poor, dear girl!--however can I tell her this\nbad news?\"\n\n\"Who are you?\" cried Tony. \"Are you Dolly's father? Oh, she's dead!\nShe died last January, and we are more lonesome without her than you\ncan think.\"\n\n\"Let me see poor Susan's father,\" he said, after a minute or two, and\nwith a very troubled face.\n\n\"Ay, come in,\" said Tony, lifting up the flap of the counter, under which\nDolly had so often played at hide-and-seek. \"He's more hisself again; but\nhis memory's bad yet. I know everythink about her, though; because she\nwas so fond of me, and me of her. Come in.\"\n\nRaleigh entered the room, and saw old Oliver sitting in his arm-chair,\nwith a pipe in his hand, and a very tranquil look upon his wrinkled face.\nThe gas-light shone upon the glittering epaulettes and white sash of the\nsoldier, and the old man fastened upon him a very keen, yet doubtful gaze\nof inquiry.\n\n\"Don't you know me, father?\" cried Raleigh, almost unable to utter a\nword. \"It's your poor Susan's husband, and Dolly's father.\"\n\n\"Dolly's father!\" repeated old Oliver, rising from his chair, and\nresting his hand upon Raleigh's shoulder. \"Do you know that the dear Lord\nhas taken her to be where he is in glory?\"\n\n\"Yes, I know it,\" he said, with a sob.\n\nHe put the old man back in his seat, and drew a chair close up to him.\nThey sat thus together in sorrowful silence for some minutes, until old\nOliver laid his hand upon the empty sleeve on Raleigh's breast.\n\n\"You've lost your arm,\" he said, pityingly.\n\n\"Ay!\" answered Raleigh; \"our colonel was set upon by a tiger in the\njungle, and I saved him; but the brute tore my arm, and craunched\nthe bone between his teeth till it had to come off. It's spoiled me\nfor a soldier.\"\n\n\"Yes, yes, poor fellow,\" answered old Oliver, \"but the Lord knew all\nabout it.\"\n\n\"That he did,\" answered Raleigh; \"and he's taught me a bit more about\nhimself than I used to know. I'm not spoiled to be His soldier. But I\ndon't know much about the service yet, and I shall want you to teach me,\nfather. You'll let me call you father, for poor Susan's sake, won't you?\"\n\n\"To be sure--to be sure,\" said old Oliver, keeping his hand still upon\nthe empty sleeve on Raleigh's breast.\n\n\"Well, father,\" he continued, \"as I am not fit for a soldier, and as the\ncolonel was hurt too, we're all come home together. Only Susan's gone\nstraight on with her lady and our little girl, and sent me through London\nto see after you and Dolly.\"\n\n\"Your little girl?\" said Oliver questioningly.\n\n\"Yes, the one born in India. Her name's Mary, but we call her Polly.\nSusan said it made her think of our little Dolly at home. Dear! dear! I\ndon't know however I shall let her know.\"\n\nAnother fit of silence fell upon them, and Tony left them together, for\nit was time to put up the shop shutters. It seemed just like the night\nwhen he had followed Susan and the little girl, and loitered outside in\nthe doorway opposite, to see what would happen after she had left her in\nthe shop. He fancied he was a ragged, shoeless boy again, nobody loving\nhim, or caring for him, and that he saw old Oliver and Dolly standing on\nthe step, looking out for the mother, who had gone away, never, never to\nsee her darling again. Tony's heart was very full; and when he tried to\nwhistle, he was obliged to give it up, lest he should break out into sobs\nand crying. When he went back into the house Raleigh was talking again.\n\n\"So Susan and me are to have one of the lodges of the colonel's park,\"\nhe said, \"and I'm to be a sort of bailiff to look after the other outdoor\nservants about the garden and premises. It's a house with three bedrooms,\nand a very pleasant sort of little parlour, as well as a kitchen and\nscullery place downstairs. You can see the Wrekin from the parlour\nwindow, and the moon over it; and it's not so far away but what we could\nget a spring-cart sometimes, and drive over to your old home under the\nWrekin. As soon as ever the colonel's lady told Susan where it was, she\ncried out, 'That's the very place for father!' You'd like to come and\nlive with your own Susan again, in your own country; wouldn't you now?\"\n\n\"Yes, yes; for a little while,\" answered old Oliver, with a smile\nupon his face.\n\nTony felt a strange and very painful shrinking at his heart. If the old\nman went away to live with his daughter in the country, his home would be\nlost to him, and he would have to go out into the great city again alone,\nwith nobody to love. He could get his living now in a respectable manner,\nand there was no fear of his being driven to sleep in Covent Garden, or\nunder the bridges. But he would be alone, and all the links which bound\nhim to Dolly and old Oliver would be snapped asunder. He wondered if the\nLord Jesus would let such a thing be.\n\n\"But I couldn't leave Tony,\" cried old Oliver, suddenly; and putting on\nhis spectacles to look for him.\n\n\"Come here, Tony. He's like my own son to me, bless him! He calls me\ngrandfather, and kept my heart up when I should have sunk very low\nwithout him. My Master gave him to me the very same night he gave me my\nlittle love. No, no; Dolly loved Tony, and Susan must come here to see\nme, but I could never leave my boy.\"\n\nOld Oliver had put his arm round Tony, drawing him closer and closer to\nhim as he spoke, until his withered cheek pressed fondly against his\nface. Since Dolly died neither of them had felt such a thrill of\nhappiness as now.\n\n\"The colonel and his lady must be told about this,\" said Raleigh, after\nhe had heard all that Tony had been and done for old Oliver; and when he\nwas obliged to go away for the night, the soldier gave him such a cordial\ngrasp of the hand, as set all his fingers tingling, and his heart\nthrobbing with exultation.\n\n\n\n\nCHAPTER XXI. POLLY.\n\n\nThe lodge stood in a very lovely place, upon a slope of ground, which\nrose still higher to where the colonel's grand house was situated. There\nwas a porch before the door, built of rough logs of pines, covered with\nivy and honeysuckle, and with seats in it, where you could sit and look\nout over a wide, rich plain, with little hills and dales in it,\nstretching far away towards the sky-line, where some distant mountains\nlay, so like to clouds, that you could scarcely tell which were soft and\nmisty vapours, and which were solid and everlasting hills. The Severn ran\nthrough the beautiful plain with so many windings, sometimes lying in\nshadow under deep banks, and sometimes glistening and sparkling in the\nsunlight, that it looked more like many little pools scattered about the\nmeadows than one long, continuous river. Not very far away, as Raleigh\nhad said, stood the Wrekin, purple in the evening haze, but by day so\nplain, that one could see the great rock on its summit, which in olden\ntimes served as an altar to the god of fire.\n\nSusan was very busy, and had been very busy all day over two\nthings--preparing the house for the reception of her father, whom she had\nnot seen for so many years, and in teaching her little girl, who was now\neighteen months old, to say grand-pa. The one work was quite finished;\neverything was ready for old Oliver, and now she was waiting and watching\nto see the colonel's spring cart arrive from the station with her\nhusband, who was gone to meet old Oliver and Tony. For Tony was not on\nany account to be parted from the old man--so said the colonel and his\nlady--but was to be employed about the garden, and as general errand boy\nfor the house, and to live at the lodge with old Oliver. Susan's eyes\nwere red, for as she had been busy about her work, she had several times\ncried bitterly over her lost little girl; but she had resolved within\nherself not to shed a single tear after her father was come, lest she\nshould spoil the gladness of his coming home to her. At last the cart\ncame in sight, and stopped, and Raleigh and Tony sprang out to help\nOliver to get down, while Susan put down Polly in the porch, and ran to\nthrow her arms round her dear old father's neck.\n\nHe was very quiet, poor old Oliver. He had not spoken a word since he\nleft the station, but had gazed about him as they drove along the\npleasant lane with almost a troubled look upon his tranquil face. When\nhis dim eyes caught the first glimpse of the Wrekin he lifted his hat\nfrom his white and trembling head, as if to greet it like some great and\ndear friend, after so many years of absence. Now he stood still at the\nwicket, leaning upon Susan's arm, and looking round him again with a\ngentle yet sad smile. The air was so fresh, after the close streets of\nLondon, that to him it seemed even full of scents of numberless flowers;\nand the sun was shining everywhere, upon the blossoms in the garden, and\nthe fine old elm-trees in the park, and the far-off hills. He grasped\nTony's hand in his, and bade him look well about him.\n\n\"If only my little love had had a bit of sunshine!\" he said, with a\nmournful and tender patience in his feeble voice.\n\nBut just then--scarcely had he finished speaking--there came a shrill,\nmerry little scream behind them, so like Dolly's, that both old Oliver\nand Tony turned round quickly. It could not be the same, for this little\nchild was even smaller than Dolly; but as she came pattering and\ntottering down the garden-walk towards them, they saw that she had the\nsame fair curly hair, and blue eyes, and rosy cheeks that Dolly had had\ntwo years before. She ran and hid her face in her mother's gown; but\nSusan lifted her into her arms, and held her towards old Oliver.\n\n\"Say grand-pa, and kiss him, Polly,\" she said, coaxingly.\n\nThe little child held back shyly for a minute, for old Oliver's head was\nshaking much more than usual now; but at length she put her two soft\nlittle hands to his face, and held it between them, while she kissed him.\n\n\"Gan-pa!\" she cried, crowing and chuckling with delight.\n\nThey went indoors to the pleasant parlour, where old Oliver's arm-chair\nwas set ready for him by the side of the fire, for Susan had kindled a\nfire, saying that he would feel the fresh air blowing from the Wrekin;\nand Polly sat first on his knee, and then upon Tony's, who could not keep\nhis eyes from following all her movements. But still it was not their own\nDolly who had made the old house in the close alley in London so happy\nand so merry for them. She was gone home to the Father's house, and was\nwatching for them there. Tony might be a long time before he joined her,\nbut for old Oliver the parting would be but short. As he sat in the\nevening dusk, very peacefully and contentedly, while Susan sang Polly to\nsleep in the kitchen, Tony heard him say half aloud, as his custom was,\n\"Yet a little, and I will come again, and receive you unto myself, that\nwhere I am ye may be also. Even so, come, Lord Jesus!\"\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      32,
      53,
      1
    ],
    [
      "chapter.title",
      10278,
      10307,
      2
    ],
    [
      "chapter.title",
      18689,
      18722,
      3
    ],
    [
      "chapter.title",
      23018,
      23050,
      4
    ],
    [
      "chapter.title",
      32404,
      32430,
      5
    ],
    [
      "chapter.title",
      36410,
      36447,
      6
    ],
    [
      "chapter.title",
      41848,
      41880,
      7
    ],
    [
      "chapter.title",
      50099,
      50136,
      8
    ],
    [
      "chapter.title",
      55493,
      55532,
      9
    ],
    [
      "chapter.title",
      60359,
      60389,
      10
    ],
    [
      "chapter.title",
      67565,
      67591,
      11
    ],
    [
      "chapter.title",
      73620,
      73648,
      12
    ],
    [
      "chapter.title",
      77927,
      77951,
      13
    ],
    [
      "chapter.title",
      84923,
      84948,
      14
    ],
    [
      "chapter.title",
      91760,
      91796,
      15
    ],
    [
      "chapter.title",
      100289,
      100315,
      16
    ],
    [
      "chapter.title",
      107251,
      107284,
      17
    ],
    [
      "chapter.title",
      113060,
      113093,
      18
    ],
    [
      "chapter.title",
      121311,
      121340,
      19
    ],
    [
      "chapter.title",
      129203,
      129233,
      20
    ],
    [
      "chapter.title",
      139304,
      139323,
      21
    ]
  ]
}