{
  "content": "The Tale Of Benjamin Bunny\nBeatrix Potter\n\n    FOR THE CHILDREN OF SAWREY\n\n    FROM\n    OLD MR. BUNNY\n\nBOOK 1.\n\n\nOne morning a little rabbit sat on a bank.\n\nHe pricked his ears and listened to the trit-trot, trit-trot of a pony.\n\nA gig was coming along the road; it was driven by Mr. McGregor, and beside\nhim sat Mrs. McGregor in her best bonnet.\n\nAs soon as they had passed, little Benjamin Bunny slid down into the road,\nand set off--with a hop, skip, and a jump--to call upon his relations, who\nlived in the wood at the back of Mr. McGregor's garden.\n\n\n\nThat wood was full of rabbit holes; and in the neatest, sandiest hole of\nall lived Benjamin's aunt and his cousins--Flopsy, Mopsy, Cotton-tail, and\nPeter.\n\nOld Mrs. Rabbit was a widow; she earned her living by knitting rabbit-wool\nmittens and muffatees (I once bought a pair at a bazaar). She also sold\nherbs, and rosemary tea, and rabbit-tobacco (which is what we call\nlavender).\n\nLittle Benjamin did not very much want to see his Aunt.\n\nHe came round the back of the fir-tree, and nearly tumbled upon the top of\nhis Cousin Peter.\n\n\n\nPeter was sitting by himself. He looked poorly, and was dressed in a red\ncotton pocket-handkerchief.\n\n\"Peter,\" said little Benjamin, in a whisper, \"who has got your clothes?\"\n\nPeter replied, \"The scarecrow in Mr. McGregor's garden,\" and described how\nhe had been chased about the garden, and had dropped his shoes and coat.\n\nLittle Benjamin sat down beside his cousin and assured him that Mr.\nMcGregor had gone out in a gig, and Mrs. McGregor also; and certainly for\nthe day, because she was wearing her best bonnet.\n\n\n\nPeter said he hoped that it would rain.\n\nAt this point old Mrs. Rabbit's voice was heard inside the rabbit hole,\ncalling: \"Cotton-tail! Cotton-tail! fetch some more camomile!\"\n\nPeter said he thought he might feel better if he went for a walk.\n\nThey went away hand in hand, and got upon the flat top of the wall at the\nbottom of the wood. From here they looked down into Mr. McGregor's garden.\nPeter's coat and shoes were plainly to be seen upon the scarecrow, topped\nwith an old tam-o'-shanter of Mr. McGregor's.\n\n\n\nLittle Benjamin said: \"It spoils people's clothes to squeeze under a gate;\nthe proper way to get in is to climb down a pear-tree.\"\n\nPeter fell down head first; but it was of no consequence, as the bed below\nwas newly raked and quite soft.\n\nIt had been sown with lettuces.\n\nThey left a great many odd little footmarks all over the bed, especially\nlittle Benjamin, who was wearing clogs.\n\n\n\nLittle Benjamin said that the first thing to be done was to get back\nPeter's clothes, in order that they might be able to use the\npocket-handkerchief.\n\nThey took them off the scarecrow. There had been rain during the night;\nthere was water in the shoes, and the coat was somewhat shrunk.\n\nBenjamin tried on the tam-o'-shanter, but it was too big for him.\n\nThen he suggested that they should fill the pocket-handkerchief with\nonions, as a little present for his Aunt.\n\nPeter did not seem to be enjoying himself; he kept hearing noises.\n\n\n\n\nBenjamin, on the contrary, was perfectly at home, and ate a lettuce leaf.\nHe said that he was in the habit of coming to the garden with his father\nto get lettuces for their Sunday dinner.\n\n(The name of little Benjamin's papa was old Mr. Benjamin Bunny.)\n\nThe lettuces certainly were very fine.\n\nPeter did not eat anything; he said he should like to go home. Presently\nhe dropped half the onions.\n\n\n\nLittle Benjamin said that it was not possible to get back up the pear-tree\nwith a load of vegetables. He led the way boldly towards the other end of\nthe garden. They went along a little walk on planks, under a sunny, red\nbrick wall.\n\nThe mice sat on their doorsteps cracking cherry-stones; they winked at\nPeter Rabbit and little Benjamin Bunny.\n\nPresently Peter let the pocket-handkerchief go again.\n\n\n\nThey got amongst flower-pots, and frames, and tubs. Peter heard noises\nworse than ever; his eyes were as big as lolly-pops!\n\nHe was a step or two in front of his cousin when he suddenly stopped.\n\nThis is what those little rabbits saw round that corner!\n\nLittle Benjamin took one look, and then, in half a minute less than no\ntime, he hid himself and Peter and the onions underneath a large\nbasket....\n\n\n\nThe cat got up and stretched herself, and came and sniffed at the basket.\n\nPerhaps she liked the smell of onions!\n\nAnyway, she sat down upon the top of the basket.\n\nShe sat there for _five hours_.\n\n       *       *       *       *       *\n\nI cannot draw you a picture of Peter and Benjamin underneath the basket,\nbecause it was quite dark, and because the smell of onions was fearful; it\nmade Peter Rabbit and little Benjamin cry.\n\nThe sun got round behind the wood, and it was quite late in the afternoon;\nbut still the cat sat upon the basket.\n\n\n\nAt length there was a pitter-patter, pitter-patter, and some bits of\nmortar fell from the wall above.\n\nThe cat looked up and saw old Mr. Benjamin Bunny prancing along the top of\nthe wall of the upper terrace.\n\nHe was smoking a pipe of rabbit-tobacco, and had a little switch in his\nhand.\n\nHe was looking for his son.\n\nOld Mr. Bunny had no opinion whatever of cats.\n\nHe took a tremendous jump off the top of the wall on to the top of the\ncat, and cuffed it off the basket, and kicked it into the greenhouse,\nscratching off a handful of fur.\n\nThe cat was too much surprised to scratch back.\n\n\n\nWhen old Mr. Bunny had driven the cat into the greenhouse, he locked the\ndoor.\n\nThen he came back to the basket and took out his son Benjamin by the ears,\nand whipped him with the little switch.\n\nThen he took out his nephew Peter.\n\nThen he took out the handkerchief of onions, and marched out of the\ngarden.\n\n\nWhen Mr. McGregor returned about half an hour later he observed several\nthings which perplexed him.\n\nIt looked as though some person had been walking all over the garden in a\npair of clogs--only the footmarks were too ridiculously little!\n\nAlso he could not understand how the cat could have managed to shut\nherself up _inside_ the greenhouse, locking the door upon the _outside_.\n\n\n\nWhen Peter got home his mother forgave him, because she was so glad to see\nthat he had found his shoes and coat. Cotton-tail and Peter folded up the\npocket-handkerchief, and old Mrs. Rabbit strung up the onions and hung\nthem from the kitchen ceiling, with the bunches of herbs and the\nrabbit-tobacco.\n\n\n\nTHE END\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}