{
  "content": "The Cuckoo Clock\nMrs. Molesworth\n\n\n[IT WAS A LITTLE BOAT.]\n\n\n\n\n\n\nTO\n\nMARY JOSEPHINE,\n\nAND TO THE DEAR MEMORY OF HER BROTHER,\n\nTHOMAS GRINDAL,\n\nBOTH FRIENDLY LITTLE CRITICS OF\nMY CHILDREN'S STORIES.\n\nEdinburgh, 1877.\n\n\n\nCHAPTER I. THE OLD HOUSE.\n\n\n    \"Somewhat back from the village street\n    Stands the old-fashioned country seat.\"\n\n\nOnce upon a time in an old town, in an old street, there stood a very\nold house. Such a house as you could hardly find nowadays, however you\nsearched, for it belonged to a gone-by time--a time now quite passed\naway.\n\nIt stood in a street, but yet it was not like a town house, for though\nthe front opened right on to the pavement, the back windows looked out\nupon a beautiful, quaintly terraced garden, with old trees growing so\nthick and close together that in summer it was like living on the edge\nof a forest to be near them; and even in winter the web of their\ninterlaced branches hid all clear view behind.\n\nThere was a colony of rooks in this old garden. Year after year they\nheld their parliaments and cawed and chattered and fussed; year after\nyear they built their nests and hatched their eggs; year after year, I\n_suppose_, the old ones gradually died off and the young ones took their\nplace, though, but for knowing this _must_ be so, no one would have\nsuspected it, for to all appearance the rooks were always the same--ever\nand always the same.\n\nTime indeed seemed to stand still in and all about the old house, as if\nit and the people who inhabited it had got _so_ old that they could not\nget any older, and had outlived the possibility of change.\n\nBut one day at last there did come a change. Late in the dusk of an\nautumn afternoon a carriage drove up to the door of the old house, came\nrattling over the stones with a sudden noisy clatter that sounded quite\nimpertinent, startling the rooks just as they were composing themselves\nto rest, and setting them all wondering what could be the matter.\n\nA little girl was the matter! A little girl in a grey merino frock and\ngrey beaver bonnet, grey tippet and grey gloves--all grey together, even\nto her eyes, all except her round rosy face and bright brown hair. Her\nname even was rather grey, for it was Griselda.\n\nA gentleman lifted her out of the carriage and disappeared with her into\nthe house, and later that same evening the gentleman came out of the\nhouse and got into the carriage which had come back for him again, and\ndrove away. That was all that the rooks saw of the change that had come\nto the old house. Shall we go inside to see more?\n\nUp the shallow, wide, old-fashioned staircase, past the wainscoted\nwalls, dark and shining like a mirror, down a long narrow passage with\nmany doors, which but for their gleaming brass handles one would not\nhave known were there, the oldest of the three old servants led little\nGriselda, so tired and sleepy that her supper had been left almost\nuntasted, to the room prepared for her. It was a queer room, for\neverything in the house was queer; but in the dancing light of the fire\nburning brightly in the tiled grate, it looked cheerful enough.\n\n\"I am glad there's a fire,\" said the child. \"Will it keep alight till\nthe morning, do you think?\"\n\nThe old servant shook her head.\n\n\"'Twould not be safe to leave it so that it would burn till morning,\"\nshe said. \"When you are in bed and asleep, little missie, you won't want\nthe fire. Bed's the warmest place.\"\n\n\"It isn't for that I want it,\" said Griselda; \"it's for the light I like\nit. This house all looks so dark to me, and yet there seem to be lights\nhidden in the walls too, they shine so.\"\n\nThe old servant smiled.\n\n\"It will all seem strange to you, no doubt,\" she said; \"but you'll get\nto like it, missie. 'Tis a _good_ old house, and those that know best\nlove it well.\"\n\n\"Whom do you mean?\" said Griselda. \"Do you mean my great-aunts?\"\n\n\"Ah, yes, and others beside,\" replied the old woman. \"The rooks love it\nwell, and others beside. Did you ever hear tell of the 'good people,'\nmissie, over the sea where you come from?\"\n\n\"Fairies, do you mean?\" cried Griselda, her eyes sparkling. \"Of course\nI've _heard_ of them, but I never saw any. Did you ever?\"\n\n\"I couldn't say,\" answered the old woman.\n\n\"My mind is not young like yours, missie, and there are times when\nstrange memories come back to me as of sights and sounds in a dream. I\nam too old to see and hear as I once could. We are all old here, missie.\n'Twas time something young came to the old house again.\"\n\n\"How strange and queer everything seems!\" thought Griselda, as she got\ninto bed. \"I don't feel as if I belonged to it a bit. And they are all\n_so_ old; perhaps they won't like having a child among them?\"\n\nThe very same thought that had occurred to the rooks! They could not\ndecide as to the fors and againsts at all, so they settled to put it to\nthe vote the next morning, and in the meantime they and Griselda all\nwent to sleep.\n\nI never heard if _they_ slept well that night; after such unusual\nexcitement it was hardly to be expected they would. But Griselda, being\na little girl and not a rook, was so tired that two minutes after she\nhad tucked herself up in bed she was quite sound asleep, and did not\nwake for several hours.\n\n\"I wonder what it will all look like in the morning,\" was her last\nwaking thought. \"If it was summer now, or spring, I shouldn't\nmind--there would always be something nice to do then.\"\n\nAs sometimes happens, when she woke again, very early in the morning,\nlong before it was light, her thoughts went straight on with the same\nsubject.\n\n\"If it was summer now, or spring,\" she repeated to herself, just as if\nshe had not been asleep at all--like the man who fell into a trance for\na hundred years just as he was saying \"it is bitt--\" and when he woke up\nagain finished the sentence as if nothing had happened--\"erly cold.\" \"If\nonly it was spring,\" thought Griselda.\n\nJust as she had got so far in her thoughts, she gave a great start. What\nwas it she heard? Could her wish have come true? Was this fairyland\nindeed that she had got to, where one only needs to _wish_, for it to\n_be_? She rubbed her eyes, but it was too dark to see; _that_ was not\nvery fairyland-like, but her ears she felt certain had not deceived her:\nshe was quite, quite sure that she had heard the cuckoo!\n\nShe listened with all her might, but she did not hear it again. Could\nit, after all, have been fancy? She grew sleepy at last, and was just\ndropping off when--yes, there it was again, as clear and distinct as\npossible--\"Cuckoo, cuckoo, cuckoo!\" three, four, _five_ times, then\nperfect silence as before.\n\n\"What a funny cuckoo,\" said Griselda to herself. \"I could almost fancy\nit was in the house. I wonder if my great-aunts have a tame cuckoo in a\ncage? I don't _think_ I ever heard of such a thing, but this is such a\nqueer house; everything seems different in it--perhaps they have a tame\ncuckoo. I'll ask them in the morning. It's very nice to hear, whatever\nit is.\"\n\nAnd, with a pleasant feeling of companionship, a sense that she was not\nthe only living creature awake in this dark world, Griselda lay\nlistening, contentedly enough, for the sweet, fresh notes of the\ncuckoo's friendly greeting. But before it sounded again through the\nsilent house she was once more fast asleep. And this time she slept till\ndaylight had found its way into all but the _very_ darkest nooks and\ncrannies of the ancient dwelling.\n\nShe dressed herself carefully, for she had been warned that her aunts\nloved neatness and precision; she fastened each button of her grey\nfrock, and tied down her hair as smooth as such a brown tangle _could_\nbe tied down; and, absorbed with these weighty cares, she forgot all\nabout the cuckoo for the time. It was not till she was sitting at\nbreakfast with her aunts that she remembered it, or rather was reminded\nof it, by some little remark that was made about the friendly robins on\nthe terrace walk outside.\n\n\"Oh, aunt,\" she exclaimed, stopping short half-way the journey to her\nmouth of a spoonful of bread and milk, \"have you got a cuckoo in a\ncage?\"\n\n\"A cuckoo in a cage,\" repeated her elder aunt, Miss Grizzel; \"what is\nthe child talking about?\"\n\n\"In a cage!\" echoed Miss Tabitha, \"a cuckoo in a cage!\"\n\n\"There is a cuckoo somewhere in the house,\" said Griselda; \"I heard it\nin the night. It couldn't have been out-of-doors, could it? It would be\ntoo cold.\"\n\nThe aunts looked at each other with a little smile. \"So like her\ngrandmother,\" they whispered. Then said Miss Grizzel--\n\n\"We have a cuckoo, my dear, though it isn't in a cage, and it isn't\nexactly the sort of cuckoo you are thinking of. It lives in a clock.\"\n\n\"In a clock,\" repeated Miss Tabitha, as if to confirm her sister's\nstatement.\n\n\"In a clock!\" exclaimed Griselda, opening her grey eyes very wide.\n\nIt sounded something like the three bears, all speaking one after the\nother, only Griselda's voice was not like Tiny's; it was the loudest of\nthe three.\n\n\"In a clock!\" she exclaimed; \"but it can't be alive, then?\"\n\n\"Why not?\" said Miss Grizzel.\n\n\"I don't know,\" replied Griselda, looking puzzled.\n\n\"I knew a little girl once,\" pursued Miss Grizzel, \"who was quite of\nopinion the cuckoo _was_ alive, and nothing would have persuaded her it\nwas not. Finish your breakfast, my dear, and then if you like you shall\ncome with me and see the cuckoo for yourself.\"\n\n\"Thank you, Aunt Grizzel,\" said Griselda, going on with her bread and\nmilk.\n\n\"Yes,\" said Miss Tabitha, \"you shall see the cuckoo for yourself.\"\n\n\"Thank you, Aunt Tabitha,\" said Griselda. It was rather a bother to have\nalways to say \"thank you,\" or \"no, thank you,\" twice, but Griselda\nthought it was polite to do so, as Aunt Tabitha always repeated\neverything that Aunt Grizzel said. It wouldn't have mattered so much if\nAunt Tabitha had said it _at once_ after Miss Grizzel, but as she\ngenerally made a little pause between, it was sometimes rather awkward.\nBut of course it was better to say \"thank you\" or \"no, thank you\" twice\nover than to hurt Aunt Tabitha's feelings.\n\nAfter breakfast Aunt Grizzel was as good as her word. She took Griselda\nthrough several of the rooms in the house, pointing out all the\ncuriosities, and telling all the histories of the rooms and their\ncontents; and Griselda liked to listen, only in every room they came\nto, she wondered _when_ they would get to the room where lived the\ncuckoo.\n\nAunt Tabitha did not come with them, for she was rather rheumatic. On\nthe whole, Griselda was not sorry. It would have taken such a _very_\nlong time, you see, to have had all the histories twice over, and\npossibly, if Griselda had got tired, she might have forgotten about the\n\"thank you's\" or \"no, thank you's\" twice over.\n\nThe old house looked quite as queer and quaint by daylight as it had\nseemed the evening before; almost more so indeed, for the view from the\nwindows added to the sweet, odd \"old-fashionedness\" of everything.\n\n\"We have beautiful roses in summer,\" observed Miss Grizzel, catching\nsight of the direction in which the child's eyes were wandering.\n\n\"I wish it was summer. I do love summer,\" said Griselda. \"But there is a\nvery rosy scent in the rooms even now, Aunt Grizzel, though it is\nwinter, or nearly winter.\"\n\nMiss Grizzel looked pleased.\n\n\"My pot-pourri,\" she explained.\n\nThey were just then standing in what she called the \"great saloon,\" a\nhandsome old room, furnished with gold-and-white chairs, that must once\nhave been brilliant, and faded yellow damask hangings. A feeling of awe\nhad crept over Griselda as they entered this ancient drawing-room. What\ngrand parties there must have been in it long ago! But as for dancing in\nit _now_--dancing, or laughing, or chattering--such a thing was quite\nimpossible to imagine!\n\nMiss Grizzel crossed the room to where stood in one corner a marvellous\nChinese cabinet, all black and gold and carving. It was made in the\nshape of a temple, or a palace--Griselda was not sure which. Any way, it\nwas very delicious and wonderful. At the door stood, one on each side,\ntwo solemn mandarins; or, to speak more correctly, perhaps I should\nsay, a mandarin and his wife, for the right-hand figure was evidently\nintended to be a lady.\n\nMiss Grizzel gently touched their heads. Forthwith, to Griselda's\nastonishment, they began solemnly to nod.\n\n\"Oh, how do you make them do that, Aunt Grizzel?\" she exclaimed.\n\n\"Never you mind, my dear; it wouldn't do for _you_ to try to make them\nnod. They wouldn't like it,\" replied Miss Grizzel mysteriously. \"Respect\nto your elders, my dear, always remember that. The mandarins are _many_\nyears older than you--older than I myself, in fact.\"\n\nGriselda wondered, if this were so, how it was that Miss Grizzel took\nsuch liberties with them herself, but she said nothing.\n\n\"Here is my last summer's pot-pourri,\" continued Miss Grizzel, touching\na great china jar on a little stand, close beside the cabinet. \"You may\nsmell it, my dear.\"\n\nNothing loth, Griselda buried her round little nose in the fragrant\nleaves.\n\n\"It's lovely,\" she said. \"May I smell it whenever I like, Aunt Grizzel?\"\n\n\"We shall see,\" replied her aunt. \"It isn't _every_ little girl, you\nknow, that we could trust to come into the great saloon alone.\"\n\n\"No,\" said Griselda meekly.\n\nMiss Grizzel led the way to a door opposite to that by which they had\nentered. She opened it and passed through, Griselda following, into a\nsmall ante-room.\n\n\"It is on the stroke of ten,\" said Miss Grizzel, consulting her watch;\n\"now, my dear, you shall make acquaintance with our cuckoo.\"\n\nThe cuckoo \"that lived in a clock!\" Griselda gazed round her eagerly.\nWhere was the clock? She could see nothing in the least like one, only\nup on the wall in one corner was what looked like a miniature house, of\ndark brown carved wood. It was not so _very_ like a house, but it\ncertainly had a roof--a roof with deep projecting eaves; and, looking\ncloser, yes, it _was_ a clock, after all, only the figures, which had\nonce been gilt, had grown dim with age, like everything else, and the\nhands at a little distance were hardly to be distinguished from the\nface.\n\nMiss Grizzel stood perfectly still, looking up at the clock; Griselda\nbeside her, in breathless expectation. Presently there came a sort of\ndistant rumbling. _Something_ was going to happen. Suddenly two little\ndoors above the clock face, which Griselda had not known were there,\nsprang open with a burst and out flew a cuckoo, flapped his wings, and\nuttered his pretty cry, \"Cuckoo! cuckoo! cuckoo!\" Miss Grizzel counted\naloud, \"Seven, eight, nine, ten.\" \"Yes, he never makes a mistake,\" she\nadded triumphantly. \"All these long years I have never known him wrong.\nThere are no such clocks made nowadays, I can assure you, my dear.\"\n\n\"But _is_ it a clock? Isn't he alive?\" exclaimed Griselda. \"He looked at\nme and nodded his head, before he flapped his wings and went in to his\nhouse again--he did indeed, aunt,\" she said earnestly; \"just like\nsaying, 'How do you do?' to me.\"\n\nAgain Miss Grizzel smiled, the same odd yet pleased smile that Griselda\nhad seen on her face at breakfast. \"Just what Sybilla used to say,\" she\nmurmured. \"Well, my dear,\" she added aloud, \"it is quite right he\n_should_ say, 'How do you do?' to you. It is the first time he has seen\n_you_, though many a year ago he knew your dear grandmother, and your\nfather, too, when he was a little boy. You will find him a good friend,\nand one that can teach you many lessons.\"\n\n\"What, Aunt Grizzel?\" inquired Griselda, looking puzzled.\n\n\"Punctuality, for one thing, and faithful discharge of duty,\" replied\nMiss Grizzel.\n\n\"May I come to see the cuckoo--to watch for him coming out, sometimes?\"\nasked Griselda, who felt as if she could spend all day looking up at the\nclock, watching for her little friend's appearance.\n\n\"You will see him several times a day,\" said her aunt, \"for it is in\nthis little room I intend you to prepare your tasks. It is nice and\nquiet, and nothing to disturb you, and close to the room where your Aunt\nTabitha and I usually sit.\"\n\nSo saying, Miss Grizzel opened a second door in the little ante-room,\nand, to Griselda's surprise, at the foot of a short flight of stairs\nthrough another door, half open, she caught sight of her Aunt Tabitha,\nknitting quietly by the fire, in the room in which they had breakfasted.\n\n\"What a _very_ funny house it is, Aunt Grizzel,\" she said, as she\nfollowed her aunt down the steps. \"Every room has so many doors, and you\ncome back to where you were just when you think you are ever so far\noff. I shall never be able to find my way about.\"\n\n\"Oh yes, you will, my dear, very soon,\" said her aunt encouragingly.\n\n\"She is very kind,\" thought Griselda; \"but I wish she wouldn't call my\nlessons tasks. It makes them sound so dreadfully hard. But, any way, I'm\nglad I'm to do them in the room where that dear cuckoo lives.\"\n\n\n\n\nCHAPTER II. _IM_PATIENT GRISELDA.\n\n\n      \"... fairies but seldom appear;\n    If we do wrong we must expect\n      That it will cost us dear!\"\n\n\nIt was all very well for a few days. Griselda found plenty to amuse\nherself with while the novelty lasted, enough to prevent her missing\n_very_ badly the home she had left \"over the sea,\" and the troop of\nnoisy merry brothers who teased and petted her. Of course she _missed_\nthem, but not \"dreadfully.\" She was neither homesick nor \"dull.\"\n\nIt was not quite such smooth sailing when lessons began. She did not\ndislike lessons; in fact, she had always thought she was rather fond of\nthem. But the having to do them alone was not lively, and her teachers\nwere very strict. The worst of all was the writing and arithmetic\nmaster, a funny little old man who wore knee-breeches and took snuff,\nand called her aunt \"Madame,\" bowing formally whenever he addressed her.\nHe screwed Griselda up into such an unnatural attitude to write her\ncopies, that she really felt as if she would never come straight and\nloose again; and the arithmetic part of his instructions was even worse.\nOh! what sums in addition he gave her! Griselda had never been partial\nto sums, and her rather easy-going governess at home had not, to tell\nthe truth, been partial to them either. And Mr.--I can't remember the\nlittle old gentleman's name. Suppose we call him Mr. Kneebreeches--Mr.\nKneebreeches, when he found this out, conscientiously put her back to\nthe very beginning.\n\nIt was dreadful, really. He came twice a week, and the days he didn't\ncome were as bad as those he did, for he left her a whole _row_ I was\ngoing to say, but you couldn't call Mr. Kneebreeches' addition sums\n\"rows,\" they were far too fat and wide across to be so spoken of!--whole\nslatefuls of these terrible mountains of figures to climb wearily to the\ntop of. And not to climb _once_ up merely. _The_ terrible thing was Mr.\nKneebreeches' favourite method of what he called \"proving.\" I can't\nexplain it--it is far beyond my poor powers--but it had something to do\nwith cutting off the top line, after you had added it all up and had\nactually done the sum, you understand--cutting off the top line and\nadding the long rows up again without it, and then joining it on again\nsomewhere else.\n\n\"I wouldn't mind so much,\" said poor Griselda, one day, \"if it was any\ngood. But you see, Aunt Grizzel, it isn't. For I'm just as likely to do\nthe _proving_ wrong as the sum itself--more likely, for I'm always so\ntired when I get to the proving--and so all that's proved is that\n_something's_ wrong, and I'm sure that isn't any good, except to make me\ncross.\"\n\n\"Hush!\" said her aunt gravely. \"That is not the way for a little girl to\nspeak. Improve these golden hours of youth, Griselda; they will never\nreturn.\"\n\n\"I hope not,\" muttered Griselda, \"if it means doing sums.\"\n\nMiss Grizzel fortunately was a little deaf; she did not hear this\nremark. Just then the cuckoo clock struck eleven.\n\n\"Good little cuckoo,\" said Miss Grizzel. \"What an example he sets you.\nHis life is spent in the faithful discharge of duty;\" and so saying she\nleft the room.\n\nThe cuckoo was still telling the hour--eleven took a good while. It\nseemed to Griselda that the bird repeated her aunt's last words.\n\"Faith--ful, dis--charge, of--your, du--ty,\" he said, \"faith--ful.\"\n\n\"You horrid little creature!\" exclaimed Griselda in a passion; \"what\nbusiness have you to mock me?\"\n\nShe seized a book, the first that came to hand, and flung it at the bird\nwho was just beginning his eleventh cuckoo. He disappeared with a snap,\ndisappeared without flapping his wings, or, as Griselda always fancied\nhe did, giving her a friendly nod, and in an instant all was silent.\n\nGriselda felt a little frightened. What had she done? She looked up at\nthe clock. It seemed just the same as usual, the cuckoo's doors closely\nshut, no sign of any disturbance. Could it have been her fancy only that\nhe had sprung back more hastily than he would have done but for her\nthrowing the book at him? She began to hope so, and tried to go on with\nher lessons. But it was no use. Though she really gave her best\nattention to the long addition sums, and found that by so doing she\nmanaged them much better than before, she could not feel happy or at\nease. Every few minutes she glanced up at the clock, as if expecting the\ncuckoo to come out, though she knew quite well there was no chance of\nhis doing so till twelve o'clock, as it was only the hours, not the half\nhours and quarters, that he told.\n\n\"I wish it was twelve o'clock,\" she said to herself anxiously more than\nonce.\n\nIf only the clock had not been so very high up on the wall, she would\nhave been tempted to climb up and open the little doors, and peep in to\nsatisfy herself as to the cuckoo's condition. But there was no\npossibility of this. The clock was far, very far above her reach, and\nthere was no high piece of furniture standing near, upon which she could\nhave climbed to get to it. There was nothing to be done but to wait for\ntwelve o'clock.\n\nAnd, after all, she did not wait for twelve o'clock, for just about\nhalf-past eleven, Miss Grizzel's voice was heard calling to her to put\non her hat and cloak quickly, and come out to walk up and down the\nterrace with her.\n\n\"It is fine just now,\" said Miss Grizzel, \"but there is a prospect of\nrain before long. You must leave your lessons for the present, and\nfinish them in the afternoon.\"\n\n\"I have finished them,\" said Griselda, meekly.\n\n\"_All_?\" inquired her aunt.\n\n\"Yes, all,\" replied Griselda.\n\n\"Ah, well, then, this afternoon, if the rain holds off, we shall drive\nto Merrybrow Hall, and inquire for the health of your dear godmother,\nLady Lavander,\" said Miss Grizzel.\n\nPoor Griselda! There were few things she disliked more than a drive with\nher aunts. They went in the old yellow chariot, with all the windows up,\nand of course Griselda had to sit with her back to the horses, which\nmade her very uncomfortable when she had no air, and had to sit still\nfor so long.\n\nMerrybrow Hall was a large house, quite as old and much grander, but not\nnearly so wonderful as the home of Griselda's aunts. It was six miles\noff, and it took a very long time indeed to drive there in the rumbling\nold chariot, for the old horses were fat and wheezy, and the old\ncoachman fat and wheezy too. Lady Lavander was, of course, old too--very\nold indeed, and rather grumpy and very deaf. Miss Grizzel and Miss\nTabitha had the greatest respect for her; she always called them \"My\ndear,\" as if they were quite girls, and they listened to all she said as\nif her words were of gold. For some mysterious reason she had been\ninvited to be Griselda's godmother; but, as she had never shown her any\nproof of affection beyond giving her a prayer-book, and hoping, whenever\nshe saw her, that she was \"a good little miss,\" Griselda did not feel\nany particular cause for gratitude to her.\n\nThe drive seemed longer and duller than ever this afternoon, but\nGriselda bore it meekly; and when Lady Lavander, as usual, expressed her\nhopes about her, the little girl looked down modestly, feeling her\ncheeks grow scarlet. \"I am not a good little girl at all,\" she felt\ninclined to call out. \"I'm very bad and cruel. I believe I've killed the\ndear little cuckoo.\"\n\nWhat _would_ the three old ladies have thought if she had called it out?\nAs it was, Lady Lavander patted her approvingly, said she loved to see\nyoung people modest and humble-minded, and gave her a slice of very\nhighly-spiced, rather musty gingerbread, which Griselda couldn't bear.\n\nAll the way home Griselda felt in a fever of impatience to rush up to\nthe ante-room and see if the cuckoo was all right again. It was late and\ndark when the chariot at last stopped at the door of the old house. Miss\nGrizzel got out slowly, and still more slowly Miss Tabitha followed\nher. Griselda was obliged to restrain herself and move demurely.\n\n\"It is past your supper-time, my dear,\" said Miss Grizzel. \"Go up at\nonce to your room, and Dorcas shall bring some supper to you. Late hours\nare bad for young people.\"\n\nGriselda obediently wished her aunts good-night, and went quietly\nupstairs. But once out of sight, at the first landing, she changed her\npace. She turned to the left instead of to the right, which led to her\nown room, and flew rather than ran along the dimly-lighted passage, at\nthe end of which a door led into the great saloon. She opened the door.\nAll was quite dark. It was impossible to fly or run across the great\nsaloon! Even in daylight this would have been a difficult matter.\nGriselda _felt_ her way as best she could, past the Chinese cabinet and\nthe pot-pourri jar, till she got to the ante-room door. It was open, and\nnow, knowing her way better, she hurried in. But what was the use? All\nwas silent, save the tick-tick of the cuckoo clock in the corner. Oh, if\n_only_ the cuckoo would come out and call the hour as usual, what a\nweight would be lifted off Griselda's heart!\n\nShe had no idea what o'clock it was. It might be close to the hour, or\nit might be just past it. She stood listening for a few minutes, then\nhearing Miss Grizzel's voice in the distance, she felt that she dared\nnot stay any longer, and turned to feel her way out of the room again.\nJust as she got to the door it seemed to her that something softly\nbrushed her cheek, and a very, very faint \"cuckoo\" sounded as it were in\nthe air close to her.\n\nStartled, but not frightened, Griselda stood perfectly still.\n\n\"Cuckoo,\" she said, softly. But there was no answer.\n\nAgain the tones of Miss Grizzel's voice coming upstairs reached her\near.\n\n\"I _must_ go,\" said Griselda; and finding her way across the saloon\nwithout, by great good luck, tumbling against any of the many breakable\ntreasures with which it was filled, she flew down the long passage\nagain, reaching her own room just before Dorcas appeared with her\nsupper.\n\nGriselda slept badly that night. She was constantly dreaming of the\ncuckoo, fancying she heard his voice, and then waking with a start to\nfind it was _only_ fancy. She looked pale and heavy-eyed when she came\ndown to breakfast the next morning; and her Aunt Tabitha, who was alone\nin the room when she entered, began immediately asking her what was the\nmatter.\n\n\"I am sure you are going to be ill, child,\" she said, nervously. \"Sister\nGrizzel must give you some medicine. I wonder what would be the best.\nTansy tea is an excellent thing when one has taken cold, or----\"\n\nBut the rest of Miss Tabitha's sentence was never heard, for at this\nmoment Miss Grizzel came hurriedly into the room--her cap awry, her\nshawl disarranged, her face very pale. I hardly think any one had ever\nseen her so discomposed before.\n\n\"Sister Tabitha!\" she exclaimed, \"what can be going to happen? The\ncuckoo clock has stopped.\"\n\n\"The cuckoo clock has stopped!\" repeated Miss Tabitha, holding up her\nhands; \"_im_possible!\"\n\n\"But it has, or rather I should say--dear me, I am so upset I cannot\nexplain myself--the _cuckoo_ has stopped. The clock is going on, but the\ncuckoo has not told the hours, and Dorcas is of opinion that he left off\ndoing so yesterday. What can be going to happen? What shall we do?\"\n\n\"What can we do?\" said Miss Tabitha. \"Should we send for the\nwatch-maker?\"\n\nMiss Grizzel shook her head.\n\n\"'Twould be worse than useless. Were we to search the world over, we\ncould find no one to put it right. Fifty years and more, Tabitha, fifty\nyears and more, it has never missed an hour! We are getting old,\nTabitha, our day is nearly over; perhaps 'tis to remind us of this.\"\n\nMiss Tabitha did not reply. She was weeping silently. The old ladies\nseemed to have forgotten the presence of their niece, but Griselda could\nnot bear to see their distress. She finished her breakfast as quickly as\nshe could, and left the room.\n\nOn her way upstairs she met Dorcas.\n\n\"Have you heard what has happened, little missie?\" said the old servant.\n\n\"Yes,\" replied Griselda.\n\n\"My ladies are in great trouble,\" continued Dorcas, who seemed inclined\nto be more communicative than usual, \"and no wonder. For fifty years\nthat clock has never gone wrong.\"\n\n\"Can't it be put right?\" asked the child.\n\nDorcas shook her head.\n\n\"No good would come of interfering,\" she said. \"What must be, must be.\nThe luck of the house hangs on that clock. Its maker spent a good part\nof his life over it, and his last words were that it would bring good\nluck to the house that owned it, but that trouble would follow its\nsilence. It's my belief,\" she added solemnly, \"that it's a _fairy_\nclock, neither more nor less, for good luck it has brought there's no\ndenying. There are no cows like ours, missie--their milk is a proverb\nhereabouts; there are no hens like ours for laying all the year round;\nthere are no roses like ours. And there's always a friendly feeling in\nthis house, and always has been. 'Tis not a house for wrangling and\njangling, and sharp words. The 'good people' can't stand that. Nothing\ndrives them away like ill-temper or anger.\"\n\nGriselda's conscience gave her a sharp prick. Could it be _her_ doing\nthat trouble was coming upon the old house? What a punishment for a\nmoment's fit of ill-temper.\n\n\"I wish you wouldn't talk that way, Dorcas,\" she said; \"it makes me so\nunhappy.\"\n\n\"What a feeling heart the child has!\" said the old servant as she went\non her way downstairs. \"It's true--she is very like Miss Sybilla.\"\n\nThat day was a very weary and sad one for Griselda. She was oppressed by\na feeling she did not understand. She knew she had done wrong, but she\nhad sorely repented it, and \"I do think the cuckoo might have come back\nagain,\" she said to herself, \"if he is a fairy; and if he isn't, it\ncan't be true what Dorcas says.\"\n\nHer aunts made no allusion to the subject in her presence, and almost\nseemed to have forgotten that she had known of their distress. They were\nmore grave and silent than usual, but otherwise things went on in their\nordinary way. Griselda spent the morning \"at her tasks,\" in the\nante-room, but was thankful to get away from the tick-tick of the clock\nin the corner and out into the garden.\n\nBut there, alas! it was just as bad. The rooks seemed to know that\nsomething was the matter; they set to work making such a chatter\nimmediately Griselda appeared that she felt inclined to run back into\nthe house again.\n\n\"I am sure they are talking about me,\" she said to herself. \"Perhaps\nthey are fairies too. I am beginning to think I don't like fairies.\"\n\nShe was glad when bed-time came. It was a sort of reproach to her to see\nher aunts so pale and troubled; and though she tried to persuade herself\nthat she thought them very silly, she could not throw off the\nuncomfortable feeling.\n\nShe was so tired when she went to bed--tired in the disagreeable way\nthat comes from a listless, uneasy day--that she fell asleep at once and\nslept heavily. When she woke, which she did suddenly, and with a start,\nit was still perfectly dark, like the first morning that she had wakened\nin the old house. It seemed to her that she had not wakened of\nherself--something had roused her. Yes! there it was again, a very,\n_very_ soft distant \"cuckoo.\" _Was_ it distant? She could not tell.\nAlmost she could have fancied it was close to her.\n\n\"If it's that cuckoo come back again, I'll catch him!\" exclaimed\nGriselda.\n\nShe darted out of bed, felt her way to the door, which was closed, and\nopening it let in a rush of moonlight from the unshuttered passage\nwindow. In another moment her little bare feet were pattering along the\npassage at full speed, in the direction of the great saloon.\n\nFor Griselda's childhood among the troop of noisy brothers had taught\nher one lesson--she was afraid of nothing. Or rather perhaps I should\nsay she had never learnt that there was anything to be afraid of! And is\nthere?\n\n\n\n\nCHAPTER III. OBEYING ORDERS.\n\n\n    \"Little girl, thou must thy part fulfil,\n      If we're to take kindly to ours:\n    Then pull up the weeds with a will,\n      And fairies will cherish the flowers.\"\n\n\nThere was moonlight, though not so much, in the saloon and the\nante-room, too; for though the windows, like those in Griselda's\nbed-room, had the shutters closed, there was a round part at the top,\nhigh up, which the shutters did not reach to, and in crept, through\nthese clear uncovered panes, quite as many moonbeams, you may be sure,\nas could find their way.\n\nGriselda, eager though she was, could not help standing still a moment\nto admire the effect.\n\n\"It looks prettier with the light coming in at those holes at the top\nthan even if the shutters were open,\" she said to herself. \"How\ngoldy-silvery the cabinet looks; and, yes, I do declare, the mandarins\nare nodding! I wonder if it is out of politeness to me, or does Aunt\nGrizzel come in last thing at night and touch them to make them keep\nnodding till morning? I _suppose_ they're a sort of policemen to the\npalace; and I dare say there are all sorts of beautiful things inside.\nHow I should like to see all through it!\"\n\nBut at this moment the faint tick-tick of the cuckoo clock in the next\nroom, reaching her ear, reminded her of the object of this midnight\nexpedition of hers. She hurried into the ante-room.\n\nIt looked darker than the great saloon, for it had but one window. But\nthrough the uncovered space at the top of this window there penetrated\nsome brilliant moonbeams, one of which lighted up brightly the face of\nthe clock with its queer over-hanging eaves.\n\n[\"WHY WON'T YOU SPEAK TO ME?\"]\n\nGriselda approached it and stood below, looking up.\n\n\"Cuckoo,\" she said softly--very softly.\n\nBut there was no reply.\n\n\"Cuckoo,\" she repeated rather more loudly. \"Why won't you speak to me? I\nknow you are there, and you're not asleep, for I heard your voice in my\nown room. Why won't you come out, cuckoo?\"\n\n\"Tick-tick\" said the clock, but there was no other reply.\n\nGriselda felt ready to cry.\n\n\"Cuckoo,\" she said reproachfully, \"I didn't think you were so\nhard-hearted. I have been _so_ unhappy about you, and I was so pleased\nto hear your voice again, for I thought I had killed you, or hurt you\nvery badly; and I didn't _mean_ to hurt you, cuckoo. I was sorry the\nmoment I had done it, _dreadfully_ sorry. Dear cuckoo, won't you\nforgive me?\"\n\nThere was a little sound at last--a faint _coming_ sound, and by the\nmoonlight Griselda saw the doors open, and out flew the cuckoo. He stood\nstill for a moment, looked round him as it were, then gently flapped his\nwings, and uttered his usual note--\"Cuckoo.\"\n\nGriselda stood in breathless expectation, but in her delight she could\nnot help very softly clapping her hands.\n\nThe cuckoo cleared his throat. You never heard such a funny little noise\nas he made; and then, in a very clear, distinct, but yet \"cuckoo-y\"\nvoice, he spoke.\n\n\"Griselda,\" he said, \"are you truly sorry?\"\n\n\"I told you I was,\" she replied. \"But I didn't _feel_ so very naughty,\ncuckoo. I didn't, really. I was only vexed for one minute, and when I\nthrew the book I seemed to be a very little in fun, too. And it made me\nso unhappy when you went away, and my poor aunts have been dreadfully\nunhappy too. If you hadn't come back I should have told them to-morrow\nwhat I had done. I would have told them before, but I was afraid it\nwould have made them more unhappy. I thought I had hurt you dreadfully.\"\n\n\"So you did,\" said the cuckoo.\n\n\"But you _look_ quite well,\" said Griselda.\n\n\"It was _my feelings_,\" replied the cuckoo; \"and I couldn't help going\naway. I have to obey orders like other people.\"\n\nGriselda stared. \"How do you mean?\" she asked.\n\n\"Never mind. You can't understand at present,\" said the cuckoo. \"You can\nunderstand about obeying _your_ orders, and you see, when you don't,\nthings go wrong.\"\n\n\"Yes,\" said Griselda humbly, \"they certainly do. But, cuckoo,\" she\ncontinued, \"I never used to get into tempers at home--_hardly_ never,\nat least; and I liked my lessons then, and I never was scolded about\nthem.\"\n\n\"What's wrong here, then?\" said the cuckoo. \"It isn't often that things\ngo wrong in this house.\"\n\n\"That's what Dorcas says,\" said Griselda. \"It must be with my being a\nchild--my aunts and the house and everything have got out of children's\nways.\"\n\n\"About time they did,\" remarked the cuckoo drily.\n\n\"And so,\" continued Griselda, \"it is really very dull. I have lots of\nlessons, but it isn't so much that I mind. It is that I've no one to\nplay with.\"\n\n\"There's something in that,\" said the cuckoo. He flapped his wings and\nwas silent for a minute or two. \"I'll consider about it,\" he observed at\nlast.\n\n\"Thank you,\" said Griselda, not exactly knowing what else to say.\n\n\"And in the meantime,\" continued the cuckoo, \"you'd better obey present\norders and go back to bed.\"\n\n\"Shall I say good-night to you, then?\" asked Griselda somewhat timidly.\n\n\"You're quite welcome to do so,\" replied the cuckoo. \"Why shouldn't\nyou?\"\n\n\"You see I wasn't sure if you would like it,\" returned Griselda, \"for of\ncourse you're not like a person, and--and--I've been told all sorts of\nqueer things about what fairies like and don't like.\"\n\n\"Who said I was a fairy?\" inquired the cuckoo.\n\n\"Dorcas did, and, _of course_, my own common sense did too,\" replied\nGriselda. \"You must be a fairy--you couldn't be anything else.\"\n\n\"I might be a fairyfied cuckoo,\" suggested the bird.\n\nGriselda looked puzzled.\n\n\"I don't understand,\" she said, \"and I don't think it could make much\ndifference. But whatever you are, I wish you would tell me one thing.\"\n\n\"What?\" said the cuckoo.\n\n\"I want to know, now that you've forgiven me for throwing the book at\nyou, have you come back for good?\"\n\n\"Certainly not for evil,\" replied the cuckoo.\n\nGriselda gave a little wriggle. \"Cuckoo, you're laughing at me,\" she\nsaid. \"I mean, have you come back to stay and cuckoo as usual and make\nmy aunts happy again?\"\n\n\"You'll see in the morning,\" said the cuckoo. \"Now go off to bed.\"\n\n\"Good night,\" said Griselda, \"and thank you, and please don't forget to\nlet me know when you've considered.\"\n\n\"Cuckoo, cuckoo,\" was her little friend's reply. Griselda thought it was\nmeant for good night, but the fact of the matter was that at that exact\nsecond of time it was two o'clock in the morning.\n\nShe made her way back to bed. She had been standing some time talking to\nthe cuckoo, but, though it was now well on in November, she did not feel\nthe least cold, nor sleepy! She felt as happy and light-hearted as\npossible, and she wished it was morning, that she might get up. Yet the\nmoment she laid her little brown curly head on the pillow, she fell\nasleep; and it seemed to her that just as she dropped off a soft\nfeathery wing brushed her cheek gently and a tiny \"Cuckoo\" sounded in\nher ear.\n\nWhen she woke it was bright morning, really bright morning, for the\nwintry sun was already sending some clear yellow rays out into the pale\ngrey-blue sky.\n\n\"It must be late,\" thought Griselda, when she had opened the shutters\nand seen how light it was. \"I must have slept a long time. I feel so\nbeautifully unsleepy now. I must dress quickly--how nice it will be to\nsee my aunts look happy again! I don't even care if they scold me for\nbeing late.\"\n\nBut, after all, it was not so much later than usual; it was only a much\nbrighter morning than they had had for some time. Griselda did dress\nherself very quickly, however. As she went downstairs two or three of\nthe clocks in the house, for there were several, were striking eight.\nThese clocks must have been a little before the right time, for it was\nnot till they had again relapsed into silence that there rang out from\nthe ante-room the clear sweet tones, eight times repeated, of \"Cuckoo.\"\n\nMiss Grizzel and Miss Tabitha were already at the breakfast-table, but\nthey received their little niece most graciously. Nothing was said about\nthe clock, however, till about half-way through the meal, when Griselda,\nfull of eagerness to know if her aunts were aware of the cuckoo's\nreturn, could restrain herself no longer.\n\n\"Aunt Grizzel,\" she said, \"isn't the cuckoo all right again?\"\n\n\"Yes, my dear. I am delighted to say it is,\" replied Miss Grizzel.\n\n\"Did you get it put right, Aunt Grizzel?\" inquired Griselda, slyly.\n\n\"Little girls should not ask so many questions,\" replied Miss Grizzel,\nmysteriously. \"It _is_ all right again, and that is enough. During fifty\nyears that cuckoo has never, till yesterday, missed an hour. If you, in\nyour sphere, my dear, do as well during fifty years, you won't have done\nbadly.\"\n\n\"No, indeed, you won't have done badly,\" repeated Miss Tabitha.\n\nBut though the two old ladies thus tried to improve the occasion by a\nlittle lecturing, Griselda could see that at the bottom of their hearts\nthey were both so happy that, even if she had been very naughty indeed,\nthey could hardly have made up their minds to scold her.\n\nShe was not at all inclined to be naughty this day. She had something\nto think about and look forward to, which made her quite a different\nlittle girl, and made her take heart in doing her lessons as well as she\npossibly could.\n\n\"I wonder when the cuckoo will have considered enough about my having no\none to play with?\" she said to herself, as she was walking up and down\nthe terrace at the back of the house.\n\n\"Caw, caw!\" screamed a rook just over her head, as if in answer to her\nthought.\n\nGriselda looked up at him.\n\n\"Your voice isn't half so pretty as the cuckoo's, Mr. Rook,\" she said.\n\"All the same, I dare say I should make friends with you, if I\nunderstood what you meant. How funny it would be to know all the\nlanguages of the birds and the beasts, like the prince in the fairy\ntale! I wonder if I should wish for that, if a fairy gave me a wish? No,\nI don't think I would. I'd _far_ rather have the fairy carpet that would\ntake you anywhere you liked in a minute. I'd go to China to see if all\nthe people there look like Aunt Grizzel's mandarins; and I'd first of\nall, of course, go to fairyland.\"\n\n\"You must come in now, little missie,\" said Dorcas's voice. \"Miss Grizzel\nsays you have had play enough, and there's a nice fire in the ante-room\nfor you to do your lessons by.\"\n\n\"Play!\" repeated Griselda indignantly, as she turned to follow the old\nservant. \"Do you call walking up and down the terrace 'play,' Dorcas? I\nmustn't loiter even to pick a flower, if there were any, for fear of\ncatching cold, and I mustn't run for fear of overheating myself. I\ndeclare, Dorcas, if I don't have some play soon, or something to amuse\nme, I think I'll run away.\"\n\n\"Nay, nay, missie, don't talk like that. You'd never do anything so\nnaughty, and you so like Miss Sybilla, who was so good.\"\n\n\"Dorcas, I'm tired of being told I'm like Miss Sybilla,\" said Griselda,\nimpatiently. \"She was my grandmother; no one would like to be told they\nwere like their grandmother. It makes me feel as if my face must be all\nscrewy up and wrinkly, and as if I should have spectacles on and a wig.\"\n\n\"_That_ is not like what Miss Sybilla was when I first saw her,\" said\nDorcas. \"She was younger than you, missie, and as pretty as a fairy.\"\n\n\"_Was_ she?\" exclaimed Griselda, stopping short.\n\n\"Yes, indeed she was. She might have been a fairy, so sweet she was and\ngentle--and yet so merry. Every creature loved her; even the animals\nabout seemed to know her, as if she was one of themselves. She brought\ngood luck to the house, and it was a sad day when she left it.\"\n\n\"I thought you said it was the cuckoo that brought good luck?\" said\nGriselda.\n\n\"Well, so it was. The cuckoo and Miss Sybilla came here the same day. It\nwas left to her by her mother's father, with whom she had lived since\nshe was a baby, and when he died she came here to her sisters. She\nwasn't _own_ sister to my ladies, you see, missie. Her mother had come\nfrom Germany, and it was in some strange place there, where her\ngrandfather lived, that the cuckoo clock was made. They make wonderful\nclocks there, I've been told, but none more wonderful than our cuckoo,\nI'm sure.\"\n\n\"No, I'm _sure_ not,\" said Griselda, softly. \"Why didn't Miss Sybilla\ntake it with her when she was married and went away?\"\n\n\"She knew her sisters were so fond of it. It was like a memory of her\nleft behind for them. It was like a part of her. And do you know,\nmissie, the night she died--she died soon after your father was born, a\nyear after she was married--for a whole hour, from twelve to one, that\ncuckoo went on cuckooing in a soft, sad way, like some living creature\nin trouble. Of course, we did not know anything was wrong with her, and\nfolks said something had caught some of the springs of the works; but\n_I_ didn't think so, and never shall. And----\"\n\nBut here Dorcas's reminiscences were abruptly brought to a close by Miss\nGrizzel's appearance at the other end of the terrace.\n\n\"Griselda, what are you loitering so for? Dorcas, you should have\nhastened, not delayed Miss Griselda.\"\n\nSo Griselda was hurried off to her lessons, and Dorcas to her kitchen.\nBut Griselda did not much mind. She had plenty to think of and wonder\nabout, and she liked to do her lessons in the ante-room, with the\ntick-tick of the clock in her ears, and the feeling that _perhaps_ the\ncuckoo was watching her through some invisible peep-hole in his closed\ndoors.\n\n\"And if he sees,\" thought Griselda, \"if he sees how hard I am trying to\ndo my lessons well, it will perhaps make him be quick about\n'considering.'\"\n\nSo she did try very hard. And she didn't speak to the cuckoo when he\ncame out to say it was four o'clock. She was busy, and he was busy. She\nfelt it was better to wait till he gave her some sign of being ready to\ntalk to her again.\n\nFor fairies, you know, children, however charming, are sometimes\n_rather_ queer to have to do with. They don't like to be interfered\nwith, or treated except with very great respect, and they have their own\nideas about what is proper and what isn't, I can assure you.\n\nI suppose it was with working so hard at her lessons--most people would\nsay it was with having been up the night before, running about the house\nin the moonlight; but as she had never felt so \"fresh\" in her life as\nwhen she got up that morning, it could hardly have been that--that\nGriselda felt so tired and sleepy that evening, she could hardly keep\nher eyes open. She begged to go to bed quite half an hour earlier than\nusual, which made Miss Tabitha afraid again that she was going to be\nill. But as there is nothing better for children than to go to bed\nearly, even if they _are_ going to be ill, Miss Grizzel told her to say\ngood-night, and to ask Dorcas to give her a wine-glassful of elderberry\nwine, nice and hot, after she was in bed.\n\nGriselda had no objection to the elderberry wine, though she felt she\nwas having it on false pretences. She certainly did not need it to send\nher to sleep, for almost before her head touched the pillow she was as\nsound as a top. She had slept a good long while, when again she wakened\nsuddenly--just as she had done the night before, and again with the\nfeeling that something had wakened her. And the queer thing was that the\nmoment she was awake she felt so _very_ awake--she had no inclination to\nstretch and yawn and hope it wasn't quite time to get up, and think how\nnice and warm bed was, and how cold it was outside! She sat straight up,\nand peered out into the darkness, feeling quite ready for an adventure.\n\n\"Is it you, cuckoo?\" she said softly.\n\nThere was no answer, but listening intently, the child fancied she heard\na faint rustling or fluttering in the corner of the room by the door.\nShe got up and, feeling her way, opened it, and the instant she had done\nso she heard, a few steps only in front of her it seemed, the familiar\nnotes, very, _very_ soft and whispered, \"Cuckoo, cuckoo.\"\n\nIt went on and on, down the passage, Griselda trotting after. There was\nno moon to-night, heavy clouds had quite hidden it, and outside the rain\nwas falling heavily. Griselda could hear it on the window-panes, through\nthe closed shutters and all. But dark as it was, she made her way along\nwithout any difficulty, down the passage, across the great saloon, in\nthrough the ante-room door, guided only by the little voice now and then\nto be heard in front of her. She came to a standstill right before the\nclock, and stood there for a minute or two patiently waiting.\n\nShe had not very long to wait. There came the usual murmuring sound,\nthen the doors above the clock face opened--she heard them open, it was\nfar too dark to see--and in his ordinary voice, clear and distinct (it\nwas just two o'clock, so the cuckoo was killing two birds with one\nstone, telling the hour and greeting Griselda at once), the bird sang\nout, \"Cuckoo, cuckoo.\"\n\n\"Good evening, cuckoo,\" said Griselda, when he had finished.\n\n\"Good morning, you mean,\" said the cuckoo.\n\n\"Good morning, then, cuckoo,\" said Griselda. \"Have you considered about\nme, cuckoo?\"\n\nThe cuckoo cleared his throat.\n\n\"Have you learnt to obey orders yet, Griselda?\" he inquired.\n\n\"I'm trying,\" replied Griselda. \"But you see, cuckoo, I've not had very\nlong to learn in--it was only last night you told me, you know.\"\n\nThe cuckoo sighed.\n\n\"You've a great deal to learn, Griselda.\"\n\n\"I dare say I have,\" she said. \"But I can tell you one thing,\ncuckoo--whatever lessons I have, I _couldn't_ ever have any worse than\nthose addition sums of Mr. Kneebreeches'. I have made up my mind about\nthat, for to-day, do you know, cuckoo----\"\n\n\"Yesterday,\" corrected the cuckoo. \"Always be exact in your statements,\nGriselda.\"\n\n\"Well, yesterday, then,\" said Griselda, rather tartly; \"though when you\nknow quite well what I mean, I don't see that you need be so _very_\nparticular. Well, as I was saying, I tried and _tried_, but still they\nwere fearful. They were, indeed.\"\n\n\"You've a great deal to learn, Griselda,\" repeated the cuckoo.\n\n\"I wish you wouldn't say that so often,\" said Griselda. \"I thought you\nwere going to _play_ with me.\"\n\n\"There's something in that,\" said the cuckoo, \"there's something in\nthat. I should like to talk about it. But we could talk more comfortably\nif you would come up here and sit beside me.\"\n\nGriselda thought her friend must be going out of his mind.\n\n\"Sit beside you up there!\" she exclaimed. \"Cuckoo, how _could_ I? I'm\nfar, far too big.\"\n\n\"Big!\" returned the cuckoo. \"What do you mean by big? It's all a matter\nof fancy. Don't you know that if the world and everything in it,\ncounting yourself of course, was all made little enough to go into a\nwalnut, you'd never find out the difference.\"\n\n\"_Wouldn't_ I?\" said Griselda, feeling rather muddled; \"but, _not_\ncounting myself, cuckoo, I would then, wouldn't I?\"\n\n\"Nonsense,\" said the cuckoo hastily; \"you've a great deal to learn, and\none thing is, not to _argue_. Nobody should argue; it's a shocking bad\nhabit, and ruins the digestion. Come up here and sit beside me\ncomfortably. Catch hold of the chain; you'll find you can manage if you\ntry.\"\n\n\"But it'll stop the clock,\" said Griselda. \"Aunt Grizzel said I was\nnever to touch the weights or the chains.\"\n\n\"Stuff,\" said the cuckoo; \"it won't stop the clock. Catch hold of the\nchains and swing yourself up. There now--I told you you could manage\nit.\"\n\n\n\n\nCHAPTER IV. THE COUNTRY OF THE NODDING MANDARINS.\n\n\n    \"We're all nodding, nid-nid-nodding.\"\n\n\n_How_ she managed it she never knew; but, somehow or other, it _was_\nmanaged. She seemed to slide up the chain just as easily as in a general\nway she would have slidden down, only without any disagreeable\nanticipation of a bump at the end of the journey. And when she got to\nthe top how wonderfully different it looked from anything she could have\nexpected! The doors stood open, and Griselda found them quite big\nenough, or herself quite small enough--which it was she couldn't tell,\nand as it was all a matter of fancy she decided not to trouble to\ninquire--to pass through quite comfortably.\n\nAnd inside there was the most charming little snuggery imaginable. It\nwas something like a saloon railway carriage--it seemed to be all lined\nand carpeted and everything, with rich mossy red velvet; there was a\nlittle round table in the middle and two arm-chairs, on one of which sat\nthe cuckoo--\"quite like other people,\" thought Griselda to\nherself--while the other, as he pointed out to Griselda by a little nod,\nwas evidently intended for her.\n\n\"Thank you,\" said she, sitting down on the chair as she spoke.\n\n\"Are you comfortable?\" inquired the cuckoo.\n\n\"Quite,\" replied Griselda, looking about her with great satisfaction.\n\"Are all cuckoo clocks like this when you get up inside them?\" she\ninquired. \"I can't think how there's room for this dear little place\nbetween the clock and the wall. Is it a hole cut out of the wall on\npurpose, cuckoo?\"\n\n\"Hush!\" said the cuckoo, \"we've got other things to talk about. First,\nshall I lend you one of my mantles? You may feel cold.\"\n\n\"I don't just now,\" replied Griselda; \"but perhaps I _might_.\"\n\nShe looked at her little bare feet as she spoke, and wondered why _they_\nweren't cold, for it was very chilblainy weather.\n\nThe cuckoo stood up, and with one of his claws reached from a corner\nwhere it was hanging a cloak which Griselda had not before noticed. For\nit was hanging wrong side out, and the lining was red velvet, very like\nwhat the sides of the little room were covered with, so it was no wonder\nshe had not noticed it.\n\nHad it been hanging the _right_ side out she must have done so; this\nside was so very wonderful!\n\nIt was all feathers--feathers of every shade and colour, but\nbeautifully worked in, somehow, so as to lie quite smoothly and evenly,\none colour melting away into another like those in a prism, so that you\ncould hardly tell where one began and another ended.\n\n\"What a _lovely_ cloak!\" said Griselda, wrapping it round her and\nfeeling even more comfortable than before, as she watched the rays of\nthe little lamp in the roof--I think I was forgetting to tell you that\nthe cuckoo's boudoir was lighted by a dear little lamp set into the red\nvelvet roof like a pearl in a ring--playing softly on the brilliant\ncolours of the feather mantle.\n\n\"It's better than lovely,\" said the cuckoo, \"as you shall see. Now,\nGriselda,\" he continued, in the tone of one coming to business--\"now,\nGriselda, let us talk.\"\n\n\"We have been talking,\" said Griselda, \"ever so long. I am very\ncomfortable. When you say 'let us talk' like that, it makes me forget\nall I wanted to say. Just let me sit still and say whatever comes into\nmy head.\"\n\n\"That won't do,\" said the cuckoo; \"we must have a plan of action.\"\n\n\"A what?\" said Griselda.\n\n\"You see you _have_ a great deal to learn,\" said the cuckoo\ntriumphantly. \"You don't understand what I say.\"\n\n\"But I didn't come up here to learn,\" said Griselda; \"I can do that down\nthere;\" and she nodded her head in the direction of the ante-room table.\n\"I want to play.\"\n\n\"Just so,\" said the cuckoo; \"that's what I want to talk about. What do\nyou call 'play'--blindman's-buff and that sort of thing?\"\n\n\"No,\" said Griselda, considering. \"I'm getting rather too big for that\nkind of play. Besides, cuckoo, you and I alone couldn't have much fun at\nblindman's-buff; there'd be only me to catch you or you to catch me.\"\n\n\"Oh, we could easily get more,\" said the cuckoo. \"The mandarins would be\npleased to join.\"\n\n\"The mandarins!\" repeated Griselda. \"Why, cuckoo, they're not alive! How\ncould they play?\"\n\nThe cuckoo looked at her gravely for a minute, then shook his head.\n\n\"You have a _great_ deal to learn,\" he said solemnly. \"Don't you know\nthat _everything's_ alive?\"\n\n\"No,\" said Griselda, \"I don't; and I don't know what you mean, and I\ndon't think I want to know what you mean. I want to talk about playing.\"\n\n\"Well,\" said the cuckoo, \"talk.\"\n\n\"What I call playing,\" pursued Griselda, \"is--I have thought about it\nnow, you see--is being amused. If you will amuse me, cuckoo, I will\ncount that you are playing with me.\"\n\n\"How shall I amuse you?\" inquired he.\n\n\"Oh, that's for you to find out!\" exclaimed Griselda. \"You might tell\nme fairy stories, you know: if you're a fairy you should know lots;\nor--oh yes, of course that would be far nicer--if you are a fairy you\nmight take me with you to fairyland.\"\n\nAgain the cuckoo shook his head.\n\n\"That,\" said he, \"I cannot do.\"\n\n\"Why not?\" said Griselda. \"Lots of children have been there.\"\n\n\"I doubt it,\" said the cuckoo. \"_Some_ may have been, but not lots. And\nsome may have thought they had been there who hadn't really been there\nat all. And as to those who have been there, you may be sure of one\nthing--they were not _taken_, they found their own way. No one ever was\n_taken_ to fairyland--to the real fairyland. They may have been taken to\nthe neighbouring countries, but not to fairyland itself.\"\n\n\"And how is one ever to find one's own way there?\" asked Griselda.\n\n\"That I cannot tell you either,\" replied the cuckoo. \"There are many\nroads there; you may find yours some day. And if ever you do find it, be\nsure you keep what you see of it well swept and clean, and then you may\nsee further after a while. Ah, yes, there are many roads and many doors\ninto fairyland!\"\n\n\"Doors!\" cried Griselda. \"Are there any doors into fairyland in this\nhouse?\"\n\n\"Several,\" said the cuckoo; \"but don't waste your time looking for them\nat present. It would be no use.\"\n\n\"Then how will you amuse me?\" inquired Griselda, in a rather\ndisappointed tone.\n\n\"Don't you care to go anywhere except to fairyland?\" said the cuckoo.\n\n\"Oh yes, there are lots of places I wouldn't mind seeing. Not geography\nsort of places--it would be just like lessons to go to India and Africa\nand all those places--but _queer_ places, like the mines where the\ngoblins make diamonds and precious stones, and the caves down under the\nsea where the mermaids live. And--oh, I've just thought--now I'm so nice\nand little, I _would_ like to go all over the mandarins' palace in the\ngreat saloon.\"\n\n\"That can be easily managed,\" said the cuckoo; \"but--excuse me for an\ninstant,\" he exclaimed suddenly. He gave a spring forward and\ndisappeared. Then Griselda heard his voice outside the doors, \"Cuckoo,\ncuckoo, cuckoo.\" It was three o'clock.\n\nThe doors opened again to let him through, and he re-settled himself on\nhis chair. \"As I was saying,\" he went on, \"nothing could be easier. But\nthat palace, as you call it, has an entrance on the other side, as well\nas the one you know.\"\n\n\"Another door, do you mean?\" said Griselda. \"How funny! Does it go\nthrough the wall? And where does it lead to?\"\n\n\"It leads,\" replied the cuckoo, \"it leads to the country of the Nodding\nMandarins.\"\n\n\"_What_ fun!\" exclaimed Griselda, clapping her hands. \"Cuckoo, do let us\ngo there. How can we get down? You can fly, but must I slide down the\nchain again?\"\n\n\"Oh dear, no,\" said the cuckoo, \"by no means. You have only to stretch\nout your feather mantle, flap it as if it was wings--so\"--he flapped his\nown wings encouragingly--\"wish, and there you'll be.\"\n\n\"Where?\" said Griselda bewilderedly.\n\n\"Wherever you wish to be, of course,\" said the cuckoo. \"Are you ready?\nHere goes.\"\n\n\"Wait--wait a moment,\" cried Griselda. \"Where am I to wish to be?\"\n\n\"Bless the child!\" exclaimed the cuckoo. \"Where _do_ you wish to be? You\nsaid you wanted to visit the country of the Nodding Mandarins.\"\n\n\"Yes; but am I to wish first to be in the palace in the great saloon?\"\n\n\"Certainly,\" replied the cuckoo. \"That is the entrance to Mandarin Land,\nand you said you would like to see through it. So--you're surely ready\nnow?\"\n\n\"A thought has just struck me,\" said Griselda. \"How will you know what\no'clock it is, so as to come back in time to tell the next hour? My\naunts will get into such a fright if you go wrong again! Are you sure we\nshall have time to go to the mandarins' country to-night?\"\n\n\"Time!\" repeated the cuckoo; \"what is time? Ah, Griselda, you have a\n_very_ great deal to learn! What do you mean by time?\"\n\n\"I don't know,\" replied Griselda, feeling rather snubbed. \"Being slow or\nquick--I suppose that's what I mean.\"\n\n\"And what is slow, and what is quick?\" said the cuckoo. \"_All_ a matter\nof fancy! If everything that's been done since the world was made till\nnow, was done over again in five minutes, you'd never know the\ndifference.\"\n\n[MANDARINS NODDING.]\n\n\"Oh, cuckoo, I wish you wouldn't!\" cried poor Griselda; \"you're worse\nthan sums, you do so puzzle me. It's like what you said about nothing\nbeing big or little, only it's worse. Where would all the days and hours\nbe if there was nothing but minutes? Oh, cuckoo, you said you'd amuse\nme, and you do nothing but puzzle me.\"\n\n\"It was your own fault. You wouldn't get ready,\" said the cuckoo.\n\"_Now_, here goes! Flap and wish.\"\n\nGriselda flapped and wished. She felt a sort of rustle in the air, that\nwas all--then she found herself standing with the cuckoo in front of the\nChinese cabinet, the door of which stood open, while the mandarins on\neach side, nodding politely, seemed to invite them to enter. Griselda\nhesitated.\n\n\"Go on,\" said the cuckoo, patronizingly; \"ladies first.\"\n\nGriselda went on. To her surprise, inside the cabinet it was quite\nlight, though where the light came from that illuminated all the queer\ncorners and recesses and streamed out to the front, where stood the\nmandarins, she could not discover.\n\nThe \"palace\" was not quite as interesting as she had expected. There\nwere lots of little rooms in it opening on to balconies commanding, no\ndoubt, a splendid view of the great saloon; there were ever so many\nlittle staircases leading to more little rooms and balconies; but it all\nseemed empty and deserted.\n\n\"I don't care for it,\" said Griselda, stopping short at last; \"it's all\nthe same, and there's nothing to see. I thought my aunts kept ever so\nmany beautiful things in here, and there's nothing.\"\n\n\"Come along, then,\" said the cuckoo. \"I didn't expect you'd care for the\npalace, as you called it, much. Let us go out the other way.\"\n\nHe hopped down a sort of little staircase near which they were standing,\nand Griselda followed him willingly enough. At the foot they found\nthemselves in a vestibule, much handsomer than the entrance at the other\nside, and the cuckoo, crossing it, lifted one of his claws and touched a\nspring in the wall. Instantly a pair of large doors flew open in the\nmiddle, revealing to Griselda the prettiest and most curious sight she\nhad ever seen.\n\nA flight of wide shallow steps led down from this doorway into a long,\nlong avenue bordered by stiffly growing trees, from the branches of\nwhich hung innumerable lamps of every colour, making a perfect network\nof brilliance as far as the eye could reach.\n\n\"Oh, how lovely!\" cried Griselda, clapping her hands. \"It'll be like\nwalking along a rainbow. Cuckoo, come quick.\"\n\n\"Stop,\" said the cuckoo; \"we've a good way to go. There's no need to\nwalk. Palanquin!\"\n\nHe flapped his wings, and instantly a palanquin appeared at the foot of\nthe steps. It was made of carved ivory, and borne by four\nChinese-looking figures with pigtails and bright-coloured jackets. A\nfeeling came over Griselda that she was dreaming, or else that she had\nseen this palanquin before. She hesitated. Suddenly she gave a little\njump of satisfaction.\n\n\"I know,\" she exclaimed. \"It's exactly like the one that stands under a\nglass shade on Lady Lavander's drawing-room mantelpiece. I wonder if it\nis the very one? Fancy me being able to get _into_ it!\"\n\nShe looked at the four bearers. Instantly they all nodded.\n\n\"What do they mean?\" asked Griselda, turning to the cuckoo.\n\n\"Get in,\" he replied.\n\n\"Yes, I'm just going to get in,\" she said; \"but what do _they_ mean when\nthey nod at me like that?\"\n\n\"They mean, of course, what I tell you--'Get in,'\" said the cuckoo.\n\n\"Why don't they say so, then?\" persisted Griselda, getting in, however,\nas she spoke.\n\n\"Griselda, you have a _very_ great----\" began the cuckoo, but Griselda\ninterrupted him.\n\n\"Cuckoo,\" she exclaimed, \"if you say that again, I'll jump out of the\npalanquin and run away home to bed. Of course I've a great deal to\nlearn--that's why I like to ask questions about everything I see. Now,\ntell me where we are going.\"\n\n\"In the first place,\" said the cuckoo, \"are you comfortable?\"\n\n\"Very,\" said Griselda, settling herself down among the cushions.\n\nIt was a change from the cuckoo's boudoir. There were no chairs or\nseats, only a number of very, _very_ soft cushions covered with green\nsilk. There were green silk curtains all round, too, which you could\ndraw or not as you pleased, just by touching a spring. Griselda stroked\nthe silk gently. It was not \"fruzzley\" silk, if you know what that\nmeans; it did not make you feel as if your nails wanted cutting, or as\nif all the rough places on your skin were being rubbed up the wrong way;\nits softness was like that of a rose or pansy petal.\n\n\"What nice silk!\" said Griselda. \"I'd like a dress of it. I never\nnoticed that the palanquin was lined so nicely,\" she continued, \"for I\nsuppose it _is_ the one from Lady Lavander's mantelpiece? There couldn't\nbe two so exactly like each other.\"\n\nThe cuckoo gave a sort of whistle.\n\n\"What a goose you are, my dear!\" he exclaimed. \"Excuse me,\" he\ncontinued, seeing that Griselda looked rather offended; \"I didn't mean\nto hurt your feelings, but you won't let me say the other thing, you\nknow. The palanquin from Lady Lavander's! I should think not. You might\nas well mistake one of those horrible paper roses that Dorcas sticks in\nher vases for one of your aunt's Gloires de Dijon! The palanquin from\nLady Lavander's--a clumsy human imitation not worth looking at!\"\n\n\"I didn't know,\" said Griselda humbly. \"Do they make such beautiful\nthings in Mandarin Land?\"\n\n\"Of course,\" said the cuckoo.\n\nGriselda sat silent for a minute or two, but very soon she recovered her\nspirits.\n\n\"Will you please tell me where we are going?\" she asked again.\n\n\"You'll see directly,\" said the cuckoo; \"not that I mind telling you.\nThere's to be a grand reception at one of the palaces to-night. I\nthought you'd like to assist at it. It'll give you some idea of what a\npalace is like. By-the-by, can you dance?\"\n\n\"A little,\" replied Griselda.\n\n\"Ah, well, I dare say you will manage. I've ordered a court dress for\nyou. It will be all ready when we get there.\"\n\n\"Thank you,\" said Griselda.\n\nIn a minute or two the palanquin stopped. The cuckoo got out, and\nGriselda followed him.\n\nShe found that they were at the entrance to a _very_ much grander palace\nthan the one in her aunt's saloon. The steps leading up to the door were\nvery wide and shallow, and covered with a gold embroidered carpet, which\n_looked_ as if it would be prickly to her bare feet, but which, on the\ncontrary, when she trod upon it, felt softer than the softest moss. She\ncould see very little besides the carpet, for at each side of the steps\nstood rows and rows of mandarins, all something like, but a great deal\ngrander than, the pair outside her aunt's cabinet; and as the cuckoo\nhopped and Griselda walked up the staircase, they all, in turn, row by\nrow, began solemnly to nod. It gave them the look of a field of very\nhigh grass, through which, any one passing, leaves for the moment a\ntrail, till all the heads bob up again into their places.\n\n\"What do they mean?\" whispered Griselda.\n\n\"It's a royal salute,\" said the cuckoo.\n\n\"A salute!\" said Griselda. \"I thought that meant kissing or guns.\"\n\n\"Hush!\" said the cuckoo, for by this time they had arrived at the top of\nthe staircase; \"you must be dressed now.\"\n\nTwo mandariny-looking young ladies, with porcelain faces and\nthree-cornered head-dresses, stepped forward and led Griselda into a\nsmall ante-room, where lay waiting for her the most magnificent dress\nyou ever saw. But how _do_ you think they dressed her? It was all by\nnodding. They nodded to the blue and silver embroidered jacket, and in a\nmoment it had fitted itself on to her. They nodded to the splendid\nscarlet satin skirt, made very short in front and very long behind, and\nbefore Griselda knew where she was, it was adjusted quite correctly.\nThey nodded to the head-dress, and the sashes, and the necklaces and\nbracelets, and forthwith they all arranged themselves. Last of all, they\nnodded to the dearest, sweetest little pair of high-heeled shoes\nimaginable--all silver, and blue, and gold, and scarlet, and everything\nmixed up together, _only_ they were rather a stumpy shape about the\ntoes, and Griselda's bare feet were encased in them, and, to her\nsurprise, quite comfortably so.\n\n\"They don't hurt me a bit,\" she said aloud; \"yet they didn't look the\nleast the shape of my foot.\"\n\nBut her attendants only nodded; and turning round, she saw the cuckoo\nwaiting for her. He did not speak either, rather to her annoyance, but\ngravely led the way through one grand room after another to the grandest\nof all, where the entertainment was evidently just about to begin. And\neverywhere there were mandarins, rows and rows, who all set to work\nnodding as fast as Griselda appeared. She began to be rather tired of\nroyal salutes, and was glad when, at last, in profound silence, the\nprocession, consisting of the cuckoo and herself, and about half a dozen\n\"mandarins,\" came to a halt before a kind of das, or raised seat, at\nthe end of the hall.\n\nUpon this das stood a chair--a throne of some kind, Griselda supposed\nit to be--and upon this was seated the grandest and gravest personage\nshe had yet seen.\n\n\"Is he the king of the mandarins?\" she whispered. But the cuckoo did not\nreply; and before she had time to repeat the question, the very grand\nand grave person got down from his seat, and coming towards her, offered\nher his hand, at the same time nodding--first once, then two or three\ntimes together, then once again. Griselda seemed to know what he meant.\nHe was asking her to dance.\n\n\"Thank you,\" she said. \"I can't dance _very_ well, but perhaps you won't\nmind.\"\n\nThe king, if that was his title, took not the slightest notice of her\nreply, but nodded again--once, then two or three times together, then\nonce alone, just as before. Griselda did not know what to do, when\nsuddenly she felt something poking her head. It was the cuckoo--he had\nlifted his claw, and was tapping her head to make her nod. So she\nnodded--once, twice together, then once--that appeared to be enough. The\nking nodded once again; an invisible band suddenly struck up the\nloveliest music, and off they set to the places of honour reserved for\nthem in the centre of the room, where all the mandarins were assembling.\n\nWhat a dance that was! It began like a minuet and ended something like\nthe hay-makers. Griselda had not the least idea what the figures or\nsteps were, but it did not matter. If she did not know, her shoes or\nsomething about her did; for she got on famously. The music was\nlovely--\"so the mandarins can't be deaf, though they are dumb,\" thought\nGriselda, \"which is one good thing about them.\" The king seemed to enjoy\nit as much as she did, though he never smiled or laughed; any one could\nhave seen he liked it by the way he whirled and twirled himself about.\nAnd between the figures, when they stopped to rest for a little,\nGriselda got on very well too. There was no conversation, or rather, if\nthere was, it was all nodding.\n\nSo Griselda nodded too, and though she did not know what her nods meant,\nthe king seemed to understand and be quite pleased; and when they had\nnodded enough, the music struck up again, and off they set, harder than\nbefore.\n\nAnd every now and then tiny little mandariny boys appeared with trays\nfilled with the most delicious fruits and sweetmeats. Griselda was not a\ngreedy child, but for once in her life she really _did_ feel rather so.\nI cannot possibly describe these delicious things; just think of\nwhatever in all your life was the most \"lovely\" thing you ever eat, and\nyou may be sure they tasted like that. Only the cuckoo would not eat\nany, which rather distressed Griselda. He walked about among the\ndancers, apparently quite at home; and the mandarins did not seem at all\nsurprised to see him, though he did look rather odd, being nearly, if\nnot quite, as big as any of them. Griselda hoped he was enjoying\nhimself, considering that she had to thank him for all the fun _she_ was\nhaving, but she felt a little conscience-stricken when she saw that he\nwouldn't eat anything.\n\n\"Cuckoo,\" she whispered; she dared not talk out loud--it would have\nseemed so remarkable, you see. \"Cuckoo,\" she said, very, very softly, \"I\nwish you would eat something. You'll be so tired and hungry.\"\n\n\"No, thank you,\" said the cuckoo; and you can't think how pleased\nGriselda was at having succeeded in making him speak. \"It isn't my way.\nI hope you are enjoying yourself?\"\n\n\"Oh, _very_ much,\" said Griselda. \"I----\"\n\n\"Hush!\" said the cuckoo; and looking up, Griselda saw a number of\nmandarins, in a sort of procession, coming their way.\n\nWhen they got up to the cuckoo they set to work nodding, two or three at\na time, more energetically than usual. When they stopped, the cuckoo\nnodded in return, and then hopped off towards the middle of the room.\n\n\"They're very fond of good music, you see,\" he whispered as he passed\nGriselda; \"and they don't often get it.\"\n\n\n\n\nCHAPTER V. PICTURES.\n\n\n    \"And she is always beautiful,\n      And always is eighteen!\"\n\n\nWhen he got to the middle of the room the cuckoo cleared his throat,\nflapped his wings, and began to sing. Griselda was quite astonished. She\nhad had no idea that her friend was so accomplished. It wasn't\n\"cuckooing\" at all; it was real singing, like that of the nightingale or\nthe thrush, or like something prettier than either. It made Griselda\nthink of woods in summer, and of tinkling brooks flowing through them,\nwith the pretty brown pebbles sparkling up through the water; and then\nit made her think of something sad--she didn't know what; perhaps it\nwas of the babes in the wood and the robins covering them up with\nleaves--and then again, in a moment, it sounded as if all the merry\nelves and sprites that ever were heard of had escaped from fairyland,\nand were rolling over and over with peals of rollicking laughter. And at\nlast, all of a sudden, the song came to an end.\n\n\"Cuckoo! cuckoo! cuckoo!\" rang out three times, clear and shrill. The\ncuckoo flapped his wings, made a bow to the mandarins, and retired to\nhis old corner.\n\nThere was no buzz of talk, as is usual after a performance has come to a\nclose, but there was a great buzz of nodding, and Griselda, wishing to\ngive the cuckoo as much praise as she could, nodded as hard as any of\nthem. The cuckoo really looked quite shy at receiving so much applause.\nBut in a minute or two the music struck up and the dancing began\nagain--one, two, three: it seemed a sort of mazurka this time, which\nsuited the mandarins very well, as it gave them a chance of nodding to\nmark the time.\n\nGriselda had once learnt the mazurka, so she got on even better than\nbefore--only she would have liked it more if her shoes had had sharper\ntoes; they looked so stumpy when she tried to point them. All the same,\nit was very good fun, and she was not too well pleased when she suddenly\nfelt the little sharp tap of the cuckoo on her head, and heard him\nwhisper--\n\n\"Griselda, it's time to go.\"\n\n\"Oh dear, why?\" she asked. \"I'm not a bit tired. Why need we go yet?\"\n\n\"Obeying orders,\" said the cuckoo; and after that, Griselda dared not\nsay another word. It was very nearly as bad as being told she had a\ngreat deal to learn.\n\n\"Must I say good-bye to the king and all the people?\" she inquired; but\nbefore the cuckoo had time to answer, she gave a little squeal. \"Oh,\ncuckoo,\" she cried, \"you've trod on my foot.\"\n\n\"I beg your pardon,\" said the cuckoo.\n\n\"I must take off my shoe; it does so hurt,\" she went on.\n\n\"Take it off, then,\" said the cuckoo.\n\nGriselda stooped to take off her shoe. \"Are we going home in the pal--?\"\nshe began to say; but she never finished the sentence, for just as she\nhad got her shoe off she felt the cuckoo throw something round her. It\nwas the feather mantle.\n\nAnd Griselda knew nothing more till she opened her eyes the next\nmorning, and saw the first early rays of sunshine peeping in through the\nchinks of the closed shutters of her little bedroom.\n\nShe rubbed her eyes, and sat up in bed. Could it have been a dream?\n\n\"What could have made me fall asleep so all of a sudden?\" she thought.\n\"I wasn't the least sleepy at the mandarins' ball. What fun it was! I\nbelieve that cuckoo made me fall asleep on purpose to make me fancy it\nwas a dream. _Was_ it a dream?\"\n\nShe began to feel confused and doubtful, when suddenly she felt\nsomething hurting her arm, like a little lump in the bed. She felt with\nher hand to see if she could smooth it away, and drew out--one of the\nshoes belonging to her court dress! The very one she had held in her\nhand at the moment the cuckoo spirited her home again to bed.\n\n\"Ah, Mr. Cuckoo!\" she exclaimed, \"you meant to play me a trick, but you\nhaven't succeeded, you see.\"\n\nShe jumped out of bed and unfastened one of the window-shutters, then\njumped in again to admire the little shoe in comfort. It was even\nprettier than she had thought it at the ball. She held it up and looked\nat it. It was about the size of the first joint of her little finger.\n\"To think that I should have been dancing with you on last night!\" she\nsaid to the shoe. \"And yet the cuckoo says being big or little is all a\nmatter of fancy. I wonder what he'll think of to amuse me next?\"\n\nShe was still holding up the shoe and admiring it when Dorcas came with\nthe hot water.\n\n\"Look, Dorcas,\" she said.\n\n\"Bless me, it's one of the shoes off the Chinese dolls in the saloon,\"\nexclaimed the old servant. \"How ever did you get that, missie? Your\naunts wouldn't be pleased.\"\n\n\"It just isn't one of the Chinese dolls' shoes, and if you don't believe\nme, you can go and look for yourself,\" said Griselda. \"It's my very own\nshoe, and it was given me to my own self.\"\n\nDorcas looked at her curiously, but said no more, only as she was going\nout of the room Griselda heard her saying something about \"so very like\nMiss Sybilla.\"\n\n\"I wonder what 'Miss Sybilla' _was_ like?\" thought Griselda. \"I have a\ngood mind to ask the cuckoo. He seems to have known her very well.\"\n\nIt was not for some days that Griselda had a chance of asking the cuckoo\nanything. She saw and heard nothing of him--nothing, that is to say, but\nhis regular appearance to tell the hours as usual.\n\n\"I suppose,\" thought Griselda, \"he thinks the mandarins' ball was fun\nenough to last me a good while. It really was very good-natured of him\nto take me to it, so I mustn't grumble.\"\n\nA few days after this poor Griselda caught cold. It was not a very bad\ncold, I must confess, but her aunts made rather a fuss about it. They\nwanted her to stay in bed, but to this Griselda so much objected that\nthey did not insist upon it.\n\n\"It would be so dull,\" she said piteously. \"Please let me stay in the\nante-room, for all my things are there; and, then, there's the cuckoo.\"\n\nAunt Grizzel smiled at this, and Griselda got her way. But even in the\nante-room it was rather dull. Miss Grizzel and Miss Tabitha were obliged\nto go out, to drive all the way to Merrybrow Hall, as Lady Lavander sent\na messenger to say that she had an attack of influenza, and wished to\nsee her friends at once.\n\nMiss Tabitha began to cry--she was so tender-hearted.\n\n\"Troubles never come singly,\" said Miss Grizzel, by way of consolation.\n\n\"No, indeed, they never come singly,\" said Miss Tabitha, shaking her\nhead and wiping her eyes.\n\nSo off they set; and Griselda, in her arm-chair by the ante-room fire,\nwith some queer little old-fashioned books of her aunts', which she had\nalready read more than a dozen times, beside her by way of amusement,\nfelt that there was one comfort in her troubles--she had escaped the\nlong weary drive to her godmother's.\n\nBut it was very dull. It got duller and duller. Griselda curled herself\nup in her chair, and wished she could go to sleep, though feeling quite\nsure she couldn't, for she had stayed in bed much later than usual this\nmorning, and had been obliged to spend the time in sleeping, for want of\nanything better to do.\n\nShe looked up at the clock.\n\n\"I don't know even what to wish for,\" she said to herself. \"I don't feel\nthe least inclined to play at anything, and I shouldn't care to go to\nthe mandarins again. Oh, cuckoo, cuckoo, I am so dull; couldn't you\nthink of anything to amuse me?\"\n\nIt was not near \"any o'clock.\" But after waiting a minute or two, it\nseemed to Griselda that she heard the soft sound of \"coming\" that always\npreceded the cuckoo's appearance. She was right. In another moment she\nheard his usual greeting, \"Cuckoo, cuckoo!\"\n\n\"Oh, cuckoo!\" she exclaimed, \"I am so glad you have come at last. I _am_\nso dull, and it has nothing to do with lessons this time. It's that I've\ngot such a bad cold, and my head's aching, and I'm so tired of reading,\nall by myself.\"\n\n\"What would you like to do?\" said the cuckoo. \"You don't want to go to\nsee the mandarins again?\"\n\n\"Oh no; I couldn't dance.\"\n\n\"Or the mermaids down under the sea?\"\n\n\"Oh, dear, no,\" said Griselda, with a little shiver, \"it would be far\ntoo cold. I would just like to stay where I am, if some one would tell\nme stories. I'm not even sure that I could listen to stories. What could\nyou do to amuse me, cuckoo?\"\n\n\"Would you like to see some pictures?\" said the cuckoo. \"I could show\nyou pictures without your taking any trouble.\"\n\n\"Oh yes, that would be beautiful,\" cried Griselda. \"What pictures will\nyou show me? Oh, I know. I would like to see the place where you were\nborn--where that very, very clever man made you and the clock, I mean.\"\n\n\"Your great-great-grandfather,\" said the cuckoo. \"Very well. Now,\nGriselda, shut your eyes. First of all, I am going to sing.\"\n\nGriselda shut her eyes, and the cuckoo began his song. It was something\nlike what he had sung at the mandarins' palace, only even more\nbeautiful. It was so soft and dreamy, Griselda felt as if she could have\nsat there for ever, listening to it.\n\nThe first notes were low and murmuring. Again they made Griselda think\nof little rippling brooks in summer, and now and then there came a sort\nof hum as of insects buzzing in the warm sunshine near. This humming\ngradually increased, till at last Griselda was conscious of nothing\nmore--_everything_ seemed to be humming, herself too, till at last she\nfell asleep.\n\nWhen she opened her eyes, the ante-room and everything in it, except the\narm-chair on which she was still curled up, had disappeared--melted away\ninto a misty cloud all round her, which in turn gradually faded, till\nbefore her she saw a scene quite new and strange. It was the first of\nthe cuckoo's \"pictures.\"\n\nAn old, quaint room, with a high, carved mantelpiece, and a bright fire\nsparkling in the grate. It was not a pretty room--it had more the look\nof a workshop of some kind; but it was curious and interesting. All\nround, the walls were hung with clocks and strange mechanical toys.\nThere was a fiddler slowly fiddling, a gentleman and lady gravely\ndancing a minuet, a little man drawing up water in a bucket out of a\nglass vase in which gold fish were swimming about--all sorts of queer\nfigures; and the clocks were even queerer. There was one intended to\nrepresent the sun, moon, and planets, with one face for the sun and\nanother for the moon, and gold and silver stars slowly circling round\nthem; there was another clock with a tiny trumpeter perched on a ledge\nabove the face, who blew a horn for the hours. I cannot tell you half\nthe strange and wonderful things there were.\n\nGriselda was so interested in looking at all these queer machines, that\nshe did not for some time observe the occupant of the room. And no\nwonder; he was sitting in front of a little table, so perfectly still,\nmuch more still than the un-living figures around him. He was examining,\nwith a magnifying glass, some small object he held in his hand, so\nclosely and intently that Griselda, forgetting she was only looking at a\n\"picture,\" almost held her breath for fear she should disturb him. He\nwas a very old man, his coat was worn and threadbare in several places,\nlooking as if he spent a great part of his life in one position. Yet he\ndid not look _poor_, and his face, when at last he lifted it, was mild\nand intelligent and very earnest.\n\nWhile Griselda was watching him closely there came a soft tap at the\ndoor, and a little girl danced into the room. The dearest little girl\nyou ever saw, and _so_ funnily dressed! Her thick brown hair, rather\nlighter than Griselda's, was tied in two long plaits down her back. She\nhad a short red skirt with silver braid round the bottom, and a white\nchemisette with beautiful lace at the throat and wrists, and over that\nagain a black velvet bodice, also trimmed with silver. And she had a\ngreat many trinkets, necklaces, and bracelets, and ear-rings, and a sort\nof little silver coronet; no, it was not like a coronet, it was a band\nwith a square piece of silver fastened so as to stand up at each side of\nher head something like a horse's blinkers, only they were not placed\nover her eyes.\n\nShe made quite a jingle as she came into the room, and the old man\nlooked up with a smile of pleasure.\n\n\"Well, my darling, and are you all ready for your _fte_?\" he said; and\nthough the language in which he spoke was quite strange to Griselda, she\nunderstood his meaning perfectly well.\n\n\"Yes, dear grandfather; and isn't my dress lovely?\" said the child. \"I\nshould be _so_ happy if only you were coming too, and would get yourself\na beautiful velvet coat like Mynheer van Huyten.\"\n\nThe old man shook his head.\n\n\"I have no time for such things, my darling,\" he replied; \"and besides,\nI am too old. I must work--work hard to make money for my pet when I am\ngone, that she may not be dependent on the bounty of those English\nsisters.\"\n\n\"But I won't care for money when you are gone, grandfather,\" said the\nchild, her eyes filling with tears. \"I would rather just go on living in\nthis little house, and I am sure the neighbours would give me something\nto eat, and then I could hear all your clocks ticking, and think of you.\nI don't want you to sell all your wonderful things for money for me,\ngrandfather. They would remind me of you, and money wouldn't.\"\n\n\"Not all, Sybilla, not all,\" said the old man. \"The best of all, the\n_chef-d'oeuvre_ of my life, shall not be sold. It shall be yours, and\nyou will have in your possession a clock that crowned heads might seek\nin vain to purchase.\"\n\nHis dim old eyes brightened, and for a moment he sat erect and strong.\n\n\"Do you mean the cuckoo clock?\" said Sybilla, in a low voice.\n\n\"Yes, my darling, the cuckoo clock, the crowning work of my life--a\nclock that shall last long after I, and perhaps thou, my pretty child,\nare crumbling into dust; a clock that shall last to tell my\ngreat-grandchildren to many generations that the old Dutch mechanic was\nnot altogether to be despised.\"\n\nSybilla sprang into his arms.\n\n\"You are not to talk like that, little grandfather,\" she said. \"I shall\nteach my children and my grandchildren to be so proud of you--oh, so\nproud!--as proud as I am of you, little grandfather.\"\n\n\"Gently, my darling,\" said the old man, as he placed carefully on the\ntable the delicate piece of mechanism he held in his hand, and tenderly\nembraced the child. \"Kiss me once again, my pet, and then thou must go;\nthy little friends will be waiting.\"\n\n       *       *       *       *       *\n\nAs he said these words the mist slowly gathered, again before Griselda's\neyes--the first of the cuckoo's pictures faded from her sight.\n\n       *       *       *       *       *\n\nWhen she looked again the scene was changed, but this time it was not a\nstrange one, though Griselda had gazed at it for some moments before\nshe recognized it. It was the great saloon, but it looked very\ndifferent from what she had ever seen it. Forty years or so make a\ndifference in rooms as well as in people!\n\nThe faded yellow damask hangings were rich and brilliant. There were\nbouquets of lovely flowers arranged about the tables; wax lights were\nsending out their brightness in every direction, and the room was filled\nwith ladies and gentlemen in gay attire.\n\nAmong them, after a time, Griselda remarked two ladies, no longer very\nyoung, but still handsome and stately, and something whispered to her\nthat they were her two aunts, Miss Grizzel and Miss Tabitha.\n\n\"Poor aunts!\" she said softly to herself; \"how old they have grown since\nthen.\"\n\nBut she did not long look at them; her attention was attracted by a much\nyounger lady--a mere girl she seemed, but oh, so sweet and pretty! She\nwas dancing with a gentleman whose eyes looked as if they saw no one\nelse, and she herself seemed brimming over with youth and happiness. Her\nvery steps had joy in them.\n\n\"Well, Griselda,\" whispered a voice, which she knew was the cuckoo's;\n\"so you don't like to be told you are like your grandmother, eh?\"\n\nGriselda turned round sharply to look for the speaker, but he was not to\nbe seen. And when she turned again, the picture of the great saloon had\nfaded away.\n\n       *       *       *       *       *\n\nOne more picture.\n\nGriselda looked again. She saw before her a country road in full summer\ntime; the sun was shining, the birds were singing, the trees covered\nwith their bright green leaves--everything appeared happy and joyful.\nBut at last in the distance she saw, slowly approaching, a group of a\nfew people, all walking together, carrying in their centre something\nlong and narrow, which, though the black cloth covering it was almost\nhidden by the white flowers with which it was thickly strewn, Griselda\nknew to be a coffin.\n\nIt was a funeral procession, and in the place of chief mourner, with\npale, set face, walked the same young man whom Griselda had last seen\ndancing with the girl Sybilla in the great saloon.\n\nThe sad group passed slowly out of sight; but as it disappeared there\nfell upon the ear the sounds of sweet music, lovelier far than she had\nheard before--lovelier than the magic cuckoo's most lovely songs--and\nsomehow, in the music, it seemed to the child's fancy there were mingled\nthe soft strains of a woman's voice.\n\n\"It is Sybilla singing,\" thought Griselda dreamily, and with that she\nfell asleep again.\n\n       *       *       *       *       *\n\nWhen she woke she was in the arm-chair by the ante-room fire,\neverything around her looking just as usual, the cuckoo clock ticking\naway calmly and regularly. Had it been a dream only? Griselda could not\nmake up her mind.\n\n\"But I don't see that it matters if it was,\" she said to herself. \"If it\nwas a dream, the cuckoo sent it to me all the same, and I thank you very\nmuch indeed, cuckoo,\" she went on, looking up at the clock. \"The last\npicture was rather sad, but still it was very nice to see it, and I\nthank you very much, and I'll never say again that I don't like to be\ntold I'm like my dear pretty grandmother.\"\n\nThe cuckoo took no notice of what she said, but Griselda did not mind.\nShe was getting used to his \"ways.\"\n\n\"I expect he hears me quite well,\" she thought; \"and even if he doesn't,\nit's only civil to _try_ to thank him.\"\n\n[My aunts must have come back!]\n\nShe sat still contentedly enough, thinking over what she had seen,\nand trying to make more \"pictures\" for herself in the fire. Then there\ncame faintly to her ears the sound of carriage wheels, opening and\nshutting of doors, a little bustle of arrival.\n\n\"My aunts must have come back,\" thought Griselda; and so it was. In a\nfew minutes Miss Grizzel, closely followed by Miss Tabitha, appeared at\nthe ante-room door.\n\n\"Well, my love,\" said Miss Grizzel anxiously, \"and how are you? Has the\ntime seemed very long while we were away?\"\n\n\"Oh no, thank you, Aunt Grizzel,\" replied Griselda, \"not at all. I've\nbeen quite happy, and my cold's ever so much better, and my headache's\n_quite_ gone.\"\n\n\"Come, that is good news,\" said Miss Grizzel. \"Not that I'm exactly\n_surprised_,\" she continued, turning to Miss Tabitha, \"for there really\nis nothing like tansy tea for a feverish cold.\"\n\n\"Nothing,\" agreed Miss Tabitha; \"there really is nothing like it.\"\n\n\"Aunt Grizzel,\" said Griselda, after a few moments' silence, \"was my\ngrandmother quite young when she died?\"\n\n\"Yes, my love, very young,\" replied Miss Grizzel with a change in her\nvoice.\n\n\"And was her husband _very_ sorry?\" pursued Griselda.\n\n\"Heart-broken,\" said Miss Grizzel. \"He did not live long after, and then\nyou know, my dear, your father was sent to us to take care of. And now\nhe has sent _you_--the third generation of young creatures confided to\nour care.\"\n\n\"Yes,\" said Griselda. \"My grandmother died in the summer, when all the\nflowers were out; and she was buried in a pretty country place, wasn't\nshe?\"\n\n\"Yes,\" said Miss Grizzel, looking rather bewildered.\n\n\"And when she was a little girl she lived with her grandfather, the old\nDutch mechanic,\" continued Griselda, unconsciously using the very words\nshe had heard in her vision. \"He was a nice old man; and how clever of\nhim to have made the cuckoo clock, and such lots of other pretty,\nwonderful things. I don't wonder little Sybilla loved him; he was so\ngood to her. But, oh, Aunt Grizzel, _how_ pretty she was when she was a\nyoung lady! That time that she danced with my grandfather in the great\nsaloon. And how very nice you and Aunt Tabitha looked then, too.\"\n\nMiss Grizzel held her very breath in astonishment; and no doubt if Miss\nTabitha had known she was doing so, she would have held hers too. But\nGriselda lay still, gazing at the fire, quite unconscious of her aunt's\nsurprise.\n\n\"Your papa told you all these old stories, I suppose, my dear,\" said\nMiss Grizzel at last.\n\n\"Oh no,\" said Griselda dreamily. \"Papa never told me anything like\nthat. Dorcas told me a very little, I think; at least, she made me want\nto know, and I asked the cuckoo, and then, you see, he showed me it all.\nIt was so pretty.\"\n\nMiss Grizzel glanced at her sister.\n\n\"Tabitha, my dear,\" she said in a low voice, \"do you hear?\"\n\nAnd Miss Tabitha, who really was not very deaf when she set herself to\nhear, nodded in awestruck silence.\n\n\"Tabitha,\" continued Miss Grizzel in the same tone, \"it is wonderful!\nAh, yes, how true it is, Tabitha, that 'there are more things in heaven\nand earth than are dreamt of in our philosophy'\" (for Miss Grizzel was a\nwell-read old lady, you see); \"and from the very first, Tabitha, we\nalways had a feeling that the child was strangely like Sybilla.\"\n\n\"Strangely like Sybilla,\" echoed Miss Tabitha.\n\n\"May she grow up as good, if not quite as beautiful--_that_ we could\nscarcely expect; and may she be longer spared to those that love her,\"\nadded Miss Grizzel, bending over Griselda, while two or three tears\nslowly trickled down her aged cheeks. \"See, Tabitha, the dear child is\nfast asleep. How sweet she looks! I trust by to-morrow morning she will\nbe quite herself again: her cold is so much better.\"\n\n\n\n\nCHAPTER VI. RUBBED THE WRONG WAY.\n\n\n    \"For now and then there comes a day\n    When everything goes wrong.\"\n\n\nGriselda's cold _was_ much better by \"to-morrow morning.\" In fact, I\nmight almost say it was quite well.\n\nBut Griselda herself did not feel quite well, and saying this reminds me\nthat it is hardly sense to speak of a _cold_ being better or well--for a\ncold's being \"well\" means that it is not there at all, out of existence,\nin short, and if a thing is out of existence how can we say anything\nabout it? Children, I feel quite in a hobble--I cannot get my mind\nstraight about it--please think it over and give me your opinion. In\nthe meantime, I will go on about Griselda.\n\nShe felt just a little ill--a sort of feeling that sometimes is rather\nnice, sometimes \"very extremely\" much the reverse! She felt in the\nhumour for being petted, and having beef-tea, and jelly, and sponge cake\nwith her tea, and for a day or two this was all very well. She _was_\npetted, and she had lots of beef-tea, and jelly, and grapes, and sponge\ncakes, and everything nice, for her aunts, as you must have seen by this\ntime, were really very, very kind to her in every way in which they\nunderstood how to be so.\n\nBut after a few days of the continued petting, and the beef-tea and the\njelly and all the rest of it, it occurred to Miss Grizzel, who had a\ngood large bump of \"common sense,\" that it might be possible to overdo\nthis sort of thing.\n\n\"Tabitha,\" she said to her sister, when they were sitting together in\nthe evening after Griselda had gone to bed, \"Tabitha, my dear, I think\nthe child is quite well again now. It seems to me it would be well to\nsend a note to good Mr. Kneebreeches, to say that she will be able to\nresume her studies the day after to-morrow.\"\n\n\"The day after to-morrow,\" repeated Miss Tabitha. \"The day after\nto-morrow--to say that she will be able to resume her studies the day\nafter to-morrow--oh yes, certainly. It would be very well to send a note\nto good Mr. Kneebreeches, my dear Grizzel.\"\n\n\"I thought you would agree with me,\" said Miss Grizzel, with a sigh of\nrelief (as if poor Miss Tabitha during all the last half-century had\never ventured to do anything else), getting up to fetch her writing\nmaterials as she spoke. \"It is such a satisfaction to consult together\nabout what we do. I was only a little afraid of being hard upon the\nchild, but as you agree with me, I have no longer any misgiving.\"\n\n\"Any misgiving, oh dear, no!\" said Miss Tabitha. \"You have no reason\nfor any misgiving, I am sure, my dear Grizzel.\"\n\nSo the note was written and despatched, and the next morning when, about\ntwelve o'clock, Griselda made her appearance in the little drawing-room\nwhere her aunts usually sat, looking, it must be confessed, very plump\nand rosy for an invalid, Miss Grizzel broached the subject.\n\n\"I have written to request Mr. Kneebreeches to resume his instructions\nto-morrow,\" she said quietly. \"I think you are quite well again now, so\nDorcas must wake you at your usual hour.\"\n\nGriselda had been settling herself comfortably on a corner of the sofa.\nShe had got a nice book to read, which her father, hearing of her\nillness, had sent her by post, and she was looking forward to the\ntempting plateful of jelly which Dorcas had brought her for luncheon\nevery day since she had been ill. Altogether, she was feeling very\n\"lazy-easy\" and contented. Her aunt's announcement felt like a sudden\ndownpour of cold water, or rush of east wind. She sat straight up in her\nsofa, and exclaimed in a tone of great annoyance--\n\n\"_Oh_, Aunt Grizzel!\"\n\n\"Well, my dear?\" said Miss Grizzel, placidly.\n\n\"I _wish_ you wouldn't make me begin lessons again just yet. I _know_\nthey'll make my head ache again, and Mr. Kneebreeches will be _so_\ncross. I know he will, and he is so horrid when he is cross.\"\n\n\"Hush!\" said Miss Grizzel, holding up her hand in a way that reminded\nGriselda of the cuckoo's favourite \"obeying orders.\" Just then, too, in\nthe distance the ante-room clock struck twelve. \"Cuckoo! cuckoo!\ncuckoo!\" on it went. Griselda could have stamped with irritation, but\n_somehow_, in spite of herself, she felt compelled to say nothing. She\nmuttered some not very pretty words, coiled herself round on the sofa,\nopened her book, and began to read.\n\nBut it was not as interesting as she had expected. She had not read many\npages before she began to yawn, and she was delighted to be interrupted\nby Dorcas and the jelly.\n\nBut the jelly was not as nice as she had expected, either. She tasted\nit, and thought it was too sweet; and when she tasted it again, it\nseemed too strong of cinnamon; and the third taste seemed too strong of\neverything. She laid down her spoon, and looked about her\ndiscontentedly.\n\n\"What is the matter, my dear?\" said Miss Grizzel. \"Is the jelly not to\nyour liking?\"\n\n\"I don't know,\" said Griselda shortly. She ate a few spoonfuls, and then\ntook up her book again. Miss Grizzel said nothing more, but to herself\nshe thought that Mr. Kneebreeches had not been recalled any too soon.\n\nAll day long it was much the same. Nothing seemed to come right to\nGriselda. It was a dull, cold day, what is called \"a black frost;\" not a\nbright, clear, _pretty_, cold day, but the sort of frost that really\nmakes the world seem dead--makes it almost impossible to believe that\nthere will ever be warmth and sound and \"growing-ness\" again.\n\nLate in the afternoon Griselda crept up to the ante-room, and sat down\nby the window. Outside it was nearly dark, and inside it was not much\nmore cheerful--for the fire was nearly out, and no lamps were lighted;\nonly the cuckoo clock went on tick-ticking briskly as usual.\n\n\"I hate winter,\" said Griselda, pressing her cold little face against\nthe colder window-pane, \"I hate winter, and I hate lessons. I would give\nup being a _person_ in a minute if I might be a--a--what would I best\nlike to be? Oh yes, I know--a butterfly. Butterflies never see winter,\nand they _certainly_ never have any lessons or any kind of work to do. I\nhate _must_-ing to do anything.\"\n\n\"Cuckoo,\" rang out suddenly above her head.\n\nIt was only four o'clock striking, and as soon as he had told it the\ncuckoo was back behind his doors again in an instant, just as usual.\nThere was nothing for Griselda to feel offended at, but somehow she got\nquite angry.\n\n\"I don't care what you think, cuckoo!\" she exclaimed defiantly. \"I know\nyou came out on purpose just now, but I don't care. I _do_ hate winter,\nand I _do_ hate lessons, and I _do_ think it would be nicer to be a\nbutterfly than a little girl.\"\n\nIn her secret heart I fancy she was half in hopes that the cuckoo would\ncome out again, and talk things over with her. Even if he were to scold\nher, she felt that it would be better than sitting there alone with\nnobody to speak to, which was very dull work indeed. At the bottom of\nher conscience there lurked the knowledge that what she _should_ be\ndoing was to be looking over her last lessons with Mr. Kneebreeches, and\nrefreshing her memory for the next day; but, alas! knowing one's duty is\nby no means the same thing as doing it, and Griselda sat on by the\nwindow doing nothing but grumble and work herself up into a belief that\nshe was one of the most-to-be-pitied little girls in all the world. So\nthat by the time Dorcas came to call her to tea, I doubt if she had a\nsingle pleasant thought or feeling left in her heart.\n\nThings grew no better after tea, and before long Griselda asked if she\nmight go to bed. She was \"so tired,\" she said; and she certainly looked\nso, for ill-humour and idleness are excellent \"tirers,\" and will soon\ntake the roses out of a child's cheeks, and the brightness out of her\neyes. She held up her face to be kissed by her aunts in a meekly\nreproachful way, which made the old ladies feel quite uncomfortable.\n\n\"I am by no means sure that I have done right in recalling Mr.\nKneebreeches so soon, Sister Tabitha,\" remarked Miss Grizzel, uneasily,\nwhen Griselda had left the room. But Miss Tabitha was busy counting her\nstitches, and did not give full attention to Miss Grizzel's observation,\nso she just repeated placidly, \"Oh yes, Sister Grizzel, you may be sure\nyou have done right in recalling Mr. Kneebreeches.\"\n\n\"I am glad you think so,\" said Miss Tabitha, with again a little sigh of\nrelief. \"I was only distressed to see the child looking so white and\ntired.\"\n\nUpstairs Griselda was hurry-scurrying into bed. There was a lovely fire\nin her room--fancy that! Was she not a poor neglected little creature?\nBut even this did not please her. She was too cross to be pleased with\nanything; too cross to wash her face and hands, or let Dorcas brush her\nhair out nicely as usual; too cross, alas, to say her prayers! She just\nhuddled into bed, huddling up her mind in an untidy hurry and confusion,\njust as she left her clothes in an untidy heap on the floor. She would\nnot look into herself, was the truth of it; she shrank from doing so\nbecause she _knew_ things had been going on in that silly little heart\nof hers in a most unsatisfactory way all day, and she wanted to go to\nsleep and forget all about it.\n\nShe did go to sleep, very quickly too. No doubt she really was tired;\ntired with crossness and doing nothing, and she slept very soundly. When\nshe woke up she felt so refreshed and rested that she fancied it must be\nmorning. It was dark, of course, but that was to be expected in\nmid-winter, especially as the shutters were closed.\n\n\"I wonder,\" thought Griselda, \"I wonder if it really _is_ morning. I\nshould like to get up early--I went so early to bed. I think I'll just\njump out of bed and open a chink of the shutters. I'll see at once if\nit's nearly morning, by the look of the sky.\"\n\nShe was up in a minute, feeling her way across the room to the window,\nand without much difficulty she found the hook of the shutters,\nunfastened it, and threw one side open. Ah no, there was no sign of\nmorning to be seen. There was moonlight, but nothing else, and not so\nvery much of that, for the clouds were hurrying across the \"orbd\nmaiden's\" face at such a rate, one after the other, that the light was\nmore like a number of pale flashes than the steady, cold shining of most\nfrosty moonlight nights. There was going to be a change of weather, and\nthe cloud armies were collecting together from all quarters; that was\nthe real explanation of the hurrying and skurrying Griselda saw\noverhead, but this, of course, she did not understand. She only saw that\nit looked wild and stormy, and she shivered a little, partly with cold,\npartly with a half-frightened feeling that she could not have explained.\n\n\"I had better go back to bed,\" she said to herself; \"but I am not a bit\nsleepy.\"\n\nShe was just drawing-to the shutter again, when something caught her\neye, and she stopped short in surprise. A little bird was outside on the\nwindowsill--a tiny bird crouching in close to the cold glass.\nGriselda's kind heart was touched in an instant. Cold as she was, she\npushed back the shutter again, and drawing a chair forward to the\nwindow, managed to unfasten it--it was not a very heavy one--and to open\nit wide enough to slip her hand gently along to the bird. It did not\nstart or move.\n\n\"Can it be dead?\" thought Griselda anxiously.\n\nBut no, it was not dead. It let her put her hand round it and draw it\nin, and to her delight she felt that it was soft and warm, and it even\ngave a gentle peck on her thumb.\n\n\"Poor little bird, how cold you must be,\" she said kindly. But, to her\namazement, no sooner was the bird safely inside the room, than it\nmanaged cleverly to escape from her hand. It fluttered quietly up on to\nher shoulder, and sang out in a soft but cheery tone, \"Cuckoo,\ncuckoo--cold, did you say, Griselda? Not so very, thank you.\"\n\nGriselda stept back from the window.\n\n\"It's _you_, is it?\" she said rather surlily, her tone seeming to infer\nthat she had taken a great deal of trouble for nothing.\n\n\"Of course it is, and why shouldn't it be? You're not generally so sorry\nto see me. What's the matter?\"\n\n\"Nothing's the matter,\" replied Griselda, feeling a little ashamed of\nher want of civility; \"only, you see, if I had known it was _you_----\" She\nhesitated.\n\n\"You wouldn't have clambered up and hurt your poor fingers in opening\nthe window if you had known it was me--is that it, eh?\" said the cuckoo.\n\nSomehow, when the cuckoo said \"eh?\" like that, Griselda was obliged to\ntell just what she was thinking.\n\n\"No, I wouldn't have _needed_ to open the window,\" she said. \"_You_ can\nget in or out whenever you like; you're not like a real bird. Of\ncourse, you were just tricking me, sitting out there and pretending to\nbe a starved robin.\"\n\nThere was a little indignation in her voice, and she gave her head a\ntoss, which nearly upset the cuckoo.\n\n\"Dear me, dear me!\" exclaimed the cuckoo. \"You have a great deal to\ncomplain of, Griselda. Your time and strength must be very valuable for\nyou to regret so much having wasted a little of them on me.\"\n\nGriselda felt her face grow red. What did he mean? Did he know how\nyesterday had been spent? She said nothing, but she drooped her head,\nand one or two tears came slowly creeping up to her eyes.\n\n\"Child!\" said the cuckoo, suddenly changing his tone, \"you are very\nfoolish. Is a kind thought or action _ever_ wasted? Can your eyes see\nwhat such good seeds grow into? They have wings, Griselda--kindnesses\nhave wings and roots, remember that--wings that never droop, and roots\nthat never die. What do you think I came and sat outside your window\nfor?\"\n\n\"Cuckoo,\" said Griselda humbly, \"I am very sorry.\"\n\n\"Very well,\" said the cuckoo, \"we'll leave it for the present. I have\nsomething else to see about. Are you cold, Griselda?\"\n\n\"_Very_,\" she replied. \"I would very much like to go back to bed,\ncuckoo, if you please; and there's plenty of room for you too, if you'd\nlike to come in and get warm.\"\n\n\"There are other ways of getting warm besides going to bed,\" said the\ncuckoo. \"A nice brisk walk, for instance. I was going to ask you to come\nout into the garden with me.\"\n\nGriselda almost screamed.\n\n\"Out into the garden! _Oh_, cuckoo!\" she exclaimed, \"how can you think\nof such a thing? Such a freezing cold night. Oh no, indeed, cuckoo, I\ncouldn't possibly.\"\n\n\"Very well, Griselda,\" said the cuckoo; \"if you haven't yet learnt to\ntrust me, there's no more to be said. Good-night.\"\n\nHe flapped his wings, cried out \"Cuckoo\" once only, flew across the\nroom, and almost before Griselda understood what he was doing, had\ndisappeared.\n\nShe hurried after him, stumbling against the furniture in her haste, and\nby the uncertain light. The door was not open, but the cuckoo had got\nthrough it--\"by the keyhole, I dare say,\" thought Griselda; \"he can\n'scrooge' himself up any way\"--for a faint \"Cuckoo\" was to be heard on\nits other side. In a moment Griselda had opened it, and was speeding\ndown the long passage in the dark, guided only by the voice from time to\ntime heard before her, \"Cuckoo, cuckoo.\"\n\nShe forgot all about the cold, or rather, she did not feel it, though\nthe floor was of uncarpeted old oak, whose hard, polished surface would\nhave usually felt like ice to a child's soft, bare feet. It was a very\nlong passage, and to-night, somehow, it seemed longer than ever. In\nfact, Griselda could have fancied she had been running along it for half\na mile or more, when at last she was brought to a standstill by finding\nshe could go no further. Where was she? She could not imagine! It must\nbe a part of the house she had never explored in the daytime, she\ndecided. In front of her was a little stair running downwards, and\nending in a doorway. All this Griselda could see by a bright light that\nstreamed in by the keyhole and through the chinks round the door--a\nlight so brilliant that the little girl blinked her eyes, and for a\nmoment felt quite dazzled and confused.\n\n\"It came so suddenly,\" she said to herself; \"some one must have lighted\na lamp in there all at once. But it can't be a lamp, it's too bright\nfor a lamp. It's more like the sun; but how ever could the sun be\nshining in a room in the middle of the night? What shall I do? Shall I\nopen the door and peep in?\"\n\n\"Cuckoo, cuckoo,\" came the answer, soft but clear, from the other side.\n\n\"Can it be a trick of the cuckoo's to get me out into the garden?\"\nthought Griselda; and for the first time since she had run out of her\nroom a shiver of cold made her teeth chatter and her skin feel creepy.\n\n\"Cuckoo, cuckoo,\" sounded again, nearer this time, it seemed to\nGriselda.\n\n\"He's waiting for me. I _will_ trust him,\" she said resolutely. \"He has\nalways been good and kind, and it's horrid of me to think he's going to\ntrick me.\"\n\nShe ran down the little stair, she seized the handle of the door. It\nturned easily; the door opened--opened, and closed again noiselessly\nbehind her, and what do you think she saw?\n\n\"Shut your eyes for a minute, Griselda,\" said the cuckoo's voice beside\nher; \"the light will dazzle you at first. Shut them, and I will brush\nthem with a little daisy dew, to strengthen them.\"\n\nGriselda did as she was told. She felt the tip of the cuckoo's softest\nfeather pass gently two or three times over her eyelids, and a delicious\nscent seemed immediately to float before her.\n\n\"I didn't know _daisies_ had any scent,\" she remarked.\n\n\"Perhaps you didn't. You forget, Griselda, that you have a great----\"\n\n\"Oh, please don't, cuckoo. Please, please don't, _dear_ cuckoo,\" she\nexclaimed, dancing about with her hands clasped in entreaty, but her\neyes still firmly closed. \"Don't say that, and I'll promise to believe\nwhatever you tell me. And how soon may I open my eyes, please, cuckoo?\"\n\n\"Turn round slowly, three times. That will give the dew time to take\neffect,\" said the cuckoo. \"Here goes--one--two--three. There, now.\"\n\nGriselda opened her eyes.\n\n\n\n\nCHAPTER VII. BUTTERFLY-LAND.\n\n\n    \"I'd be a butterfly.\"\n\n\nGriselda opened her eyes.\n\nWhat did she see?\n\nThe loveliest, loveliest garden that ever or never a little girl's eyes\nsaw. As for describing it, I cannot. I must leave a good deal to your\nfancy. It was just a _delicious_ garden. There was a charming mixture of\nall that is needed to make a garden perfect--grass, velvety lawn rather;\nwater, for a little brook ran tinkling in and out, playing bo-peep among\nthe bushes; trees, of course, and flowers, of course, flowers of every\nshade and shape. But all these beautiful things Griselda did not at\nfirst give as much attention to as they deserved; her eyes were so\noccupied with a quite unusual sight that met them.\n\nThis was butterflies! Not that butterflies are so very uncommon; but\nbutterflies, as Griselda saw them, I am quite sure, children, none of\nyou ever saw, or are likely to see. There were such enormous numbers of\nthem, and the variety of their colours and sizes was so great. They were\nfluttering about everywhere; the garden seemed actually alive with them.\n\nGriselda stood for a moment in silent delight, feasting her eyes on the\nlovely things before her, enjoying the delicious sunshine which kissed\nher poor little bare feet, and seemed to wrap her all up in its warm\nembrace. Then she turned to her little friend.\n\n\"Cuckoo,\" she said, \"I thank you _so_ much. This _is_ fairyland, at\nlast!\"\n\nThe cuckoo smiled, I was going to say, but that would be a figure of\nspeech only, would it not? He shook his head gently.\n\n\"No, Griselda,\" he said kindly; \"this is only butterfly-land.\"\n\n\"_Butterfly_-land!\" repeated Griselda, with a little disappointment in\nher tone.\n\n\"Well,\" said the cuckoo, \"it's where you were wishing to be yesterday,\nisn't it?\"\n\nGriselda did not particularly like these allusions to \"yesterday.\" She\nthought it would be as well to change the subject.\n\n\"It's a beautiful place, whatever it is,\" she said, \"and I'm sure,\ncuckoo, I'm _very_ much obliged to you for bringing me here. Now may I\nrun about and look at everything? How delicious it is to feel the warm\nsunshine again! I didn't know how cold I was. Look, cuckoo, my toes and\nfingers are quite blue; they're only just beginning to come right again.\nI suppose the sun always shines here. How nice it must be to be a\nbutterfly; don't you think so, cuckoo? Nothing to do but fly about.\"\n\nShe stopped at last, quite out of breath.\n\n\"Griselda,\" said the cuckoo, \"if you want me to answer your questions,\nyou must ask them one at a time. You may run about and look at\neverything if you like, but you had better not be in such a hurry. You\nwill make a great many mistakes if you are--you have made some already.\"\n\n\"How?\" said Griselda.\n\n\"_Have_ the butterflies nothing to do but fly about? Watch them.\"\n\nGriselda watched.\n\n\"They do seem to be doing something,\" she said, at last, \"but I can't\nthink what. They seem to be nibbling at the flowers, and then flying\naway something like bees gathering honey. _Butterflies_ don't gather\nhoney, cuckoo?\"\n\n\"No,\" said the cuckoo. \"They are filling their paint-boxes.\"\n\n\"What _do_ you mean?\" said Griselda.\n\n\"Come and see,\" said the cuckoo.\n\nHe flew quietly along in front of her, leading the way through the\nprettiest paths in all the pretty garden. The paths were arranged in\ndifferent colours, as it were; that is to say, the flowers growing along\ntheir sides were not all \"mixty-maxty,\" but one shade after another in\nregular order--from the palest blush pink to the very deepest damask\ncrimson; then, again, from the soft greenish blue of the small grass\nforget-me-not to the rich warm tinge of the brilliant cornflower.\n_Every_ tint was there; shades, to which, though not exactly strange to\nher, Griselda could yet have given no name, for the daisy dew, you see,\nhad sharpened her eyes to observe delicate variations of colour, as she\nhad never done before.\n\n\"How beautifully the flowers are planned,\" she said to the cuckoo. \"Is\nit just to look pretty, or why?\"\n\n\"It saves time,\" replied the cuckoo. \"The fetch-and-carry butterflies\nknow exactly where to go to for the tint the world-flower-painters\nwant.\"\n\n\"Who are the fetch-and-carry butterflies, and who are the\nworld-flower-painters?\" asked Griselda.\n\n\"Wait a bit and you'll see, and use your eyes,\" answered the cuckoo.\n\"It'll do your tongue no harm to have a rest now and then.\"\n\nGriselda thought it as well to take his advice, though not particularly\nrelishing the manner in which it was given. She did use her eyes, and as\nshe and the cuckoo made their way along the flower alleys, she saw that\nthe butterflies were never idle. They came regularly, in little parties\nof twos and threes, and nibbled away, as she called it, at flowers of\nthe same colour but different shades, till they had got what they\nwanted. Then off flew butterfly No. 1 with perhaps the palest tint of\nmaize, or yellow, or lavender, whichever he was in quest of, followed\nby No. 2 with the next deeper shade of the same, and No. 3 bringing up\nthe rear.\n\nGriselda gave a little sigh.\n\n\"What's the matter?\" said the cuckoo.\n\n\"They work very hard,\" she replied, in a melancholy tone.\n\n\"It's a busy time of year,\" observed the cuckoo, drily.\n\nAfter a while they came to what seemed to be a sort of centre to the\ngarden. It was a huge glass house, with numberless doors, in and out of\nwhich butterflies were incessantly flying--reminding Griselda again of\nbees and a beehive. But she made no remark till the cuckoo spoke again.\n\n\"Come in,\" he said.\n\nGriselda had to stoop a good deal, but she did manage to get in without\nknocking her head or doing any damage. Inside was just a mass of\nbutterflies. A confused mass it seemed at first, but after a while she\nsaw that it was the very reverse of confused. The butterflies were all\nsettled in rows on long, narrow, white tables, and before each was a\ntiny object about the size of a flattened-out pin's head, which he was\nmost carefully painting with one of his tentacles, which, from time to\ntime, he moistened by rubbing it on the head of a butterfly waiting\npatiently behind him. Behind this butterfly again stood another, who\nafter a while took his place, while the first attendant flew away.\n\n\"To fill his paint-box again,\" remarked the cuckoo, who seemed to read\nGriselda's thoughts.\n\n\"But what _are_ they painting, cuckoo?\" she inquired eagerly.\n\n\"All the flowers in the world,\" replied the cuckoo. \"Autumn, winter, and\nspring, they're hard at work. It's only just for the three months of\nsummer that the butterflies have any holiday, and then a few stray ones\nnow and then wander up to the world, and people talk about 'idle\nbutterflies'! And even then it isn't true that they are idle. They go up\nto take a look at the flowers, to see how their work has turned out, and\nmany a damaged petal they repair, or touch up a faded tint, though no\none ever knows it.\"\n\n\"_I_ know it now,\" said Griselda. \"I will never talk about idle\nbutterflies again--never. But, cuckoo, do they paint all the flowers\n_here_, too? What a _fearful_ lot they must have to do!\"\n\n\"No,\" said the cuckoo; \"the flowers down here are fairy flowers. They\nnever fade or die, they are always just as you see them. But the colours\nof your flowers are all taken from them, as you have seen. Of course\nthey don't look the same up there,\" he went on, with a slight\ncontemptuous shrug of his cuckoo shoulders; \"the coarse air and the ugly\nthings about must take the bloom off. The wild flowers do the best, to\nmy thinking; people don't meddle with them in their stupid, clumsy\nway.\"\n\n\"But how do they get the flowers sent up to the world, cuckoo?\" asked\nGriselda.\n\n\"They're packed up, of course, and taken up at night when all of you are\nasleep,\" said the cuckoo. \"They're painted on elastic stuff, you see,\nwhich fits itself as the plant grows. Why, if your eyes were as they are\nusually, Griselda, you couldn't even _see_ the petals the butterflies\nare painting now.\"\n\n\"And the packing up,\" said Griselda; \"do the butterflies do that too?\"\n\n\"No,\" said the cuckoo, \"the fairies look after that.\"\n\n\"How wonderful!\" exclaimed Griselda. But before the cuckoo had time to\nsay more a sudden tumult filled the air. It was butterfly dinner-time!\n\n\"Are you hungry, Griselda?\" said the cuckoo.\n\n\"Not so very,\" replied Griselda.\n\n\"It's just as well perhaps that you're not,\" he remarked, \"for I don't\nknow that you'd be much the better for dinner here.\"\n\n\"Why not?\" inquired Griselda curiously. \"What do they have for dinner?\nHoney? I like that very well, spread on the top of bread-and-butter, of\ncourse--I don't think I should care to eat it alone.\"\n\n\"You won't get any honey,\" the cuckoo was beginning; but he was\ninterrupted. Two handsome butterflies flew into the great glass hall,\nand making straight for the cuckoo, alighted on his shoulders. They\nfluttered about him for a minute or two, evidently rather excited about\nsomething, then flew away again, as suddenly as they had appeared.\n\n\"Those were royal messengers,\" said the cuckoo, turning to Griselda.\n\"They have come with a message from the king and queen to invite us to\na banquet which is to be held in honour of your visit.\"\n\n\"What fun!\" cried Griselda. \"Do let's go at once, cuckoo. But, oh dear\nme,\" she went on, with a melancholy change of tone, \"I was forgetting,\ncuckoo. I can't go to the banquet. I have nothing on but my night-gown.\nI never thought of it before, for I'm not a bit cold.\"\n\n\"Never mind,\" said the cuckoo, \"I'll soon have that put to rights.\"\n\n[SHE LOOKED LIKE A FAIRY QUEEN.]\n\nHe flew off, and was back almost immediately, followed by a whole flock\nof butterflies. They were of a smaller kind than Griselda had hitherto\nseen, and they were of two colours only; half were blue, half yellow.\nThey flew up to Griselda, who felt for a moment as if she were really\ngoing to be suffocated by them, but only for a moment. There seemed a\ngreat buzz and flutter about her, and then the butterflies set to work\nto _dress_ her. And how do you think they dressed her? With\n_themselves_! They arranged themselves all over her in the cleverest\nway. One set of blue ones clustered round the hem of her little white\nnight-gown, making a thick \"_rche_,\" as it were; and then there came\ntwo or three thinner rows of yellow, and then blue again. Round her\nwaist they made the loveliest belt of mingled blue and yellow, and all\nover the upper part of her night-gown, in and out among the pretty white\nfrills which Dorcas herself \"goffered,\" so nicely, they made themselves\ninto fantastic trimmings of every shape and kind; bows, rosettes--I\ncannot tell you what they did not imitate.\n\nPerhaps the prettiest ornament of all was the coronet or wreath they\nmade of themselves for her head, dotting over her curly brown hair too\nwith butterfly spangles, which quivered like dew-drops as she moved\nabout. No one would have known Griselda; she looked like a fairy queen,\nor princess, at least, for even her little white feet had what _looked_\nlike butterfly shoes upon them, though these, you will understand, were\nonly a sort of make-believe, as, of course, the shoes were soleless.\n\n\"Now,\" said the cuckoo, when at last all was quiet again, and every blue\nand every yellow butterfly seemed settled in his place, \"now, Griselda,\ncome and look at yourself.\"\n\nHe led the way to a marble basin, into which fell the waters of one of\nthe tinkling brooks that were to be found everywhere about the garden,\nand bade Griselda look into the water mirror. It danced about rather;\nbut still she was quite able to see herself. She peered in with great\nsatisfaction, turning herself round so as to see first over one\nshoulder, then over the other.\n\n\"It _is_ lovely,\" she said at last. \"But, cuckoo, I'm just thinking--how\nshall I possibly be able to sit down without crushing ever so many?\"\n\n\"Bless you, you needn't trouble about that,\" said the cuckoo; \"the\nbutterflies are quite able to take care of themselves. You don't suppose\nyou are the first little girl they have ever made a dress for?\"\n\nGriselda said no more, but followed the cuckoo, walking rather\n\"gingerly,\" notwithstanding his assurances that the butterflies could\ntake care of themselves. At last the cuckoo stopped, in front of a sort\nof banked-up terrace, in the centre of which grew a strange-looking\nplant with large, smooth, spreading-out leaves, and on the two topmost\nleaves, their splendid wings glittering in the sunshine, sat two\nmagnificent butterflies. They were many times larger than any Griselda\nhad yet seen; in fact, the cuckoo himself looked rather small beside\nthem, and they were _so_ beautiful that Griselda felt quite over-awed.\nYou could not have said what colour they were, for at the faintest\nmovement they seemed to change into new colours, each more exquisite\nthan the last. Perhaps I could best give you an idea of them by saying\nthat they were like living rainbows.\n\n\"Are those the king and queen?\" asked Griselda in a whisper.\n\n\"Yes,\" said the cuckoo. \"Do you admire them?\"\n\n\"I should rather think I did,\" said Griselda. \"But, cuckoo, do they\nnever do anything but lie there in the sunshine?\"\n\n\"Oh, you silly girl,\" exclaimed the cuckoo, \"always jumping at\nconclusions. No, indeed, that is not how they manage things in\nbutterfly-land. The king and queen have worked harder than any other\nbutterflies. They are chosen every now and then, out of all the others,\nas being the most industrious and the cleverest of all the\nworld-flower-painters, and then they are allowed to rest, and are fed on\nthe finest essences, so that they grow as splendid as you see. But even\nnow they are not idle; they superintend all the work that is done, and\nchoose all the new colours.\"\n\n\"Dear me!\" said Griselda, under her breath, \"how clever they must be.\"\n\nJust then the butterfly king and queen stretched out their magnificent\nwings, and rose upwards, soaring proudly into the air.\n\n\"Are they going away?\" said Griselda in a disappointed tone.\n\n\"Oh no,\" said the cuckoo; \"they are welcoming you. Hold out your hands.\"\n\nGriselda held out her hands, and stood gazing up into the sky. In a\nminute or two the royal butterflies appeared again, slowly, majestically\ncircling downwards, till at length they alighted on Griselda's little\nhands, the king on the right, the queen on the left, almost covering her\nfingers with their great dazzling wings.\n\n\"You _do_ look nice now,\" said the cuckoo, hopping back a few steps and\nlooking up at Griselda approvingly; \"but it's time for the feast to\nbegin, as it won't do for us to be late.\"\n\nThe king and queen appeared to understand. They floated away from\nGriselda's hands and settled themselves, this time, at one end of a\nbeautiful little grass plot or lawn, just below the terrace where grew\nthe large-leaved plant. This was evidently their dining-room, for no\nsooner were they in their place than butterflies of every kind and\ncolour came pouring in, in masses, from all directions. Butterflies\nsmall and butterflies large; butterflies light and butterflies dark;\nbutterflies blue, pink, crimson, green, gold-colour--_every_ colour, and\nfar, far more colours than you could possibly imagine.\n\nThey all settled down, round the sides of the grassy dining-table, and\nin another minute a number of small white butterflies appeared, carrying\namong them flower petals carefully rolled up, each containing a drop of\nliquid. One of these was presented to the king, and then one to the\nqueen, who each sniffed at their petal for an instant, and then passed\nit on to the butterfly next them, whereupon fresh petals were handed to\nthem, which they again passed on.\n\n\"What are they doing, cuckoo?\" said Griselda; \"that's not _eating_.\"\n\n\"It's their kind of eating,\" he replied. \"They don't require any other\nkind of food than a sniff of perfume; and as there are perfumes\nextracted from every flower in butterfly-land, and there are far more\nflowers than you could count between now and Christmas, you must allow\nthere is plenty of variety of dishes.\"\n\n\"Um-m,\" said Griselda; \"I suppose there is. But all the same, cuckoo,\nit's a very good thing I'm not hungry, isn't it? May I pour the scent on\nmy pocket-handkerchief when it comes round to me? I have my handkerchief\nhere, you see. Isn't it nice that I brought it? It was under my pillow,\nand I wrapped it round my hand to open the shutter, for the hook\nscratched it once.\"\n\n\"You may pour one drop on your handkerchief,\" said the cuckoo, \"but not\nmore. I shouldn't like the butterflies to think you greedy.\"\n\nBut Griselda grew very tired of the scent feast long before all the\npetals had been passed round. The perfumes were very nice, certainly,\nbut there were such quantities of them--double quantities in honour of\nthe guest, of course! Griselda screwed up her handkerchief into a tight\nlittle ball, so that the one drop of scent should not escape from it,\nand then she kept sniffing at it impatiently, till at last the cuckoo\nasked her what was the matter.\n\n\"I am so tired of the feast,\" she said. \"Do let us do something else,\ncuckoo.\"\n\n\"It is getting rather late,\" said the cuckoo. \"But see, Griselda, they\nare going to have an air-dance now.\"\n\n\"What's that?\" said Griselda.\n\n\"Look, and you'll see,\" he replied.\n\nFlocks and flocks of butterflies were rising a short way into the air,\nand there arranging themselves in bands according to their colours.\n\n\"Come up on to the bank,\" said the cuckoo to Griselda; \"you'll see them\nbetter.\"\n\nGriselda climbed up the bank, and as from there she could look down on\nthe butterfly show, she saw it beautifully. The long strings of\nbutterflies twisted in and out of each other in the most wonderful way,\nlike ribbons of every hue plaiting themselves and then in an instant\nunplaiting themselves again. Then the king and queen placed themselves\nin the centre, and round and round in moving circles twisted and\nuntwisted the brilliant bands of butterflies.\n\n\"It's like a kaleidoscope,\" said Griselda; \"and now it's like those\ntwisty-twirly dissolving views that papa took me to see once. It's\n_just_ like them. Oh, how pretty! Cuckoo, are they doing it all on\npurpose to please me?\"\n\n\"A good deal,\" said the cuckoo. \"Stand up and clap your hands loud three\ntimes, to show them you're pleased.\"\n\nGriselda obeyed. \"Clap\" number one--all the butterflies rose up into the\nair in a cloud; clap number two--they all fluttered and twirled and\nbuzzed about, as if in the greatest excitement; clap number three--they\nall turned in Griselda's direction with a rush.\n\n\"They're going to kiss you, Griselda,\" cried the cuckoo.\n\nGriselda felt her breath going. Up above her was the vast feathery cloud\nof butterflies, fluttering, _rushing_ down upon her.\n\n\"Cuckoo, cuckoo,\" she screamed, \"they'll suffocate me. Oh, cuckoo!\"\n\n\"Shut your eyes, and clap your hands loud, very loud,\" called out the\ncuckoo.\n\nAnd just as Griselda clapped her hands, holding her precious\nhandkerchief between her teeth, she heard him give his usual cry,\n\"Cuckoo, cuckoo.\"\n\n_Clap_--where were they all?\n\nGriselda opened her eyes--garden, butterflies, cuckoo, all had\ndisappeared. She was in bed, and Dorcas was knocking at the door with\nthe hot water.\n\n\"Miss Grizzel said I was to wake you at your usual time this morning,\nmissie,\" she said. \"I hope you don't feel too tired to get up.\"\n\n\"Tired! I should think not,\" replied Griselda. \"I was awake this morning\nages before you, I can tell you, my dear Dorcas. Come here for a minute,\nDorcas, please,\" she went on. \"There now, sniff my handkerchief. What do\nyou think of that?\"\n\n\"It's beautiful,\" said Dorcas. \"It's out of the big blue chinay bottle\non your auntie's table, isn't it, missie?\"\n\n\"Stuff and nonsense,\" replied Griselda; \"it's scent of my own, Dorcas.\nAunt Grizzel never had any like it in her life. There now! Please give\nme my slippers, I want to get up and look over my lessons for Mr.\nKneebreeches before he comes. Dear me,\" she added to herself, as she\nwas putting on her slippers, \"how pretty my feet did look with the blue\nbutterfly shoes! It was very good of the cuckoo to take me there, but I\ndon't think I shall ever wish to be a butterfly again, now I know how\nhard they work! But I'd like to do my lessons well to-day. I fancy it'll\nplease the dear old cuckoo.\"\n\n\n\n\nCHAPTER VIII. MASTER PHIL.\n\n\n      \"Who comes from the world of flowers?\n    Daisy and crocus, and sea-blue bell,\n    And violet shrinking in dewy cell--\n    Sly cells that know the secrets of night,\n    When earth is bathed in fairy light--\n      Scarlet, and blue, and golden flowers.\"\n\n\nAnd so Mr. Kneebreeches had no reason to complain of his pupil that day.\n\nAnd Miss Grizzel congratulated herself more heartily than ever on her\nwise management of children.\n\nAnd Miss Tabitha repeated that Sister Grizzel might indeed congratulate\nherself.\n\nAnd Griselda became gradually more and more convinced that the only way\nas yet discovered of getting through hard tasks is to set to work and\ndo them; also, that grumbling, as things are at present arranged in this\nworld, does not _always_, nor I may say _often_, do good; furthermore,\nthat an ill-tempered child is not, on the whole, likely to be as much\nloved as a good-tempered one; lastly, that if you wait long enough,\nwinter will go and spring will come.\n\nFor this was the case this year, after all! Spring had only been sleepy\nand lazy, and in such a case what could poor old winter do but fill the\nvacant post till she came? Why he should be so scolded and reviled for\nfaithfully doing his best, as he often is, I really don't know. Not that\nall the ill words he gets have much effect on him--he comes again just\nas usual, whatever we say of or to him. I suppose his feelings have long\nago been frozen up, or surely before this he would have taken\noffence--well for us that he has not done so!\n\nBut when the spring did come at last this year, it would be impossible\nfor me to tell you how Griselda enjoyed it. It was like new life to her\nas well as to the plants, and flowers, and birds, and insects. Hitherto,\nyou see, she had been able to see very little of the outside of her\naunt's house; and charming as the inside was, the outside, I must say,\nwas still \"charminger.\" There seemed no end to the little up-and-down\npaths and alleys, leading to rustic seats and quaint arbours; no limits\nto the little pine-wood, down into which led the dearest little\nzig-zaggy path you ever saw, all bordered with snow-drops and primroses\nand violets, and later on with periwinkles, and wood anemones, and those\nbright, starry, white flowers, whose name no two people agree about.\n\nThis wood-path was the place, I think, which Griselda loved the best.\nThe bowling-green was certainly very delightful, and so was the terrace\nwhere the famous roses grew; but lovely as the roses were (I am\nspeaking just now, of course, of later on in the summer, when they were\nall in bloom), Griselda could not enjoy them as much as the\nwild-flowers, for she was forbidden to gather or touch them, except with\nher funny round nose!\n\n\"You may _scent_ them, my dear,\" said Miss Grizzel, who was of opinion\nthat smell was not a pretty word; \"but I cannot allow anything more.\"\n\nAnd Griselda did \"scent\" them, I assure you. She burrowed her whole rosy\nface in the big ones; but gently, for she did not want to spoil them,\nboth for her aunt's sake, and because, too, she had a greater regard for\nflowers now that she knew the secret of how they were painted, and what\na great deal of trouble the butterflies take about them.\n\nBut after a while one grows tired of \"scenting\" roses; and even the\ntrying to walk straight across the bowling-green with her eyes shut,\nfrom the arbour at one side to the arbour exactly like it at the other,\ngrew stupid, though no doubt it would have been capital fun with a\ncompanion to applaud or criticize.\n\nSo the wood-path became Griselda's favourite haunt. As the summer grew\non, she began to long more than ever for a companion--not so much for\nplay, as for some one to play with. She had lessons, of course, just as\nmany as in the winter; but with the long days, there seemed to come a\nquite unaccountable increase of play-time, and Griselda sometimes found\nit hang heavy on her hands. She had not seen or heard anything of the\ncuckoo either, save, of course, in his \"official capacity\" of\ntime-teller, for a very long time.\n\n\"I suppose,\" she thought, \"he thinks I don't need amusing, now that the\nfine days are come and I can play in the garden; and certainly, if I\nhad _any one_ to play with, the garden would be perfectly lovely.\"\n\nBut, failing companions, she did the best she could for herself, and\nthis was why she loved the path down into the wood so much. There was a\nsort of mystery about it; it might have been the path leading to the\ncottage of Red-Ridinghood's grandmother, or a path leading to fairyland\nitself. There were all kinds of queer, nice, funny noises to be heard\nthere--in one part of it especially, where Griselda made herself a seat\nof some moss-grown stones, and where she came so often that she got to\nknow all the little flowers growing close round about, and even the\nparticular birds whose nests were hard by.\n\nShe used to sit there and _fancy_--fancy that she heard the wood-elves\nchattering under their breath, or the little underground gnomes and\nkobolds hammering at their fairy forges. And the tinkling of the brook\nin the distance sounded like the enchanted bells round the necks of the\nfairy kine, who are sent out to pasture sometimes on the upper world\nhill-sides. For Griselda's head was crammed full, perfectly full, of\nfairy lore; and the mandarins' country, and butterfly-land, were quite\nas real to her as the every-day world about her.\n\nBut all this time she was not forgotten by the cuckoo, as you will see.\n\nOne day she was sitting in her favourite nest, feeling, notwithstanding\nthe sunshine, and the flowers, and the soft sweet air, and the pleasant\nsounds all about, rather dull and lonely. For though it was only May, it\nwas really quite a hot day, and Griselda had been all the morning at her\nlessons, and had tried very hard, and done them very well, and now she\nfelt as if she deserved some reward. Suddenly in the distance, she heard\na well-known sound, \"Cuckoo, cuckoo.\"\n\n\"Can that be the cuckoo?\" she said to herself; and in a moment she felt\nsure that it must be. For, for some reason that I do not know enough\nabout the habits of real \"flesh and blood\" cuckoos to explain, that bird\nwas not known in the neighbourhood where Griselda's aunts lived. Some\ntwenty miles or so further south it was heard regularly, but all this\nspring Griselda had never caught the sound of its familiar note, and she\nnow remembered hearing it never came to these parts.\n\nSo, \"it must be my cuckoo,\" she said to herself. \"He must be coming out\nto speak to me. How funny! I have never seen him by daylight.\"\n\nShe listened. Yes, again there it was, \"Cuckoo, cuckoo,\" as plain as\npossible, and nearer than before.\n\n\"Cuckoo,\" cried Griselda, \"do come and talk to me. It's such a long time\nsince I have seen you, and I have nobody to play with.\"\n\nBut there was no answer. Griselda held her breath to listen, but there\nwas nothing to be heard.\n\n\"Unkind cuckoo!\" she exclaimed. \"He is tricking me, I do believe; and\nto-day too, just when I was so dull and lonely.\"\n\nThe tears came into her eyes, and she was beginning to think herself\nvery badly used, when suddenly a rustling in the bushes beside her made\nher turn round, more than half expecting to see the cuckoo himself. But\nit was not he. The rustling went on for a minute or two without anything\nmaking its appearance, for the bushes were pretty thick just there, and\nany one scrambling up from the pinewood below would have had rather hard\nwork to get through, and indeed for a very big person such a feat would\nhave been altogether impossible.\n\nIt was not a very big person, however, who was causing all the rustling,\nand crunching of branches, and general commotion, which now absorbed\nGriselda's attention. She sat watching for another minute in perfect\nstillness, afraid of startling by the slightest movement the squirrel or\nrabbit or creature of some kind which she expected to see. At last--was\nthat a squirrel or rabbit--that rosy, round face, with shaggy, fair hair\nfalling over the eager blue eyes, and a general look of breathlessness\nand over-heatedness and determination?\n\nA squirrel or a rabbit! No, indeed, but a very sturdy, very merry, very\nragged little boy.\n\n\"Where are that cuckoo? Does _you_ know?\" were the first words he\nuttered, as soon as he had fairly shaken himself, though not by any\nmeans all his clothes, free of the bushes (for ever so many pieces of\njacket and knickerbockers, not to speak of one boot and half his hat,\nhad been left behind on the way), and found breath to say something.\n\n[\"WHERE ARE THAT CUCKOO?\"]\n\nGriselda stared at him for a moment without speaking. She was so\nastonished. It was months since she had spoken to a child, almost since\nshe had seen one, and about children younger than herself she knew very\nlittle at any time, being the baby of the family at home, you see,\nand having only big brothers older than herself for play-fellows.\n\n\"Who are you?\" she said at last. \"What's your name, and what do you\nwant?\"\n\n\"My name's Master Phil, and I want that cuckoo,\" answered the little\nboy. \"He camed up this way. I'm sure he did, for he called me all the\nway.\"\n\n\"He's not here,\" said Griselda, shaking her head; \"and this is my aunts'\ngarden. No one is allowed to come here but friends of theirs. You had\nbetter go home; and you have torn your clothes so.\"\n\n\"This aren't a garden,\" replied the little fellow undauntedly, looking\nround him; \"this are a wood. There are blue-bells and primroses here,\nand that shows it aren't a garden--not anybody's garden, I mean, with\nwalls round, for nobody to come in.\"\n\n\"But it _is_,\" said Griselda, getting rather vexed.\n\n\"If it isn't a garden it's _grounds_, private grounds, and nobody\nshould come without leave. This path leads down to the wood, and there's\na door in the wall at the bottom to get into the lane. You may go down\nthat way, little boy. No one comes scrambling up the way you did.\"\n\n\"But I want to find the cuckoo,\" said the little boy. \"I do so want to\nfind the cuckoo.\"\n\nHis voice sounded almost as if he were going to cry, and his pretty,\nhot, flushed face puckered up. Griselda's heart smote her; she looked at\nhim more carefully. He was such a very little boy, after all; she did\nnot like to be cross to him.\n\n\"How old are you?\" she asked.\n\n\"Five and a bit. I had a birthday after the summer, and if I'm good,\nnurse says perhaps I'll have one after next summer too. Do you ever have\nbirthdays?\" he went on, peering up at Griselda. \"Nurse says she used to\nwhen she was young, but she never has any now.\"\n\n\"_Have_ you a nurse?\" asked Griselda, rather surprised; for, to tell the\ntruth, from \"Master Phil's\" appearance, she had not felt at all sure\nwhat _sort_ of little boy he was, or rather what sort of people he\nbelonged to.\n\n\"Of course I have a nurse, and a mother too,\" said the little boy,\nopening wide his eyes in surprise at the question. \"Haven't you? Perhaps\nyou're too big, though. People leave off having nurses and mothers when\nthey're big, don't they? Just like birthdays. But _I_ won't. I won't\nnever leave off having a mother, any way. I don't care so much about\nnurse and birthdays, not _kite_ so much. Did you care when you had to\nleave off, when you got too big?\"\n\n\"I hadn't to leave off because I got big,\" said Griselda sadly. \"I left\noff when I was much littler than you,\" she went on, unconsciously\nspeaking as Phil would best understand her. \"My mother died.\"\n\n\"I'm werry sorry,\" said Phil; and the way in which he said it quite\novercame Griselda's unfriendliness. \"But perhaps you've a nice nurse. My\nnurse is rather nice; but she _will_ 'cold me to-day, won't she?\" he\nadded, laughing, pointing to the terrible rents in his garments. \"These\nare my very oldestest things; that's a good thing, isn't it? Nurse says\nI don't look like Master Phil in these, but when I have on my blue\nwelpet, then I look like Master Phil. I shall have my blue welpet when\nmother comes.\"\n\n\"Is your mother away?\" said Griselda.\n\n\"Oh yes, she's been away a long time; so nurse came here to take care of\nme at the farmhouse, you know. Mother was ill, but she's better now, and\nsome day she'll come too.\"\n\n\"Do you like being at the farmhouse? Have you anybody to play with?\"\nsaid Griselda.\n\nPhil shook his curly head. \"I never have anybody to play with,\" he said.\n\"I'd like to play with you if you're not too big. And do you think you\ncould help me to find the cuckoo?\" he added insinuatingly.\n\n\"What do you know about the cuckoo?\" said Griselda.\n\n\"He called me,\" said Phil, \"he called me lots of times; and to-day nurse\nwas busy, so I thought I'd come. And do you know,\" he added\nmysteriously, \"I do believe the cuckoo's a fairy, and when I find him\nI'm going to ask him to show me the way to fairyland.\"\n\n\"He says we must all find the way ourselves,\" said Griselda, quite\nforgetting to whom she was speaking.\n\n\"_Does_ he?\" cried Phil, in great excitement. \"Do you know him, then?\nand have you asked him? Oh, do tell me.\"\n\nGriselda recollected herself. \"You couldn't understand,\" she said. \"Some\nday perhaps I'll tell you--I mean if ever I see you again.\"\n\n\"But I may see you again,\" said Phil, settling himself down comfortably\nbeside Griselda on her mossy stone. \"You'll let me come, won't you? I\nlike to talk about fairies, and nurse doesn't understand. And if the\ncuckoo knows you, perhaps that's why he called me to come to play with\nyou.\"\n\n\"How did he call you?\" asked Griselda.\n\n\"First,\" said Phil gravely, \"it was in the night. I was asleep, and I\nhad been wishing I had somebody to play with, and then I d'eamed of the\ncuckoo--such a nice d'eam. And when I woke up I heard him calling me,\nand I wasn't d'eaming then. And then when I was in the field he called\nme, but I _couldn't_ find him, and nurse said 'Nonsense.' And to-day he\ncalled me again, so I camed up through the bushes. And mayn't I come\nagain? Perhaps if we both tried together we could find the way to\nfairyland. Do you think we could?\"\n\n\"I don't know,\" said Griselda, dreamily.\n\n\"There's a great deal to learn first, the cuckoo says.\"\n\n\"Have you learnt a great deal?\" (he called it \"a gate deal\") asked Phil,\nlooking up at Griselda with increased respect. \"_I_ don't know scarcely\nnothing. Mother was ill such a long time before she went away, but I\nknow she wanted me to learn to read books. But nurse is too old to teach\nme.\"\n\n\"Shall I teach you?\" said Griselda. \"I can bring some of my old books\nand teach you here after I have done my own lessons.\"\n\n\"And then mother _would_ be surprised when she comes back,\" said Master\nPhil, clapping his hands. \"Oh, _do_. And when I've learnt to read a\ngreat deal, do you think the cuckoo would show us the way to fairyland?\"\n\n\"I don't think it was that sort of learning he meant,\" said Griselda.\n\"But I dare say that would help. I _think_,\" she went on, lowering her\nvoice a little, and looking down gravely into Phil's earnest eyes, \"I\n_think_ he means mostly learning to be very good--very, _very_ good, you\nknow.\"\n\n\"Gooder than you?\" said Phil.\n\n\"Oh dear, yes; lots and lots gooder than me,\" replied Griselda.\n\n\"_I_ think you're very good,\" observed Phil, in a parenthesis. Then he\nwent on with his cross-questioning.\n\n\"Gooder than mother?\"\n\n\"I don't know your mother, so how can I tell how good she is?\" said\nGriselda.\n\n\"_I_ can tell you,\" said Phil, importantly. \"She is just as good as--as\ngood as--as good as _good_. That's what she is.\"\n\n\"You mean she couldn't be better,\" said Griselda, smiling.\n\n\"Yes, that'll do, if you like. Would that be good enough for us to be,\ndo you think?\"\n\n\"We must ask the cuckoo,\" said Griselda. \"But I'm sure it would be a\ngood thing for you to learn to read. You must ask your nurse to let you\ncome here every afternoon that it's fine, and I'll ask my aunt.\"\n\n\"I needn't ask nurse,\" said Phil composedly; \"she'll never know where I\nam, and I needn't tell her. She doesn't care what I do, except tearing\nmy clothes; and when she scolds me, _I_ don't care.\"\n\n\"_That_ isn't good, Phil,\" said Griselda gravely. \"You'll never be as\ngood as good if you speak like that.\"\n\n\"What should I say, then? Tell me,\" said the little boy submissively.\n\n\"You should ask nurse to let you come to play with me, and tell her I'm\nmuch bigger than you, and I won't let you tear your clothes. And you\nshould tell her you're very sorry you've torn them to-day.\"\n\n\"Very well,\" said Phil, \"I'll say that. But, oh see!\" he exclaimed,\ndarting off, \"there's a field mouse! If only I could catch him!\"\n\nOf course he couldn't catch him, nor could Griselda either; very ready,\nthough, she was to do her best. But it was great fun all the same, and\nthe children laughed heartily and enjoyed themselves tremendously. And\nwhen they were tired they sat down again and gathered flowers for\nnosegays, and Griselda was surprised to find how clever Phil was about\nit. He was much quicker than she at spying out the prettiest blossoms,\nhowever hidden behind tree, or stone, or shrub. And he told her of all\nthe best places for flowers near by, and where grew the largest\nprimroses and the sweetest violets, in a way that astonished her.\n\n\"You're such a little boy,\" she said; \"how do you know so much about\nflowers?\"\n\n\"I've had no one else to play with,\" he said innocently. \"And then, you\nknow, the fairies are so fond of them.\"\n\nWhen Griselda thought it was time to go home, she led little Phil down\nthe wood-path, and through the door in the wall opening on to the lane.\n\n\"Now you can find your way home without scrambling through any more\nbushes, can't you, Master Phil?\" she said.\n\n\"Yes, thank you, and I'll come again to that place to-morrow afternoon,\nshall I?\" asked Phil. \"I'll know when--after I've had my dinner and\nraced three times round the big field, then it'll be time. That's how it\nwas to-day.\"\n\n\"I should think it would do if you _walked_ three times--or twice if you\nlike--round the field. It isn't a good thing to race just when you've\nhad your dinner,\" observed Griselda sagely. \"And you mustn't try to come\nif it isn't fine, for my aunts won't let me go out if it rains even the\ntiniest bit And of course you must ask your nurse's leave.\"\n\n\"Very well,\" said little Phil as he trotted off. \"I'll try to remember\nall those things. I'm so glad you'll play with me again; and if you see\nthe cuckoo, please thank him.\"\n\n\n\n\nCHAPTER IX. UP AND DOWN THE CHIMNEY.\n\n\n     \"_Helper_. Well, but if it was all dream, it would be the same as if\n     it was all real, would it not?\n\n     \"_Keeper_. Yes, I see. I mean, Sir, I do _not_ see.\"--_A Liliput\n     Revel_.\n\n\n_Not_ having \"just had her dinner,\" and feeling very much inclined for\nher tea, Griselda ran home at a great rate.\n\nShe felt, too, in such good spirits; it had been so delightful to have a\ncompanion in her play.\n\n\"What a good thing it was I didn't make Phil run away before I found out\nwhat a nice little boy he was,\" she said to herself. \"I must look out my\nold reading books to-night. I shall so like teaching him, poor little\nboy, and the cuckoo will be pleased at my doing something useful, I'm\nsure.\"\n\nTea was quite ready, in fact waiting for her, when she came in. This was\na meal she always had by herself, brought up on a tray to Dorcas's\nlittle sitting-room, where Dorcas waited upon her. And sometimes when\nGriselda was in a particularly good humour she would beg Dorcas to sit\ndown and have a cup of tea with her--a liberty the old servant was far\ntoo dignified and respectful to have thought of taking, unless specially\nrequested to do so.\n\nThis evening, as you know, Griselda was in a very particularly good\nhumour, and besides this, so very full of her adventures, that she would\nhave been glad of an even less sympathising listener than Dorcas was\nlikely to be.\n\n\"Sit down, Dorcas, and have some more tea, do,\" she said coaxingly. \"It\nlooks ever so much more comfortable, and I'm sure you could eat a\nlittle more if you tried, whether you've had your tea in the kitchen or\nnot. I'm _fearfully_ hungry, I can tell you. You'll have to cut a whole\nlot more bread and butter, and not 'ladies' slices' either.\"\n\n\"How your tongue does go, to be sure, Miss Griselda,\" said Dorcas,\nsmiling, as she seated herself on the chair Griselda had drawn in for\nher.\n\n\"And why shouldn't it?\" said Griselda saucily. \"It doesn't do it any\nharm. But oh, Dorcas, I've had such fun this afternoon--really, you\ncouldn't guess what I've been doing.\"\n\n\"Very likely not, missie,\" said Dorcas.\n\n\"But you might try to guess. Oh no, I don't think you need--guessing\ntakes such a time, and I want to tell you. Just fancy, Dorcas, I've been\nplaying with a little boy in the wood.\"\n\n\"Playing with a little boy, Miss Griselda!\" exclaimed Dorcas, aghast.\n\n\"Yes, and he's coming again to-morrow, and the day after, and every\nday, I dare say,\" said Griselda. \"He _is_ such a nice little boy.\"\n\n\"But, missie,\" began Dorcas.\n\n\"Well? What's the matter? You needn't look like that--as if I had done\nsomething naughty,\" said Griselda sharply.\n\n\"But you'll tell your aunt, missie?\"\n\n\"Of course,\" said Griselda, looking up fearlessly into Dorcas's face\nwith her bright grey eyes. \"Of course; why shouldn't I? I must ask her\nto give the little boy leave to come into _our_ grounds; and I told the\nlittle boy to be sure to tell his nurse, who takes care of him, about\nhis playing with me.\"\n\n\"His nurse,\" repeated Dorcas, in a tone of some relief. \"Then he must be\nquite a little boy, perhaps Miss Grizzel would not object so much in\nthat case.\"\n\n\"Why should she object at all? She might know I wouldn't want to play\nwith a naughty rude boy,\" said Griselda.\n\n\"She thinks all boys rude and naughty, I'm afraid, missie,\" said Dorcas.\n\"All, that is to say, excepting your dear papa. But then, of course, she\nhad the bringing up of _him_ in her own way from the beginning.\"\n\n\"Well, I'll ask her, any way,\" said Griselda, \"and if she says I'm not\nto play with him, I shall think--I know what I shall _think_ of Aunt\nGrizzel, whether I _say_ it or not.\"\n\nAnd the old look of rebellion and discontent settled down again on her\nrosy face.\n\n\"Be careful, missie, now do, there's a dear good girl,\" said Dorcas\nanxiously, an hour later, when Griselda, dressed as usual in her little\nwhite muslin frock, was ready to join her aunts at dessert.\n\nBut Griselda would not condescend to make any reply.\n\n\"Aunt Grizzel,\" she said suddenly, when she had eaten an orange and\nthree biscuits and drunk half a glass of home-made elderberry wine,\n\"Aunt Grizzel, when I was out in the garden to-day--down the wood-path,\nI mean--I met a little boy, and he played with me, and I want to know if\nhe may come every day to play with me.\"\n\nGriselda knew she was not making her request in a very amiable or\nbecoming manner; she knew, indeed, that she was making it in such a way\nas was almost certain to lead to its being refused; and yet, though she\nwas really so very, very anxious to get leave to play with little Phil,\nshe took a sort of spiteful pleasure in injuring her own cause.\n\nHow _foolish_ ill-temper makes us! Griselda had allowed herself to get\nso angry at the _thought_ of being thwarted that had her aunt looked up\nquietly and said at once, \"Oh yes, you may have the little boy to play\nwith you whenever you like,\" she would really, in a strange distorted\nsort of way, have been _disappointed_.\n\nBut, of course, Miss Grizzel made no such reply. Nothing less than a\nmiracle could have made her answer Griselda otherwise than as she did.\nLike Dorcas, for an instant, she was utterly \"flabbergasted,\" if you\nknow what that means. For she was really quite an old lady, you know,\nand sensible as she was, things upset her much more easily than when she\nwas younger.\n\nNaughty Griselda saw her uneasiness, and enjoyed it.\n\n\"Playing with a boy!\" exclaimed Miss Grizzel. \"A boy in my grounds, and\nyou, my niece, to have played with him!\"\n\n\"Yes,\" said Griselda coolly, \"and I want to play with him again.\"\n\n\"Griselda,\" said her aunt, \"I am too astonished to say more at present.\nGo to bed.\"\n\n\"Why should I go to bed? It is not my bed-time,\" cried Griselda, blazing\nup. \"What have I done to be sent to bed as if I were in disgrace?\"\n\n\"Go to bed,\" repeated Miss Grizzel. \"I will speak to you to-morrow.\"\n\n\"You are very unfair and unjust,\" said Griselda, starting up from her\nchair. \"That's all the good of being honest and telling everything. I\nmight have played with the little boy every day for a month and you\nwould never have known, if I hadn't told you.\"\n\nShe banged across the room as she spoke, and out at the door, slamming\nit behind her rudely. Then upstairs like a whirlwind; but when she got\nto her own room, she sat down on the floor and burst into tears, and\nwhen Dorcas came up, nearly half an hour later, she was still in the\nsame place, crouched up in a little heap, sobbing bitterly.\n\n\"Oh, missie, missie,\" said Dorcas, \"it's just what I was afraid of!\"\n\nAs Griselda rushed out of the room Miss Grizzel leant back in her chair\nand sighed deeply.\n\n\"Already,\" she said faintly. \"She was never so violent before. Can one\nafternoon's companionship with rudeness have already contaminated her?\nAlready, Tabitha--can it be so?\"\n\n\"Already,\" said Miss Tabitha, softly shaking her head, which somehow\nmade her look wonderfully like an old cat, for she felt cold of an\nevening and usually wore a very fine woolly shawl of a delicate grey\nshade, and the borders of her cap and the ruffles round her throat and\nwrists were all of fluffy, downy white--\"already,\" she said.\n\n\"Yet,\" said Miss Grizzel, recovering herself a little, \"it is true what\nthe child said. She might have deceived us. Have I been hard upon her,\nSister Tabitha?\"\n\n\"Hard upon her! Sister Grizzel,\" said Miss Tabitha with more energy than\nusual; \"no, certainly not. For once, Sister Grizzel, I disagree with\nyou. Hard upon her! Certainly not.\"\n\nBut Miss Grizzel did not feel happy.\n\nWhen she went up to her own room at night she was surprised to find\nDorcas waiting for her, instead of the younger maid.\n\n\"I thought you would not mind having me, instead of Martha, to-night,\nma'am,\" she said, \"for I did so want to speak to you about Miss\nGriselda. The poor, dear young lady has gone to bed so very unhappy.\"\n\n\"But do you know what she has done, Dorcas?\" said Miss Grizzel.\n\"Admitted a _boy_, a rude, common, impertinent _boy_, into my precincts,\nand played with him--with a _boy_, Dorcas.\"\n\n\"Yes, ma'am,\" said Dorcas. \"I know all about it, ma'am. Miss Griselda\nhas told me all. But if you would allow me to give an opinion, it isn't\nquite so bad. He's quite a little boy, ma'am--between five and six--only\njust about the age Miss Griselda's dear papa was when he first came to\nus, and, by all I can hear, quite a little gentleman.\"\n\n\"A little gentleman,\" repeated Miss Grizzel, \"and not six years old!\nThat is less objectionable than I expected. What is his name, as you\nknow so much, Dorcas?\"\n\n\"Master Phil,\" replied Dorcas. \"That is what he told Miss Griselda, and\nshe never thought to ask him more. But I'll tell you how we could get to\nhear more about him, I think, ma'am. From what Miss Griselda says, I\nbelieve he is staying at Mr. Crouch's farm, and that, you know, ma'am,\nbelongs to my Lady Lavander, though it is a good way from Merrybrow\nHall. My lady is pretty sure to know about the child, for she knows all\nthat goes on among her tenants, and I remember hearing that a little\ngentleman and his nurse had come to Mr. Crouch's to lodge for six\nmonths.\"\n\nMiss Grizzel listened attentively.\n\n\"Thank you, Dorcas,\" she said, when the old servant had left off\nspeaking. \"You have behaved with your usual discretion. I shall drive\nover to Merrybrow to-morrow, and make inquiry. And you may tell Miss\nGriselda in the morning what I purpose doing; but tell her also that,\nas a punishment for her rudeness and ill-temper, she must have breakfast\nin her own room to-morrow, and not see me till I send for her. Had she\nrestrained her temper and explained the matter, all this distress might\nhave been saved.\"\n\nDorcas did not wait till \"to-morrow morning;\" she could not bear to\nthink of Griselda's unhappiness. From her mistress's room she went\nstraight to the little girl's, going in very softly, so as not to\ndisturb her should she be sleeping.\n\n\"Are you awake, missie?\" she said gently.\n\nGriselda started up.\n\n\"Yes,\" she exclaimed. \"Is it you, cuckoo? I'm quite awake.\"\n\n\"Bless the child,\" said Dorcas to herself, \"how her head does run on\nMiss Sybilla's cuckoo. It's really wonderful. There's more in such\nthings than some people think.\"\n\nBut aloud she only replied--\n\n\"It's Dorcas, missie. No fairy, only old Dorcas come to comfort you a\nbit. Listen, missie. Your auntie is going over to Merrybrow Hall\nto-morrow to inquire about this little Master Phil from my Lady\nLavander, for we think it's at one of her ladyship's farms that he and\nhis nurse are staying, and if she hears that he's a nice-mannered little\ngentleman, and comes of good parents--why, missie, there's no saying but\nthat you'll get leave to play with him as much as you like.\"\n\n\"But not to-morrow, Dorcas,\" said Griselda. \"Aunt Grizzel never goes to\nMerrybrow till the afternoon. She won't be back in time for me to play\nwith Phil to-morrow.\"\n\n\"No, but next day, perhaps,\" said Dorcas.\n\n\"Oh, but that won't do,\" said Griselda, beginning to cry again. \"Poor\nlittle Phil will be coming up to the wood-path _to-morrow_, and if he\ndoesn't find me, he'll be _so_ unhappy--perhaps he'll never come again\nif I don't meet him to-morrow.\"\n\nDorcas saw that the little girl was worn out and excited, and not yet\ninclined to take a reasonable view of things.\n\n\"Go to sleep, missie,\" she said kindly, \"and don't think anything more\nabout it till to-morrow It'll be all right, you'll see.\"\n\nHer patience touched Griselda.\n\n\"You are very kind, Dorcas,\" she said. \"I don't mean to be cross to\n_you_; but I can't bear to think of poor little Phil. Perhaps he'll sit\ndown on my mossy stone and cry. Poor little Phil!\"\n\nBut notwithstanding her distress, when Dorcas had left her she did feel\nher heart a little lighter, and somehow or other before long she fell\nasleep.\n\nWhen she awoke it seemed to be suddenly, and she had the feeling that\nsomething had disturbed her. She lay for a minute or two perfectly\nstill--listening. Yes; there it was--the soft, faint rustle in the air\nthat she knew so well. It seemed as if something was moving away from\nher.\n\n\"Cuckoo,\" she said gently, \"is that you?\"\n\nA moment's pause, then came the answer--the pretty greeting she\nexpected.\n\n\"Cuckoo, cuckoo,\" soft and musical. Then the cuckoo spoke.\n\n\"Well, Griselda,\" he said, \"and how are you? It's a good while since we\nhave had any fun together.\"\n\n\"That's not _my_ fault,\" said Griselda sharply. She was not yet feeling\nquite as amiable as might have been desired, you see. \"That's\n_certainly_ not my fault,\" she repeated.\n\n\"I never said it was,\" replied the cuckoo. \"Why will you jump at\nconclusions so? It's a very bad habit, for very often you jump _over_\nthem, you see, and go too far. One should always _walk_ up to\nconclusions, very slowly and evenly, right foot first, then left, one\nwith another--that's the way to get where you want to go, and feel sure\nof your ground. Do you see?\"\n\n\"I don't know whether I do or not, and I'm not going to speak to you if\nyou go on at me like that. You might see I don't want to be lectured\nwhen I am so unhappy.\"\n\n\"What are you unhappy about?\"\n\n\"About Phil, of course. I won't tell you, for I believe you know,\" said\nGriselda. \"Wasn't it you that sent him to play with me? I was so\npleased, and I thought it was very kind of you; but it's all spoilt\nnow.\"\n\n\"But I heard Dorcas saying that your aunt is going over to consult my\nLady Lavander about it,\" said the cuckoo. \"It'll be all right; you\nneedn't be in such low spirits about nothing.\"\n\n\"Were you in the room _then_?\" said Griselda. \"How funny you are,\ncuckoo. But it isn't all right. Don't you see, poor little Phil will be\ncoming up the wood-path to-morrow afternoon to meet me, and I won't be\nthere! I can't bear to think of it.\"\n\n\"Is that all?\" said the cuckoo. \"It really is extraordinary how some\npeople make troubles out of nothing! We can easily tell Phil not to come\ntill the day after. Come along.\"\n\n\"Come along,\" repeated Griselda; \"what do you mean?\"\n\n\"Oh, I forgot,\" said the cuckoo. \"You don't understand. Put out your\nhand. There, do you feel me?\"\n\n\"Yes,\" said Griselda, stroking gently the soft feathers which seemed to\nbe close under her hand. \"Yes, I feel you.\"\n\n\"Well, then,\" said the cuckoo, \"put your arms round my neck, and hold me\nfirm. I'll lift you up.\"\n\n\"How _can_ you talk such nonsense, cuckoo?\" said Griselda. \"Why, one of\nmy little fingers would clasp your neck. How can I put my arms round\nit?\"\n\n\"Try,\" said the cuckoo.\n\nSomehow Griselda had to try.\n\nShe held out her arms in the cuckoo's direction, as if she expected his\nneck to be about the size of a Shetland pony's, or a large Newfoundland\ndog's; and, to her astonishment, so it was! A nice, comfortable,\nfeathery neck it felt--so soft that she could not help laying her head\ndown upon it, and nestling in the downy cushion.\n\n\"That's right,\" said the cuckoo.\n\nThen he seemed to give a little spring, and Griselda felt herself\naltogether lifted on to his back. She lay there as comfortably as\npossible--it felt so firm as well as soft. Up he flew a little way--then\nstopped short.\n\n\"Are you all right?\" he inquired. \"You're not afraid of falling off?\"\n\n\"Oh no,\" said Griselda; \"not a bit.\"\n\n\"You needn't be,\" said the cuckoo, \"for you couldn't if you tried. I'm\ngoing on, then.\"\n\n\"Where to?\" said Griselda.\n\n\"Up the chimney first,\" said the cuckoo.\n\n\"But there'll never be room,\" said Griselda. \"I might _perhaps_ crawl up\nlike a sweep, hands and knees, you know, like going up a ladder. But\nstretched out like this--it's just as if I were lying on a sofa--I\n_couldn't_ go up the chimney.\"\n\n\"Couldn't you?\" said the cuckoo. \"We'll see. _I_ intend to go, any way,\nand to take you with me. Shut your eyes--one, two, three--here\ngoes--we'll be up the chimney before you know.\"\n\nIt was quite true. Griselda shut her eyes tight. She felt nothing but a\npleasant sort of rush. Then she heard the cuckoo's voice, saying--\n\n\"Well, wasn't that well done? Open your eyes and look about you.\"\n\nGriselda did so. Where were they?\n\nThey were floating about above the top of the house, which Griselda saw\ndown below them, looking dark and vast. She felt confused and\nbewildered.\n\n\"Cuckoo,\" she said, \"I don't understand. Is it I that have grown little,\nor you that have grown big?\"\n\n\"Whichever you please,\" said the cuckoo. \"You have forgotten. I told you\nlong ago it is all a matter of fancy.\"\n\n\"Yes, if everything grew little _together_,\" persisted Griselda; \"but it\nisn't everything. It's just you or me, or both of us. No, it can't be\nboth of us. And I don't think it can be me, for if any of me had grown\nlittle all would, and my eyes haven't grown little, for everything looks\nas big as usual, only _you_ a great deal bigger. My eyes can't have\ngrown bigger without the rest of me, surely, for the moon looks just the\nsame. And I must have grown little, or else we couldn't have got up the\nchimney. Oh, cuckoo, you have put all my thinking into such a muddle!\"\n\n\"Never mind,\" said the cuckoo. \"It'll show you how little consequence\nbig and little are of. Make yourself comfortable all the same. Are you\nall right? Shut your eyes if you like. I'm going pretty fast.\"\n\n\"Where to?\" said Griselda.\n\n\"To Phil, of course,\" said the cuckoo. \"What a bad memory you have! Are\nyou comfortable?\"\n\n\"_Very_, thank you,\" replied Griselda, giving the cuckoo's neck an\naffectionate hug as she spoke.\n\n\"That'll do, thank you. Don't throttle me, if it's quite the same to\nyou,\" said the cuckoo. \"Here goes--one, two, three,\" and off he flew\nagain.\n\nGriselda shut her eyes and lay still. It was delicious--the gliding, yet\ndarting motion, like nothing she had ever felt before. It did not make\nher the least giddy, either; but a slightly sleepy feeling came over\nher. She felt no inclination to open her eyes; and, indeed, at the rate\nthey were going, she could have distinguished very little had she done\nso.\n\nSuddenly the feeling in the air about her changed. For an instant it\nfelt more _rushy_ than before, and there was a queer, dull sound in her\nears. Then she felt that the cuckoo had stopped.\n\n\"Where are we?\" she asked.\n\n\"We've just come _down_ a chimney again,\" said the cuckoo. \"Open your\neyes and clamber down off my back, but don't speak loud, or you'll waken\nhim, and that wouldn't do. There you are--the moonlight's coming in\nnicely at the window--you can see your way.\"\n\nGriselda found herself in a little bedroom, quite a tiny one, and by the\nlook of the simple furniture and the latticed window, she saw that she\nwas not in a grand house. But everything looked very neat and nice, and\non a little bed in one corner lay a lovely sleeping child. It was Phil!\nHe looked so pretty asleep--his shaggy curls all tumbling about, his\nrosy mouth half open as if smiling, one little hand tossed over his\nhead, the other tight clasping a little basket which he had insisted on\ntaking to bed with him, meaning as soon as he was dressed the next\nmorning to run out and fill it with flowers for the little girl he had\nmade friends with.\n\nGriselda stepped up to the side of the bed on tiptoe. The cuckoo had\ndisappeared, but Griselda heard his voice. It seemed to come from a\nlittle way up the chimney.\n\n\"Don't wake him,\" said the cuckoo, \"but whisper what you want to say\ninto his ear, as soon as I have called him. He'll understand; he's\naccustomed to my ways.\"\n\nThen came the old note, soft and musical as ever--\n\n\"Cuckoo, cuckoo, cuckoo. Listen, Phil,\" said the cuckoo, and without\nopening his eyes a change passed over the little boy's face. Griselda\ncould see that he was listening to hear her message.\n\n\"He thinks he's dreaming, I suppose,\" she said to herself with a smile.\nThen she whispered softly--\n\n\"Phil, dear, don't come to play with me to-morrow, for I can't come. But\ncome the day after. I'll be at the wood-path then.\"\n\n\"Welly well,\" murmured Phil. Then he put out his two arms towards\nGriselda, all without opening his eyes, and she, bending down, kissed\nhim softly.\n\n\"Phil's so sleepy,\" he whispered, like a baby almost. Then he turned\nover and went to sleep more soundly than before.\n\n\"That'll do,\" said the cuckoo. \"Come along, Griselda.\"\n\nGriselda obediently made her way to the place whence the cuckoo's voice\nseemed to come.\n\n\"Shut your eyes and put your arms round my neck again,\" said the cuckoo.\n\nShe did not hesitate this time. It all happened just as before. There\ncame the same sort of rushy sound; then the cuckoo stopped, and\nGriselda opened her eyes.\n\nThey were up in the air again--a good way up, too, for some grand old\nelms that stood beside the farmhouse were gently waving their topmost\nbranches a yard or two from where the cuckoo was poising himself and\nGriselda.\n\n\"Where shall we go to now?\" he said. \"Or would you rather go home? Are\nyou tired?\"\n\n\"Tired!\" exclaimed Griselda. \"I should rather think not. How could I be\ntired, cuckoo?\"\n\n\"Very well, don't excite yourself about nothing, whatever you do,\" said\nthe cuckoo. \"Say where you'd like to go.\"\n\n\"How can I?\" said Griselda. \"You know far more nice places than I do.\"\n\n\"You don't care to go back to the mandarins, or the butterflies, I\nsuppose?\" asked the cuckoo.\n\n[\"TIRED! HOW COULD I BE TIRED, CUCKOO?\"]\n\n\"No, thank you,\" said Griselda; \"I'd like something new. And I'm not\nsure that I care for seeing any more countries of that kind, unless\nyou could take me to the _real_ fairyland.\"\n\n\"_I_ can't do that, you know,\" said the cuckoo.\n\nJust then a faint \"soughing\" sound among the branches suggested another\nidea to Griselda.\n\n\"Cuckoo,\" she exclaimed, \"take me to the sea. It's _such_ a time since I\nsaw the sea. I can fancy I hear it; do take me to see it.\"\n\n\n\n\nCHAPTER X. THE OTHER SIDE OF THE MOON.\n\n\n    \"That after supper time has come,\n      And silver dews the meadow steep.\n    And all is silent in the home,\n      And even nurses are asleep,\n    That be it late, or be it soon,\n    Upon this lovely night in June\n    They both will step into the moon.\"\n\n\n\"Very well,\" said the cuckoo. \"You would like to look about you a little\non the way, perhaps, Griselda, as we shall not be going down chimneys,\nor anything of that kind just at present.\"\n\n\"Yes,\" said Griselda. \"I think I should. I'm rather tired of shutting my\neyes, and I'm getting quite accustomed to flying about with you,\ncuckoo.\"\n\n\"Turn on your side, then,\" said the cuckoo, \"and you won't have to twist\nyour neck to see over my shoulder. Are you comfortable now? And,\nby-the-by, as you may be cold, just feel under my left wing. You'll find\nthe feather mantle there, that you had on once before. Wrap it round\nyou. I tucked it in at the last moment, thinking you might want it.\"\n\n\"Oh, you dear, kind cuckoo!\" cried Griselda. \"Yes, I've found it. I'll\ntuck it all round me like a rug--that's it. I _am_ so warm now, cuckoo.\"\n\n\"Here goes, then,\" said the cuckoo, and off they set. Had ever a little\ngirl such a flight before? Floating, darting, gliding, sailing--no words\ncan describe it. Griselda lay still in delight, gazing all about her.\n\n\"How lovely the stars are, cuckoo!\" she said. \"Is it true they're all\ngreat, big _suns_? I'd rather they weren't. I like to think of them as\nnice, funny little things.\"\n\n\"They're not all suns,\" said the cuckoo. \"Not all those you're looking\nat now.\"\n\n\"I like the twinkling ones best,\" said Griselda. \"They look so\ngood-natured. Are they _all_ twirling about always, cuckoo? Mr.\nKneebreeches has just begun to teach me astronomy, and _he_ says they\nare; but I'm not at all sure that he knows much about it.\"\n\n\"He's quite right all the same,\" replied the cuckoo.\n\n\"Oh dear me! How tired they must be, then!\" said Griselda. \"Do they\nnever rest just for a minute?\"\n\n\"Never.\"\n\n\"Why not?\"\n\n\"Obeying orders,\" replied the cuckoo.\n\nGriselda gave a little wriggle.\n\n\"What's the use of it?\" she said. \"It would be just as nice if they\nstood still now and then.\"\n\n\"Would it?\" said the cuckoo. \"I know some body who would soon find\nfault if they did. What would you say to no summer; no day, or no night,\nwhichever it happened not to be, you see; nothing growing, and nothing\nto eat before long? That's what it would be if they stood still, you\nsee, because----\"\n\n\"Thank you, cuckoo,\" interrupted Griselda. \"It's very nice to hear\nyou--I mean, very dreadful to think of, but I don't want you to explain.\nI'll ask Mr. Kneebreeches when I'm at my lessons. You might tell me one\nthing, however. What's at the other side of the moon?\"\n\n\"There's a variety of opinions,\" said the cuckoo.\n\n\"What are they? Tell me the funniest.\"\n\n\"Some say all the unfinished work of the world is kept there,\" said the\ncuckoo.\n\n\"_That's_ not funny,\" said Griselda. \"What a messy place it must be!\nWhy, even _my_ unfinished work makes quite a heap. I don't like that\nopinion at all, cuckoo. Tell me another.\"\n\n\"I _have_ heard,\" said the cuckoo, \"that among the places there you\nwould find the country of the little black dogs. You know what sort of\ncreatures those are?\"\n\n\"Yes, I suppose so,\" said Griselda, rather reluctantly.\n\n\"There are a good many of them in this world, as of course you know,\"\ncontinued the cuckoo. \"But up there, they are much worse than here. When\na child has made a great pet of one down here, I've heard tell the\nfairies take him up there when his parents and nurses think he's\nsleeping quietly in his bed, and make him work hard all night, with his\nown particular little black dog on his back. And it's so dreadfully\nheavy--for every time he takes it on his back down here it grows a pound\nheavier up there--that by morning the child is quite worn out. I dare\nsay you've noticed how haggard and miserable some ill-tempered children\nget to look--now you'll know the reason.\"\n\n\"Thank you, cuckoo,\" said Griselda again; \"but I can't say I like this\nopinion about the other side of the moon any better than the first. If\nyou please, I would rather not talk about it any more.\"\n\n\"Oh, but it's not so bad an idea after all,\" said the cuckoo. \"Lots of\nchildren, they say, get quite cured in the country of the little black\ndogs. It's this way--for every time a child refuses to take the dog on\nhis back down here it grows a pound lighter up there, so at last any\nsensible child learns how much better it is to have nothing to say to it\nat all, and gets out of the way of it, you see. Of course, there _are_\nchildren whom nothing would cure, I suppose. What becomes of them I\nreally can't say. Very likely they get crushed into pancakes by the\nweight of the dogs at last, and then nothing more is ever heard of\nthem.\"\n\n\"Horrid!\" said Griselda, with a shudder. \"Don't let's talk about it any\nmore, cuckoo; tell me your _own_ opinion about what there really is on\nthe other side of the moon.\"\n\nThe cuckoo was silent for a moment. Then suddenly he stopped short in\nthe middle of his flight.\n\n\"Would you like to see for yourself, Griselda?\" he said. \"There would be\nabout time to do it,\" he added to himself, \"and it would fulfil her\nother wish, too.\"\n\n\"See the moon for myself, do you mean?\" cried Griselda, clasping her\nhands. \"I should rather think I would. Will you really take me there,\ncuckoo?\"\n\n\"To the other side,\" said the cuckoo. \"I couldn't take you to this\nside.\"\n\n\"Why not? Not that I'd care to go to this side as much as to the other;\nfor, of course, we can _see_ this side from here. But I'd like to know\nwhy you couldn't take me there.\"\n\n\"For _reasons_,\" said the cuckoo drily. \"I'll give you one if you like.\nIf I took you to this side of the moon you wouldn't be yourself when you\ngot there.\"\n\n\"Who would I be, then?\"\n\n\"Griselda,\" said the cuckoo, \"I told you once that there are a great\nmany things you don't know. Now, I'll tell you something more. There are\na great many things you're not _intended_ to know.\"\n\n\"Very well,\" said Griselda. \"But do tell me when you're going on again,\nand where you are going to take me to. There's no harm my asking that?\"\n\n\"No,\" said the cuckoo. \"I'm going on immediately, and I'm going to take\nyou where you wanted to go to, only you must shut your eyes again, and\nlie perfectly still without talking, for I must put on steam--a good\ndeal of steam--and I can't talk to you. Are you all right?\"\n\n\"All right,\" said Griselda.\n\nShe had hardly said the words when she seemed to fall asleep. The\nrushing sound in the air all round her increased so greatly that she was\nconscious of nothing else. For a moment or two she tried to remember\nwhere she was, and where she was going, but it was useless. She forgot\neverything, and knew nothing more of what was passing till--till she\nheard the cuckoo again.\n\n\"Cuckoo, cuckoo; wake up, Griselda,\" he said.\n\nGriselda sat up.\n\nWhere was she?\n\nNot certainly where she had been when she went to sleep. Not on the\ncuckoo's back, for there he was standing beside her, as tiny as usual.\nEither he had grown little again, or she had grown big--which, she\nsupposed, it did not much matter. Only it was very queer!\n\n\"Where am I, cuckoo?\" she said.\n\n\"Where you wished to be,\" he replied. \"Look about you and see.\"\n\nGriselda looked about her. What did she see? Something that I can only\ngive you a faint idea of, children; something so strange and unlike what\nshe had ever seen before, that only in a dream could you see it as\nGriselda saw it. And yet _why_ it seemed to her so strange and unnatural\nI cannot well explain; if I could, my words would be as good as\npictures, which I know they are not.\n\nAfter all, it was only the sea she saw; but such a great, strange,\nsilent sea, for there were no waves. Griselda was seated on the shore,\nclose beside the water's edge, but it did not come lapping up to her\nfeet in the pretty, coaxing way that _our_ sea does when it is in a good\nhumour. There were here and there faint ripples on the surface, caused\nby the slight breezes which now and then came softly round Griselda's\nface, but that was all. King Canute might have sat \"from then till now\"\nby this still, lifeless ocean without the chance of reading his silly\nattendants a lesson--if, indeed, there ever were such silly people,\nwhich I very much doubt.\n\nGriselda gazed with all her eyes. Then she suddenly gave a little\nshiver.\n\n\"What's the matter?\" said the cuckoo. \"You have the mantle on--you're\nnot cold?\"\n\n\"No,\" said Griselda, \"I'm not cold; but somehow, cuckoo, I feel a little\nfrightened. The sea is so strange, and so dreadfully big; and the light\nis so queer, too. What is the light, cuckoo? It isn't moonlight, is it?\"\n\n\"Not exactly,\" said the cuckoo. \"You can't both have your cake and eat\nit, Griselda. Look up at the sky. There's no moon there, is there?\"\n\n\"No,\" said Griselda; \"but what lots of stars, cuckoo. The light comes\nfrom them, I suppose? And where's the sun, cuckoo? Will it be rising\nsoon? It isn't always like this up here, is it?\"\n\n\"Bless you, no,\" said the cuckoo. \"There's sun enough, and rather too\nmuch, sometimes. How would you like a day a fortnight long, and nights\nto match? If it had been daytime here just now, I couldn't have brought\nyou. It's just about the very middle of the night now, and in about a\nweek of _your_ days the sun will begin to rise, because, you see----\"\n\n\"Oh, _dear_ cuckoo, please don't explain!\" cried Griselda. \"I'll promise\nto ask Mr. Kneebreeches, I will indeed. In fact, he was telling me\nsomething just like it to-day or yesterday--which should I say?--at my\nastronomy lesson. And that makes it so strange that you should have\nbrought me up here to-night to see for myself, doesn't it, cuckoo?\"\n\n\"An odd coincidence,\" said the cuckoo.\n\n\"What _would_ Mr. Kneebreeches think if I told him where I had been?\"\ncontinued Griselda. \"Only, you see, cuckoo, I never tell anybody about\nwhat I see when I am with you.\"\n\n\"No,\" replied the cuckoo; \"better not. ('Not that you could if you\ntried,' he added to himself.) You're not frightened now, Griselda, are\nyou?\"\n\n\"No, I don't think I am,\" she replied. \"But, cuckoo, isn't this sea\n_awfully_ big?\"\n\n\"Pretty well,\" said the cuckoo. \"Just half, or nearly half, the size of\nthe moon; and, no doubt, Mr. Kneebreeches has told you that the moon's\ndiameter and circumference are respec----\"\n\n\"Oh _don't_, cuckoo!\" interrupted Griselda, beseechingly. \"I want to\nenjoy myself, and not to have lessons. Tell me something funny, cuckoo.\nAre there any mermaids in the moon-sea?\"\n\n\"Not exactly,\" said the cuckoo.\n\n\"What a stupid way to answer,\" said Griselda. \"There's no sense in that;\nthere either must be or must not be. There couldn't be half mermaids.\"\n\n\"I don't know about that,\" replied the cuckoo. \"They might have been\nhere once and have left their tails behind them, like Bopeep's sheep,\nyou know; and some day they might be coming to find them again, you\nknow. That would do for 'not exactly,' wouldn't it?\"\n\n\"Cuckoo, you're laughing at me,\" said Griselda. \"Tell me, are there any\nmermaids, or fairies, or water-sprites, or any of those sort of\ncreatures here?\"\n\n\"I must still say 'not exactly,'\" said the cuckoo. \"There are beings\nhere, or rather there have been, and there may be again; but you,\nGriselda, can know no more than this.\"\n\nHis tone was rather solemn, and again Griselda felt a little \"eerie.\"\n\n\"It's a dreadfully long way from home, any way,\" she said. \"I feel as\nif, when I go back, I shall perhaps find I have been away fifty years or\nso, like the little boy in the fairy story. Cuckoo, I think I would like\nto go home. Mayn't I get on your back again?\"\n\n\"Presently,\" said the cuckoo. \"Don't be uneasy, Griselda. Perhaps I'll\ntake you home by a short cut.\"\n\n\"Was ever any child here before?\" asked Griselda, after a little pause.\n\n\"Yes,\" said the cuckoo.\n\n\"And did they get safe home again?\"\n\n\"Quite,\" said the cuckoo. \"It's so silly of you, Griselda, to have all\nthese ideas still about far and near, and big and little, and long and\nshort, after all I've taught you and all you've seen.\"\n\n\"I'm very sorry,\" said Griselda humbly; \"but you see, cuckoo, I can't\nhelp it. I suppose I'm made so.\"\n\n\"Perhaps,\" said the cuckoo, meditatively.\n\nHe was silent for a minute. Then he spoke again. \"Look over there,\nGriselda,\" he said. \"There's the short cut.\"\n\nGriselda looked. Far, far over the sea, in the silent distance, she saw\na tiny speck of light. It was very tiny; but yet the strange thing was\nthat, far away as it appeared, and minute as it was, it seemed to throw\noff a thread of light to Griselda's very feet--right across the great\nsheet of faintly gleaming water. And as Griselda looked, the thread\nseemed to widen and grow, becoming at the same time brighter and\nclearer, till at last it lay before her like a path of glowing light.\n\n\"Am I to walk along there?\" she said softly to the cuckoo.\n\n\"No,\" he replied; \"wait.\"\n\nGriselda waited, looking still, and presently in the middle of the\nshining streak she saw something slowly moving--something from which the\nlight came, for the nearer it got to her the shorter grew the glowing\npath, and behind the moving object the sea looked no brighter than\nbefore it had appeared.\n\nAt last--at last, it came quite near--near enough for Griselda to\ndistinguish clearly what it was.\n\nIt was a little boat--the prettiest, the loveliest little boat that ever\nwas seen; and it was rowed by a little figure that at first sight\nGriselda felt certain was a fairy. For it was a child with bright hair\nand silvery wings, which with every movement sparkled and shone like a\nthousand diamonds.\n\nGriselda sprang up and clapped her hands with delight. At the sound, the\nchild in the boat turned and looked at her. For one instant she could\nnot remember where she had seen him before; then she exclaimed,\njoyfully--\n\n\"It is Phil! Oh, cuckoo, it is Phil. Have you turned into a fairy,\nPhil?\"\n\nBut, alas, as she spoke the light faded away, the boy's figure\ndisappeared, the sea and the shore and the sky were all as they had been\nbefore, lighted only by the faint, strange gleaming of the stars. Only\nthe boat remained. Griselda saw it close to her, in the shallow water, a\nfew feet from where she stood.\n\n\"Cuckoo,\" she exclaimed in a tone of reproach and disappointment, \"where\nis Phil gone? Why did you send him away?\"\n\n\"I didn't send him away,\" said the cuckoo. \"You don't understand. Never\nmind, but get into the boat. It'll be all right, you'll see.\"\n\n\"But are we to go away and leave Phil here, all alone at the other side\nof the moon?\" said Griselda, feeling ready to cry.\n\n\"Oh, you silly girl!\" said the cuckoo. \"Phil's all right, and in some\nways he has a great deal more sense than you, I can tell you. Get into\nthe boat and make yourself comfortable; lie down at the bottom and cover\nyourself up with the mantle. You needn't be afraid of wetting your feet\na little, moon water never gives cold. There, now.\"\n\nGriselda did as she was told. She was beginning to feel rather tired,\nand it certainly was very comfortable at the bottom of the boat, with\nthe nice warm feather-mantle well tucked round her.\n\n\"Who will row?\" she said sleepily. \"_You_ can't, cuckoo, with your tiny\nlittle claws, you could never hold the oars, I'm----\"\n\n\"Hush!\" said the cuckoo; and whether he rowed or not Griselda never\nknew.\n\nOff they glided somehow, but it seemed to Griselda that _somebody_\nrowed, for she heard the soft dip, dip of the oars as they went along,\nso regularly that she couldn't help beginning to count in time--one,\ntwo, three, four--on, on--she thought she had got nearly to a hundred,\nwhen----\n\n\n\n\nCHAPTER XI. \"CUCKOO, CUCKOO, GOOD-BYE!\"\n\n\n    \"Children, try to be good!\n      That is the end of all teaching;\n    Easily understood,\n      And very easy in preaching.\n    And if you find it hard,\n      Your efforts you need but double;\n    Nothing deserves reward\n      Unless it has given as trouble.\"\n\n\n--When she forgot everything, and fell fast, fast asleep, to wake, of\ncourse, in her own little bed as usual!\n\n\"One of your tricks again, Mr. Cuckoo,\" she said to herself with a\nsmile. \"However, I don't mind. It _was_ a short cut home, and it was\nvery comfortable in the boat, and I certainly saw a great deal last\nnight, and I'm very much obliged to you--particularly for making it all\nright with Phil about not coming to play with me to-day. Ah! that\nreminds me, I'm in disgrace. I wonder if Aunt Grizzel will really make\nme stay in my room all day. How tired I shall be, and what will Mr.\nKneebreeches think! But it serves me right. I _was_ very cross and\nrude.\"\n\nThere came a tap at the door. It was Dorcas with the hot water.\n\n\"Good morning, missie,\" she said gently, not feeling, to tell the truth,\nvery sure as to what sort of a humour \"missie\" was likely to be found in\nthis morning. \"I hope you've slept well.\"\n\n\"Exceedingly well, thank you, Dorcas. I've had a delightful night,\"\nreplied Griselda amiably, smiling to herself at the thought of what\nDorcas would say if she knew where she had been, and what she had been\ndoing since last she saw her.\n\n\"That's good news,\" said Dorcas in a tone of relief; \"and I've good\nnews for you, too, missie. At least, I hope you'll think it so. Your\naunt has ordered the carriage for quite early this morning--so you see\nshe really wants to please you, missie, about playing with little Master\nPhil; and if to-morrow's a fine day, we'll be sure to find some way of\nletting him know to come.\"\n\n\"Thank you, Dorcas. I hope it will be all right, and that Lady Lavander\nwon't say anything against it. I dare say she won't. I feel ever so much\nhappier this morning, Dorcas; and I'm very sorry I was so rude to Aunt\nGrizzel, for of course I know I _should_ obey her.\"\n\n\"That's right, missie,\" said Dorcas approvingly.\n\n\"It seems to me, Dorcas,\" said Griselda dreamily, when, a few minutes\nlater, she was standing by the window while the old servant brushed out\nher thick, wavy hair, \"it seems to me, Dorcas, that it's _all_ 'obeying\norders' together. There's the sun now, just getting up, and the moon\njust going to bed--_they_ are always obeying, aren't they? I wonder why\nit should be so hard for people--for children, at least.\"\n\n\"To be sure, missie, you do put it a way of your own,\" replied Dorcas,\nsomewhat mystified; \"but I see how you mean, I think, and it's quite\ntrue. And it _is_ a hard lesson to learn.\"\n\n\"I want to learn it _well_, Dorcas,\" said Griselda, resolutely. \"So will\nyou please tell Aunt Grizzel that I'm very sorry about last night, and\nI'll do just as she likes about staying in my room or anything. But, if\nshe _would_ let me, I'd far rather go down and do my lessons as usual\nfor Mr. Kneebreeches. I won't ask to go out in the garden; but I would\nlike to please Aunt Grizzel by doing my lessons _very_ well.\"\n\nDorcas was both delighted and astonished. Never had she known her little\n\"missie\" so altogether submissive and reasonable.\n\n\"I only hope the child's not going to be ill,\" she said to herself. But\nshe proved a skilful ambassadress, notwithstanding her misgivings; and\nGriselda's imprisonment confined her only to the bounds of the house and\nterrace walk, instead of within the four walls of her own little room,\nas she had feared.\n\nLessons _were_ very well done that day, and Mr. Kneebreeches' report was\nall that could be wished.\n\n\"I am particularly gratified,\" he remarked to Miss Grizzel, \"by the\nintelligence and interest Miss Griselda displays with regard to the\nstudy of astronomy, which I have recently begun to give her some\nelementary instruction in. And, indeed, I have no fault to find with the\nway in which any of the young lady's tasks are performed.\"\n\n\"I am extremely glad to hear it,\" replied Miss Grizzel graciously, and\nthe kiss with which she answered Griselda's request for forgiveness was\na very hearty one.\n\nAnd it was \"all right\" about Phil.\n\nLady Lavander knew all about him; his father and mother were friends of\nhers, for whom she had a great regard, and for some time she had been\nintending to ask the little boy to spend the day at Merrybrow Hall, to\nbe introduced to her god-daughter Griselda. So, _of course_, as Lady\nLavander knew all about him, there could be no objection to his playing\nin Miss Grizzel's garden!\n\nAnd \"to-morrow\" turned out a fine day. So altogether you can imagine\nthat Griselda felt very happy and light-hearted as she ran down the\nwood-path to meet her little friend, whose rosy face soon appeared among\nthe bushes.\n\n\"What did you do yesterday, Phil?\" asked Griselda. \"Were you sorry not\nto come to play with me?\"\n\n\"No,\" said Phil mysteriously, \"I didn't mind. I was looking for the way\nto fairyland to show you, and I do believe I've found it. Oh, it _is_\nsuch a pretty way.\"\n\nGriselda smiled.\n\n\"I'm afraid the way to fairyland isn't so easily found,\" she said. \"But\nI'd like to hear about where you went. Was it far?\"\n\n\"A good way,\" said Phil. \"Won't you come with me? It's in the wood. I\ncan show you quite well, and we can be back by tea-time.\"\n\n\"Very well,\" said Griselda; and off they set.\n\nWhether it was the way to fairyland or not, it was not to be wondered at\nthat little Phil thought so. He led Griselda right across the wood to a\npart where she had never been before. It was pretty rough work part of\nthe way. The children had to fight with brambles and bushes, and here\nand there to creep through on hands and knees, and Griselda had to\nremind Phil several times of her promise to his nurse that his clothes\nshould not be the worse for his playing with her, to prevent his\nscrambling through \"anyhow\" and leaving bits of his knickerbockers\nbehind him.\n\nBut when at last they reached Phil's favourite spot all their troubles\nwere forgotten. Oh, how pretty it was! It was a sort of tiny glade in\nthe very middle of the wood--a little green nest enclosed all round by\ntrees, and right through it the merry brook came rippling along as if\nrejoicing at getting out into the sunlight again for a while. And all\nthe choicest and sweetest of the early summer flowers seemed to be\ncollected here in greater variety and profusion than in any other part\nof the wood.\n\n\"_Isn't_ it nice?\" said Phil, as he nestled down beside Griselda on the\nsoft, mossy grass. \"It must have been a fairies' garden some time, I'm\nsure, and I shouldn't wonder if one of the doors into fairyland is\nhidden somewhere here, if only we could find it.\"\n\n\"If only!\" said Griselda. \"I don't think we shall find it, Phil; but,\nany way, this is a lovely place you've found, and I'd like to come here\nvery often.\"\n\nThen at Phil's suggestion they set to work to make themselves a house in\nthe centre of this fairies' garden, as he called it. They managed it\nvery much to their own satisfaction, by dragging some logs of wood and\nbig stones from among the brushwood hard by, and filling the holes up\nwith bracken and furze.\n\n\"And if the fairies _do_ come here,\" said Phil, \"they'll be very pleased\nto find a house all ready, won't they?\"\n\nThen they had to gather flowers to ornament the house inside, and dry\nleaves and twigs all ready for a fire in one corner. Altogether it was\nquite a business, I can assure you, and when it was finished they were\nvery hot and very tired and _rather_ dirty. Suddenly a thought struck\nGriselda.\n\n\"Phil,\" she said, \"it must be getting late.\"\n\n\"Past tea-time?\" he said coolly.\n\n\"I dare say it is. Look how low down the sun has got. Come, Phil, we\nmust be quick. Where is the place we came out of the wood at?\"\n\n\"Here,\" said Phil, diving at a little opening among the bushes.\n\nGriselda followed him. He had been a good guide hitherto, and she\ncertainly could not have found her way alone. They scrambled on for some\nway, then the bushes suddenly seemed to grow less thick, and in a minute\nthey came out upon a little path.\n\n\"Phil,\" said Griselda, \"this isn't the way we came.\"\n\n\"Isn't it?\" said Phil, looking about him. \"Then we must have comed the\nwrong way.\"\n\n\"I'm afraid so,\" said Griselda, \"and it seems to be so late already. I'm\nso sorry, for Aunt Grizzel will be vexed, and I did so want to please\nher. Will your nurse be vexed, Phil?\"\n\n\"I don't care if she are,\" replied Phil valiantly.\n\n\"You shouldn't say that, Phil. You know we _shouldn't_ have stayed so\nlong playing.\"\n\n\"Nebber mind,\" said Phil. \"If it was mother I would mind. Mother's so\ngood, you don't know. And she never 'colds me, except when I _am_\nnaughty--so I _do_ mind.\"\n\n\"She wouldn't like you to be out so late, I'm sure,\" said Griselda in\ndistress, \"and it's most my fault, for I'm the biggest. Now, which way\n_shall_ we go?\"\n\nThey had followed the little path till it came to a point where two\nroads, rough cart-ruts only, met; or, rather, where the path ran across\nthe road. Right, or left, or straight on, which should it be? Griselda\nstood still in perplexity. Already it was growing dusk; already the\nmoon's soft light was beginning faintly to glimmer through the branches.\nGriselda looked up to the sky.\n\n\"To think,\" she said to herself--\"to think that I should not know my way\nin a little bit of a wood like this--I that was up at the other side of\nthe moon last night.\"\n\nThe remembrance put another thought into her mind.\n\n\"Cuckoo, cuckoo,\" she said softly, \"couldn't you help us?\"\n\nThen she stood still and listened, holding Phil's cold little hands in\nher own.\n\nShe was not disappointed. Presently, in the distance, came the\nwell-known cry, \"cuckoo, cuckoo,\" so soft and far away, but yet so\nclear.\n\nPhil clapped his hands.\n\n\"He's calling us,\" he cried joyfully. \"He's going to show us the way.\nThat's how he calls me always. Good cuckoo, we're coming;\" and, pulling\nGriselda along, he darted down the road to the right--the direction from\nwhence came the cry.\n\nThey had some way to go, for they had wandered far in a wrong direction,\nbut the cuckoo never failed them. Whenever they were at a loss--whenever\nthe path turned or divided, they heard his clear, sweet call; and,\nwithout the least misgiving, they followed it, till at last it brought\nthem out upon the high-road, a stone's throw from Farmer Crouch's gate.\n\n\"I know the way now, good cuckoo,\" exclaimed Phil. \"I can go home alone\nnow, if your aunt will be vexed with you.\"\n\n\"No,\" said Griselda, \"I must take you quite all the way home, Phil dear.\nI promised to take care of you, and if nurse scolds any one it must be\nme, not you.\"\n\nThere was a little bustle about the door of the farmhouse as the\nchildren wearily came up to it. Two or three men were standing together\nreceiving directions from Mr. Crouch himself, and Phil's nurse was\ntalking eagerly. Suddenly she caught sight of the truants.\n\n\"Here he is, Mr. Crouch!\" she exclaimed. \"No need now to send to look\nfor him. Oh, Master Phil, how could you stay out so late? And to-night\nof all nights, just when your--I forgot, I mustn't say. Come in to the\nparlour at once--and this little girl, who is she?\"\n\n\"She isn't a little girl, she's a young lady,\" said Master Phil, putting\non his lordly air, \"and she's to come into the parlour and have some\nsupper with me, and then some one must take her home to her auntie's\nhouse--that's what I say.\"\n\nMore to please Phil than from any wish for \"supper,\" for she was really\nin a fidget to get home, Griselda let the little boy lead her into the\nparlour. But she was for a moment perfectly startled by the cry that\nbroke from him when he opened the door and looked into the room. A lady\nwas standing there, gazing out of the window, though in the quickly\ngrowing darkness she could hardly have distinguished the little figure\nshe was watching for so anxiously.\n\nThe noise of the door opening made her look round.\n\n\"Phil,\" she cried, \"my own little Phil; where have you been to? You\ndidn't know I was waiting here for you, did you?\"\n\n\"Mother, mother!\" shouted Phil, darting into his mother's arms.\n\nBut Griselda drew back into the shadow of the doorway, and tears filled\nher eyes as for a minute or two she listened to the cooings and\ncaressings of the mother and son.\n\nOnly for a minute, however. Then Phil called to her.\n\n\"Mother, mother,\" he cried again, \"you must kiss Griselda, too! She's\nthe little girl that is so kind, and plays with me; and she has no\nmother,\" he added in a lower tone.\n\nThe lady put her arm round Griselda, and kissed her, too. She did not\nseem surprised.\n\n\"I think I know about Griselda,\" she said very kindly, looking into her\nface with her gentle eyes, blue and clear like Phil's.\n\nAnd then Griselda found courage to say how uneasy she was about the\nanxiety her aunts would be feeling, and a messenger was sent off at once\nto tell of her being safe at the farm.\n\nBut Griselda herself the kind lady would not let go till she had had\nsome nice supper with Phil, and was both warmed and rested.\n\n\"And what were you about, children, to lose your way?\" she asked\npresently.\n\n\"I took Griselda to see a place that I thought was the way to fairyland,\nand then we stayed to build a house for the fairies, in case they come,\nand then we came out at the wrong side, and it got dark,\" explained\nPhil.\n\n\"And _was_ it the way to fairyland?\" asked his mother, smiling.\n\nGriselda shook her head as she replied--\n\n\"Phil doesn't understand yet,\" she said gently. \"He isn't old enough.\nThe way to the true fairyland is hard to find, and we must each find it\nfor ourselves, mustn't we?\"\n\nShe looked up in the lady's face as she spoke, and saw that _she_\nunderstood.\n\n\"Yes, dear child,\" she answered softly, and perhaps a very little sadly.\n\"But Phil and you may help each other, and I perhaps may help you both.\"\n\nGriselda slid her hand into the lady's. \"You're not going to take Phil\naway, are you?\" she whispered.\n\n\"No, I have come to stay here,\" she answered, \"and Phil's father is\ncoming too, soon. We are going to live at the White House--the house on\nthe other side of the wood, on the way to Merrybrow. Are you glad,\nchildren?\"\n\n       *       *       *       *       *\n\nGriselda had a curious dream that night--merely a dream, nothing else.\nShe dreamt that the cuckoo came once more; this time, he told her, to\nsay \"good-bye.\"\n\n\"For you will not need me now,\" he said.\n\n\"I leave you in good hands, Griselda. You have friends now who will\nunderstand you--friends who will help you both to work and to play.\nBetter friends than the mandarins, or the butterflies, or even than your\nfaithful old cuckoo.\"\n\nAnd when Griselda tried to speak to him, to thank him for his goodness,\nto beg him still sometimes to come to see her, he gently fluttered away.\n\"Cuckoo, cuckoo, cuckoo,\" he warbled; but somehow the last \"cuckoo\"\nsounded like \"good-bye.\"\n\nIn the morning, when Griselda awoke, her pillow was wet with tears. Thus\nmany stories end. She was happy, very happy in the thought of her kind\nnew friends; but there were tears for the one she felt she had said\nfarewell to, even though he was only a cuckoo in a clock.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      219,
      244,
      1
    ],
    [
      "chapter.title",
      16808,
      16841,
      2
    ],
    [
      "chapter.title",
      32600,
      32628,
      3
    ],
    [
      "chapter.title",
      51863,
      51912,
      4
    ],
    [
      "chapter.title",
      73774,
      73794,
      5
    ],
    [
      "chapter.title",
      95535,
      95568,
      6
    ],
    [
      "chapter.title",
      113326,
      113354,
      7
    ],
    [
      "chapter.title",
      133552,
      133578,
      8
    ],
    [
      "chapter.title",
      151865,
      151901,
      9
    ],
    [
      "chapter.title",
      173473,
      173511,
      10
    ],
    [
      "chapter.title",
      189141,
      189180,
      11
    ]
  ]
}