{
  "content": "The Little Duke\nCharlotte M. Yonge\n\nCHAPTER I.\n\n\nOn a bright autumn day, as long ago as the year 943, there was a great\nbustle in the Castle of Bayeux in Normandy.\n\nThe hall was large and low, the roof arched, and supported on thick short\ncolumns, almost like the crypt of a Cathedral; the walls were thick, and\nthe windows, which had no glass, were very small, set in such a depth of\nwall that there was a wide deep window seat, upon which the rain might\nbeat, without reaching the interior of the room.  And even if it had come\nin, there was nothing for it to hurt, for the walls were of rough stone,\nand the floor of tiles.  There was a fire at each end of this great dark\napartment, but there were no chimneys over the ample hearths, and the\nsmoke curled about in thick white folds in the vaulted roof, adding to\nthe wreaths of soot, which made the hall look still darker.\n\nThe fire at the lower end was by far the largest and hottest.  Great\nblack cauldrons hung over it, and servants, both men and women, with red\nfaces, bare and grimed arms, and long iron hooks, or pots and pans, were\nbusied around it.  At the other end, which was raised about three steps\nabove the floor of the hall, other servants were engaged.  Two young\nmaidens were strewing fresh rushes on the floor; some men were setting up\na long table of rough boards, supported on trestles, and then ranging\nupon it silver cups, drinking horns, and wooden trenchers.\n\nBenches were placed to receive most of the guests, but in the middle, at\nthe place of honour, was a high chair with very thick crossing legs, and\nthe arms curiously carved with lions' faces and claws; a clumsy wooden\nfootstool was set in front, and the silver drinking-cup on the table was\nof far more beautiful workmanship than the others, richly chased with\nvine leaves and grapes, and figures of little boys with goats' legs.  If\nthat cup could have told its story, it would have been a strange one, for\nit had been made long since, in the old Roman times, and been carried off\nfrom Italy by some Northman pirate.\n\nFrom one of these scenes of activity to the other, there moved a stately\nold lady: her long thick light hair, hardly touched with grey, was bound\nround her head, under a tall white cap, with a band passing under her\nchin: she wore a long sweeping dark robe, with wide hanging sleeves, and\nthick gold ear-rings and necklace, which had possibly come from the same\nquarter as the cup.  She directed the servants, inspected both the\ncookery and arrangements of the table, held council with an old steward,\nnow and then looked rather anxiously from the window, as if expecting\nsome one, and began to say something about fears that these loitering\nyouths would not bring home the venison in time for Duke William's\nsupper.\n\nPresently, she looked up rejoiced, for a few notes of a bugle-horn were\nsounded; there was a clattering of feet, and in a few moments there\nbounded into the hall, a boy of about eight years old, his cheeks and\nlarge blue eyes bright with air and exercise, and his long light-brown\nhair streaming behind him, as he ran forward flourishing a bow in his\nhand, and crying out, \"I hit him, I hit him!  Dame Astrida, do you hear?\n'Tis a stag of ten branches, and I hit him in the neck.\"\n\n\"You! my Lord Richard! you killed him?\"\n\n\"Oh, no, I only struck him.  It was Osmond's shaft that took him in the\neye, and--Look you, Fru Astrida, he came thus through the wood, and I\nstood here, it might be, under the great elm with my bow thus\"--And\nRichard was beginning to act over again the whole scene of the deer-hunt,\nbut Fru, that is to say, Lady Astrida, was too busy to listen, and broke\nin with, \"Have they brought home the haunch?\"\n\n\"Yes, Walter is bringing it.  I had a long arrow--\"\n\n                   [Richard with Dame Estrida]\n\nA stout forester was at this instant seen bringing in the venison, and\nDame Astrida hastened to meet it, and gave directions, little Richard\nfollowing her all the way, and talking as eagerly as if she was attending\nto him, showing how he shot, how Osmond shot, how the deer bounded, and\nhow it fell, and then counting the branches of its antlers, always ending\nwith, \"This is something to tell my father.  Do you think he will come\nsoon?\"\n\nIn the meantime two men entered the hall, one about fifty, the other, one\nor two-and-twenty, both in hunting dresses of plain leather, crossed by\nbroad embroidered belts, supporting a knife, and a bugle-horn.  The elder\nwas broad-shouldered, sun-burnt, ruddy, and rather stern-looking; the\nyounger, who was also the taller, was slightly made, and very active,\nwith a bright keen grey eye, and merry smile.  These were Dame Astrida's\nson, Sir Eric de Centeville, and her grandson, Osmond; and to their care\nDuke William of Normandy had committed his only child, Richard, to be\nfostered, or brought up. {1}\n\nIt was always the custom among the Northmen, that young princes should\nthus be put under the care of some trusty vassal, instead of being\nbrought up at home, and one reason why the Centevilles had been chosen by\nDuke William was, that both Sir Eric and his mother spoke only the old\nNorwegian tongue, which he wished young Richard to understand well,\nwhereas, in other parts of the Duchy, the Normans had forgotten their own\ntongue, and had taken up what was then called the Langued'oui, a language\nbetween German and Latin, which was the beginning of French.\n\nOn this day, Duke William himself was expected at Bayeux, to pay a visit\nto his son before setting out on a journey to settle the disputes between\nthe Counts of Flanders and Montreuil, and this was the reason of Fru\nAstrida's great preparations.  No sooner had she seen the haunch placed\nupon a spit, which a little boy was to turn before the fire, than she\nturned to dress something else, namely, the young Prince Richard himself,\nwhom she led off to one of the upper rooms, and there he had full time to\ntalk, while she, great lady though she was, herself combed smooth his\nlong flowing curls, and fastened his short scarlet cloth tunic, which\njust reached to his knee, leaving his neck, arms, and legs bare.  He\nbegged hard to be allowed to wear a short, beautifully ornamented dagger\nat his belt, but this Fru Astrida would not allow.\n\n\"You will have enough to do with steel and dagger before your life is at\nan end,\" said she, \"without seeking to begin over soon.\"\n\n\"To be sure I shall,\" answered Richard.  \"I will be called Richard of the\nSharp Axe, or the Bold Spirit, I promise you, Fru Astrida.  We are as\nbrave in these days as the Sigurds and Ragnars you sing of!  I only wish\nthere were serpents and dragons to slay here in Normandy.\"\n\n\"Never fear but you will find even too many of them,\" said Dame Astrida;\n\"there be dragons of wrong here and everywhere, quite as venomous as any\nin my Sagas.\"\n\n\"I fear them not,\" said Richard, but half understanding her, \"if you\nwould only let me have the dagger!  But, hark! hark!\" he darted to the\nwindow.  \"They come, they come!  There is the banner of Normandy.\"\n\nAway ran the happy child, and never rested till he stood at the bottom of\nthe long, steep, stone stair, leading to the embattled porch.  Thither\ncame the Baron de Centeville, and his son, to receive their Prince.\nRichard looked up at Osmond, saying, \"Let me hold his stirrup,\" and then\nsprang up and shouted for joy, as under the arched gateway there came a\ntall black horse, bearing the stately form of the Duke of Normandy.  His\npurple robe was fastened round him by a rich belt, sustaining the mighty\nweapon, from which he was called \"William of the long Sword,\" his legs\nand feet were cased in linked steel chain-work, his gilded spurs were on\nhis heels, and his short brown hair was covered by his ducal cap of\npurple, turned up with fur, and a feather fastened in by a jewelled\nclasp.  His brow was grave and thoughtful, and there was something both\nof dignity and sorrow in his face, at the first moment of looking at it,\nrecalling the recollection that he had early lost his young wife, the\nDuchess Emma, and that he was beset by many cares and toils; but the next\nglance generally conveyed encouragement, so full of mildness were his\neyes, and so kind the expression of his lips.\n\nAnd now, how bright a smile beamed upon the little Richard, who, for the\nfirst time, paid him the duty of a pupil in chivalry, by holding the\nstirrup while he sprung from his horse.  Next, Richard knelt to receive\nhis blessing, which was always the custom when children met their\nparents.  The Duke laid his hand on his head, saying, \"God of His mercy\nbless thee, my son,\" and lifting him in his arms, held him to his breast,\nand let him cling to his neck and kiss him again and again, before\nsetting him down, while Sir Eric came forward, bent his knee, kissed the\nhand of his Prince, and welcomed him to his Castle.\n\nIt would take too long to tell all the friendly and courteous words that\nwere spoken, the greeting of the Duke and the noble old Lady Astrida, and\nthe reception of the Barons who had come in the train of their Lord.\nRichard was bidden to greet them, but, though he held out his hand as\ndesired, he shrank a little to his father's side, gazing at them in dread\nand shyness.\n\nThere was Count Bernard, of Harcourt, called the \"Dane,\" {2} with his\nshaggy red hair and beard, to which a touch of grey had given a strange\nunnatural tint, his eyes looking fierce and wild under his thick\neyebrows, one of them mis-shapen in consequence of a sword cut, which had\nleft a broad red and purple scar across both cheek and forehead.  There,\ntoo, came tall Baron Rainulf, of Ferrieres, cased in a linked steel\nhauberk, that rang as he walked, and the men-at-arms, with helmets and\nshields, looking as if Sir Eric's armour that hung in the hail had come\nto life and was walking about.\n\nThey sat down to Fru Astrida's banquet, the old Lady at the Duke's right\nhand, and the Count of Harcourt on his left; Osmond carved for the Duke,\nand Richard handed his cup and trencher.  All through the meal, the Duke\nand his Lords talked earnestly of the expedition on which they were bound\nto meet Count Arnulf of Flanders, on a little islet in the river Somme,\nthere to come to some agreement, by which Arnulf might make restitution\nto Count Herluin of Montreuil, for certain wrongs which he had done him.\n\nSome said that this would be the fittest time for requiring Arnulf to\nyield up some towns on his borders, to which Normandy had long laid\nclaim, but the Duke shook his head, saying that he must seek no selfish\nadvantage, when called to judge between others.\n\nRichard was rather tired of their grave talk, and thought the supper very\nlong; but at last it was over, the Grace was said, the boards which had\nserved for tables were removed, and as it was still light, some of the\nguests went to see how their steeds had been bestowed, others to look at\nSir Eric's horses and hounds, and others collected together in groups.\n\nThe Duke had time to attend to his little boy, and Richard sat upon his\nknee and talked, told about all his pleasures, how his arrow had hit the\ndeer to-day, how Sir Eric let him ride out to the chase on his little\npony, how Osmond would take him to bathe in the cool bright river, and\nhow he had watched the raven's nest in the top of the old tower.\n\nDuke William listened, and smiled, and seemed as well pleased to hear as\nthe boy was to tell.  \"And, Richard,\" said he at last, \"have you nought\nto tell me of Father Lucas, and his great book?  What, not a word?  Look\nup, Richard, and tell me how it goes with the learning.\" {3}\n\n\"Oh, father!\" said Richard, in a low voice, playing with the clasp of his\nfather's belt, and looking down, \"I don't like those crabbed letters on\nthe old yellow parchment.\"\n\n\"But you try to learn them, I hope!\" said the Duke.\n\n\"Yes, father, I do, but they are very hard, and the words are so long,\nand Father Lucas will always come when the sun is so bright, and the wood\nso green, that I know not how to bear to be kept poring over those black\nhooks and strokes.\"\n\n\"Poor little fellow,\" said Duke William, smiling and Richard, rather\nencouraged, went on more boldly.  \"You do not know this reading, noble\nfather?\"\n\n\"To my sorrow, no,\" said the Duke.\n\n\"And Sir Eric cannot read, nor Osmond, nor any one, and why must I read,\nand cramp my fingers with writing, just as if I was a clerk, instead of a\nyoung Duke?\"  Richard looked up in his father's face, and then hung his\nhead, as if half-ashamed of questioning his will, but the Duke answered\nhim without displeasure.\n\n\"It is hard, no doubt, my boy, to you now, but it will be the better for\nyou in the end.  I would give much to be able myself to read those holy\nbooks which I must now only hear read to me by a clerk, but since I have\nhad the wish, I have had no time to learn as you have now.\"\n\n\"But Knights and Nobles never learn,\" said Richard.\n\n\"And do you think it a reason they never should?  But you are wrong, my\nboy, for the Kings of France and England, the Counts of Anjou, of\nProvence, and Paris, yes, even King Hako of Norway, {4} can all read.\"\n\n\"I tell you, Richard, when the treaty was drawn up for restoring this\nKing Louis to his throne, I was ashamed to find myself one of the few\ncrown vassals who could not write his name thereto.\"\n\n\"But none is so wise or so good as you, father,\" said Richard, proudly.\n\"Sir Eric often says so.\"\n\n\"Sir Eric loves his Duke too well to see his faults,\" said Duke William;\n\"but far better and wiser might I have been, had I been taught by such\nmasters as you may be.  And hark, Richard, not only can all Princes here\nread, but in England, King Ethelstane would have every Noble taught; they\nstudy in his own palace, with his brothers, and read the good words that\nKing Alfred the truth-teller put into their own tongue for them.\"\n\n\"I hate the English,\" said Richard, raising his head and looking very\nfierce.\n\n\"Hate them? and wherefore?\"\n\n\"Because they traitorously killed the brave Sea King Ragnar!  Fru Astrida\nsings his death-song, which he chanted when the vipers were gnawing him\nto death, and he gloried to think how his sons would bring the ravens to\nfeast upon the Saxon.  Oh! had I been his son, how I would have carried\non the feud!  How I would have laughed when I cut down the false\ntraitors, and burnt their palaces!\"  Richard's eye kindled, and his\nwords, as he spoke the old Norse language, flowed into the sort of wild\nverse in which the Sagas or legendary songs were composed, and which,\nperhaps, he was unconsciously repeating.\n\nDuke William looked grave.\n\n\"Fru Astrida must sing you no more such Sagas,\" said he, \"if they fill\nyour mind with these revengeful thoughts, fit only for the worshippers of\nOdin and Thor.  Neither Ragnar nor his sons knew better than to rejoice\nin this deadly vengeance, but we, who are Christians, know that it is for\nus to forgive.\"\n\n\"The English had slain their father!\" said Richard, looking up with\nwondering dissatisfied eyes.\n\n\"Yes, Richard, and I speak not against them, for they were even as we\nshould have been, had not King Harold the fair-haired driven your\ngrandfather from Denmark.  They had not been taught the truth, but to us\nit has been said, 'Forgive, and ye shall be forgiven.'  Listen to me, my\nson, Christian as is this nation of ours, this duty of forgiveness is too\noften neglected, but let it not be so with you.  Bear in mind, whenever\nyou see the Cross {5} marked on our banner, or carved in stone on the\nChurches, that it speaks of forgiveness to us; but of that pardon we\nshall never taste if we forgive not our enemies.  Do you mark me, boy?\"\n\nRichard hesitated a little, and then said, \"Yes, father, but I could\nnever have pardoned, had I been one of Ragnar's sons.\"\n\n\"It may be that you will be in their case, Richard,\" said the Duke, \"and\nshould I fall, as it may well be I shall, in some of the contests that\ntear to pieces this unhappy Kingdom of France, then, remember what I say\nnow.  I charge you, on your duty to God and to your father, that you keep\nup no feud, no hatred, but rather that you should deem me best revenged,\nwhen you have with heart and hand, given the fullest proof of forgiveness\nto your enemy.  Give me your word that you will.\"\n\n\"Yes, father,\" said Richard, with rather a subdued tone, and resting his\nhead on his father's shoulder.  There was a silence for a little space,\nduring which he began to revive into playfulness, to stroke the Duke's\nshort curled beard, and play with his embroidered collar.\n\nIn so doing, his fingers caught hold of a silver chain, and pulling it\nout with a jerk, he saw a silver key attached to it.  \"Oh, what is that?\"\nhe asked eagerly.  \"What does that key unlock?\"\n\n\"My greatest treasure,\" replied Duke William, as he replaced the chain\nand key within his robe.\n\n\"Your greatest treasure, father!  Is that your coronet?\"\n\n\"You will know one day,\" said his father, putting the little hand down\nfrom its too busy investigations; and some of the Barons at that moment\nreturning into the hall, he had no more leisure to bestow on his little\nson.\n\nThe next day, after morning service in the Chapel, and breakfast in the\nhall, the Duke again set forward on his journey, giving Richard hopes he\nmight return in a fortnight's time, and obtaining from him a promise that\nhe would be very attentive to Father Lucas, and very obedient to Sir Eric\nde Centeville.\n\n\n\n\nCHAPTER II.\n\n\nOne evening Fru Astrida sat in her tall chair in the chimney corner, her\ndistaff, with its load of flax in her hand, while she twisted and drew\nout the thread, and her spindle danced on the floor.  Opposite to her\nsat, sleeping in his chair, Sir Eric de Centeville; Osmond was on a low\nbench within the chimney corner, trimming and shaping with his knife some\nfeathers of the wild goose, which were to fly in a different fashion from\ntheir former one, and serve, not to wing the flight of a harmless goose,\nbut of a sharp arrow.\n\nThe men of the household sat ranged on benches on one side of the hall,\nthe women on the other; a great red fire, together with an immense\nflickering lamp which hung from the ceiling, supplied the light; the\nwindows were closed with wooden shutters, and the whole apartment had a\ncheerful appearance.  Two or three large hounds were reposing in front of\nthe hearth, and among them sat little Richard of Normandy, now smoothing\ndown their broad silken ears; now tickling the large cushions of their\nfeet with the end of one of Osmond's feathers; now fairly pulling open\nthe eyes of one of the good-natured sleepy creatures, which only\nstretched its legs, and remonstrated with a sort of low groan, rather\nthan a growl.  The boy's eyes were, all the time, intently fixed on Dame\nAstrida, as if he would not lose one word of the story she was telling\nhim; how Earl Rollo, his grandfather, had sailed into the mouth of the\nSeine, and how Archbishop Franco, of Rouen, had come to meet him and\nbrought him the keys of the town, and how not one Neustrian of Rouen had\nmet with harm from the brave Northmen.  Then she told him of his\ngrandfather's baptism, and how during the seven days that he wore his\nwhite baptismal robes, he had made large gifts to all the chief churches\nin his dukedom of Normandy.\n\n\"Oh, but tell of the paying homage!\" said Richard; \"and how Sigurd\nBloodaxe threw down simple King Charles!  Ah! how would I have laughed to\nsee it!\"\n\n\"Nay, nay, Lord Richard,\" said the old lady, \"I love not that tale.  That\nwas ere the Norman learnt courtesy, and rudeness ought rather to be\nforgotten than remembered, save for the sake of amending it.  No, I will\nrather tell you of our coming to Centeville, and how dreary I thought\nthese smooth meads, and broad soft gliding streams, compared with mine\nown father's fiord in Norway, shut in with the tall black rocks, and dark\npines above them, and far away the snowy mountains rising into the sky.\nAh! how blue the waters were in the long summer days when I sat in my\nfather's boat in the little fiord, and--\"\n\nDame Astrida was interrupted.  A bugle note rang out at the castle gate;\nthe dogs started to their feet, and uttered a sudden deafening bark;\nOsmond sprung up, exclaiming, \"Hark!\" and trying to silence the hounds;\nand Richard running to Sir Eric, cried, \"Wake, wake, Sir Eric, my father\nis come!  Oh, haste to open the gate, and admit him.\"\n\n\"Peace, dogs!\" said Sir Eric, slowly rising, as the blast of the horn was\nrepeated.  \"Go, Osmond, with the porter, and see whether he who comes at\nsuch an hour be friend or foe.  Stay you here, my Lord,\" he added, as\nRichard was running after Osmond; and the little boy obeyed, and stood\nstill, though quivering all over with impatience.\n\n\"Tidings from the Duke, I should guess,\" said Fru Astrida.  \"It can\nscarce be himself at such an hour.\"\n\n\"Oh, it must be, dear Fru Astrida!\" said Richard.  \"He said he would come\nagain.  Hark, there are horses' feet in the court!  I am sure that is his\nblack charger's tread!  And I shall not be there to hold his stirrup!\nOh!  Sir Eric, let me go.\"\n\nSir Eric, always a man of few words, only shook his head, and at that\nmoment steps were heard on the stone stairs.  Again Richard was about to\nspring forward, when Osmond returned, his face showing, at a glance, that\nsomething was amiss; but all that he said was, \"Count Bernard of\nHarcourt, and Sir Rainulf de Ferrieres,\" and he stood aside to let them\npass.\n\nRichard stood still in the midst of the hall, disappointed.  Without\ngreeting to Sir Eric, or to any within the hall, the Count of Harcourt\ncame forward to Richard, bent his knee before him, took his hand, and\nsaid with a broken voice and heaving breast, \"Richard, Duke of Normandy,\nI am thy liegeman and true vassal;\" then rising from his knees while\nRainulf de Ferrieres went through the same form, the old man covered his\nface with his hands and wept aloud.\n\n\"Is it even so?\" said the Baron de Centeville; and being answered by a\nmournful look and sigh from Ferrieres, he too bent before the boy, and\nrepeated the words, \"I am thy liegeman and true vassal, and swear fealty\nto thee for my castle and barony of Centeville.\"\n\n\"Oh, no, no!\" cried Richard, drawing back his hand in a sort of agony,\nfeeling as if he was in a frightful dream from which he could not awake.\n\"What means it?  Oh!  Fru Astrida, tell me what means it?  Where is my\nfather?\"\n\n                    [The oath of the vassals]\n\n\"Alas, my child!\" said the old lady, putting her arm round him, and\ndrawing him close to her, whilst her tears flowed fast, and Richard\nstood, reassured by her embrace, listening with eyes open wide, and deep\noppressed breathing, to what was passing between the four nobles, who\nspoke earnestly among themselves, without much heed of him.\n\n\"The Duke dead!\" repeated Sir Eric de Centeville, like one stunned and\nstupefied.\n\n\"Even so,\" said Rainulf, slowly and sadly, and the silence was only\nbroken by the long-drawn sobs of old Count Bernard.\n\n\"But how? when? where?\" broke forth Sir Eric, presently.  \"There was no\nnote of battle when you went forth.  Oh, why was not I at his side?\"\n\n\"He fell not in battle,\" gloomily replied Sir Rainulf.\n\n\"Ha! could sickness cut him down so quickly?\"\n\n\"It was not sickness,\" answered Ferrieres.  \"It was treachery.  He fell\nin the Isle of Pecquigny, by the hand of the false Fleming!\"\n\n\"Lives the traitor yet?\" cried the Baron de Centeville, grasping his good\nsword.\n\n\"He lives and rejoices in his crime,\" said Ferrieres, \"safe in his own\nmerchant towns.\"\n\n\"I can scarce credit you, my Lords!\" said Sir Eric.  \"Our Duke slain, and\nhis enemy safe, and you here to tell the tale!\"\n\n\"I would I were stark and stiff by my Lord's side!\" said Count Bernard,\n\"but for the sake of Normandy, and of that poor child, who is like to\nneed all that ever were friends to his house.  I would that mine eyes had\nbeen blinded for ever, ere they had seen that sight!  And not a sword\nlifted in his defence!  Tell you how it passed, Rainulf!  My tongue will\nnot speak it!\"\n\nHe threw himself on a bench and covered his face with his mantle, while\nRainulf de Ferrieres proceeded: \"You know how in an evil hour our good\nDuke appointed to meet this caitiff, Count of Flanders, in the Isle of\nPecquigny, the Duke and Count each bringing twelve men with them, all\nunarmed.  Duke Alan of Brittany was one on our side, Count Bernard here\nanother, old Count Bothon and myself; we bore no weapon--would that we\nhad--but not so the false Flemings.  Ah me!  I shall never forget Duke\nWilliam's lordly presence when he stepped ashore, and doffed his bonnet\nto the knave Arnulf.\"\n\n\"Yes,\" interposed Bernard.  \"And marked you not the words of the traitor,\nas they met?  'My Lord,' quoth he, 'you are my shield and defence.' {6}\nWould that I could cleave his treason-hatching skull with my battle-axe.\"\n\n\"So,\" continued Rainulf, \"they conferred together, and as words cost\nnothing to Arnulf, he not only promised all restitution to the paltry\nMontreuil, but even was for offering to pay homage to our Duke for\nFlanders itself; but this our William refused, saying it were foul wrong\nto both King Louis of France, and Kaiser Otho of Germany, to take from\nthem their vassal.  They took leave of each other in all courtesy, and we\nembarked again.  It was Duke William's pleasure to go alone in a small\nboat, while we twelve were together in another.  Just as we had nearly\nreached our own bank, there was a shout from the Flemings that their\nCount had somewhat further to say to the Duke, and forbidding us to\nfollow him, the Duke turned his boat and went back again.  No sooner had\nhe set foot on the isle,\" proceeded the Norman, clenching his hands, and\nspeaking between his teeth, \"than we saw one Fleming strike him on the\nhead with an oar; he fell senseless, the rest threw themselves upon him,\nand the next moment held up their bloody daggers in scorn at us!  You may\nwell think how we shouted and yelled at them, and plied our oars like men\ndistracted, but all in vain, they were already in their boats, and ere we\ncould even reach the isle, they were on the other side of the river,\nmounted their horses, fled with coward speed, and were out of reach of a\nNorman's vengeance.\"\n\n\"But they shall not be so long!\" cried Richard, starting forward; for to\nhis childish fancy this dreadful history was more like one of Dame\nAstrida's legends than a reality, and at the moment his thought was only\nof the blackness of the treason.  \"Oh, that I were a man to chastise\nthem!  One day they shall feel--\"\n\nHe broke off short, for he remembered how his father had forbidden his\ndenunciations of vengeance, but his words were eagerly caught up by the\nBarons, who, as Duke William had said, were far from possessing any\ntemper of forgiveness, thought revenge a duty, and were only glad to see\na warlike spirit in their new Prince.\n\n\"Ha! say you so, my young Lord?\" exclaimed old Count Bernard, rising.\n\"Yes, and I see a sparkle in your eye that tells me you will one day\navenge him nobly!\"\n\nRichard drew up his head, and his heart throbbed high as Sir Eric made\nanswer, \"Ay, truly, that will he!  You might search Normandy through,\nyea, and Norway likewise, ere you would find a temper more bold and free.\nTrust my word, Count Bernard, our young Duke will be famed as widely as\never were his forefathers!\"\n\n\"I believe it well!\" said Bernard.  \"He hath the port of his grandfather,\nDuke Rollo, and much, too, of his noble father!  How say you, Lord\nRichard, will you be a valiant leader of the Norman race against our\nfoes?\"\n\n\"That I will!\" said Richard, carried away by the applause excited by\nthose few words of his.  \"I will ride at your head this very night if you\nwill but go to chastise the false Flemings.\"\n\n\"You shall ride with us to-morrow, my Lord,\" answered Bernard, \"but it\nmust be to Rouen, there to be invested with your ducal sword and mantle,\nand to receive the homage of your vassals.\"\n\nRichard drooped his head without replying, for this seemed to bring to\nhim the perception that his father was really gone, and that he should\nnever see him again.  He thought of all his projects for the day of his\nreturn, how he had almost counted the hours, and had looked forward to\ntelling him that Father Lucas was well pleased with him!  And now he\nshould never nestle into his breast again, never hear his voice, never\nsee those kind eyes beam upon him.  Large tears gathered in his eyes, and\nashamed that they should be seen, he sat down on a footstool at Fru\nAstrida's feet, leant his forehead on his hands, and thought over all\nthat his father had done and said the last time they were together.  He\nfancied the return that had been promised, going over the meeting and the\ngreeting, till he had almost persuaded himself that this dreadful story\nwas but a dream.  But when he looked up, there were the Barons, with\ntheir grave mournful faces, speaking of the corpse, which Duke Alan of\nBrittany was escorting to Rouen, there to be buried beside the old Duke\nRollo, and the Duchess Emma, Richard's mother.  Then he lost himself in\nwonder how that stiff bleeding body could be the same as the father whose\narm was so lately around him, and whether his father's spirit knew how he\nwas thinking of him; and in these dreamy thoughts, the young orphan Duke\nof Normandy, forgotten by his vassals in their grave councils, fell\nasleep, and scarce wakened enough to attend to his prayers, when Fru\nAstrida at length remembered him, and led him away to bed.\n\nWhen Richard awoke the next morning, he could hardly believe that all\nthat had passed in the evening was true, but soon he found that it was\nbut too real, and all was prepared for him to go to Rouen with the\nvassals; indeed, it was for no other purpose than to fetch him that the\nCount of Harcourt had come to Bayeux.  Fru Astrida was quite unhappy that\n\"the child,\" as she called him, should go alone with the warriors; but\nSir Eric laughed at her, and said that it would never do for the Duke of\nNormandy to bring his nurse with him in his first entry into Rouen, and\nshe must be content to follow at some space behind under the escort of\nWalter the huntsman.\n\nSo she took leave of Richard, charging both Sir Eric and Osmond to have\nthe utmost care of him, and shedding tears as if the parting was to be\nfor a much longer space; then he bade farewell to the servants of the\ncastle, received the blessing of Father Lucas, and mounting his pony,\nrode off between Sir Eric and Count Bernard.  Richard was but a little\nboy, and he did not think so much of his loss, as he rode along in the\nfree morning air, feeling himself a Prince at the head of his vassals,\nhis banner displayed before him, and the people coming out wherever he\npassed to gaze on him, and call for blessings on his name.  Rainulf de\nFerrieres carried a large heavy purse filled with silver and gold, and\nwhenever they came to these gazing crowds, Richard was well pleased to\nthrust his hands deep into it, and scatter handfuls of coins among the\ngazers, especially where he saw little children.\n\nThey stopped to dine and rest in the middle of the day, at the castle of\na Baron, who, as soon as the meal was over, mounted his horse, and joined\nthem in their ride to Rouen.  So far it had not been very different from\nRichard's last journey, when he went to keep Christmas there with his\nfather; but now they were beginning to come nearer the town, he knew the\nbroad river Seine again, and saw the square tower of the Cathedral, and\nhe remembered how at that very place his father had met him, and how he\nhad ridden by his side into the town, and had been led by his hand up to\nthe hall.\n\nHis heart was very heavy, as he recollected there was no one now to meet\nand welcome him; scarcely any one to whom he could even tell his\nthoughts, for those tall grave Barons had nothing to say to such a little\nboy, and the very respect and formality with which they treated him, made\nhim shrink from them still more, especially from the grim-faced Bernard;\nand Osmond, his own friend and playfellow, was obliged to ride far\nbehind, as inferior in rank.\n\nThey entered the town just as it was growing dark.  Count Bernard looked\nback and arrayed the procession; Eric de Centeville bade Richard sit\nupright and not look weary, and then all the Knights held back while the\nlittle Duke rode alone a little in advance of them through the gateway.\nThere was a loud shout of \"Long live the little Duke!\" and crowds of\npeople were standing round to gaze upon his entry, so many that the bag\nof coins was soon emptied by his largesses.  The whole city was like one\ngreat castle, shut in by a wall and moat, and with Rollo's Tower rising\nat one end like the keep of a castle, and it was thither that Richard was\nturning his horse, when the Count of Harcourt said, \"Nay, my Lord, to the\nChurch of our Lady.\" {7}\n\nIt was then considered a duty to be paid to the deceased, that their\nrelatives and friends should visit them as they lay in state, and\nsprinkle them with drops of holy water, and Richard was now to pay this\ntoken of respect.  He trembled a little, and yet it did not seem quite so\ndreary, since he should once more look on his father's face, and he\naccordingly rode towards the Cathedral.  It was then very unlike what it\nis now; the walls were very thick, the windows small and almost buried in\nheavy carved arches, the columns within were low, clumsy, and circular,\nand it was usually so dark that the vaulting of the roof could scarcely\nbe seen.\n\nNow, however, a whole flood of light poured forth from every window, and\nwhen Richard came to the door, he saw not only the two tall thick candles\nthat always burnt on each side of the Altar, but in the Chancel stood a\ndouble row ranged in a square, shedding a pure, quiet brilliancy\nthroughout the building, and chiefly on the silver and gold ornaments of\nthe Altar.  Outside these lights knelt a row of priests in dark garments,\ntheir heads bowed over their clasped hands, and their chanted psalms\nsounding sweet, and full of soothing music.  Within that guarded space\nwas a bier, and a form lay on it.\n\nRichard trembled still more with awe, and would have paused, but he was\nobliged to proceed.  He dipped his hand in the water of the font, crossed\nhis brow, and came slowly on, sprinkled the remaining drops on the\nlifeless figure, and then stood still.  There was an oppression on his\nbreast as if he could neither breathe nor move.\n\nThere lay William of the Long Sword, like a good and true Christian\nwarrior, arrayed in his shining armour, his sword by his side, his shield\non his arm, and a cross between his hands, clasped upon his breast.  His\nducal mantle of crimson velvet, lined with ermine, was round his\nshoulders, and, instead of a helmet, his coronet was on his head; but, in\ncontrast with this rich array, over the collar of the hauberk, was folded\nthe edge of a rough hair shirt, which the Duke had worn beneath his\nrobes, unknown to all, until his corpse was disrobed of his blood-stained\ngarments.  His face looked full of calm, solemn peace, as if he had\ngently fallen asleep, and was only awaiting the great call to awaken.\nThere was not a single token of violence visible about him, save that one\nside of his forehead bore a deep purple mark, where he had first been\nstruck by the blow of the oar which had deprived him of sense.\n\n\"See you that, my Lord?\" said Count Bernard, first breaking the silence,\nin a low, deep, stern voice.\n\nRichard had heard little for many hours past save counsels against the\nFlemings, and plans of bitter enmity against them; and the sight of his\nmurdered father, with that look and tone of the old Dane, fired his\nspirit, and breaking from his trance of silent awe and grief, he\nexclaimed, \"I see it, and dearly shall the traitor Fleming abye it!\"\nThen, encouraged by the applauding looks of the nobles, he proceeded,\nfeeling like one of the young champions of Fru Astrida's songs.  His\ncheek was coloured, his eye lighted up, and he lifted his head, so that\nthe hair fell back from his forehead; he laid his hand on the hilt of his\nfather's sword, and spoke on in words, perhaps, suggested by some sage.\n\"Yes, Arnulf of Flanders, know that Duke William of Normandy shall not\nrest unavenged!  On this good sword I vow, that, as soon as my arm shall\nhave strength--\"\n\nThe rest was left unspoken, for a hand was laid on his arm.  A priest,\nwho had hitherto been kneeling near the head of the corpse, had risen,\nand stood tall and dark over him, and, looking up, he recognized the\npale, grave countenance of Martin, Abbot of Jumieges, his father's chief\nfriend and councillor.\n\n\"Richard of Normandy, what sayest thou?\" said he, sternly.  \"Yes, hang\nthy head, and reply not, rather than repeat those words.  Dost thou come\nhere to disturb the peace of the dead with clamours for vengeance?  Dost\nthou vow strife and anger on that sword which was never drawn, save in\nthe cause of the poor and distressed?  Wouldst thou rob Him, to whose\nservice thy life has been pledged, and devote thyself to that of His foe?\nIs this what thou hast learnt from thy blessed father?\"\n\nRichard made no answer, but he covered his face with his hands, to hide\nthe tears which were fast streaming.\n\n\"Lord Abbot, Lord Abbot, this passes!\" exclaimed Bernard the Dane.  \"Our\nyoung Lord is no monk, and we will not see each spark of noble and\nknightly spirit quenched as soon as it shows itself.\"\n\n\"Count of Harcourt,\" said Abbot Martin, \"are these the words of a savage\nPagan, or of one who has been washed in yonder blessed font?  Never,\nwhile I have power, shalt thou darken the child's soul with thy foul\nthirst of revenge, insult the presence of thy master with the crime he so\nabhorred, nor the temple of Him who came to pardon, with thy hatred.\nWell do I know, ye Barons of Normandy, that each drop of your blood would\nwillingly be given, could it bring back our departed Duke, or guard his\norphan child; but, if ye have loved the father, do his bidding--lay aside\nthat accursed spirit of hatred and vengeance; if ye love the child, seek\nnot to injure his soul more deeply than even his bitterest foe, were it\nArnulf himself, hath power to hurt him.\"\n\nThe Barons were silenced, whatever their thoughts might be, and Abbot\nMartin turned to Richard, whose tears were still dropping fast through\nhis fingers, as the thought of those last words of his father returned\nmore clearly upon him.  The Abbot laid his hand on his head, and spoke\ngently to him.  \"These are tears of a softened heart, I trust,\" said he.\n\"I well believe that thou didst scarce know what thou wert saying.\"\n\n\"Forgive me!\" said Richard, as well as he could speak.\n\n\"See there,\" said the priest, pointing to the large Cross over the Altar,\n\"thou knowest the meaning of that sacred sign?\"\n\nRichard bowed his head in assent and reverence.\n\n\"It speaks of forgiveness,\" continued the Abbot.  \"And knowest thou who\ngave that pardon?  The Son forgave His murderers; the Father them who\nslew His Son.  And shalt thou call for vengeance?\"\n\n\"But oh!\" said Richard, looking up, \"must that cruel, murderous traitor\nglory unpunished in his crime, while there lies--\" and again his voice\nwas cut off by tears.\n\n\"Vengeance shall surely overtake the sinner,\" said Martin, \"the vengeance\nof the Lord, and in His own good time, but it must not be of thy seeking.\nNay, Richard, thou art of all men the most bound to show love and mercy\nto Arnulf of Flanders.  Yes, when the hand of the Lord hath touched him,\nand bowed him down in punishment for his crime, it is then, that thou,\nwhom he hath most deeply injured, shouldst stretch out thine hand to aid\nhim, and receive him with pardon and peace.  If thou dost vow aught on\nthe sword of thy blessed father, in the sanctuary of thy Redeemer, let it\nbe a Christian vow.\"\n\nRichard wept too bitterly to speak, and Bernard de Harcourt, taking his\nhand, led him away from the Church.\n\n\n\n\nCHAPTER III.\n\n\nDuke William of the Long Sword was buried the next morning in high pomp\nand state, with many a prayer and psalm chanted over his grave.\n\nWhen this was over, little Richard, who had all the time stood or knelt\nnearest the corpse, in one dull heavy dream of wonder and sorrow, was led\nback to the palace, and there his long, heavy, black garments were taken\noff, and he was dressed in his short scarlet tunic, his hair was\ncarefully arranged, and then he came down again into the hall, where\nthere was a great assembly of Barons, some in armour, some in long furred\ngowns, who had all been attending his father's burial.  Richard, as he\nwas desired by Sir Eric de Centeville, took off his cap, and bowed low in\nreply to the reverences with which they all greeted his entrance, and he\nthen slowly crossed the hall, and descended the steps from the door,\nwhile they formed into a procession behind him, according to their\nranks--the Duke of Brittany first, and then all the rest, down to the\npoorest knight who held his manor immediately from the Duke of Normandy.\n\nThus, they proceeded, in slow and solemn order, till they came to the\nchurch of our Lady.  The clergy were there already, ranged in ranks on\neach side of the Choir; and the Bishops, in their mitres and rich robes,\neach with his pastoral staff in his hand, were standing round the Altar.\nAs the little Duke entered, there arose from all the voices in the\nChancel the full, loud, clear chant of _Te Deum Laudamus_, echoing among\nthe dark vaults of the roof.  To that sound, Richard walked up the Choir,\nto a large, heavy, crossed-legged, carved chair, raised on two steps,\njust before the steps of the Altar began, and there he stood, Bernard de\nHarcourt and Eric de Centeville on each side of him, and all his other\nvassals in due order, in the Choir.\n\nAfter the beautiful chant of the hymn was ended, the service for the Holy\nCommunion began.  When the time came for the offering, each noble gave\ngold or silver; and, lastly, Rainulf of Ferrieres came up to the step of\nthe Altar with a cushion, on which was placed a circlet of gold, the\nducal coronet; and another Baron, following him closely, carried a long,\nheavy sword, with a cross handle.  The Archbishop of Rouen received both\ncoronet and sword, and laid them on the Altar.  Then the service\nproceeded.  At that time the rite of Confirmation was administered in\ninfancy, and Richard, who had been confirmed by his godfather, the\nArchbishop of Rouen, immediately after his baptism, knelt in solemn awe\nto receive the other Holy Sacrament from his hands, as soon as all the\nclergy had communicated. {8}\n\nWhen the administration was over, Richard was led forward to the step of\nthe Altar by Count Bernard, and Sir Eric, and the Archbishop, laying one\nhand upon both his, as he held them clasped together, demanded of him, in\nthe name of God, and of the people of Normandy, whether he would be their\ngood and true ruler, guard them from their foes, maintain truth, punish\niniquity, and protect the Church.\n\n\"I will!\" answered Richard's young, trembling voice, \"So help me God!\"\nand he knelt, and kissed the book of the Holy Gospels, which the\nArchbishop offered him.\n\nIt was a great and awful oath, and he dreaded to think that he had taken\nit.  He still knelt, put both hands over his face, and whispered, \"O God,\nmy Father, help me to keep it.\"\n\nThe Archbishop waited till he rose, and then, turning him with his face\nto the people, said, \"Richard, by the grace of God, I invest thee with\nthe ducal mantle of Normandy!\"\n\nTwo of the Bishops then hung round his shoulders a crimson velvet mantle,\nfurred with ermine, which, made as it was for a grown man, hung heavily\non the poor child's shoulders, and lay in heaps on the ground.  The\nArchbishop then set the golden coronet on his long, flowing hair, where\nit hung so loosely on the little head, that Sir Eric was obliged to put\nhis hand to it to hold it safe; and, lastly, the long, straight,\ntwo-handed sword was brought and placed in his hand, with another solemn\nbidding to use it ever in maintaining the right.  It should have been\ngirded to his side, but the great sword was so much taller than the\nlittle Duke, that, as it stood upright by him, he was obliged to raise\nhis arm to put it round the handle.\n\nHe then had to return to his throne, which was not done without some\ndifficulty, encumbered as he was, but Osmond held up the train of his\nmantle, Sir Eric kept the coronet on his head, and he himself held fast\nand lovingly the sword, though the Count of Harcourt offered to carry it\nfor him.  He was lifted up to his throne, and then came the paying him\nhomage; Alan, Duke of Brittany, was the first to kneel before him, and\nwith his hand between those of the Duke, he swore to be his man, to obey\nhim, and pay him feudal service for his dukedom of Brittany.  In return,\nRichard swore to be his good Lord, and to protect him from all his foes.\nThen followed Bernard the Dane, and many another, each repeating the same\nformulary, as their large rugged hands were clasped within those little\nsoft fingers.  Many a kind and loving eye was bent in compassion on the\norphan child; many a strong voice faltered with earnestness as it\npronounced the vow, and many a brave, stalwart heart heaved with grief\nfor the murdered father, and tears flowed down the war-worn cheeks which\nhad met the fiercest storms of the northern ocean, as they bent before\nthe young fatherless boy, whom they loved for the sake of his conquering\ngrandfather, and his brave and pious father.  Few Normans were there\nwhose hearts did not glow at the touch of those small hands, with a love\nalmost of a parent, for their young Duke.\n\nThe ceremony of receiving homage lasted long and Richard, though\ninterested and touched at first, grew very weary; the crown and mantle\nwere so heavy, the faces succeeded each other like figures in an endless\ndream, and the constant repetition of the same words was very tedious.\nHe grew sleepy, he longed to jump up, to lean to the right or left, or to\nspeak something besides that regular form.  He gave one great yawn, but\nit brought him such a frown from the stern face of Bernard, as quite to\nwake him for a few minutes, and make him sit upright, and receive the\nnext vassal with as much attention as he had shown the first, but he\nlooked imploringly at Sir Eric, as if to ask if it ever would be over.\nAt last, far down among the Barons, came one at whose sight Richard\nrevived a little.  It was a boy only a few years older than himself,\nperhaps about ten, with a pleasant brown face, black hair, and quick\nblack eyes which glanced, with a look between friendliness and respect,\nup into the little Duke's gazing face.  Richard listened eagerly for his\nname, and was refreshed at the sound of the boyish voice which\npronounced, \"I, Alberic de Montemar, am thy liegeman and vassal for my\ncastle and barony of Montemar sur Epte.\"\n\nWhen Alberic moved away, Richard followed him with his eye as far as he\ncould to his place in the Cathedral, and was taken by surprise when he\nfound the next Baron kneeling before him.\n\nThe ceremony of homage came to an end at last, and Richard would fain\nhave run all the way to the palace to shake off his weariness, but he was\nobliged to head the procession again; and even when he reached the castle\nhall his toils were not over, for there was a great state banquet spread\nout, and he had to sit in the high chair where he remembered climbing on\nhis father's knee last Christmas-day, all the time that the Barons\nfeasted round, and held grave converse.  Richard's best comfort all this\ntime was in watching Osmond de Centeville and Alberic de Montemar, who,\nwith the other youths who were not yet knighted, were waiting on those\nwho sat at the table.  At last he grew so very weary, that he fell fast\nasleep in the corner of his chair, and did not wake till he was startled\nby the rough voice of Bernard de Harcourt, calling him to rouse up, and\nbid the Duke of Brittany farewell.\n\n\"Poor child!\" said Duke Alan, as Richard rose up, startled, \"he is\nover-wearied with this day's work.  Take care of him, Count Bernard; thou\na kindly nurse, but a rough one for such a babe.  Ha! my young Lord, your\ncolour mantles at being called a babe!  I crave your pardon, for you are\na fine spirit.  And hark you, Lord Richard of Normandy, I have little\ncause to love your race, and little right, I trow, had King Charles the\nSimple to call us free Bretons liegemen to a race of plundering Northern\npirates.  To Duke Rollo's might, my father never gave his homage; nay,\nnor did I yield it for all Duke William's long sword, but I did pay it to\nhis generosity and forbearance, and now I grant it to thy weakness and to\nhis noble memory.  I doubt not that the recreant Frank, Louis, whom he\nrestored to his throne, will strive to profit by thy youth and\nhelplessness, and should that be, remember that thou hast no surer friend\nthan Alan of Brittany.  Fare thee well, my young Duke.\"\n\n\"Farewell, Sir,\" said Richard, willingly giving his hand to be shaken by\nhis kind vassal, and watching him as Sir Eric attended him from the hall.\n\n\"Fair words, but I trust not the Breton,\" muttered Bernard; \"hatred is\ndeeply ingrained in them.\"\n\n\"He should know what the Frank King is made of,\" said Rainulf de\nFerrieres; \"he was bred up with him in the days that they were both\nexiles at the court of King Ethelstane of England.\"\n\n\"Ay, and thanks to Duke William that either Louis or Alan are not exiles\nstill.  Now we shall see whose gratitude is worth most, the Frank's or\nthe Breton's.  I suspect the Norman valour will be the best to trust to.\"\n\n\"Yes, and how will Norman valour prosper without treasure?  Who knows\nwhat gold is in the Duke's coffers?\"\n\nThere was some consultation here in a low voice, and the next thing\nRichard heard distinctly was, that one of the Nobles held up a silver\nchain and key, {9} saying that they had been found on the Duke's neck,\nand that he had kept them, thinking that they doubtless led to something\nof importance.\n\n\"Oh, yes!\" said Richard, eagerly, \"I know it.  He told me it was the key\nto his greatest treasure.\"\n\nThe Normans heard this with great interest, and it was resolved that\nseveral of the most trusted persons, among whom were the Archbishop of\nRouen, Abbot Martin of Jumieges, and the Count of Harcourt, should go\nimmediately in search of this precious hoard.  Richard accompanied them\nup the narrow rough stone stairs, to the large dark apartment, where his\nfather had slept.  Though a Prince's chamber, it had little furniture; a\nlow uncurtained bed, a Cross on a ledge near its head, a rude table, a\nfew chairs, and two large chests, were all it contained.  Harcourt tried\nthe lid of one of the chests: it opened, and proved to be full of wearing\napparel; he went to the other, which was smaller, much more carved, and\nornamented with very handsome iron-work.  It was locked, and putting in\nthe key, it fitted, the lock turned, and the chest was opened.  The\nNormans pressed eagerly to see their Duke's greatest treasure.\n\nIt was a robe of serge, and a pair of sandals, such as were worn in the\nAbbey of Jumieges.\n\n\"Ha! is this all?  What didst say, child?\" cried Bernard the Dane,\nhastily.\n\n\"He told me it was his greatest treasure!\" repeated Richard.\n\n\"And it was!\" said Abbot Martin.\n\nThen the good Abbot told them the history, part of which was already\nknown to some of them.  About five or six years before, Duke William had\nbeen hunting in the forest of Jumieges, when he had suddenly come on the\nruins of the Abbey, which had been wasted thirty or forty years\npreviously by the Sea-King, Hasting.  Two old monks, of the original\nbrotherhood, still survived, and came forth to greet the Duke, and offer\nhim their hospitality.\n\n\"Ay!\" said Bernard, \"well do I remember their bread; we asked if it was\nmade of fir-bark, like that of our brethren of Norway.\"\n\nWilliam, then an eager, thoughtless young man, turned with disgust from\nthis wretched fare, and throwing the old men some gold, galloped on to\nenjoy his hunting.  In the course of the sport, he was left alone, and\nencountered a wild boar, which threw him down, trampled on him, and left\nhim stretched senseless on the ground, severely injured.  His companions\ncoming up, carried him, as the nearest place of shelter, to the ruins of\nJumieges, where the two old monks gladly received him in the remaining\nportion of their house.  As soon as he recovered his senses, he earnestly\nasked their pardon for his pride, and the scorn he had shown to the\npoverty and patient suffering which he should have reverenced.\n\nWilliam had always been a man who chose the good and refused the evil,\nbut this accident, and the long illness that followed it, made him far\nmore thoughtful and serious than he had ever been before; he made\npreparing for death and eternity his first object, and thought less of\nhis worldly affairs, his wars, and his ducal state.  He rebuilt the old\nAbbey, endowed it richly, and sent for Martin himself from France, to\nbecome the Abbot; he delighted in nothing so much as praying there,\nconversing with the Abbot, and hearing him read holy books; and he felt\nhis temporal affairs, and the state and splendour of his rank, so great a\ntemptation, that he had one day come to the Abbot, and entreated to be\nallowed to lay them aside, and become a brother of the order.  But Martin\nhad refused to receive his vows.  He had told him that he had no right to\nneglect or forsake the duties of the station which God had appointed him;\nthat it would be a sin to leave the post which had been given him to\ndefend; and that the way marked out for him to serve God was by doing\njustice among his people, and using his power to defend the right.  Not\ntill he had done his allotted work, and his son was old enough to take\nhis place as ruler of the Normans, might he cease from his active duties,\nquit the turmoil of the world, and seek the repose of the cloister.  It\nwas in this hope of peaceful retirement, that William had delighted to\ntreasure up the humble garments that he hoped one day to wear in peace\nand holiness.\n\n\"And oh! my noble Duke!\" exclaimed Abbot Martin, bursting into tears, as\nhe finished his narration, \"the Lord hath been very gracious unto thee!\nHe has taken thee home to thy rest, long before thou didst dare to hope\nfor it.\"\n\nSlowly, and with subdued feelings, the Norman Barons left the chamber;\nRichard, whom they seemed to have almost forgotten, wandered to the\nstairs, to find his way to the room where he had slept last night.  He\nhad not made many steps before he heard Osmond's voice say, \"Here, my\nLord;\" he looked up, saw a white cap at a doorway a little above him, he\nbounded up and flew into Dame Astrida's outstretched arms.\n\nHow glad he was to sit in her lap, and lay his wearied head on her bosom,\nwhile, with a worn-out voice, he exclaimed, \"Oh, Fru Astrida!  I am very,\nvery tired of being Duke of Normandy!\"\n\n\n\n\nCHAPTER IV.\n\n\nRichard of Normandy was very anxious to know more of the little boy whom\nhe had seen among his vassals.\n\n\"Ah! the young Baron de Montemar,\" said Sir Eric.  \"I knew his father\nwell, and a brave man he was, though not of northern blood.  He was\nwarden of the marches of the Epte, and was killed by your father's side\nin the inroad of the Viscount du Cotentin, {10} at the time when you were\nborn, Lord Richard.\"\n\n\"But where does he live?  Shall I not see him again?\"\n\n\"Montemar is on the bank of the Epte, in the domain that the French\nwrongfully claim from us.  He lives there with his mother, and if he be\nnot yet returned, you shall see him presently.  Osmond, go you and seek\nout the lodgings of the young Montemar, and tell him the Duke would see\nhim.\"\n\nRichard had never had a playfellow of his own age, and his eagerness to\nsee Alberic de Montemar was great.  He watched from the window, and at\nlength beheld Osmond entering the court with a boy of ten years old by\nhis side, and an old grey-headed Squire, with a golden chain to mark him\nas a Seneschal or Steward of the Castle, walking behind.\n\nRichard ran to the door to meet them, holding out his hand eagerly.\nAlberic uncovered his bright dark hair, bowed low and gracefully, but\nstood as if he did not exactly know what to do next.  Richard grew shy at\nthe same moment, and the two boys stood looking at each other somewhat\nawkwardly.  It was easy to see that they were of different races, so\nunlike were the blue eyes, flaxen hair, and fair face of the young Duke,\nto the black flashing eyes and olive cheek of his French vassal, who,\nthough two years older, was scarcely above him in height; and his slight\nfigure, well-proportioned, active and agile as it was, did not give the\nsame promise of strength as the round limbs and large-boned frame of\nRichard, which even now seemed likely to rival the gigantic stature of\nhis grandfather, Earl Rollo, the Ganger.\n\nFor some minutes the little Duke and the young Baron stood surveying each\nother without a word, and old Sir Eric did not improve matters by saying,\n\"Well, Lord Duke, here he is.  Have you no better greeting for him?\"\n\n\"The children are shame-faced,\" said Fru Astrida, seeing how they both\ncoloured.  \"Is your Lady mother in good health, my young sir?\"\n\nAlberic blushed more deeply, bowed to the old northern lady, and answered\nfast and low in French, \"I cannot speak the Norman tongue.\"\n\nRichard, glad to say something, interpreted Fru Astrida's speech, and\nAlberic readily made courteous reply that his mother was well, and he\nthanked the Dame de Centeville, a French title which sounded new to Fru\nAstrida's ears.  Then came the embarrassment again, and Fru Astrida at\nlast said, \"Take him out, Lord Richard; take him to see the horses in the\nstables, or the hounds, or what not.\"\n\nRichard was not sorry to obey, so out they went into the court of Rollo's\ntower, and in the open air the shyness went off.  Richard showed his own\npony, and Alberic asked if he could leap into the saddle without putting\nhis foot in the stirrup.  No, Richard could not; indeed, even Osmond had\nnever seen it done, for the feats of French chivalry had scarcely yet\nspread into Normandy.\n\n\"Can you?\" said Richard; \"will you show us?\"\n\n\"I know I can with my own pony,\" said Alberic, \"for Bertrand will not let\nme mount in any other way; but I will try with yours, if you desire it,\nmy Lord.\"\n\nSo the pony was led out.  Alberic laid one hand on its mane, and vaulted\non its back in a moment.  Both Osmond and Richard broke out loudly into\nadmiration.  \"Oh, this is nothing!\" said Alberic.  \"Bertrand says it is\nnothing.  Before he grew old and stiff he could spring into the saddle in\nthis manner fully armed.  I ought to do this much better.\"\n\nRichard begged to be shown how to perform the exploit, and Alberic\nrepeated it; then Richard wanted to try, but the pony's patience would\nnot endure any longer, and Alberic said he had learnt on a block of wood,\nand practised on the great wolf-hound.  They wandered about a little\nlonger in the court, and then climbed up the spiral stone stairs to the\nbattlements at the top of the tower, where they looked at the house-tops\nof Rouen close beneath, and the river Seine, broadening and glittering on\none side in its course to the sea, and on the other narrowing to a blue\nribbon, winding through the green expanse of fertile Normandy.  They\nthrew the pebbles and bits of mortar down that they might hear them fall,\nand tried which could stand nearest to the edge of the battlement without\nbeing giddy.  Richard was pleased to find that he could go the nearest,\nand began to tell some of Fru Astrida's stories about the precipices of\nNorway, among which when she was a young girl she used to climb about and\ntend the cattle in the long light summer time.  When the two boys came\ndown again into the hall to dinner, they felt as if they had known each\nother all their lives.  The dinner was laid out in full state, and\nRichard had, as before, to sit in the great throne-like chair with the\nold Count of Harcourt on one side, but, to his comfort, Fru Astrida was\non the other.\n\nAfter the dinner, Alberic de Montemar rose to take his leave, as he was\nto ride half way to his home that afternoon.  Count Bernard, who all\ndinner time had been watching him intently from under his shaggy\neye-brows, at this moment turned to Richard, whom he hardly ever\naddressed, and said to him, \"Hark ye, my Lord, what should you say to\nhave him yonder for a comrade?\"\n\n\"To stay with me?\" cried Richard, eagerly.  \"Oh, thanks, Sir Count; and\nmay he stay?\"\n\n\"You are Lord here.\"\n\n\"Oh, Alberic!\" cried Richard, jumping out of his chair of state, and\nrunning up to him, \"will you not stay with me, and be my brother and\ncomrade?\"\n\nAlberic looked down hesitating.\n\n\"Oh, say that you will!  I will give you horses, and hawks, and hounds,\nand I will love you--almost as well as Osmond.  Oh, stay with me,\nAlberic.\"\n\n\"I must obey you, my Lord,\" said Alberic, \"but--\"\n\n\"Come, young Frenchman, out with it,\" said Bernard,--\"no buts!  Speak\nhonestly, and at once, like a Norman, if you can.\"\n\nThis rough speech seemed to restore the little Baron's self-possession,\nand he looked up bright and bold at the rugged face of the old Dane,\nwhile he said, \"I had rather not stay here.\"\n\n\"Ha! not do service to your Lord?\"\n\n\"I would serve him with all my heart, but I do not want to stay here.  I\nlove the Castle of Montemar better, and my mother has no one but me.\"\n\n\"Brave and true, Sir Frenchman,\" said the old Count, laying his great\nhand on Alberic's head, and looking better pleased than Richard thought\nhis grim features could have appeared.  Then turning to Bertrand,\nAlberic's Seneschal, he said, \"Bear the Count de Harcourt's greetings to\nthe noble Dame de Montemar, and say to her that her son is of a free bold\nspirit, and if she would have him bred up with my Lord Duke, as his\ncomrade and brother in arms, he will find a ready welcome.\"\n\n\"So, Alberic, you will come back, perhaps?\" said Richard.\n\n\"That must be as my mother pleases,\" answered Alberic bluntly, and with\nall due civilities he and his Seneschal departed.\n\nFour or five times a day did Richard ask Osmond and Fru Astrida if they\nthought Alberic would return, and it was a great satisfaction to him to\nfind that every one agreed that it would be very foolish in the Dame de\nMontemar to refuse so good an offer, only Fru Astrida could not quite\nbelieve she would part with her son.  Still no Baron de Montemar arrived,\nand the little Duke was beginning to think less about his hopes, when one\nevening, as he was returning from a ride with Sir Eric and Osmond, he saw\nfour horsemen coming towards them, and a little boy in front.\n\n\"It is Alberic himself, I am sure of it!\" he exclaimed, and so it proved;\nand while the Seneschal delivered his Lady's message to Sir Eric, Richard\nrode up and greeted the welcome guest.\n\n\"Oh, I am very glad your mother has sent you!\"\n\n\"She said she was not fit to bring up a young warrior of the marches,\"\nsaid Alberic.\n\n\"Were you very sorry to come?\"\n\n\"I dare say I shall not mind it soon; and Bertrand is to come and fetch\nme home to visit her every three months, if you will let me go, my Lord.\"\n\nRichard was extremely delighted, and thought he could never do enough to\nmake Rouen pleasant to Alberic, who after the first day or two cheered\nup, missed his mother less, managed to talk something between French and\nNorman to Sir Eric and Fru Astrida, and became a very animated companion\nand friend.  In one respect Alberic was a better playfellow for the Duke\nthan Osmond de Centeville, for Osmond, playing as a grown up man, not for\nhis own amusement, but the child's, had left all the advantages of the\ngame to Richard, who was growing not a little inclined to domineer.  This\nAlberic did not like, unless, as he said, \"it was to be always Lord and\nvassal, and then he did not care for the game,\" and he played with so\nlittle animation that Richard grew vexed.\n\n\"I can't help it,\" said Alberic; \"if you take all the best chances to\nyourself, 'tis no sport for me.  I will do your bidding, as you are the\nDuke, but I cannot like it.\"\n\n\"Never mind my being Duke, but play as we used to do.\"\n\n\"Then let us play as I did with Bertrand's sons at Montemar.  I was their\nBaron, as you are my Duke, but my mother said there would be no sport\nunless we forgot all that at play.\"\n\n\"Then so we will.  Come, begin again, Alberic, and you shall have the\nfirst turn.\"\n\nHowever, Alberic was quite as courteous and respectful to the Duke when\nthey were not at play, as the difference of their rank required; indeed,\nhe had learnt much more of grace and courtliness of demeanour from his\nmother, a Provencal lady, than was yet to be found among the Normans.\nThe Chaplain of Montemar had begun to teach him to read and write, and he\nliked learning much better than Richard, who would not have gone on with\nFather Lucas's lessons at all, if Abbot Martin of Jumieges had not put\nhim in mind that it had been his father's especial desire.\n\nWhat Richard most disliked was, however, the being obliged to sit in\ncouncil.  The Count of Harcourt did in truth govern the dukedom, but\nnothing could be done without the Duke's consent, and once a week at\nleast, there was held in the great hall of Rollo's tower, what was called\na _Parlement_, or \"a talkation,\" where Count Bernard, the Archbishop, the\nBaron de Centeville, the Abbot of Jumieges, and such other Bishops,\nNobles, or Abbots, as might chance to be at Rouen, consulted on the\naffairs of Normandy; and there the little Duke always was forced to be\npresent, sitting up in his chair of state, and hearing rather than\nlistening to, questions about the repairing and guarding of Castles, the\nasking of loans from the vassals, the appeals from the Barons of the\nExchequer, who were then Nobles sent through the duchy to administer\njustice, and the discussions about the proceedings of his neighbours,\nKing Louis of France, Count Foulques of Anjou, and Count Herluin of\nMontreuil, and how far the friendship of Hugh of Paris, and Alan of\nBrittany might be trusted.\n\nVery tired of all this did Richard grow, especially when he found that\nthe Normans had made up their minds not to attempt a war against the\nwicked Count of Flanders.  He sighed most wearily, yawned again and\nagain, and moved restlessly about in his chair; but whenever Count\nBernard saw him doing so, he received so severe a look and sign that he\ngrew perfectly to dread the eye of the fierce old Dane.  Bernard never\nspoke to him to praise him, or to enter into any of his pursuits; he only\ntreated him with the grave distant respect due to him as a Prince, or\nelse now and then spoke a few stern words to him of reproof for this\nrestlessness, or for some other childish folly.\n\nUsed as Richard was to be petted and made much of by the whole house of\nCenteville, he resented this considerably in secret, disliked and feared\nthe old Count, and more than once told Alberic de Montemar, that as soon\nas he was fourteen, when he would be declared of age, he should send\nCount Bernard to take care of his own Castle of Harcourt, instead of\nletting him sit gloomy and grim in the Castle hall in the evening,\nspoiling all their sport.\n\nWinter had set in, and Osmond used daily to take the little Duke and\nAlberic to the nearest sheet of ice, for the Normans still prided\nthemselves on excelling in skating, though they had long since left the\nfrost-bound streams and lakes of Norway.\n\nOne day, as they were returning from the ice, they were surprised, even\nbefore they entered the Castle court, by hearing the trampling of horses'\nfeet, and a sound of voices.\n\n\"What may this mean?\" said Osmond.  \"There must surely be a great arrival\nof the vassals.  The Duke of Brittany, perhaps.\"\n\n\"Oh,\" said Richard, piteously, \"we have had one council already this\nweek.  I hope another is not coming!\"\n\n\"It must import something extraordinary,\" proceeded Osmond.  \"It is a\nmischance that the Count of Harcourt is not at Rouen just now.\"\n\nRichard thought this no mischance at all, and just then, Alberic, who had\nrun on a little before, came back exclaiming, \"They are French.  It is\nthe Frank tongue, not the Norman, that they speak.\"\n\n\"So please you, my Lord,\" said Osmond, stopping short, \"we go not rashly\ninto the midst of them.  I would I knew what were best to do.\"\n\nOsmond rubbed his forehead and stood considering, while the two boys\nlooked at him anxiously.  In a few seconds, before he had come to any\nconclusion, there came forth from the gate a Norman Squire, accompanied\nby two strangers.\n\n\"My Lord Duke,\" said he to Richard, in French, \"Sir Eric has sent me to\nbring you tidings that the King of France has arrived to receive your\nhomage.\"\n\n\"The King!\" exclaimed Osmond.\n\n\"Ay!\" proceeded the Norman, in his own tongue, \"Louis himself, and with a\ntrain looking bent on mischief.  I wish it may portend good to my Lord\nhere.  You see I am accompanied.  I believe from my heart that Louis\nmeant to prevent you from receiving a warning, and taking the boy out of\nhis clutches.\"\n\n\"Ha! what?\" said Richard, anxiously.  \"Why is the King come?  What must I\ndo?\"\n\n\"Go on now, since there is no help for it,\" said Osmond.\n\n\"Greet the king as becomes you, bend the knee, and pay him homage.\"\n\nRichard repeated over to himself the form of homage that he might be\nperfect in it, and walked on into the court; Alberic, Osmond, and the\nrest falling back as he entered.  The court was crowded with horses and\nmen, and it was only by calling out loudly, \"The Duke, the Duke,\" that\nOsmond could get space enough made for them to pass.  In a few moments\nRichard had mounted the steps and stood in the great hall.\n\nIn the chair of state, at the upper end of the room, sat a small spare\nman, of about eight or nine-and-twenty, pale, and of a light complexion,\nwith a rich dress of blue and gold.  Sir Eric and several other persons\nstood respectfully round him, and he was conversing with the Archbishop,\nwho, as well as Sir Eric, cast several anxious glances at the little Duke\nas he advanced up the hall.  He came up to the King, put his knee to the\nground, and was just beginning, \"Louis, King of France, I--\" when he\nfound himself suddenly lifted from the ground in the King's arms, and\nkissed on both cheeks.  Then setting him on his knee, the King exclaimed,\n\"And is this the son of my brave and noble friend, Duke William?  Ah!  I\nshould have known it from his likeness.  Let me embrace you again, dear\nchild, for your father's sake.\"\n\nRichard was rather overwhelmed, but he thought the King very kind,\nespecially when Louis began to admire his height and free-spirited\nbearing, and to lament that his own sons, Lothaire and Carloman, were so\nmuch smaller and more backward.  He caressed Richard again and again,\npraised every word he said--Fru Astrida was nothing to him; and Richard\nbegan to say to himself how strange and unkind it was of Bernard de\nHarcourt to like to find fault with him, when, on the contrary, he\ndeserved all this praise from the King himself.\n\n              [Louis of France and the Little Duke]\n\n\n\n\nCHAPTER V.\n\n\nDuke Richard of Normandy slept in the room which had been his father's;\nAlberic de Montemar, as his page, slept at his feet, and Osmond de\nCenteville had a bed on the floor, across the door, where he lay with his\nsword close at hand, as his young Lord's guard and protector.\n\nAll had been asleep for some little time, when Osmond was startled by a\nslight movement of the door, which could not be pushed open without\nawakening him.  In an instant he had grasped his sword, while he pressed\nhis shoulder to the door to keep it closed; but it was his father's voice\nthat answered him with a few whispered words in the Norse tongue, \"It is\nI, open.\"  He made way instantly, and old Sir Eric entered, treading\ncautiously with bare feet, and sat down on the bed motioning him to do\nthe same, so that they might be able to speak lower.  \"Right, Osmond,\" he\nsaid.  \"It is well to be on the alert, for peril enough is around\nhim--The Frank means mischief!  I know from a sure hand that Arnulf of\nFlanders was in council with him just before he came hither, with his\nfalse tongue, wiling and coaxing the poor child!\"\n\n\"Ungrateful traitor!\" murmured Osmond.  \"Do you guess his purpose?\"\n\n\"Yes, surely, to carry the boy off with him, and so he trusts doubtless\nto cut off all the race of Rollo!  I know his purpose is to bear off the\nDuke, as a ward of the Crown forsooth.  Did you not hear him luring the\nchild with his promises of friendship with the Princes?  I could not\nunderstand all his French words, but I saw it plain enough.\"\n\n\"You will never allow it?\"\n\n\"If he does, it must be across our dead bodies; but taken as we are by\nsurprise, our resistance will little avail.  The Castle is full of\nFrench, the hall and court swarm with them.  Even if we could draw our\nNormans together, we should not be more than a dozen men, and what could\nwe do but die?  That we are ready for, if it may not be otherwise, rather\nthan let our charge be thus borne off without a pledge for his safety,\nand without the knowledge of the states.\"\n\n\"The king could not have come at a worse time,\" said Osmond.\n\n\"No, just when Bernard the Dane is absent.  If he only knew what has\nbefallen, he could raise the country, and come to the rescue.\"\n\n\"Could we not send some one to bear the tidings to-night?\"\n\n\"I know not,\" said Sir Eric, musingly.  \"The French have taken the\nkeeping of the doors; indeed they are so thick through the Castle that I\ncan hardly reach one of our men, nor could I spare one hand that may\navail to guard the boy to-morrow.\"\n\n\"Sir Eric;\" a bare little foot was heard on the floor, and Alberic de\nMontemar stood before him.  \"I did not mean to listen, but I could not\nhelp hearing you.  I cannot fight for the Duke yet, but I could carry a\nmessage.\"\n\n\"How would that be?\" said Osmond, eagerly.  \"Once out of the Castle, and\nin Rouen, he could easily find means of sending to the Count.  He might\ngo either to the Convent of St. Ouen, or, which would be better, to the\ntrusty armourer, Thibault, who would soon find man and horse to send\nafter the Count.\"\n\n\"Ha! let me see,\" said Sir Eric.  \"It might be.  But how is he to get\nout?\"\n\n\"I know a way,\" said Alberic.  \"I scrambled down that wide buttress by\nthe east wall last week, when our ball was caught in a branch of the ivy,\nand the drawbridge is down.\"\n\n\"If Bernard knew, it would be off my mind, at least!\" said Sir Eric.\n\"Well, my young Frenchman, you may do good service.\"\n\n\"Osmond,\" whispered Alberic, as he began hastily to dress himself, \"only\nask one thing of Sir Eric--never to call me young Frenchman again!\"\n\nSir Eric smiled, saying, \"Prove yourself Norman, my boy.\"\n\n\"Then,\" added Osmond, \"if it were possible to get the Duke himself out of\nthe castle to-morrow morning.  If I could take him forth by the postern,\nand once bring him into the town, he would be safe.  It would be only to\nraise the burghers, or else to take refuge in the Church of Our Lady till\nthe Count came up, and then Louis would find his prey out of his hands\nwhen he awoke and sought him.\"\n\n\"That might be,\" replied Sir Eric; \"but I doubt your success.  The French\nare too eager to hold him fast, to let him slip out of their hands.  You\nwill find every door guarded.\"\n\n\"Yes, but all the French have not seen the Duke, and the sight of a\nsquire and a little page going forth, will scarcely excite their\nsuspicion.\"\n\n\"Ay, if the Duke would bear himself like a little page; but that you need\nnot hope for.  Besides, he is so taken with this King's flatteries, that\nI doubt whether he would consent to leave him for the sake of Count\nBernard.  Poor child, he is like to be soon taught to know his true\nfriends.\"\n\n\"I am ready,\" said Alberic, coming forward.\n\nThe Baron de Centeville repeated his instructions, and then undertook to\nguard the door, while his son saw Alberic set off on his expedition.\nOsmond went with him softly down the stairs, then avoiding the hall,\nwhich was filled with French, they crept silently to a narrow window,\nguarded by iron bars, placed at such short intervals apart that only so\nsmall and slim a form as Alberic's could have squeezed out between them.\nThe distance to the ground was not much more than twice his own height,\nand the wall was so covered with ivy, that it was not a very dangerous\nfeat for an active boy, so that Alberic was soon safe on the ground, then\nlooking up to wave his cap, he ran on along the side of the moat, and was\nsoon lost to Osmond's sight in the darkness.\n\nOsmond returned to the Duke's chamber, and relieved his father's guard,\nwhile Richard slept soundly on, little guessing at the plots of his\nenemies, or at the schemes of his faithful subjects for his protection.\n\nOsmond thought this all the better, for he had small trust in Richard's\npatience and self-command, and thought there was much more chance of\ngetting him unnoticed out of the Castle, if he did not know how much\ndepended on it, and how dangerous his situation was.\n\nWhen Richard awoke, he was much surprised at missing Alberic, but Osmond\nsaid he was gone into the town to Thibault the armourer, and this was a\nmessage on which he was so likely to be employed that Richard's suspicion\nwas not excited.  All the time he was dressing he talked about the King,\nand everything he meant to show him that day; then, when he was ready,\nthe first thing was as usual to go to attend morning mass.\n\n\"Not by that way, to-day, my Lord,\" said Osmond, as Richard was about to\nenter the great hall.  \"It is crowded with the French who have been\nsleeping there all night; come to the postern.\"\n\nOsmond turned, as he spoke, along the passage, walking fast, and not\nsorry that Richard was lingering a little, as it was safer for him to be\nfirst.  The postern was, as he expected, guarded by two tall steel-cased\nfigures, who immediately held their lances across the door-way, saying,\n\"None passes without warrant.\"\n\n\"You will surely let us of the Castle attend to our daily business,\" said\nOsmond.  \"You will hardly break your fast this morning if you stop all\ncommunication with the town.\"\n\n\"You must bring warrant,\" repeated one of the men-at-arms.  Osmond was\nbeginning to say that he was the son of the Seneschal of the Castle, when\nRichard came hastily up.  \"What?  Do these men want to stop us?\" he\nexclaimed in the imperious manner he had begun to take up since his\naccession.  \"Let us go on, sirs.\"\n\nThe men-at-arms looked at each other, and guarded the door more closely.\nOsmond saw it was hopeless, and only wanted to draw his young charge back\nwithout being recognised, but Richard exclaimed loudly, \"What means\nthis?\"\n\n\"The King has given orders that none should pass without warrant,\" was\nOsmond's answer.  \"We must wait.\"\n\n\"I will pass!\" said Richard, impatient at opposition, to which he was\nlittle accustomed.  \"What mean you, Osmond?  This is my Castle, and no\none has a right to stop me.  Do you hear, grooms? let me go.  I am the\nDuke!\"\n\nThe sentinels bowed, but all they said was, \"Our orders are express.\"\n\n\"I tell you I am Duke of Normandy, and I will go where I please in my own\ncity!\" exclaimed Richard, passionately pressing against the crossed\nstaves of the weapons, to force his way between them, but he was caught\nand held fast in the powerful gauntlet of one of the men-at-arms.  \"Let\nme go, villain!\" cried he, struggling with all his might.  \"Osmond,\nOsmond, help!\"\n\nEven as he spoke Osmond had disengaged him from the grasp of the\nFrenchman, and putting his hand on his arm, said, \"Nay, my Lord, it is\nnot for you to strive with such as these.\"\n\n\"I will strive!\" cried the boy.  \"I will not have my way barred in my own\nCastle.  I will tell the King how these rogues of his use me.  I will\nhave them in the dungeon.  Sir Eric! where is Sir Eric?\"\n\nAway he rushed to the stairs, Osmond hurrying after him, lest he should\nthrow himself into some fresh danger, or by his loud calls attract the\nFrench, who might then easily make him prisoner.  However, on the very\nfirst step of the stairs stood Sir Eric, who was too anxious for the\nsuccess of the attempt to escape, to be very far off.  Richard, too angry\nto heed where he was going, dashed up against him without seeing him, and\nas the old Baron took hold of him, began, \"Sir Eric, Sir Eric, those\nFrench are villains! they will not let me pass--\"\n\n\"Hush, hush! my Lord,\" said Sir Eric.  \"Silence! come here.\"\n\nHowever imperious with others, Richard from force of habit always obeyed\nSir Eric, and now allowed himself to be dragged hastily and silently by\nhim, Osmond following closely, up the stairs, up a second and a third\nwinding flight, still narrower, and with broken steps, to a small round,\nthick-walled turret chamber, with an extremely small door, and loop-holes\nof windows high up in the tower.  Here, to his great surprise, he found\nDame Astrida, kneeling and telling her beads, two or three of her\nmaidens, and about four of the Norman Squires and men-at-arms.\n\n\"So you have failed, Osmond?\" said the Baron.\n\n\"But what is all this?  How did Fru Astrida come up here?  May I not go\nto the King and have those insolent Franks punished?\"\n\n\"Listen to me, Lord Richard,\" said Sir Eric: \"that smooth-spoken King\nwhose words so charmed you last night is an ungrateful deceiver.  The\nFranks have always hated and feared the Normans, and not being able to\nconquer us fairly, they now take to foul means.  Louis came hither from\nFlanders, he has brought this great troop of French to surprise us, claim\nyou as a ward of the crown, and carry you away with him to some prison of\nhis own.\"\n\n\"You will not let me go?\" said Richard.\n\n\"Not while I live,\" said Sir Eric.  \"Alberic is gone to warn the Count of\nHarcourt, to call the Normans together, and here we are ready to defend\nthis chamber to our last breath, but we are few, the French are many, and\nsuccour may be far off.\"\n\n\"Then you meant to have taken me out of their reach this morning,\nOsmond?\"\n\n\"Yes, my Lord.\"\n\n\"And if I had not flown into a passion and told who I was, I might have\nbeen safe!  O Sir Eric!  Sir Eric! you will not let me be carried off to\na French prison!\"\n\n\"Here, my child,\" said Dame Astrida, holding out her arms, \"Sir Eric will\ndo all he can for you, but we are in God's hands!\"\n\nRichard came and leant against her.  \"I wish I had not been in a\npassion!\" said he, sadly, after a silence; then looking at her in\nwonder--\"But how came you up all this way?\"\n\n\"It is a long way for my old limbs,\" said Fru Astrida, smiling, \"but my\nson helped me, and he deems it the only safe place in the Castle.\"\n\n\"The safest,\" said Sir Eric, \"and that is not saying much for it.\"\n\n\"Hark!\" said Osmond, \"what a tramping the Franks are making.  They are\nbeginning to wonder where the Duke is.\"\n\n\"To the stairs, Osmond,\" said Sir Eric.  \"On that narrow step one man may\nkeep them at bay a long time.  You can speak their jargon too, and hold\nparley with them.\"\n\n\"Perhaps they will think I am gone,\" whispered Richard, \"if they cannot\nfind me, and go away.\"\n\nOsmond and two of the Normans were, as he spoke, taking their stand on\nthe narrow spiral stair, where there was just room for one man on the\nstep.  Osmond was the lowest, the other two above him, and it would have\nbeen very hard for an enemy to force his way past them.\n\nOsmond could plainly hear the sounds of the steps and voices of the\nFrench as they consulted together, and sought for the Duke.  A man at\nlength was heard clanking up these very stairs, till winding round, he\nsuddenly found himself close upon young de Centeville.\n\n\"Ha!  Norman!\" he cried, starting back in amazement, \"what are you doing\nhere?\"\n\n\"My duty,\" answered Osmond, shortly.  \"I am here to guard this stair;\"\nand his drawn sword expressed the same intention.\n\nThe Frenchman drew back, and presently a whispering below was heard, and\nsoon after a voice came up the stairs, saying, \"Norman--good Norman--\"\n\n\"What would you say?\" replied Osmond, and the head of another Frank\nappeared.  \"What means all this, my friend?\" was the address.  \"Our King\ncomes as a guest to you, and you received him last evening as loyal\nvassals.  Wherefore have you now drawn out of the way, and striven to\nbear off your young Duke into secret places?  Truly it looks not well\nthat you should thus strive to keep him apart, and therefore the King\nrequires to see him instantly.\"\n\n\"Sir Frenchman,\" replied Osmond, \"your King claims the Duke as his ward.\nHow that may be my father knows not, but as he was committed to his\ncharge by the states of Normandy, he holds himself bound to keep him in\nhis own hands until further orders from them.\"\n\n\"That means, insolent Norman, that you intend to shut the boy up and keep\nhim in your own rebel hands.  You had best yield--it will be the better\nfor you and for him.  The child is the King's ward, and he shall not be\nleft to be nurtured in rebellion by northern pirates.\"\n\nAt this moment a cry from without arose, so loud as almost to drown the\nvoices of the speakers on the turret stair, a cry welcome to the ears of\nOsmond, repeated by a multitude of voices, \"Haro!  Haro! our little\nDuke!\"\n\nIt was well known as a Norman shout.  So just and so ready to redress all\ngrievances had the old Duke Rollo been, that his very name was an appeal\nagainst injustice, and whenever wrong was done, the Norman outcry against\nthe injury was always \"Ha Rollo!\" or as it had become shortened, \"Haro.\"\nAnd now Osmond knew that those whose affection had been won by the\nuprightness of Rollo, were gathering to protect his helpless grandchild.\n\nThe cry was likewise heard by the little garrison in the turret chamber,\nbringing hope and joy.  Richard thought himself already rescued, and\nspringing from Fru Astrida, danced about in ecstasy, only longing to see\nthe faithful Normans, whose voices he heard ringing out again and again,\nin calls for their little Duke, and outcries against the Franks.  The\nwindows were, however, so high, that nothing could be seen from them but\nthe sky; and, like Richard, the old Baron de Centeville was almost beside\nhimself with anxiety to know what force was gathered together, and what\nmeasures were being taken.  He opened the door, called to his son, and\nasked if he could tell what was passing, but Osmond knew as little--he\ncould see nothing but the black, cobwebbed, dusty steps winding above his\nhead, while the clamours outside, waxing fiercer and louder, drowned all\nthe sounds which might otherwise have come up to him from the French\nwithin the Castle.  At last, however, Osmond called out to his father, in\nNorse, \"There is a Frank Baron come to entreat, and this time very\nhumbly, that the Duke may come to the King.\"\n\n\"Tell him,\" replied Sir Eric, \"that save with consent of the council of\nNormandy, the child leaves not my hands.\"\n\n\"He says,\" called back Osmond, after a moment, \"that you shall guard him\nyourself, with as many as you choose to bring with you.  He declares on\nthe faith of a free Baron, that the King has no thought of ill--he wants\nto show him to the Rouennais without, who are calling for him, and\nthreaten to tear down the tower rather than not see their little Duke.\nShall I bid him send a hostage?\"\n\n\"Answer him,\" returned the Baron, \"that the Duke leaves not this chamber\nunless a pledge is put into our hands for his safety.  There was an\noily-tongued Count, who sat next the King at supper--let him come hither,\nand then perchance I may trust the Duke among them.\"\n\nOsmond gave the desired reply, which was carried to the King.  Meantime\nthe uproar outside grew louder than ever, and there were new sounds, a\nhorn was winded, and there was a shout of \"_Dieu aide_!\" the Norman\nwar-cry, joined with \"Notre Dame de Harcourt!\"\n\n\"There, there!\" cried Sir Eric, with a long breath, as if relieved of\nhalf his anxieties, \"the boy has sped well.  Bernard is here at last!\nNow his head and hand are there, I doubt no longer.\"\n\n\"Here comes the Count,\" said Osmond, opening the door, and admitting a\nstout, burly man, who seemed sorely out of breath with the ascent of the\nsteep, broken stair, and very little pleased to find himself in such a\nsituation.  The Baron de Centeville augured well from the speed with\nwhich he had been sent, thinking it proved great perplexity and distress\non the part of Louis.  Without waiting to hear his hostage speak, he\npointed to a chest on which he had been sitting, and bade two of his\nmen-at-arms stand on each side of the Count, saying at the same time to\nFru Astrida, \"Now, mother, if aught of evil befalls the child, you know\nyour part.  Come, Lord Richard.\"\n\nRichard moved forward.  Sir Eric held his hand.  Osmond kept close behind\nhim, and with as many of the men-at-arms as could be spared from guarding\nFru Astrida and her hostage, he descended the stairs, not by any means\nsorry to go, for he was weary of being besieged in that turret chamber,\nwhence he could see nothing, and with those friendly cries in his ears,\nhe could not be afraid.\n\nHe was conducted to the large council-room which was above the hall.\nThere, the King was walking up and down anxiously, looking paler than his\nwont, and no wonder, for the uproar sounded tremendous there--and now and\nthen a stone dashed against the sides of the deep window.\n\nNearly at the same moment as Richard entered by one door, Count Bernard\nde Harcourt came in from the other, and there was a slight lull in the\ntumult.\n\n\"What means this, my Lords?\" exclaimed the King.  \"Here am I come in all\ngood will, in memory of my warm friendship with Duke William, to take on\nme the care of his orphan, and hold council with you for avenging his\ndeath, and is this the greeting you afford me?  You steal away the child,\nand stir up the rascaille of Rouen against me.  Is this the reception for\nyour King?\"\n\n\"Sir King,\" replied Bernard, \"what your intentions may be, I know not.\nAll I do know is, that the burghers of Rouen are fiercely incensed\nagainst you--so much so, that they were almost ready to tear me to pieces\nfor being absent at this juncture.  They say that you are keeping the\nchild prisoner in his own Castle and that they will have him restored if\nthey tear it down to the foundations.\"\n\n\"You are a true man, a loyal man--you understand my good intentions,\"\nsaid Louis, trembling, for the Normans were extremely dreaded.  \"You\nwould not bring the shame of rebellion on your town and people.  Advise\nme--I will do just as you counsel me--how shall I appease them?\"\n\n\"Take the child, lead him to the window, swear that you mean him no evil,\nthat you will not take him from us,\" said Bernard.  \"Swear it on the\nfaith of a King.\"\n\n\"As a King--as a Christian, it is true!\" said Louis.  \"Here, my boy!\nWherefore shrink from me?  What have I done, that you should fear me?\nYou have been listening to evil tales of me, my child.  Come hither.\"\n\nAt a sign from the Count de Harcourt, Sir Eric led Richard forward, and\nput his hand into the King's.  Louis took him to the window, lifted him\nupon the sill, and stood there with his arm round him, upon which the\nshout, \"Long live Richard, our little Duke!\" arose again.  Meantime, the\ntwo Centevilles looked in wonder at the old Harcourt, who shook his head\nand muttered in his own tongue, \"I will do all I may, but our force is\nsmall, and the King has the best of it.  We must not yet bring a war on\nourselves.\"\n\n\"Hark! he is going to speak,\" said Osmond.\n\n\"Fair Sirs!--excellent burgesses!\" began the King, as the cries lulled a\nlittle. {11}  \"I rejoice to see the love ye bear to our young Prince!  I\nwould all my subjects were equally loyal!  But wherefore dread me, as if\nI were come to injure him?  I, who came but to take counsel how to avenge\nthe death of his father, who brought me back from England when I was a\nfriendless exile.  Know ye not how deep is the debt of gratitude I owe to\nDuke William?  He it was who made me King--it was he who gained me the\nlove of the King of Germany; he stood godfather for my son--to him I owe\nall my wealth and state, and all my care is to render guerdon for it to\nhis child, since, alas!  I may not to himself.  Duke William rests in his\nbloody grave!  It is for me to call his murderers to account, and to\ncherish his son, even as mine own!\"\n\nSo saying, Louis tenderly embraced the little boy, and the Rouennais\nbelow broke out into another cry, in which \"Long live King Louis,\" was\njoined with \"Long live Richard!\"\n\n\"You will not let the child go?\" said Eric, meanwhile, to Harcourt.\n\n\"Not without provision for his safety, but we are not fit for war as yet,\nand to let him go is the only means of warding it off.\"\n\nEric groaned and shook his head; but the Count de Harcourt's judgment was\nof such weight with him, that he never dreamt of disputing it.\n\n\"Bring me here,\" said the King, \"all that you deem most holy, and you\nshall see me pledge myself to be your Duke's most faithful friend.\"\n\nThere was some delay, during which the Norman Nobles had time for further\ncounsel together, and Richard looked wistfully at them, wondering what\nwas to happen to him, and wishing he could venture to ask for Alberic.\n\nSeveral of the Clergy of the Cathedral presently appeared in procession,\nbringing with them the book of the Gospels on which Richard had taken his\ninstallation oath, with others of the sacred treasures of the Church,\npreserved in gold cases.  The Priests were followed by a few of the\nNorman Knights and Nobles, some of the burgesses of Rouen, and, to\nRichard's great joy, by Alberic de Montemar himself.  The two boys stood\nlooking eagerly at each other, while preparation was made for the\nceremony of the King's oath.\n\nThe stone table in the middle of the room was cleared, and arranged so as\nin some degree to resemble the Altar in the Cathedral; then the Count de\nHarcourt, standing before it, and holding the King's hand, demanded of\nhim whether he would undertake to be the friend, protector, and good Lord\nof Richard, Duke of Normandy, guarding him from all his enemies, and ever\nseeking his welfare.  Louis, with his hand on the Gospels, \"swore that so\nhe would.\"\n\n\"Amen!\" returned Bernard the Dane, solemnly, \"and as thou keepest that\noath to the fatherless child, so may the Lord do unto thine house!\"\n\nThen followed the ceremony, which had been interrupted the night before,\nof the homage and oath of allegiance which Richard owed to the King, and,\non the other hand, the King's formal reception of him as a vassal,\nholding, under him, the two dukedoms of Normandy and Brittany.  \"And,\"\nsaid the King, raising him in his arms and kissing him, \"no dearer vassal\ndo I hold in all my realm than this fair child, son of my murdered friend\nand benefactor--precious to me as my own children, as so on my Queen and\nI hope to testify.\"\n\nRichard did not much like all this embracing; but he was sure the King\nreally meant him no ill, and he wondered at all the distrust the\nCentevilles had shown.\n\n\"Now, brave Normans,\" said the King, \"be ye ready speedily, for an onset\non the traitor Fleming.  The cause of my ward is my own cause.  Soon\nshall the trumpet be sounded, the ban and arriere ban of the realm be\ncalled forth, and Arnulf, in the flames of his cities, and the blood of\nhis vassals, shall learn to rue the day when his foot trod the Isle of\nPecquigny!  How many Normans can you bring to the muster, Sir Count?\"\n\n\"I cannot say, within a few hundreds of lances,\" replied the old Dane,\ncautiously; \"it depends on the numbers that may be engaged in the Italian\nwar with the Saracens, but of this be sure, Sir King, that every man in\nNormandy and Brittany who can draw a sword or bend a bow, will stand\nforth in the cause of our little Duke; ay, and that his blessed father's\nmemory is held so dear in our northern home, that it needs but a message\nto King Harold Blue-tooth to bring a fleet of long keels into the Seine,\nwith stout Danes enough to carry fire and sword, not merely through\nFlanders, but through all France.  We of the North are not apt to forget\nold friendships and favours, Sir King.\"\n\n\"Yes, yes, I know the Norman faith of old,\" returned Louis, uneasily,\n\"but we should scarcely need such wild allies as you propose; the Count\nof Paris, and Hubert of Senlis may be reckoned on, I suppose.\"\n\n\"No truer friend to Normandy than gallant and wise old Hugh the White!\"\nsaid Bernard, \"and as to Senlis, he is uncle to the boy, and doubly bound\nto us.\"\n\n\"I rejoice to see your confidence,\" said Louis.  \"You shall soon hear\nfrom me.  In the meantime I must return to gather my force together, and\nsummon my great vassals, and I will, with your leave, brave Normans, take\nwith me my dear young ward.  His presence will plead better in his cause\nthan the finest words; moreover, he will grow up in love and friendship\nwith my two boys, and shall be nurtured with them in all good learning\nand chivalry, nor shall he ever be reminded that he is an orphan while\nunder the care of Queen Gerberge and myself.\"\n\n\"Let the child come to me, so please you, my Lord the King,\" answered\nHarcourt, bluntly.  \"I must hold some converse with him, ere I can\nreply.\"\n\n\"Go then, Richard,\" said Louis, \"go to your trusty vassal--happy are you\nin possessing such a friend; I hope you know his value.\"\n\n\"Here then, young Sir,\" said the Count, in his native tongue, when\nRichard had crossed from the King's side, and stood beside him, \"what say\nyou to this proposal?\"\n\n\"The King is very kind,\" said Richard.  \"I am sure he is kind; but I do\nnot like to go from Rouen, or from Dame Astrida.\"\n\n\"Listen, my Lord,\" said the Dane, stooping down and speaking low.  \"The\nKing is resolved to have you away; he has with him the best of his\nFranks, and has so taken us at unawares, that though I might yet rescue\nyou from his hands, it would not be without a fierce struggle, wherein\nyou might be harmed, and this castle and town certainly burnt, and\nwrested from us.  A few weeks or months, and we shall have time to draw\nour force together, so that Normandy need fear no man, and for that time\nyou must tarry with him.\"\n\n\"Must I--and all alone?\"\n\n\"No, not alone, not without the most trusty guardian that can be found\nfor you.  Friend Eric, what say you?\" and he laid his hand on the old\nBaron's shoulder.  \"Yet, I know not; true thou art, as a Norwegian\nmountain, but I doubt me if thy brains are not too dull to see through\nthe French wiles and disguises, sharp as thou didst show thyself last\nnight.\"\n\n\"That was Osmond, not I,\" said Sir Eric.  \"He knows their mincing tongue\nbetter than I.  He were the best to go with the poor child, if go he\nmust.\"\n\n\"Bethink you, Eric,\" said the Count, in an undertone, \"Osmond is the only\nhope of your good old house--if there is foul play, the guardian will be\nthe first to suffer.\"\n\n\"Since you think fit to peril the only hope of all Normandy, I am not the\nman to hold back my son where he may aid him,\" said old Eric, sadly.\n\"The poor child will be lonely and uncared-for there, and it were hard he\nshould not have one faithful comrade and friend with him.\"\n\n\"It is well,\" said Bernard: \"young as he is, I had rather trust Osmond\nwith the child than any one else, for he is ready of counsel, and quick\nof hand.\"\n\n\"Ay, and a pretty pass it is come to,\" muttered old Centeville, \"that we,\nwhose business it is to guard the boy, should send him where you scarcely\nlike to trust my son.\"\n\nBernard paid no further attention to him, but, coming forward, required\nanother oath from the King, that Richard should be as safe and free at\nhis court as at Rouen, and that on no pretence whatsoever should he be\ntaken from under the immediate care of his Esquire, Osmond Fitz Eric,\nheir of Centeville.\n\nAfter this, the King was impatient to depart, and all was preparation.\nBernard called Osmond aside to give full instructions on his conduct, and\nthe means of communicating with Normandy, and Richard was taking leave of\nFru Astrida, who had now descended from her turret, bringing her hostage\nwith her.  She wept much over her little Duke, praying that he might\nsafely be restored to Normandy, even though she might not live to see it;\nshe exhorted him not to forget the good and holy learning in which he had\nbeen brought up, to rule his temper, and, above all, to say his prayers\nconstantly, never leaving out one, as the beads of his rosary reminded\nhim of their order.  As to her own grandson, anxiety for him seemed\nalmost lost in her fears for Richard, and the chief things she said to\nhim, when he came to take leave of her, were directions as to the care he\nwas to take of the child, telling him the honour he now received was one\nwhich would make his name forever esteemed if he did but fulfil his\ntrust, the most precious that Norman had ever yet received.\n\n\"I will, grandmother, to the very best of my power,\" said Osmond; \"I may\ndie in his cause, but never will I be faithless!\"\n\n\"Alberic!\" said Richard, \"are you glad to be going back to Montemar?\"\n\n\"Yes, my Lord,\" answered Alberic, sturdily, \"as glad as you will be to\ncome back to Rouen.\"\n\n\"Then I shall send for you directly, Alberic, for I shall never love the\nPrinces Carloman and Lothaire half as well as you!\"\n\n\"My Lord the King is waiting for the Duke,\" said a Frenchman, coming\nforward.\n\n\"Farewell then, Fru Astrida.  Do not weep.  I shall soon come back.\nFarewell, Alberic.  Take the bar-tailed falcon back to Montemar, and keep\nhim for my sake.  Farewell, Sir Eric--Farewell, Count Bernard.  When the\nNormans come to conquer Arnulf you will lead them.  O dear, dear Fru\nAstrida, farewell again.\"\n\n\"Farewell, my own darling.  The blessing of Heaven go with you, and bring\nyou safe home!  Farewell, Osmond.  Heaven guard you and strengthen you to\nbe his shield and his defence!\"\n\n\n\n\nCHAPTER VI.\n\n\nAway from the tall narrow gateway of Rollo's Tower, with the cluster of\nfriendly, sorrowful faces looking forth from it, away from the booth-like\nshops of Rouen, and the stout burghers shouting with all the power of\ntheir lungs, \"Long live Duke Richard!  Long live King Louis!  Death to\nthe Fleming!\"--away from the broad Seine--away from home and friends,\nrode the young Duke of Normandy, by the side of the palfrey of the King\nof France.\n\nThe King took much notice of him, kept him by his side, talked to him,\nadmired the beautiful cattle grazing in security in the green pastures,\nand, as he looked at the rich dark brown earth of the fields, the Castles\ntowering above the woods, the Convents looking like great farms, the many\nvillages round the rude Churches, and the numerous population who came\nout to gaze at the party, and repeat the cry of \"Long live the King!\nBlessings on the little Duke!\" he told Richard, again and again, that his\nwas the most goodly duchy in France and Germany to boot.\n\nWhen they crossed the Epte, the King would have Richard in the same boat\nwith him, and sitting close to Louis, and talking eagerly about falcons\nand hounds, the little Duke passed the boundary of his own dukedom.\n\nThe country beyond was not like Normandy.  First they came to a great\nforest, which seemed to have no path through it.  The King ordered that\none of the men, who had rowed them across, should be made to serve as\nguide, and two of the men-at-arms took him between them, and forced him\nto lead the way, while others, with their swords and battle-axes, cut\ndown and cleared away the tangled branches and briars that nearly choked\nthe path.  All the time, every one was sharply on the look-out for\nrobbers, and the weapons were all held ready for use at a moment's\nnotice.  On getting beyond the forest a Castle rose before them, and,\nthough it was not yet late in the day, they resolved to rest there, as a\nmarsh lay not far before them, which it would not have been safe to\ntraverse in the evening twilight.\n\nThe Baron of the Castle received them with great respect to the King, but\nwithout paying much attention to the Duke of Normandy, and Richard did\nnot find the second place left for him at the board.  He coloured\nviolently, and looked first at the King, and then at Osmond, but Osmond\nheld up his finger in warning; he remembered how he had lost his temper\nbefore, and what had come of it, and resolved to try to bear it better;\nand just then the Baron's daughter, a gentle-looking maiden of fifteen or\nsixteen, came and spoke to him, and entertained him so well, that he did\nnot think much more of his offended dignity.--When they set off on their\njourney again, the Baron and several of his followers came with them to\nshow the only safe way across the morass, and a very slippery,\ntreacherous, quaking road it was, where the horses' feet left pools of\nwater wherever they trod.  The King and the Baron rode together, and the\nother French Nobles closed round them; Richard was left quite in the\nbackground, and though the French men-at-arms took care not to lose sight\nof him, no one offered him any assistance, excepting Osmond, who, giving\nhis own horse to Sybald, one of the two Norman grooms who accompanied\nhim, led Richard's horse by the bridle along the whole distance of the\nmarshy path, a business that could scarcely have been pleasant, as Osmond\nwore his heavy hauberk, and his pointed, iron-guarded boots sunk deep at\nevery step into the bog.  He spoke little, but seemed to be taking good\nheed of every stump of willow or stepping-stone that might serve as a\nnote of remembrance of the path.\n\nAt the other end of the morass began a long tract of dreary-looking,\nheathy waste, without a sign of life.  The Baron took leave of the King,\nonly sending three men-at-arms, to show him the way to a monastery, which\nwas to be the next halting-place.  He sent three, because it was not safe\nfor one, even fully armed, to ride alone, for fear of the attacks of the\nfollowers of a certain marauding Baron, who was at deadly feud with him,\nand made all that border a most perilous region.  Richard might well\nobserve that he did not like the Vexin half as well as Normandy, and that\nthe people ought to learn Fru Astrida's story of the golden bracelets,\nwhich, in his grandfather's time, had hung untouched for a year, in a\ntree in a forest.\n\nIt was pretty much the same through the whole journey, waste lands,\nmarshes, and forests alternated.  The Castles stood on high mounds\nfrowning on the country round, and villages were clustered round them,\nwhere the people either fled away, driving off their cattle with them at\nthe first sight of an armed band, or else, if they remained, proved to be\nthin, wretched-looking creatures, with wasted limbs, aguish faces, and\noften iron collars round their necks.  Wherever there was anything of\nmore prosperous appearance, such as a few cornfields, vineyards on the\nslopes of the hills, fat cattle, and peasantry looking healthy and\nsecure, there was sure to be seen a range of long low stone buildings,\nsurmounted with crosses, with a short square Church tower rising in the\nmidst, and interspersed with gnarled hoary old apple-trees, or with\ngardens of pot-herbs spreading before them to the meadows.  If, instead\nof two or three men-at-arms from a Castle, or of some trembling serf\npressed into the service, and beaten, threatened, and watched to prevent\ntreachery, the King asked for a guide at a Convent, some lay brother\nwould take his staff; or else mount an ass, and proceed in perfect\nconfidence and security as to his return homewards, sure that his poverty\nand his sacred character would alike protect him from any outrage from\nthe most lawless marauder of the neighbourhood.\n\nThus they travelled until they reached the royal Castle of Laon, where\nthe Fleur-de-Lys standard on the battlements announced the presence of\nGerberge, Queen of France, and her two sons.  The King rode first into\nthe court with his Nobles, and before Richard could follow him through\nthe narrow arched gateway, he had dismounted, entered the Castle, and was\nout of sight.  Osmond held the Duke's stirrup, and followed him up the\nsteps which led to the Castle Hall.  It was full of people, but no one\nmade way, and Richard, holding his Squire's hand, looked up in his face,\ninquiring and bewildered.\n\n\"Sir Seneschal,\" said Osmond, seeing a broad portly old man, with grey\nhair and a golden chain, \"this is the Duke of Normandy--I pray you\nconduct him to the King's presence.\"\n\nRichard had no longer any cause to complain of neglect, for the Seneschal\ninstantly made him a very low bow, and calling \"Place--place for the high\nand mighty Prince, my Lord Duke of Normandy!\" ushered him up to the dais\nor raised part of the floor, where the King and Queen stood together\ntalking.  The Queen looked round, as Richard was announced, and he saw\nher face, which was sallow, and with a sharp sour expression that did not\nplease him, and he backed and looked reluctant, while Osmond, with a\nwarning hand pressed on his shoulder, was trying to remind him that he\nought to go forward, kneel on one knee, and kiss her hand.\n\n\"There he is,\" said the King.\n\n\"One thing secure!\" said the Queen; \"but what makes that northern giant\nkeep close to his heels?\"\n\nLouis answered something in a low voice, and, in the meantime, Osmond\ntried in a whisper to induce his young Lord to go forward and perform his\nobeisance.\n\n\"I tell you I will not,\" said Richard.  \"She looks cross, and I do not\nlike her.\"\n\nLuckily he spoke his own language; but his look and air expressed a good\ndeal of what he said, and Gerberge looked all the more unattractive.\n\n\"A thorough little Norwegian bear,\" said the King; \"fierce and unruly as\nthe rest.  Come, and perform your courtesy--do you forget where you are?\"\nhe added, sternly.\n\nRichard bowed, partly because Osmond forced down his shoulder; but he\nthought of old Rollo and Charles the Simple, and his proud heart resolved\nthat he would never kiss the hand of that sour-looking Queen.  It was a\ndetermination made in pride and defiance, and he suffered for it\nafterwards; but no more passed now, for the Queen only saw in his\nbehaviour that of an unmannerly young Northman: and though she disliked\nand despised him, she did not care enough about his courtesy to insist on\nits being paid.  She sat down, and so did the King, and they went on\ntalking; the King probably telling her his adventures at Rouen, while\nRichard stood on the step of the dais, swelling with sullen pride.\n\nNearly a quarter of an hour had passed in this manner when the servants\ncame to set the table for supper, and Richard, in spite of his indignant\nlooks, was forced to stand aside.  He wondered that all this time he had\nnot seen the two Princes, thinking how strange he should have thought it,\nto let his own dear father be in the house so long without coming to\nwelcome him.  At last, just as the supper had been served up, a side door\nopened, and the Seneschal called, \"Place for the high and mighty Princes,\nmy Lord Lothaire and my Lord Carloman!\" and in walked two boys, one about\nthe same age as Richard, the other rather less than a year younger.  They\nwere both thin, pale, sharp-featured children, and Richard drew himself\nup to his full height, with great satisfaction at being so much taller\nthan Lothaire.\n\nThey came up ceremoniously to their father and kissed his hand, while he\nkissed their foreheads, and then said to them, \"There is a new\nplay-fellow for you.\"\n\n\"Is that the little Northman?\" said Carloman, turning to stare at Richard\nwith a look of curiosity, while Richard in his turn felt considerably\naffronted that a boy so much less than himself should call him little.\n\n\"Yes,\" said the Queen; \"your father has brought him home with him.\"\n\nCarloman stepped forward, shyly holding out his hand to the stranger, but\nhis brother pushed him rudely aside.  \"I am the eldest; it is my business\nto be first.  So, young Northman, you are come here for us to play with.\"\n\nRichard was too much amazed at being spoken to in this imperious way to\nmake any answer.  He was completely taken by surprise, and only opened\nhis great blue eyes to their utmost extent.\n\n\"Ha! why don't you answer?  Don't you hear?  Can you speak only your own\nheathen tongue?\" continued Lothaire.\n\n\"The Norman is no heathen tongue!\" said Richard, at once breaking silence\nin a loud voice.  \"We are as good Christians as you are--ay, and better\ntoo.\"\n\n\"Hush! hush! my Lord!\" said Osmond.\n\n\"What now, Sir Duke,\" again interfered the King, in an angry tone, \"are\nyou brawling already?  Time, indeed, I should take you from your own\nsavage court.  Sir Squire, look to it, that you keep your charge in\nbetter rule, or I shall send him instantly to bed, supperless.\"\n\n\"My Lord, my Lord,\" whispered Osmond, \"see you not that you are bringing\ndiscredit on all of us?\"\n\n\"I would be courteous enough, if they would be courteous to me,\" returned\nRichard, gazing with eyes full of defiance at Lothaire, who, returning an\nangry look, had nevertheless shrunk back to his mother.  She meanwhile\nwas saying, \"So strong, so rough, the young savage is, he will surely\nharm our poor boys!\"\n\n\"Never fear,\" said Louis; \"he shall be watched.  And,\" he added in a\nlower tone, \"for the present, at least, we must keep up appearances.\nHubert of Senlis, and Hugh of Paris, have their eyes on us, and were the\nboy to be missed, the grim old Harcourt would have all the pirates of his\nland on us in the twinkling of an eye.  We have him, and there we must\nrest content for the present.  Now to supper.\"\n\nAt supper, Richard sat next little Carloman, who peeped at him every now\nand then from under his eyelashes, as if he was afraid of him; and\npresently, when there was a good deal of talking going on, so that his\nvoice could not be heard, half whispered, in a very grave tone, \"Do you\nlike salt beef or fresh?\"\n\n\"I like fresh,\" answered Richard, with equal gravity, \"only we eat salt\nall the winter.\"\n\nThere was another silence, and then Carloman, with the same solemnity,\nasked, \"How old are you?\"\n\n\"I shall be nine on the eve of St. Boniface.  How old are you?\"\n\n\"Eight.  I was eight at Martinmas, and Lothaire was nine three days\nsince.\"\n\nAnother silence; then, as Osmond waited on Richard, Carloman returned to\nthe charge, \"Is that your Squire?\"\n\n\"Yes, that is Osmond de Centeville.\"\n\n\"How tall he is!\"\n\n\"We Normans are taller than you French.\"\n\n\"Don't say so to Lothaire, or you will make him angry.\"\n\n\"Why? it is true.\"\n\n\"Yes; but--\" and Carloman sunk his voice--\"there are some things which\nLothaire will not hear said.  Do not make him cross, or he will make my\nmother displeased with you.  She caused Thierry de Lincourt to be\nscourged, because his ball hit Lothaire's face.\"\n\n\"She cannot scourge me--I am a free Duke,\" said Richard.  \"But why?  Did\nhe do it on purpose?\"\n\n\"Oh, no!\"\n\n\"And was Lothaire hurt?\"\n\n\"Hush! you must say Prince Lothaire.  No; it was quite a soft ball.\"\n\n\"Why?\" again asked Richard--\"why was he scourged?\"\n\n\"I told you, because he hit Lothaire.\"\n\n\"Well, but did he not laugh, and say it was nothing?  Alberic quite\nknocked me down with a great snowball the other day, and Sir Eric\nlaughed, and said I must stand firmer.\"\n\n\"Do you make snowballs?\"\n\n\"To be sure I do!  Do not you?\"\n\n\"Oh, no! the snow is so cold.\"\n\n\"Ah! you are but a little boy,\" said Richard, in a superior manner.\nCarloman asked how it was done; and Richard gave an animated description\nof the snowballing, a fortnight ago, at Rouen, when Osmond and some of\nthe other young men built a snow fortress, and defended it against\nRichard, Alberic, and the other Squires.  Carloman listened with delight,\nand declared that next time it snowed, they would have a snow castle; and\nthus, by the time supper was over, the two little boys were very good\nfriends.\n\nBedtime came not long after supper.  Richard's was a smaller room than he\nhad been used to at Rouen; but it amazed him exceedingly when he first\nwent into it: he stood gazing in wonder, because, as he said, \"It was as\nif he had been in a church.\"\n\n\"Yes, truly!\" said Osmond.  \"No wonder these poor creatures of French\ncannot stand before a Norman lance, if they cannot sleep without glass to\ntheir windows.  Well! what would my father say to this?\"\n\n\"And see! see, Osmond! they have put hangings up all round the walls,\njust like our Lady's church on a great feast-day.  They treat us just as\nif we were the holy saints; and here are fresh rushes strewn about the\nfloor, too.  This must be a mistake--it must be an oratory, instead of my\nchamber.\"\n\n\"No, no, my Lord; here is our gear, which I bade Sybald and Henry see\nbestowed in our chamber.  Well, these Franks are come to a pass, indeed!\nMy grandmother will never believe what we shall have to tell her.  Glass\nwindows and hangings to sleeping chambers! I do not like it I am sure we\nshall never be able to sleep, closed up from the free air of heaven in\nthis way: I shall be always waking, and fancying I am in the chapel at\nhome, hearing Father Lucas chanting his matins.  Besides, my father would\nblame me for letting you be made as tender as a Frank.  I'll have out\nthis precious window, if I can.\"\n\nLuxurious as the young Norman thought the King, the glazing of Laon was\nnot permanent.  It consisted of casements, which could be put up or\nremoved at pleasure; for, as the court possessed only one set of glass\nwindows, they were taken down, and carried from place to place, as often\nas Louis removed from Rheims to Soissons, Laon, or any other of his royal\ncastles; so that Osmond did not find much difficulty in displacing them,\nand letting in the sharp, cold, wintry breeze.  The next thing he did was\nto give his young Lord a lecture on his want of courtesy, telling him\nthat \"no wonder the Franks thought he had no more culture than a Viking\n(or pirate), fresh caught from Norway.  A fine notion he was giving them\nof the training he had at Centeville, if he could not even show common\ncivility to the Queen--a lady!  Was that the way Alberic had behaved when\nhe came to Rouen?\"\n\n\"Fru Astrida did not make sour faces at him, nor call him a young\nsavage,\" replied Richard.\n\n\"No, and he gave her no reason to do so; he knew that the first teaching\nof a young Knight is to be courteous to ladies--never mind whether fair\nand young, or old and foul of favour.  Till you learn and note that, Lord\nRichard, you will never be worthy of your golden spurs.\"\n\n\"And the King told me she would treat me as a mother,\" exclaimed Richard.\n\"Do you think the King speaks the truth, Osmond?\"\n\n\"That we shall see by his deeds,\" said Osmond.\n\n\"He was very kind while we were in Normandy.  I loved him so much better\nthan the Count de Harcourt; but now I think that the Count is best!  I'll\ntell you, Osmond, I will never call him grim old Bernard again.\"\n\n\"You had best not, sir, for you will never have a more true-hearted\nvassal.\"\n\n\"Well, I wish we were back in Normandy, with Fru Astrida and Alberic.  I\ncannot bear that Lothaire.  He is proud, and unknightly, and cruel.  I am\nsure he is, and I will never love him.\"\n\n\"Hush, my Lord!--beware of speaking so loud.  You are not in your own\nCastle.\"\n\n\"And Carloman is a chicken-heart,\" continued Richard, unheeding.  \"He\ndoes not like to touch snow, and he cannot even slide on the ice, and he\nis afraid to go near that great dog--that beautiful wolf-hound.\"\n\n\"He is very little,\" said Osmond.\n\n\"I am sure I was not as cowardly at his age, now was I, Osmond?  Don't\nyou remember?\"\n\n\"Come, Lord Richard, I cannot let you wait to remember everything; tell\nyour beads and pray that we may be brought safe back to Rouen; and that\nyou may not forget all the good that Father Lucas and holy Abbot Martin\nhave laboured to teach you.\"\n\nSo Richard told the beads of his rosary--black polished wood, with amber\nat certain spaces--he repeated a prayer with every bead, and Osmond did\nthe same; then the little Duke put himself into a narrow crib of richly\ncarved walnut; while Osmond, having stuck his dagger so as to form an\nadditional bolt to secure the door, and examined the hangings that no\nsecret entrance might be concealed behind them, gathered a heap of rushes\ntogether, and lay down on them, wrapped in his mantle, across the\ndoorway.  The Duke was soon asleep; but the Squire lay long awake, musing\non the possible dangers that surrounded his charge, and on the best way\nof guarding against them.\n\n\n\n\nCHAPTER VII.\n\n\nOsmond de Centeville was soon convinced that no immediate peril\nthreatened his young Duke at the Court of Laon.  Louis seemed to intend\nto fulfil his oaths to the Normans by allowing the child to be the\ncompanion of his own sons, and to be treated in every respect as became\nhis rank.  Richard had his proper place at table, and all due attendance;\nhe learnt, rode, and played with the Princes, and there was nothing to\ncomplain of, excepting the coldness and inattention with which the King\nand Queen treated him, by no means fulfilling the promise of being as\nparents to their orphan ward.  Gerberge, who had from the first dreaded\nhis superior strength and his roughness with her puny boys, and who had\nbeen by no means won by his manners at their first meeting, was\nespecially distant and severe with him, hardly ever speaking to him\nexcept with some rebuke, which, it must be confessed, Richard often\ndeserved.\n\nAs to the boys, his constant companions, Richard was on very friendly\nterms with Carlo-man, a gentle, timid, weakly child.  Richard looked down\nupon him; but he was kind, as a generous-tempered boy could not fail to\nbe, to one younger and weaker than himself.  He was so much kinder than\nLothaire, that Carloman was fast growing very fond of him, and looked up\nto his strength and courage as something noble and marvellous.\n\nIt was very different with Lothaire, the person from whom, above all\nothers, Richard would have most expected to meet with affection, as his\nfather's god-son, a relationship which in those times was thought almost\nas near as kindred by blood.  Lothaire had been brought up by an\nindulgent mother, and by courtiers who never ceased flattering him, as\nthe heir to the crown, and he had learnt to think that to give way to his\nnaturally imperious and violent disposition was the way to prove his\npower and assert his rank.  He had always had his own way, and nothing\nhad ever been done to check his faults; somewhat weakly health had made\nhim fretful and timid; and a latent consciousness of this fearfulness\nmade him all the more cruel, sometimes because he was frightened,\nsometimes because he fancied it manly.\n\nHe treated his little brother in a way which in these times boys would\ncall bullying; and, as no one ever dared to oppose the King's eldest son,\nit was pretty much the same with every one else, except now and then some\ndumb creature, and then all Lothaire's cruelty was shown.  When his horse\nkicked, and ended by throwing him, he stood by, and caused it to be\nbeaten till the poor creature's back streamed with blood; when his dog\nbit his hand in trying to seize the meat with which he was teazing it, he\ninsisted on having it killed, and it was worse still when a falcon pecked\none of his fingers.  It really hurt him a good deal, and, in a furious\nrage, he caused two nails to be heated red hot in the fire, intending to\nhave them thrust into the poor bird's eyes.\n\n\"I will not have it done!\" exclaimed Richard, expecting to be obeyed as\nhe was at home; but Lothaire only laughed scornfully, saying, \"Do you\nthink you are master here, Sir pirate?\"\n\n\"I will not have it done!\" repeated Richard.  \"Shame on you, shame on\nyou, for thinking of such an unkingly deed.\"\n\n\"Shame on me! Do you know to whom you speak, master savage?\" cried\nLothaire, red with passion.\n\n\"I know who is the savage now!\" said Richard.  \"Hold!\" to the servant who\nwas bringing the red-hot irons in a pair of tongs.\n\n\"Hold?\" exclaimed Lothaire.  \"No one commands here but I and my father.\nGo on Charlot--where is the bird?  Keep her fast, Giles.\"\n\n\"Osmond.  You I can command--\"\n\n\"Come away, my Lord,\" said Osmond, interrupting Richard's order, before\nit was issued. \"We have no right to interfere here, and cannot hinder it.\nCome away from such a foul sight.\"\n\n\"Shame on you too, Osmond, to let such a deed be done without hindering\nit!\" exclaimed Richard, breaking from him, and rushing on the man who\ncarried the hot irons.  The French servants were not very willing to\nexert their strength against the Duke of Normandy, and Richard's onset,\ntaking the man by surprise, made him drop the tongs.  Lothaire, both\nafraid and enraged, caught them up as a weapon of defence, and, hardly\nknowing what he did, struck full at Richard's face with the hot iron.\nHappily it missed his eye, and the heat had a little abated; but, as it\ntouched his cheek, it burnt him sufficiently to cause considerable pain.\nWith a cry of passion, he flew at Lothaire, shook him with all his might,\nand ended by throwing him at his length on the pavement.  But this was\nthe last of Richard's exploits, for he was at the same moment captured by\nhis Squire, and borne off, struggling and kicking as if Osmond had been\nhis greatest foe; but the young Norman's arms were like iron round him;\nand he gave over his resistance sooner, because at that moment a whirring\nflapping sound was heard, and the poor hawk rose high, higher, over their\nheads in ever lessening circles, far away from her enemies.  The servant\nwho held her, had relaxed his grasp in the consternation caused by\nLothaire's fall, and she was mounting up and up, spying, it might be, her\nway to her native rocks in Iceland, with the yellow eyes which Richard\nhad saved.\n\n\"Safe! safe!\" cried Richard, joyfully, ceasing his struggles.  \"Oh, how\nglad I am!  That young villain should never have hurt her.  Put me down,\nOsmond, what are you doing with me?\"\n\n\"Saving you from your--no, I cannot call it folly,--I would hardly have\nhad you stand still to see such--but let me see your face.\"\n\n\"It is nothing.  I don't care now the hawk is safe,\" said Richard, though\nhe could hardly keep his lips in order, and was obliged to wink very hard\nwith his eyes to keep the tears out, now that he had leisure to feel the\nsmarting; but it would have been far beneath a Northman to complain, and\nhe stood bearing it gallantly, and pinching his fingers tightly together,\nwhile Osmond knelt down to examine the hurt.  \"'Tis not much,\" said he,\ntalking to himself, \"half bruise, half burn--I wish my grandmother was\nhere--however, it can't last long!  'Tis right, you bear it like a little\nBerserkar, and it is no bad thing that you should have a scar to show,\nthat they may not be able to say you did _all_ the damage.\"\n\n\"Will it always leave a mark?\" said Richard.  \"I am afraid they will call\nme Richard of the scarred cheek, when we get back to Normandy.\"\n\n\"Never mind, if they do--it will not be a mark to be ashamed of, even if\nit does last, which I do not believe it will.\"\n\n\"Oh, no, I am so glad the gallant falcon is out of his reach!\" replied\nRichard, in a somewhat quivering voice.\n\n\"Does it smart much?  Well, come and bathe it with cold water--or shall I\ntake you to one of the Queen's women?\"\n\n\"No--the water,\" said Richard, and to the fountain in the court they\nwent; but Osmond had only just begun to splash the cheek with the\nhalf-frozen water, with a sort of rough kindness, afraid at once of\nteaching the Duke to be effeminate, and of not being as tender to him as\nDame Astrida would have wished, when a messenger came in haste from the\nKing, commanding the presence of the Duke of Normandy and his Squire.\n\nLothaire was standing between his father and mother on their throne-like\nseat, leaning against the Queen, who had her arm round him; his face was\nred and glazed with tears, and he still shook with subsiding sobs.  It\nwas evident he was just recovering from a passionate crying fit.\n\n\"How is this?\" began the King, as Richard entered.  \"What means this\nconduct, my Lord of Normandy?  Know you what you have done in striking\nthe heir of France?  I might imprison you this instant in a dungeon where\nyou would never see the light of day.\"\n\n\"Then Bernard de Harcourt would come and set me free,\" fearlessly\nanswered Richard.\n\n\"Do you bandy words with me, child? Ask Prince Lothaire's pardon\ninstantly, or you shall rue it.\"\n\n\"I have done nothing to ask his pardon for.  It would have been cruel and\ncowardly in me to let him put out the poor hawk's eyes,\" said Richard,\nwith a Northman's stern contempt for pain, disdaining to mention his own\nburnt cheek, which indeed the King might have seen plainly enough.\n\n\"Hawk's eyes!\" repeated the King.  \"Speak the truth, Sir Duke; do not add\nslander to your other faults.\"\n\n                       [False accusation]\n\n\"I have spoken the truth--I always speak it!\" cried Richard.  \"Whoever\nsays otherwise lies in his throat.\"\n\nOsmond here hastily interfered, and desired permission to tell the whole\nstory.  The hawk was a valuable bird, and Louis's face darkened when he\nheard what Lothaire had purposed, for the Prince had, in telling his own\nstory, made it appear that Richard had been the aggressor by insisting on\nletting the falcon fly.  Osmond finished by pointing to the mark on\nRichard's cheek, so evidently a burn, as to be proof that hot iron had\nplayed a part in the matter.  The King looked at one of his own Squires\nand asked his account, and he with some hesitation could not but reply\nthat it was as the young Sieur de Centeville had said.  Thereupon Louis\nangrily reproved his own people for having assisted the Prince in trying\nto injure the hawk, called for the chief falconer, rated him for not\nbetter attending to his birds, and went forth with him to see if the hawk\ncould yet be recaptured, leaving the two boys neither punished nor\npardoned.\n\n\"So you have escaped for this once,\" said Gerberge, coldly, to Richard;\n\"you had better beware another time.  Come with me, my poor darling\nLothaire.\"  She led her son away to her own apartments, and the French\nSquires began to grumble to each other complaints of the impossibility of\npleasing their Lords, since, if they contradicted Prince Lothaire, he was\nso spiteful that he was sure to set the Queen against them, and that was\nfar worse in the end than the King's displeasure.  Osmond, in the\nmeantime, took Richard to re-commence bathing his face, and presently\nCarloman ran out to pity him, wonder at him for not crying, and say he\nwas glad the poor hawk had escaped.\n\nThe cheek continued inflamed and painful for some time, and there was a\ndeep scar long after the pain had ceased, but Richard thought little of\nit after the first, and would have scorned to bear ill-will to Lothaire\nfor the injury.\n\nLothaire left off taunting Richard with his Norman accent, and calling\nhim a young Sea-king.  He had felt his strength, and was afraid of him;\nbut he did not like him the better--he never played with him\nwillingly--scowled, and looked dark and jealous, if his father, or if any\nof the great nobles took the least notice of the little Duke, and\nwhenever he was out of hearing, talked against him with all his natural\nspitefulness.\n\nRichard liked Lothaire quite as little, contemning almost equally his\ncowardly ways and his imperious disposition.  Since he had been Duke,\nRichard had been somewhat inclined to grow imperious himself, though\nalways kept under restraint by Fru Astrida's good training, and Count\nBernard's authority, and his whole generous nature would have revolted\nagainst treating Alberic, or indeed his meanest vassal, as Lothaire used\nthe unfortunate children who were his playfellows.  Perhaps this made him\nlook on with great horror at the tyranny which Lothaire exercised; at any\nrate he learnt to abhor it more, and to make many resolutions against\nordering people about uncivilly when once he should be in Normandy again.\nHe often interfered to protect the poor boys, and generally with success,\nfor the Prince was afraid of provoking such another shake as Richard had\nonce given him, and though he generally repaid himself on his victim in\nthe end, he yielded for the time.\n\nCarloman, whom Richard often saved from his brother's unkindness, clung\ncloser and closer to him, went with him everywhere, tried to do all he\ndid, grew very fond of Osmond, and liked nothing better than to sit by\nRichard in some wide window-seat, in the evening, after supper, and\nlisten to Richard's version of some of Fru Astrida's favourite tales, or\nhear the never-ending history of sports at Centeville, or at Rollo's\nTower, or settle what great things they would both do when they were\ngrown up, and Richard was ruling Normandy--perhaps go to the Holy Land\ntogether, and slaughter an unheard-of host of giants and dragons on the\nway.  In the meantime, however, poor Carloman gave small promise of being\nable to perform great exploits, for he was very small for his age and\noften ailing; soon tired, and never able to bear much rough play.\nRichard, who had never had any reason to learn to forbear, did not at\nfirst understand this, and made Carloman cry several times with his\nroughness and violence, but this always vexed him so much that he grew\ncareful to avoid such things for the future, and gradually learnt to\ntreat his poor little weakly friend with a gentleness and patience at\nwhich Osmond used to marvel, and which he would hardly have been taught\nin his prosperity at home.\n\nBetween Carloman and Osmond he was thus tolerably happy at Laon, but he\nmissed his own dear friends, and the loving greetings of his vassals, and\nlonged earnestly to be at Rouen, asking Osmond almost every night when\nthey should go back, to which Osmond could only answer that he must pray\nthat Heaven would be pleased to bring them home safely.\n\nOsmond, in the meantime, kept a vigilant watch for anything that might\nseem to threaten danger to his Lord; but at present there was no token of\nany evil being intended; the only point in which Louis did not seem to be\nfulfilling his promises to the Normans was, that no preparations were\nmade for attacking the Count of Flanders.\n\nAt Easter the court was visited by Hugh the White, the great Count of\nParis, the most powerful man in France, and who was only prevented by his\nown loyalty and forbearance, from taking the crown from the feeble and\ndegenerate race of Charlemagne.  He had been a firm friend of William\nLongsword, and Osmond remarked how, on his arrival, the King took care to\nbring Richard forward, talk of him affectionately, and caress him almost\nas much as he had done at Rouen.  The Count himself was really kind and\naffectionate to the little Duke; he kept him by his side, and seemed to\nlike to stroke down his long flaxen hair, looking in his face with a\ngrave mournful expression, as if seeking for a likeness to his father.\nHe soon asked about the scar which the burn had left, and the King was\nobliged to answer hastily, it was an accident, a disaster that had\nchanced in a boyish quarrel.  Louis, in fact, was uneasy, and appeared to\nbe watching the Count of Paris the whole time of his visit, so as to\nprevent him from having any conversation in private with the other great\nvassals assembled at the court.  Hugh did not seem to perceive this, and\nacted as if he was entirely at his ease, but at the same time he watched\nhis opportunity.  One evening, after supper, he came up to the window\nwhere Richard and Carloman were, as usual, deep in story telling; he sat\ndown on the stone seat, and taking Richard on his knee, he asked if he\nhad any greetings for the Count de Harcourt.\n\nHow Richard's face lighted up!  \"Oh, Sir,\" he cried, \"are you going to\nNormandy?\"\n\n\"Not yet, my boy, but it may be that I may have to meet old Harcourt at\nthe Elm of Gisors.\"\n\n\"Oh, if I was but going with you.\"\n\n\"I wish I could take you, but it would scarcely do for me to steal the\nheir of Normandy.  What shall I tell him?\"\n\n\"Tell him,\" whispered Richard, edging himself close to the Count, and\ntrying to reach his ear, \"tell him that I am sorry, now, that I was\nsullen when he reproved me.  I know he was right.  And, sir, if he brings\nwith him a certain huntsman with a long hooked nose, whose name is\nWalter, {12} tell him I am sorry I used to order him about so unkindly.\nAnd tell him to bear my greetings to Fru Astrida and Sir Eric, and to\nAlberic.\"\n\n\"Shall I tell him how you have marked your face?\"\n\n\"No,\" said Richard, \"he would think me a baby to care about such a thing\nas that!\"\n\nThe Count asked how it happened, and Richard told the story, for he felt\nas if he could tell the kind Count anything--it was almost like that last\nevening that he had sat on his father's knee.  Hugh ended by putting his\narm round him, and saying, \"Well, my little Duke, I am as glad as you are\nthe gallant bird is safe--it will be a tale for my own little Hugh and\nEumacette {13} at home--and you must one day be friends with them as your\nfather has been with me.  And now, do you think your Squire could come to\nmy chamber late this evening when the household is at rest?\"\n\nRichard undertook that Osmond should do so, and the Count, setting him\ndown again, returned to the dais.  Osmond, before going to the Count that\nevening, ordered Sybald to come and guard the Duke's door.  It was a long\nconference, for Hugh had come to Laon chiefly for the purpose of seeing\nhow it went with his friend's son, and was anxious to know what Osmond\nthought of the matter.  They agreed that at present there did not seem to\nbe any evil intended, and that it rather appeared as if Louis wished only\nto keep him as a hostage for the tranquillity of the borders of Normandy;\nbut Hugh advised that Osmond should maintain a careful watch, and send\nintelligence to him on the first token of mischief.\n\nThe next morning the Count of Paris quitted Laon, and everything went on\nin the usual course till the feast of Whitsuntide, when there was always\na great display of splendour at the French court.  The crown vassals\ngenerally came to pay their duty and go with the King to Church; and\nthere was a state banquet, at which the King and Queen wore their crowns,\nand every one sat in great magnificence according to their rank.\n\nThe grand procession to Church was over.  Richard had walked with\nCarloman, the Prince richly dressed in blue, embroidered with golden\nfleur-de-lys, and Richard in scarlet, with a gold Cross on his breast;\nthe beautiful service was over, they had returned to the Castle, and\nthere the Seneschal was marshalling the goodly and noble company to the\nbanquet, when horses' feet were heard at the gate announcing some fresh\narrival.  The Seneschal went to receive the guests, and presently was\nheard ushering in the noble Prince, Arnulf, Count of Flanders.\n\nRichard's face became pale--he turned from Carloman by whose side he had\nbeen standing, and walked straight out of the hall and up the stairs,\nclosely followed by Osmond.  In a few minutes there was a knock at the\ndoor of his chamber, and a French Knight stood there saying, \"Comes not\nthe Duke to the banquet?\"\n\n\"No,\" answered Osmond: \"he eats not with the slayer of his father.\"\n\n\"The King will take it amiss; for the sake of the child you had better\nbeware,\" said the Frenchman, hesitating.\n\n\"He had better beware himself,\" exclaimed Osmond, indignantly, \"how he\nbrings the treacherous murderer of William Longsword into the presence of\na free-born Norman, unless he would see him slain where he stands.  Were\nit not for the boy, I would challenge the traitor this instant to single\ncombat.\"\n\n\"Well, I can scarce blame you,\" said the Knight, \"but you had best have a\ncare how you tread.  Farewell.\"\n\nRichard had hardly time to express his indignation, and his wishes that\nhe was a man, before another message came through a groom of Lothaire's\ntrain, that the Duke must fast, if he would not consent to feast with the\nrest.\n\n\"Tell Prince Lothaire,\" replied Richard, \"that I am not such a glutton as\nhe--I had rather fast than be choked with eating with Arnulf.\"\n\nAll the rest of the day, Richard remained in his own chamber, resolved\nnot to run the risk of meeting with Arnulf.  The Squire remained with\nhim, in this voluntary imprisonment, and they occupied themselves, as\nbest they could, with furbishing Osmond's armour, and helping each other\nout in repeating some of the Sagas.  They once heard a great uproar in\nthe court, and both were very anxious to learn its cause, but they did\nnot know it till late in the afternoon.\n\nCarloman crept up to them--\"Here I am at last!\" he exclaimed.  \"Here,\nRichard, I have brought you some bread, as you had no dinner: it was all\nI could bring.  I saved it under the table lest Lothaire should see it.\"\n\nRichard thanked Carloman with all his heart, and being very hungry was\nglad to share the bread with Osmond.  He asked how long the wicked Count\nwas going to stay, and rejoiced to hear he was going away the next\nmorning, and the King was going with him.\n\n\"What was that great noise in the court?\" asked Richard.\n\n\"I scarcely like to tell you,\" returned Carloman.\n\nRichard, however, begged to hear, and Carloman was obliged to tell that\nthe two Norman grooms, Sybald and Henry, had quarrelled with the Flemings\nof Arnulf's train; there had been a fray, which had ended in the death of\nthree Flemings, a Frank, and of Sybald himself--And where was Henry?\nAlas! there was more ill news--the King had sentenced Henry to die, and\nhe had been hanged immediately.\n\nDark with anger and sorrow grew young Richard's face; he had been fond of\nhis two Norman attendants, he trusted to their attachment, and he would\nhave wept for their loss even if it had happened in any other way; but\nnow, when it had been caused by their enmity to his father's foes, the\nFlemings,--when one had fallen overwhelmed by numbers, and the other been\ncondemned hastily, cruelly, unjustly, it was too much, and he almost\nchoked with grief and indignation.  Why had he not been there, to claim\nHenry as his own vassal, and if he could not save him, at least bid him\nfarewell?  Then he would have broken out in angry threats, but he felt\nhis own helplessness, and was ashamed, and he could only shed tears of\npassionate grief, refusing all Carloman's attempts to comfort him.\nOsmond was even more concerned; he valued the two Normans extremely for\ntheir courage and faithfulness, and had relied on sending intelligence by\ntheir means to Rouen, in case of need.  It appeared to him as if the\nfirst opportunity had been seized of removing these protectors from the\nlittle Duke, and as if the designs, whatever they might be, which had\nbeen formed against him, were about to take effect.  He had little doubt\nthat his own turn would be the next; but he was resolved to endure\nanything, rather than give the smallest opportunity of removing him, to\nbear even insults with patience, and to remember that in his care rested\nthe sole hope of safety for his charge.\n\nThat danger was fast gathering around them became more evident every day,\nespecially after the King and Arnulf had gone away together.  It was very\nhot weather, and Richard began to weary after the broad cool river at\nRouen, where he used to bathe last summer; and one evening he persuaded\nhis Squire to go down with him to the Oise, which flowed along some\nmeadow ground about a quarter of a mile from the Castle; but they had\nhardly set forth before three or four attendants came running after them,\nwith express orders from the Queen that they should return immediately.\nThey obeyed, and found her standing in the Castle hall, looking greatly\nincensed.\n\n\"What means this?\" she asked, angrily.  \"Knew you not that the King has\nleft commands that the Duke quits not the Castle in his absence?\"\n\n\"I was only going as far as the river--\" began Richard, but Gerberge cut\nhim short.  \"Silence, child--I will hear no excuses.  Perhaps you think,\nSieur de Centeville, that you may take liberties in the King's absence,\nbut I tell you that if you are found without the walls again, it shall be\nat your peril; ay, and his!  I'll have those haughty eyes put out, if you\ndisobey!\"\n\nShe turned away, and Lothaire looked at them with his air of gratified\nmalice.  \"You will not lord it over your betters much longer, young\npirate!\" said he, as he followed his mother, afraid to stay to meet the\nanger he might have excited by the taunt he could not deny himself the\npleasure of making; but Richard, who, six months ago could not brook a\nslight disappointment or opposition, had, in his present life of\nrestraint, danger, and vexation, learnt to curb the first outbreak of\ntemper, and to bear patiently instead of breaking out into passion and\nthreats, and now his only thought was of his beloved Squire.\n\n\"Oh, Osmond!  Osmond!\" he exclaimed, \"they shall not hurt you.  I will\nnever go out again.  I will never speak another hasty word.  I will never\naffront the Prince, if they will but leave you with me!\" {14}\n\n\n\n\nCHAPTER VIII.\n\n\nIt was a fine summer evening, and Richard and Carloman were playing at\nball on the steps of the Castle-gate, when a voice was heard from\nbeneath, begging for alms from the noble Princes in the name of the\nblessed Virgin, and the two boys saw a pilgrim standing at the gate,\nwrapt in a long robe of serge, with a staff in his hand, surmounted by a\nCross, a scrip at his girdle, and a broad shady hat, which he had taken\noff, as he stood, making low obeisances, and asking charity.\n\n\"Come in, holy pilgrim,\" said Carloman.  \"It is late, and you shall sup\nand rest here to-night.\"\n\n\"Blessings from Heaven light on you, noble Prince,\" replied the pilgrim,\nand at that moment Richard shouted joyfully, \"A Norman, a Norman! 'tis my\nown dear speech!  Oh, are you not from Normandy?  Osmond, Osmond! he\ncomes from home!\"\n\n\"My Lord! my own Lord!\" exclaimed the pilgrim, and, kneeling on one knee\nat the foot of the steps, he kissed the hand which his young Duke held\nout to him--\"This is joy unlooked for!\"\n\n\"Walter!--Walter, the huntsman!\" cried Richard.  \"Is it you?  Oh, how is\nFru Astrida, and all at home?\"\n\n\"Well, my Lord, and wearying to know how it is with you--\" began\nWalter--but a very different tone exclaimed from behind the pilgrim,\n\"What is all this?  Who is stopping my way?  What!  Richard would be\nKing, and more, would he?  More insolence!\"  It was Lothaire, returning\nwith his attendants from the chase, in by no means an amiable mood, for\nhe had been disappointed of his game.\n\n\"He is a Norman--a vassal of Richard's own,\" said Carloman.\n\n\"A Norman, is he?  I thought we had got rid of the robbers!  We want no\nrobbers here!  Scourge him soundly, Perron, and teach him how to stop my\nway!\"\n\n\"He is a pilgrim, my Lord,\" suggested one of the followers.\n\n\"I care not; I'll have no Normans here, coming spying in disguise.\nScourge him, I say, dog that he is!  Away with him!  A spy, a spy!\"\n\n\"No Norman is scourged in my sight!\" said Richard, darting forwards, and\nthrowing himself between Walter and the woodsman, who was preparing to\nobey Lothaire, just in time to receive on his own bare neck the sharp,\ncutting leathern thong, which raised a long red streak along its course.\nLothaire laughed.\n\n\"My Lord Duke!  What have you done?  Oh, leave me--this befits you not!\"\ncried Walter, extremely distressed; but Richard had caught hold of the\nwhip, and called out, \"Away, away! run! haste, haste!\" and the words were\nrepeated at once by Osmond, Carloman, and many of the French, who, though\nafraid to disobey the Prince, were unwilling to violate the sanctity of a\npilgrim's person; and the Norman, seeing there was no help for it,\nobeyed: the French made way for him and he effected his escape; while\nLothaire, after a great deal of storming and raging, went up to his\nmother to triumph in the cleverness with which he had detected a Norman\nspy in disguise.\n\nLothaire was not far wrong; Walter had really come to satisfy himself as\nto the safety of the little Duke, and try to gain an interview with\nOsmond.  In the latter purpose he failed, though he lingered in the\nneighbourhood of Laon for several days; for Osmond never left the Duke\nfor an instant, and he was, as has been shown, a close prisoner, in all\nbut the name, within the walls of the Castle.  The pilgrim had, however,\nthe opportunity of picking up tidings which made him perceive the true\nstate of things: he learnt the deaths of Sybald and Henry, the alliance\nbetween the King and Arnulf, and the restraint and harshness with which\nthe Duke was treated; and with this intelligence he went in haste to\nNormandy.\n\nSoon after his arrival, a three days' fast was observed throughout the\ndukedom, and in every church, from the Cathedral of Bayeux to the\nsmallest and rudest village shrine, crowds of worshippers were kneeling,\nimploring, many of them with tears, that God would look on them in His\nmercy, restore to them their Prince, and deliver the child out of the\nhands of his enemies.  How earnest and sorrowful were the prayers offered\nat Centeville may well be imagined; and at Montemar sur Epte the anxiety\nwas scarcely less.  Indeed, from the time the evil tidings arrived,\nAlberic grew so restless and unhappy, and so anxious to do something,\nthat at last his mother set out with him on a pilgrimage to the Abbey of\nJumieges, to pray for the rescue of his dear little Duke.\n\nIn the meantime, Louis had sent notice to Laon that he should return home\nin a week's time; and Richard rejoiced at the prospect, for the King had\nalways been less unkind to him than the Queen, and he hoped to be\nreleased from his captivity within the Castle.  Just at this time he\nbecame very unwell; it might have been only the effect of the life of\nunwonted confinement which he had lately led that was beginning to tell\non his health; but, after being heavy and uncomfortable for a day or two,\nwithout knowing what was the matter with him, he was one night attacked\nwith high fever.\n\nOsmond was dreadfully alarmed, knowing nothing at all of the treatment of\nillness, and, what was worse, fully persuaded that the poor child had\nbeen poisoned, and therefore resolved not to call any assistance; he hung\nover him all night, expecting each moment to see him expire--ready to\ntear his hair with despair and fury, and yet obliged to restrain himself\nto the utmost quietness and gentleness, to soothe the suffering of the\nsick child.\n\nThrough that night, Richard either tossed about on his narrow bed, or,\nwhen his restlessness desired the change, sat, leaning his aching head on\nOsmond's breast, too oppressed and miserable to speak or think.  When the\nday dawned on them, and he was still too ill to leave the room,\nmessengers were sent for him, and Osmond could no longer conceal the fact\nof his sickness, but parleyed at the door, keeping out every one he\ncould, and refusing all offers of attendance.  He would not even admit\nCarloman, though Richard, hearing his voice, begged to see him; and when\na proposal was sent from the Queen, that a skilful old nurse should visit\nand prescribe for the patient, he refused with all his might, and when he\nhad shut the door, walked up and down, muttering, \"Ay, ay, the witch!\ncoming to finish what she has begun!\"\n\nAll that day and the next, Richard continued very ill, and Osmond waited\non him very assiduously, never closing his eyes for a moment, but\nconstantly telling his beads whenever the boy did not require his\nattendance.  At last Richard fell asleep, slept long and soundly for some\nhours, and waked much better.  Osmond was in a transport of joy: \"Thanks\nto Heaven, they shall fail for this time and they shall never have\nanother chance!  May Heaven be with us still!\"  Richard was too weak and\nweary to ask what he meant, and for the next few days Osmond watched him\nwith the utmost care.  As for food, now that Richard could eat again,\nOsmond would not hear of his touching what was sent for him from the\nroyal table, but always went down himself to procure food in the kitchen,\nwhere he said he had a friend among the cooks, who would, he thought,\nscarcely poison him intentionally.  When Richard was able to cross the\nroom, he insisted on his always fastening the door with his dagger, and\nnever opening to any summons but his own, not even Prince Carloman's.\nRichard wondered, but he was obliged to obey; and he knew enough of the\nperils around him to perceive the reasonableness of Osmond's caution.\n\nThus several days had passed, the King had returned, and Richard was so\nmuch recovered, that he had become very anxious to be allowed to go down\nstairs again, instead of remaining shut up there; but still Osmond would\nnot consent, though Richard had done nothing all day but walk round the\nroom, to show how strong he was.\n\n\"Now, my Lord, guard the door--take care,\" said Osmond; \"you have no loss\nto-day, for the King has brought home Herluin of Montreuil, whom you\nwould be almost as loth to meet as the Fleming.  And tell your beads\nwhile I am gone, that the Saints may bring us out of our peril.\"\n\nOsmond was absent nearly half an hour, and, when he returned, brought on\nhis shoulders a huge bundle of straw.  \"What is this for?\" exclaimed\nRichard.  \"I wanted my supper, and you have brought straw!\"\n\n\"Here is your supper,\" said Osmond, throwing down the straw, and\nproducing a bag with some bread and meat.  \"What should you say, my Lord,\nif we should sup in Normandy to-morrow night?\"\n\n\"In Normandy!\" cried Richard, springing up and clapping his hands.  \"In\nNormandy!  Oh, Osmond, did you say in Normandy?  Shall we, shall we\nreally?  Oh, joy! joy!  Is Count Bernard come?  Will the King let us go?\"\n\n\"Hush! hush, sir!  It must be our own doing; it will all fail if you are\nnot silent and prudent, and we shall be undone.\"\n\n\"I will do anything to get home again!\"\n\n\"Eat first,\" said Osmond.\n\n\"But what are you going to do?  I will not be as foolish as I was when\nyou tried to get me safe out of Rollo's tower.  But I should like to wish\nCarloman farewell.\"\n\n\"That must not be,\" said Osmond; \"we should not have time to escape, if\nthey did not still believe you very ill in bed.\"\n\n\"I am sorry not to wish Carloman good-bye,\" repeated Richard; \"but we\nshall see Fru Astrida again, and Sir Eric; and Alberic must come back!\nOh, do let us go!  O Normandy, dear Normandy!\"\n\nRichard could hardly eat for excitement, while Osmond hastily made his\narrangements, girding on his sword, and giving Richard his dagger to put\ninto his belt.  He placed the remainder of the provisions in his wallet,\nthrew a thick purple cloth mantle over the Duke, and then desired him to\nlie down on the straw which he had brought in.  \"I shall hide you in it,\"\nhe said, \"and carry you through the hall, as if I was going to feed my\nhorse.\"\n\n\"Oh, they will never guess!\" cried Richard, laughing.  \"I will be quite\nstill--I will make no noise--I will hold my breath.\"\n\n\"Yes, mind you do not move hand or foot, or rustle the straw.  It is no\nplay--it is life or death,\" said Osmond, as he disposed the straw round\nthe little boy.  \"There, can you breathe?\"\n\n\"Yes,\" said Richard's voice from the midst.  \"Am I quite hidden?\"\n\n\"Entirely.  Now, remember, whatever happens, do not move.  May Heaven\nprotect us!  Now, the Saints be with us!\"\n\nRichard, from the interior of the bundle heard Osmond set open the door;\nthen he felt himself raised from the ground; Osmond was carrying him\nalong down the stairs, the ends of the straw crushing and sweeping\nagainst the wall.  The only way to the outer door was through the hall,\nand here was the danger.  Richard heard voices, steps, loud singing and\nlaughter, as if feasting was going on; then some one said, \"Tending your\nhorse, Sieur de Centeville?\"\n\n\"Yes,\" Osmond made answer.  \"You know, since we lost our grooms, the poor\nblack would come off badly, did I not attend to him.\"\n\nPresently came Carloman's voice: \"O Osmond de Centeville! is Richard\nbetter?\"\n\n\"He is better, my Lord, I thank you, but hardly yet out of danger.\"\n\n\"Oh, I wish he was well!  And when will you let me come to him, Osmond?\nIndeed, I would sit quiet, and not disturb him.\"\n\n\"It may not be yet, my Lord, though the Duke loves you well--he told me\nso but now.\"\n\n\"Did he?  Oh, tell him I love him very much--better than any one\nhere--and it is very dull without him.  Tell him so, Osmond.\"\n\nRichard could hardly help calling out to his dear little Carloman; but he\nremembered the peril of Osmond's eyes and the Queen's threat, and held\nhis peace, with some vague notion that some day he would make Carloman\nKing of France.  In the meantime, half stifled with the straw, he felt\nhimself carried on, down the steps, across the court; and then he knew,\nfrom the darkness and the changed sound of Osmond's tread, that they were\nin the stable.  Osmond laid him carefully down, and whispered--\"All right\nso far.  You can breathe?\"\n\n\"Not well.  Can't you let me out?\"\n\n\"Not yet--not for worlds.  Now tell me if I put you face downwards, for I\ncannot see.\"\n\nHe laid the living heap of straw across the saddle, bound it on, then led\nout the horse, gazing round cautiously as he did so; but the whole of the\npeople of the Castle were feasting, and there was no one to watch the\ngates.  Richard heard the hollow sound of the hoofs, as the drawbridge\nwas crossed, and knew that he was free; but still Osmond held his arm\nover him, and would not let him move, for some distance.  Then, just as\nRichard felt as if he could endure the stifling of the straw, and his\nuncomfortable position, not a moment longer, Osmond stopped the horse,\ntook him down, laid him on the grass, and released him.  He gazed around;\nthey were in a little wood; evening twilight was just coming on, and the\nbirds sang sweetly.\n\n\"Free! free!--this is freedom!\" cried Richard, leaping up in the\ndelicious cool evening breeze; \"the Queen and Lothaire, and that grim\nroom, all far behind.\"\n\n\"Not so far yet,\" said Osmond; \"you must not call yourself safe till the\nEpte is between us and them.  Into the saddle, my Lord; we must ride for\nour lives.\"\n\n                     [Escape from captivity]\n\nOsmond helped the Duke to mount, and sprang to the saddle behind him, set\nspurs to the horse, and rode on at a quick rate, though not at full\nspeed, as he wished to spare the horse.  The twilight faded, the stars\ncame out, and still he rode, his arm round the child, who, as night\nadvanced, grew weary, and often sunk into a sort of half doze, conscious\nall the time of the trot of the horse.  But each step was taking him\nfurther from Queen Gerberge, and nearer to Normandy; and what recked he\nof weariness?  On--on; the stars grew pale again, and the first pink\nlight of dawn showed in the eastern sky; the sun rose, mounted higher and\nhigher, and the day grew hotter; the horse went more slowly, stumbled,\nand though Osmond halted and loosed the girth, he only mended his pace\nfor a little while.\n\nOsmond looked grievously perplexed; but they had not gone much further\nbefore a party of merchants came in sight, winding their way with a long\ntrain of loaded mules, and stout men to guard them, across the plains,\nlike an eastern caravan in the desert.  They gazed in surprise at the\ntall young Norman holding the child upon the worn-out war-horse.\n\n\"Sir merchant,\" said Osmond to the first, \"see you this steed?  Better\nhorse never was ridden; but he is sorely spent, and we must make speed.\nLet me barter him with you for yonder stout palfrey.  He is worth twice\nas much, but I cannot stop to chaffer--ay or no at once.\"\n\nThe merchant, seeing the value of Osmond's gallant black, accepted the\noffer; and Osmond removing his saddle, and placing Richard on his new\nsteed, again mounted, and on they went through the country which Osmond's\neye had marked with the sagacity men acquire by living in wild, unsettled\nplaces.  The great marshes were now far less dangerous than in the\nwinter, and they safely crossed them.  There had, as yet, been no\npursuit, and Osmond's only fear was for his little charge, who, not\nhaving recovered his full strength since his illness, began to suffer\ngreatly from fatigue in the heat of that broiling summer day, and leant\nagainst Osmond patiently, but very wearily, without moving or looking up.\nHe scarcely revived when the sun went down, and a cool breeze sprang up,\nwhich much refreshed Osmond himself; and still more did it refresh the\nSquire to see, at length, winding through the green pastures, a blue\nriver, on the opposite bank of which rose a high rocky mound, bearing a\ncastle with many a turret and battlement.\n\n\"The Epte! the Epte!  There is Normandy, sir!  Look up, and see your own\ndukedom.\"  \"Normandy!\" cried Richard, sitting upright.  \"Oh, my own\nhome!\"  Still the Epte was wide and deep, and the peril was not yet\nended.  Osmond looked anxiously, and rejoiced to see marks of cattle, as\nif it had been forded.  \"We must try it,\" he said, and dismounting, he\nwaded in, leading the horse, and firmly holding Richard in the saddle.\nDeep they went; the water rose to Richard's feet, then to the horse's\nneck; then the horse was swimming, and Osmond too, still keeping his firm\nhold; then there was ground again, the force of the current was less, and\nthey were gaining the bank.  At that instant, however, they perceived two\nmen aiming at them with cross-bows from the castle, and another standing\non the bank above them, who called out, \"Hold!  None pass the ford of\nMontemar without permission of the noble Dame Yolande.\"  \"Ha! Bertrand,\nthe Seneschal, is that you?\" returned Osmond.  \"Who calls me by my name?\"\nreplied the Seneschal.  \"It is I, Osmond de Centeville.  Open your gates\nquickly, Sir Seneschal; for here is the Duke, sorely in need of rest and\nrefreshment.\"\n\n\"The Duke!\" exclaimed Bertrand, hurrying down to the landing-place, and\nthrowing off his cap.  \"The Duke! the Duke!\" rang out the shout from the\nmen-at-arms on the battlements above and in an instant more Osmond had\nled the horse up from the water, and was exclaiming, \"Look up, my Lord,\nlook up!  You are in your own dukedom again, and this is Alberic's\ncastle.\"\n\n\"Welcome, indeed, most noble Lord Duke!  Blessings on the day!\" cried the\nSeneschal.  \"What joy for my Lady and my young Lord!\"\n\n\"He is sorely weary,\" said Osmond, looking anxiously at Richard, who,\neven at the welcome cries that showed so plainly that he was in his own\nNormandy, scarcely raised himself or spoke.  \"He had been very sick ere I\nbrought him away.  I doubt me they sought to poison him, and I vowed not\nto tarry at Laon another hour after he was fit to move.  But cheer up, my\nLord; you are safe and free now, and here is the good Dame de Montemar to\ntend you, far better than a rude Squire like me.\"\n\n\"Alas, no!\" said the Seneschal; \"our Dame is gone with young Alberic on a\npilgrimage to Jumieges to pray for the Duke's safety.  What joy for them\nto know that their prayers have been granted!\"\n\nOsmond, however, could scarcely rejoice, so alarmed was he at the extreme\nweariness and exhaustion of his charge, who, when they brought him into\nthe Castle hall, hardly spoke or looked, and could not eat.  They carried\nhim up to Alberic's bed, where he tossed about restlessly, too tired to\nsleep.\n\n\"Alas! alas!\" said Osmond, \"I have been too hasty.  I have but saved him\nfrom the Franks to be his death by my own imprudence.\"\n\n\"Hush!  Sieur de Centeville,\" said the Seneschal's wife, coming into the\nroom.  \"To talk in that manner is the way to be his death, indeed.  Leave\nthe child to me--he is only over-weary.\"\n\nOsmond was sure his Duke was among friends, and would have been glad to\ntrust him to a woman; but Richard had but one instinct left in all his\nweakness and exhaustion--to cling close to Osmond, as if he felt him his\nonly friend and protector; for he was, as yet, too much worn out to\nunderstand that he was in Normandy and safe.  For two or three hours,\ntherefore, Osmond and the Seneschal's wife watched on each side of his\nbed, soothing his restlessness, until at length he became quiet, and at\nlast dropped sound asleep.\n\nThe sun was high in the heavens when Richard awoke.  He turned on his\nstraw-filled crib, and looked up.  It was not the tapestried walls of his\nchamber at Laon that met his opening eyes, but the rugged stone and tall\nloop-hole window of a turret chamber.  Osmond de Centeville lay on the\nfloor by his side, in the sound sleep of one overcome by long watching\nand weariness.  And what more did Richard see?\n\nIt was the bright face and sparkling eyes of Alberic de Montemar, who was\nleaning against the foot of his bed, gazing earnestly, as he watched for\nhis waking.  There was a cry--\"Alberic! Alberic!\"  \"My Lord! my Lord!\"\nRichard sat up and held out both arms, and Alberic flung himself into\nthem.  They hugged each other, and uttered broken exclamations and\nscreams of joy, enough to have awakened any sleeper but one so wearied\nout as Osmond.\n\n\"And is it true?  Oh, am I really in Normandy again?\" cried Richard.\n\n\"Yes, yes!--oh, yes, my Lord!  You are at Montemar.  Everything here is\nyours.  The bar-tailed hawk is quite well, and my mother will be here\nthis evening; she let me ride on the instant we heard the news.\"\n\n\"We rode long and late, and I was very weary,\" said Richard! \"but I don't\ncare, now we are at home.  But I can hardly believe it!  Oh, Alberic, it\nhas been very dreary!\"\n\n\"See here, my Lord!\" said Alberic, standing by the window.  \"Look here,\nand you will know you are at home again!\"\n\nRichard bounded to the window, and what a sight met his eyes! The Castle\ncourt was thronged with men-at-arms and horses, the morning sun sparkling\non many a burnished hauberk and tall conical helmet, and above them waved\nmany a banner and pennon that Richard knew full well.  \"There! there!\" he\nshouted aloud with glee.  \"Oh, there is the horse-shoe of Ferrieres! and\nthere the chequers of Warenne!  Oh, and best of all, there is--there is\nour own red pennon of Centeville!  O Alberic!  Alberic! is Sir Eric here?\nI must go down to him!\"\n\n\"Bertrand sent out notice to them all, as soon as you came, to come and\nguard our Castle,\" said Alberic, \"lest the Franks should pursue you; but\nyou are safe now--safe as Norman spears can make you--thanks be to God!\"\n\n\"Yes, thanks to God!\" said Richard, crossing himself and kneeling\nreverently for some minutes, while he repeated his Latin prayer; then,\nrising and looking at Alberic, he said, \"I must thank Him, indeed, for he\nhas saved Osmond and me from the cruel King and Queen, and I must try to\nbe a less hasty and overbearing boy than I was when I went away; for I\nvowed that so I would be, if ever I came back.  Poor Osmond, how soundly\nhe sleeps! Come, Alberic, show me the way to Sir Eric!\"\n\nAnd, holding Alberic's hand, Richard left the room, and descended the\nstairs to the Castle hall.  Many of the Norman knights and barons, in\nfull armour, were gathered there; but Richard looked only for one.  He\nknew Sir Eric's grizzled hair, and blue inlaid armour, though his back\nwas towards him, and in a moment, before his entrance had been perceived,\nhe sprang towards him, and, with outstretched arms, exclaimed: \"Sir\nEric--dear Sir Eric, here I am! Osmond is safe!  And is Fru Astrida\nwell?\"\n\nThe old Baron turned.  \"My child!\" he exclaimed, and clasped him in his\nmailed arms, while the tears flowed down his rugged cheeks.  \"Blessed be\nGod that you are safe, and that my son has done his duty!\"\n\n\"And is Fru Astrida well?\"\n\n\"Yes, right well, since she heard of your safety.  But look round, my\nLord; it befits not a Duke to be clinging thus round an old man's neck.\nSee how many of your true vassals be here, to guard you from the villain\nFranks.\"\n\nRichard stood up, and held out his hand, bowing courteously and\nacknowledging the greetings of each bold baron, with a grace and\nreadiness he certainly had not when he left Normandy.  He was taller too;\nand though still pale, and not dressed with much care (since he had\nhurried on his clothes with no help but Alberic's)--though his hair was\nrough and disordered, and the scar of the burn had not yet faded from his\ncheck--yet still, with his bright blue eyes, glad face, and upright form,\nhe was a princely, promising boy, and the Norman knights looked at him\nwith pride and joy, more especially when, unprompted, he said: \"I thank\nyou, gallant knights, for coming to guard me.  I do not fear the whole\nFrench host now I am among my own true Normans.\"\n\nSir Eric led him to the door of the hall to the top of the steps, that\nthe men-at-arms might see him; and then such a shout rang out of \"Long\nlive Duke Richard!\"--\"Blessings on the little Duke!\"--that it echoed and\ncame back again from the hills around--it pealed from the old tower--it\nroused Osmond from his sleep--and, if anything more had been wanting to\ndo so, it made Richard feel that he was indeed in a land where every\nheart glowed with loyal love for him.\n\nBefore the shout had died away, a bugle-horn was heard winding before the\ngate; and Sir Eric, saying, \"It is the Count of Harcourt's note,\" sent\nBertrand to open the gates in haste, while Alberic followed, as Lord of\nthe Castle, to receive the Count.\n\nThe old Count rode into the court, and to the foot of the steps, where he\ndismounted, Alberic holding his stirrup.  He had not taken many steps\nupwards before Richard came voluntarily to meet him (which he had never\ndone before), held out his hand, and said, \"Welcome, Count Bernard,\nwelcome.  Thank you for coming to guard me.  I am very glad to see you\nonce more.\"\n\n\"Ah, my young Lord,\" said Bernard, \"I am right glad to see you out of the\nclutches of the Franks! You know friend from foe now, methinks!\"\n\n\"Yes, indeed I do, Count Bernard.  I know you meant kindly by me, and\nthat I ought to have thanked you, and not been angry, when you reproved\nme.  Wait one moment, Sir Count; there is one thing that I promised\nmyself to say if ever I came safe to my own dear home.\nWalter--Maurice--Jeannot--all you of my household, and of Sir Eric's--I\nknow, before I went away, I was often no good Lord to you; I was\npassionate, and proud, and overbearing; but God has punished me for it,\nwhen I was far away among my enemies, and sick and lonely.  I am very\nsorry for it, and I hope you will pardon me; for I will strive, and I\nhope God will help me, never to be proud and passionate again.\"\n\n\"There, Sir Eric,\" said Bernard, \"you hear what the boy says.  If he\nspeaks it out so bold and free, without bidding, and if he holds to what\nhe says, I doubt it not that he shall not grieve for his journey to\nFrance, and that we shall see him, in all things, such a Prince as his\nfather of blessed memory.\"\n\n\"You must thank Osmond for me,\" said Richard, as Osmond came down,\nawakened at length.  \"It is Osmond who has helped me to bear my troubles;\nand as to saving me, why he flew away with me even like an old eagle with\nits eaglet.  I say, Osmond, you must ever after this wear a pair of wings\non shield and pennon, to show how well we managed our flight.\" {15}\n\n\"As you will, my Lord,\" said Osmond, half asleep; \"but 'twas a good long\nflight at a stretch, and I trust never to have to fly before your foes or\nmine again.\"\n\nWhat a glad summer's day was that! Even the three hours spent in council\ndid but renew the relish with which Richard visited Alberic's treasures,\ntold his adventures, and showed the accomplishments he had learnt at\nLaon.  The evening was more joyous still; for the Castle gates were\nopened, first to receive Dame Yolande Montemar, and not above a quarter\nof an hour afterwards, the drawbridge was lowered to admit the followers\nof Centeville; and in front of them appeared Fru Astrida's own high cap.\nRichard made but one bound into her arms, and was clasped to her breast;\nthen held off at arm's-length, that she might see how much he was grown,\nand pity his scar; then hugged closer than ever: but, taking another\nlook, she declared that Osmond left his hair like King Harald\nHorrid-locks; {16} and, drawing an ivory comb from her pouch, began to\npull out the thick tangles, hurting him to a degree that would once have\nmade him rebel, but now he only fondled her the more.\n\nAs to Osmond, when he knelt before her, she blessed him, and sobbed over\nhim, and blamed him for over-tiring her darling, all in one; and\nassuredly, when night closed in and Richard had, as of old, told his\nbeads beside her knee, the happiest boy in Normandy was its little Duke.\n\n\n\n\nCHAPTER IX.\n\n\nMontemar was too near the frontier to be a safe abode for the little\nDuke, and his uncle, Count Hubert of Senlis, agreed with Bernard the Dane\nthat he would be more secure beyond the limits of his own duchy, which\nwas likely soon to be the scene of war; and, sorely against his will, he\nwas sent in secret, under a strong escort, first to the Castle of Coucy,\nand afterwards to Senlis.\n\nHis consolation was, that he was not again separated from his friends;\nAlberic, Sir Eric, and even Fru Astrida, accompanied him, as well as his\nconstant follower, Osmond.  Indeed, the Baron would hardly bear that he\nshould be out of his sight; and he was still so carefully watched, that\nit was almost like a captivity.  Never, even in the summer days, was he\nallowed to go beyond the Castle walls; and his guardians would fain have\nhad it supposed that the Castle did not contain any such guest.\n\nOsmond did not give him so much of his company as usual, but was always\nat work in the armourer's forge--a low, vaulted chamber, opening into the\nCastle court.  Richard and Alberic were very curious to know what he did\nthere; but he fastened the door with an iron bar, and they were forced to\ncontent themselves with listening to the strokes of the hammer, keeping\ntime to the voice that sang out, loud and cheerily, the song of \"Sigurd's\nsword, and the maiden sleeping within the ring of flame.\"  Fru Astrida\nsaid Osmond was quite right--no good weapon-smith ever toiled with open\ndoors; and when the boys asked him questions as to his work, he only\nsmiled, and said that they would see what it was when the call to arms\nshould come.\n\nThey thought it near at hand, for tidings came that Louis had assembled\nhis army, and marched into Normandy to recover the person of the young\nDuke, and to seize the country.  No summons, however, arrived, but a\nmessage came instead, that Rouen had been surrendered into the bands of\nthe King.  Richard shed indignant tears.  \"My father's Castle!  My own\ncity in the hands of the foe!  Bernard is a traitor then!  None shall\nhinder me from so calling him.  Why did we trust him?\"\n\n\"Never fear, Lord Duke,\" said Osmond.  \"When you come to the years of\nKnighthood, your own sword shall right you, in spite of all the false\nDanes, and falser Franks, in the land.\"\n\n\"What! you too, son Osmond?  I deemed you carried a cooler brain than to\nmiscall one who was true to Rollo's race before you or yon varlet were\nborn!\" said the old Baron.\n\n\"He has yielded my dukedom!  It is mis-calling to say he is aught but a\ntraitor!\" cried Richard.  \"Vile, treacherous, favour-seeking--\"\n\n\"Peace, peace, my Lord,\" said the Baron.  \"Bernard has more in that wary\nhead of his than your young wits, or my old ones, can unwind.  What he is\ndoing I may not guess, but I gage my life his heart is right.\"\n\nRichard was silent, remembering he had been once unjust, but he grieved\nheartily when he thought of the French in Rollo's tower, and it was\nfurther reported that the King was about to share Normandy among his\nFrench vassals.  A fresh outcry broke out in the little garrison of\nSenlis, but Sir Eric still persisted in his trust in his friend Bernard,\neven when he heard that Centeville was marked out as the prey of the fat\nFrench Count who had served for a hostage at Rouen.\n\n\"What say you now, my Lord?\" said he, after a conference with a messenger\nat the gate.  \"The Black Raven has spread its wings.  Fifty keels are in\nthe Seine, and Harald Blue-tooth's Long Serpent at the head of them.\"\n\n\"The King of Denmark! Come to my aid!\"\n\n\"Ay, that he is!  Come at Bernard's secret call, to right you, and put\nyou on your father's seat.  Now call honest Harcourt a traitor, because\nhe gave not up your fair dukedom to the flame and sword!\"\n\n\"No traitor to me,\" said Richard, pausing.  \"No, verily, but what more\nwould you say?\"\n\n\"I think, when I come to my dukedom, I will not be so politic,\" said\nRichard.  \"I will be an open friend or an open foe.\"\n\n\"The boy grows too sharp for us,\" said Sir Eric, smiling, \"but it was\nspoken like his father.\"\n\n\"He grows more like his blessed father each day,\" said Fru Astrida.\n\n\"But the Danes, father, the Danes!\" said Osmond.  \"Blows will be passing\nnow.  I may join the host and win my spurs?\"\n\n\"With all my heart,\" returned the Baron, \"so my Lord here gives you\nleave: would that I could leave him and go with you.  It would do my very\nspirit good but to set foot in a Northern keel once more.\"\n\n\"I would fain see what these men of the North are,\" said Osmond.\n\n\"Oh! they are only Danes, not Norsemen, and there are no Vikings, such as\nonce were when Ragnar laid waste--\"\n\n\"Son, son, what talk is this for the child's ears?\" broke in Fru Astrida,\n\"are these words for a Christian Baron?\"\n\n\"Your pardon, mother,\" said the grey warrior, in all humility, \"but my\nblood thrills to hear of a Northern fleet at hand, and to think of Osmond\ndrawing sword under a Sea-King.\"\n\nThe next morning, Osmond's steed was led to the door, and such\nmen-at-arms as could be spared from the garrison of Senlis were drawn up\nin readiness to accompany him.  The boys stood on the steps, wishing they\nwere old enough to be warriors, and wondering what had become of him,\nuntil at length the sound of an opening door startled them, and there, in\nthe low archway of the smithy, the red furnace glowing behind him, stood\nOsmond, clad in bright steel, the links of his hauberk reflecting the\nlight, and on his helmet a pair of golden wings, while the same device\nadorned his long pointed kite-shaped shield.\n\n\"Your wings! our wings!\" cried Richard, \"the bearing of Centeville!\"\n\n\"May they fly after the foe, not before him,\" said Sir Eric.  \"Speed thee\nwell, my son--let not our Danish cousins say we learn Frank graces\ninstead of Northern blows.\"\n\nWith such farewells, Osmond quitted Senlis, while the two boys hastened\nto the battlements to watch him as long as he remained in view.\n\nThe highest tower became their principal resort, and their eyes were\nconstantly on the heath where he had disappeared; but days passed, and\nthey grew weary of the watch, and betook themselves to games in the\nCastle court.\n\nOne day, Alberic, in the character of a Dragon, was lying on his back,\npanting hard so as to be supposed to cast out volumes of flame and smoke\nat Richard, the Knight, who with a stick for a lance, and a wooden sword,\nwas waging fierce war; when suddenly the Dragon paused, sat up, and\npointed towards the warder on the tower.  His horn was at his lips, and\nin another moment, the blast rang out through the Castle.\n\nWith a loud shout, both boys rushed headlong up the turret stairs, and\ncame to the top so breathless, that they could not even ask the warder\nwhat he saw.  He pointed, and the keen-eyed Alberic exclaimed, \"I see!\nLook, my Lord, a speck there on the heath!\"\n\n\"I do not see! where, oh where?\"\n\n\"He is behind the hillock now, but--oh, there again!  How fast he comes!\"\n\n\"It is like the flight of a bird,\" said Richard, \"fast, fast--\"\n\n\"If only it be not flight in earnest,\" said Alberic, a little anxiously,\nlooking into the warder's face, for he was a borderer, and tales of\nterror of the inroad of the Vicomte du Contentin were rife on the marches\nof the Epte.\n\n\"No, young Sir,\" said the warder, \"no fear of that.  I know how men ride\nwhen they flee from the battle.\"\n\n\"No, indeed, there is no discomfiture in the pace of that steed,\" said\nSir Eric, who had by this time joined them.\n\n\"I see him clearer!  I see the horse,\" cried Richard, dancing with\neagerness, so that Sir Eric caught hold of him, exclaiming, \"You will be\nover the battlements! hold still! better hear of a battle lost than\nthat!\"\n\n\"He bears somewhat in his hand,\" said Alberic.\n\n\"A banner or pennon,\" said the warder; \"methinks he rides like the young\nBaron.\"\n\n\"He does!  My brave boy!  He has done good service,\" exclaimed Sir Eric,\nas the figure became more developed.  \"The Danes have seen how we train\nour young men.\"\n\n\"His wings bring good tidings,\" said Richard.  \"Let me go, Sir Eric, I\nmust tell Fru Astrida.\"\n\nThe drawbridge was lowered, the portcullis raised, and as all the\ndwellers in the Castle stood gathered in the court, in rode the warrior\nwith the winged helm, bearing in his hand a drooping banner; lowering it\nas he entered, it unfolded, and displayed, trailing on the ground at the\nfeet of the little Duke of Normandy, the golden lilies of France.\n\nA shout of amazement arose, and all gathered round him, asking hurried\nquestions.  \"A great victory--the King a prisoner--Montreuil slain!\"\n\nRichard would not be denied holding his hand, and leading him to the\nhall, and there, sitting around him, they heard his tidings.  His\nfather's first question was, what he thought of their kinsmen, the Danes?\n\n\"Rude comrades, father, I must own,\" said Osmond, smiling, and shaking\nhis head.  \"I could not pledge them in a skull-goblet--set in gold though\nit were.\"\n\n\"None the worse warriors,\" said Sir Eric.  \"Ay, ay, and you were dainty,\nand brooked not the hearty old fashion of tearing the whole sheep to\npieces.  You must needs cut your portion with the fine French knife at\nyour girdle.\"\n\nOsmond could not see that a man was braver for being a savage, but he\nheld his peace; and Richard impatiently begged to hear how the battle had\ngone, and where it had been fought.\n\n\"On the bank of the Dive,\" said Osmond.  \"Ah, father, you might well call\nold Harcourt wary--his name might better have been Fox-heart than\nBear-heart!  He had sent to the Franks a message of distress, that the\nDanes were on him in full force, and to pray them to come to his aid.\"\n\n\"I trust there was no treachery.  No foul dealing shall be wrought in my\nname,\" exclaimed Richard, with such dignity of tone and manner, as made\nall feel he was indeed their Duke, and forget his tender years.\n\n\"No, or should I tell the tale with joy like this?\" said Osmond.\n\"Bernard's view was to bring the Kings together, and let Louis see you\nhad friends to maintain your right.  He sought but to avoid bloodshed.\"\n\n\"And how chanced it?\"\n\n\"The Danes were encamped on the Dive, and so soon as the French came in\nsight, Blue-tooth sent a messenger to Louis, to summon him to quit\nNeustria, and leave it to you, its lawful owner.  Thereupon, Louis,\nhoping to win him over with wily words, invited him to hold a personal\nconference.\"\n\n\"Where were you, Osmond?\"\n\n\"Where I had scarce patience to be.  Bernard had gathered all of us\nhonest Normans together, and arranged us beneath that standard of the\nKing, as if to repel his Danish inroad.  Oh, he was, in all seeming,\nhand-and-glove with Louis, guiding him by his counsel, and, verily,\nseeming his friend and best adviser!  But in one thing he could not\nprevail.  That ungrateful recreant, Herluin of Montreuil, came with the\nKing, hoping, it seems, to get his share of our spoils; and when Bernard\nadvised the King to send him home, since no true Norman could bear the\nsight of him, the hot-headed Franks vowed no Norman should hinder them\nfrom bringing whom they chose.  So a tent was set up by the riverside,\nwherein the two Kings, with Bernard, Alan of Brittany, and Count Hugh,\nheld their meeting.  We all stood without, and the two hosts began to\nmingle together, we Normans making acquaintance with the Danes.  There\nwas a red-haired, wild-looking fellow, who told me he had been with\nAnlaff in England, and spoke much of the doings of Hako in Norway; when,\nsuddenly, he pointed to a Knight who was near, speaking to a Cotentinois,\nand asked me his name.  My blood boiled as I answered, for it was\nMontreuil himself!  'The cause of your Duke's death!' said the Dane.\n'Ha, ye Normans are fallen sons of Odin, to see him yet live!'\"\n\n\"You said, I trust, my son, that we follow not the laws of Odin?\" said\nFru Astrida.\n\n\"I had no space for a word, grandmother; the Danes took the vengeance on\nthemselves.  In one moment they rushed on Herluin with their axes, and\nthe unhappy man was dead.  All was tumult; every one struck without\nknowing at whom, or for what.  Some shouted, '_Thor Hulfe_!' some '_Dieu\naide_!' others '_Montjoie St. Denis_!'  Northern blood against French,\nthat was all our guide.  I found myself at the foot of this standard, and\nhad a hard combat for it; but I bore it away at last.\"\n\n\"And the Kings?\"\n\n\"They hurried out of the tent, it seems, to rejoin their men.  Louis\nmounted, but you know of old, my Lord, he is but an indifferent horseman,\nand the beast carried him into the midst of the Danes, where King Harald\ncaught his bridle, and delivered him to four Knights to keep.  Whether he\ndealt secretly with them, or whether they, as they declared, lost sight\nof him whilst plundering his tent, I cannot say; but when Harald demanded\nhim of them, he was gone.\"\n\n\"Gone! is this what you call having the King prisoner?\"\n\n\"You shall hear.  He rode four leagues, and met one of the baser sort of\nRouennais, whom he bribed to hide him in the Isle of Willows.  However,\nBernard made close inquiries, found the fellow had been seen in speech\nwith a French horseman, pounced on his wife and children, and threatened\nthey should die if he did not disclose the secret.  So the King was\nforced to come out of his hiding-place, and is now fast guarded in\nRollo's tower--a Dane, with a battle-axe on his shoulder, keeping guard\nat every turn of the stairs.\"\n\n\"Ha! ha!\" cried Richard.  \"I wonder how he likes it.  I wonder if he\nremembers holding me up to the window, and vowing that he meant me only\ngood!\"\n\n\"When you believed him, my Lord,\" said Osmond, slyly.\n\n\"I was a little boy then,\" said Richard, proudly.  \"Why, the very walls\nmust remind him of his oath, and how Count Bernard said, as he dealt with\nme, so might Heaven deal with him.\"\n\n\"Remember it, my child--beware of broken vows,\" said Father Lucas; \"but\nremember it not in triumph over a fallen foe.  It were better that all\ncame at once to the chapel, to bestow their thanksgivings where alone\nthey are due.\"\n\n\n\n\nCHAPTER X.\n\n\nAfter nearly a year's captivity, the King engaged to pay a ransom, and,\nuntil the terms could be arranged, his two sons were to be placed as\nhostages in the hands of the Normans, whilst he returned to his own\ndomains.  The Princes were to be sent to Bayeux; whither Richard had\nreturned, under the charge of the Centevilles, and was now allowed to\nride and walk abroad freely, provided he was accompanied by a guard.\n\n\"I shall rejoice to have Carloman, and make him happy,\" said Richard;\n\"but I wish Lothaire were not coming.\"\n\n\"Perhaps,\" said good Father Lucas, \"he comes that you may have a first\ntrial in your father's last lesson, and Abbot Martin's, and return good\nfor evil.\"\n\nThe Duke's cheek flushed, and he made no answer.\n\nHe and Alberic betook themselves to the watch-tower, and, by and by, saw\na cavalcade approaching, with a curtained vehicle in the midst, slung\nbetween two horses.  \"That cannot be the Princes,\" said Alberic; \"that\nmust surely be some sick lady.\"\n\n\"I only hope it is not the Queen,\" exclaimed Richard, in dismay.  \"But\nno; Lothaire is such a coward, no doubt he was afraid to ride, and she\nwould not trust her darling without shutting him up like a demoiselle.\nBut come down, Alberic; I will say nothing unkind of Lothaire, if I can\nhelp it.\"\n\nRichard met the Princes in the court, his sunny hair uncovered, and\nbowing with such becoming courtesy, that Fru Astrida pressed her son's\narm, and bade him say if their little Duke was not the fairest and\nnoblest child in Christendom.\n\nWith black looks, Lothaire stepped from the litter, took no heed of the\nlittle Duke, but, roughly calling his attendant, Charlot, to follow him,\nhe marched into the hall, vouchsafing neither word nor look to any as he\npassed, threw himself into the highest seat, and ordered Charlot to bring\nhim some wine.\n\nMeanwhile, Richard, looking into the litter, saw Carloman crouching in a\ncorner, sobbing with fright.\n\n\"Carloman!--dear Carloman!--do not cry.  Come out!  It is I--your own\nRichard!  Will you not let me welcome you?\"\n\nCarloman looked, caught at the outstretched hand, and clung to his neck.\n\n\"Oh, Richard, send us back!  Do not let the savage Danes kill us!\"\n\n\"No one will hurt you.  There are no Danes here.  You are my guest, my\nfriend, my brother.  Look up! here is my own Fru Astrida.\"\n\n\"But my mother said the Northmen would kill us for keeping you captive.\nShe wept and raved, and the cruel men dragged us away by force.  Oh, let\nus go back!\"\n\n\"I cannot do that,\" said Richard; \"for you are the King of Denmark's\ncaptives, not mine; but I will love you, and you shall have all that is\nmine, if you will only not cry, dear Carloman.  Oh, Fru Astrida, what\nshall I do?  You comfort him--\" as the poor boy clung sobbing to him.\n\nFru Astrida advanced to take his hand, speaking in a soothing voice, but\nhe shrank and started with a fresh cry of terror--her tall figure, high\ncap, and wrinkled face, were to him witch-like, and as she knew no\nFrench, he understood not her kind words.  However, he let Richard lead\nhim into the hall, where Lothaire sat moodily in the chair, with one leg\ntucked under him, and his finger in his mouth.\n\n\"I say, Sir Duke,\" said he, \"is there nothing to be had in this old den\nof yours?  Not a drop of Bordeaux?\"\n\nRichard tried to repress his anger at this very uncivil way of speaking,\nand answered, that he thought there was none, but there was plenty of\nNorman cider.\n\n\"As if I would taste your mean peasant drinks! I bade them bring my\nsupper--why does it not come?\"\n\n\"Because you are not master here,\" trembled on Richard's lips, but he\nforced it back, and answered that it would soon be ready, and Carloman\nlooked imploringly at his brother, and said, \"Do not make them angry,\nLothaire.\"\n\n\"What, crying still, foolish child?\" said Lothaire.  \"Do you not know\nthat if they dare to cross us, my father will treat them as they deserve?\nBring supper, I say, and let me have a pasty of ortolans.\"\n\n\"There are none--they are not in season,\" said Richard.\n\n\"Do you mean to give me nothing I like?  I tell you it shall be the worse\nfor you.\"\n\n\"There is a pullet roasting,\" began Richard.\n\n\"I tell you, I do not care for pullets--I will have ortolans.\"\n\n\"If I do not take order with that boy, my name is not Eric,\" muttered the\nBaron.\n\n\"What must he not have made our poor child suffer!\" returned Fru Astrida,\n\"but the little one moves my heart.  How small and weakly he is, but it\nis worth anything to see our little Duke so tender to him.\"\n\n\"He is too brave not to be gentle,\" said Osmond; and, indeed, the\nhigh-spirited, impetuous boy was as soft and kind as a maiden, with that\nfeeble, timid child.  He coaxed him to eat, consoled him, and, instead of\nlaughing at his fears, kept between him and the great bloodhound\nHardigras, and drove it off when it came too near.\n\n\"Take that dog away,\" said Lothaire, imperiously.  No one moved to obey\nhim, and the dog, in seeking for scraps, again came towards him.\n\n\"Take it away,\" he repeated, and struck it with his foot.  The dog\ngrowled, and Richard started up in indignation.\n\n\"Prince Lothaire,\" he said, \"I care not what else you do, but my dogs and\nmy people you shall not maltreat.\"\n\n\"I tell you I am Prince!  I do what I will!  Ha! who laughs there?\" cried\nthe passionate boy, stamping on the floor.\n\n\"It is not so easy for French Princes to scourge free-born Normans here,\"\nsaid the rough voice of Walter the huntsman: \"there is a reckoning for\nthe stripe my Lord Duke bore for me.\"\n\n\"Hush, hush, Walter,\" began Richard; but Lothaire had caught up a\nfootstool, and was aiming it at the huntsman, when his arm was caught.\n\nOsmond, who knew him well enough to be prepared for such outbreaks, held\nhim fast by both hands, in spite of his passionate screams and struggles,\nwhich were like those of one frantic.\n\nSir Eric, meanwhile, thundered forth in his Norman patois, \"I would have\nyou to know, young Sir, Prince though you be, you are our prisoner, and\nshall taste of a dungeon, and bread and water, unless you behave\nyourself.\"\n\nEither Lothaire did not hear, or did not believe, and fought more\nfuriously in Osmond's arms, but he had little chance with the stalwart\nyoung warrior, and, in spite of Richard's remonstrances, he was carried\nfrom the hall, roaring and kicking, and locked up alone in an empty room.\n\n\"Let him alone for the present,\" said Sir Eric, putting the Duke aside,\n\"when he knows his master, we shall have peace.\"\n\nHere Richard had to turn, to reassure Carloman, who had taken refuge in a\ndark corner, and there shook like an aspen leaf, crying bitterly, and\nstarting with fright, when Richard touched him.\n\n\"Oh, do not put me in the dungeon.  I cannot bear the dark.\"\n\nRichard again tried to comfort him, but he did not seem to hear or heed.\n\"Oh! they said you would beat and hurt us for what we did to you! but,\nindeed, it was not I that burnt your cheek!\"\n\n\"We would not hurt you for worlds, dear Carloman; Lothaire is not in the\ndungeon--he is only shut up till he is good.\"\n\n\"It was Lothaire that did it,\" repeated Carloman, \"and, indeed, you must\nnot be angry with me, for my mother was so cross with me for not having\nstopped Osmond when I met him with the bundle of straw, that she gave me\na blow, that knocked me down.  And were you really there, Richard?\"\n\nRichard told his story, and was glad to find Carloman could smile at it;\nand then Fru Astrida advised him to take his little friend to bed.\nCarloman would not lie down without still holding Richard's hand, and the\nlittle Duke spared no pains to set him at rest, knowing what it was to be\na desolate captive far from home.\n\n\"I thought you would be good to me,\" said Carloman.  \"As to Lothaire, it\nserves him right, that you should use him as he used you.\"\n\n\"Oh, no, Carloman; if I had a brother I would never speak so of him.\"\n\n\"But Lothaire is so unkind.\"\n\n\"Ah! but we must be kind to those who are unkind to us.\"\n\nThe child rose on his elbow, and looked into Richard's face.  \"No one\never told me so before.\"\n\n\"Oh, Carloman, not Brother Hilary?\"\n\n\"I never heed Brother Hilary--he is so lengthy, and wearisome; besides,\nno one is ever kind to those that hate them.\"\n\n\"My father was,\" said Richard.\n\n\"And they killed him!\" said Carloman.\n\n\"Yes,\" said Richard, crossing himself, \"but he is gone to be in peace.\"\n\n\"I wonder if it is happier there, than here,\" said Carloman.  \"I am not\nhappy.  But tell me why should we be good to those that hate us?\"\n\n\"Because the holy Saints were--and look at the Crucifix, Carloman.  That\nwas for them that hated Him.  And, don't you know what our Pater Noster\nsays?\"\n\nPoor little Carloman could only repeat the Lord's Prayer in Latin--he had\nnot the least notion of its meaning--in which Richard had been carefully\ninstructed by Father Lucas.  He began to explain it, but before many\nwords had passed his lips, little Carloman was asleep.\n\nThe Duke crept softly away to beg to be allowed to go to Lothaire; he\nentered the room, already dark, with a pine torch in his hand, that so\nflickered in the wind, that he could at first see nothing, but presently\nbeheld a dark lump on the floor.\n\n\"Prince Lothaire,\" he said, \"here is--\"\n\nLothaire cut him short.  \"Get away,\" he said.  \"If it is your turn now,\nit will be mine by and by.  I wish my mother had kept her word, and put\nyour eyes out.\"\n\nRichard's temper did not serve for such a reply.  \"It is a foul shame of\nyou to speak so, when I only came out of kindness to you--so I shall\nleave you here all night, and not ask Sir Eric to let you out.\"\n\nAnd he swung back the heavy door with a resounding clang.  But his heart\nsmote him when he told his beads, and remembered what he had said to\nCarloman.  He knew he could not sleep in his warm bed when Lothaire was\nin that cold gusty room.  To be sure, Sir Eric said it would do him good,\nbut Sir Eric little knew how tender the French Princes were.\n\nSo Richard crept down in the dark, slid back the bolt, and called,\n\"Prince, Prince, I am sorry I was angry.  Come out, and let us try to be\nfriends.\"\n\n\"What do you mean?\" said Lothaire.\n\n\"Come out of the cold and dark.  Here am I.  I will show you the way.\nWhere is your hand?  Oh, how cold it is.  Let me lead you down to the\nhall fire.\"\n\nLothaire was subdued by fright, cold, and darkness, and quietly allowed\nRichard to lead him down.  Round the fire, at the lower end of the hall,\nsnored half-a-dozen men-at-arms; at the upper hearth there was only\nHardigras, who raised his head as the boys came in.  Richard's whisper\nand soft pat quieted him instantly, and the two little Princes sat on the\nhearth together, Lothaire surprised, but sullen.  Richard stirred the\nembers, so as to bring out more heat, then spoke: \"Prince, will you let\nus be friends?\"\n\n\"I must, if I am in your power.\"\n\n\"I wish you would be my guest and comrade.\"\n\n\"Well, I will; I can't help it.\"\n\nRichard thought his advances might have been more graciously met, and,\nhaving little encouragement to say more, took Lothaire to bed, as soon as\nhe was warm.\n\n\n\n\nCHAPTER XI.\n\n\nAs the Baron had said, there was more peace now that Lothaire had learnt\nto know that he must submit, and that no one cared for his threats of his\nfather's or his mother's vengeance.  He was very sulky and disagreeable,\nand severely tried Richard's forbearance; but there were no fresh\noutbursts, and, on the whole, from one week to another, there might be\nsaid to be an improvement.  He could not always hold aloof from one so\ngood-natured and good-humoured as the little Duke; and the fact of being\nkept in order could not but have some beneficial effect on him, after\nsuch spoiling as his had been at home.\n\nIndeed, Osmond was once heard to say, it was a pity the boy was not to be\na hostage for life; to which Sir Eric replied, \"So long as we have not\nthe training of him.\"\n\nLittle Carloman, meanwhile, recovered from his fears of all the inmates\nof the Castle excepting Hardigras, at whose approach he always shrank and\ntrembled.\n\nHe renewed his friendship with Osmond, no longer started at the entrance\nof Sir Eric, laughed at Alberic's merry ways, and liked to sit on Fru\nAstrida's lap, and hear her sing, though he understood not one word; but\nhis especial love was still for his first friend, Duke Richard.\nHand-in-hand they went about together, Richard sometimes lifting him up\nthe steep steps, and, out of consideration for him, refraining from rough\nplay; and Richard led him to join with him in those lessons that Father\nLucas gave the children of the Castle, every Friday and Sunday evening in\nthe Chapel.  The good Priest stood on the Altar steps, with the children\nin a half circle round him--the son and daughter of the armourer, the\nhuntsman's little son, the young Baron de Montemar, the Duke of Normandy,\nand the Prince of France, all were equal there--and together they learnt,\nas he explained to them the things most needful to believe; and thus\nCarloman left off wondering why Richard thought it right to be good to\nhis enemies; and though at first he had known less than even the little\nleather-coated huntsman, he seemed to take the holy lessons in faster\nthan any of them--yes, and act on them, too.  His feeble health seemed to\nmake him enter into their comfort and meaning more than even Richard; and\nAlberic and Father Lucas soon told Fru Astrida that it was a\nsaintly-minded child.\n\nIndeed, Carloman was more disposed to thoughtfulness, because he was\nincapable of joining in the sports of the other boys.  A race round the\ncourt was beyond his strength, the fresh wind on the battlements made him\nshiver and cower, and loud shouting play was dreadful to him.  In old\ntimes, he used to cry when Lothaire told him he must have his hair cut,\nand be a priest; now, he only said quietly, he should like it very much,\nif he could be good enough.\n\nFru Astrida sighed and shook her head, and feared the poor child would\nnever grow up to be anything on this earth.  Great as had been the\ndifference at first between him and Richard, it was now far greater.\nRichard was an unusually strong boy for ten years old, upright and\nbroad-chested, and growing very fast; while Carloman seemed to dwindle,\nstooped forward from weakness, had thin pinched features, and sallow\ncheeks, looking like a plant kept in the dark.\n\nThe old Baron said that hardy, healthy habits would restore the puny\nchildren; and Lothaire improved in health, and therewith in temper; but\nhis little brother had not strength enough to bear the seasoning.  He\npined and drooped more each day; and as the autumn came on, and the wind\nwas chilly, he grew worse, and was scarcely ever off the lap of the kind\nLady Astrida.  It was not a settled sickness, but he grew weaker, and\nwasted away.  They made up a little couch for him by the fire, with the\nhigh settle between it and the door, to keep off the draughts; and there\nhe used patiently to lie, hour after hour, speaking feebly, or smiling\nand seeming pleased, when any one of those he loved approached.  He liked\nFather Lucas to come and say prayers with him; and he never failed to\nhave a glad look, when his dear little Duke came to talk to him, in his\ncheerful voice, about his rides and his hunting and hawking adventures.\nRichard's sick guest took up much of his thoughts, and he never willingly\nspent many hours at a distance from him, softening his step and lowering\nhis voice, as he entered the hall, lest Carloman should be asleep.\n\n\"Richard, is it you?\" said the little boy, as the young figure came round\nthe settle in the darkening twilight.\n\n\"Yes.  How do you feel now, Carloman; are you better?\"\n\n\"No better, thanks, dear Richard;\" and the little wasted fingers were put\ninto his.\n\n\"Has the pain come again?\"\n\n\"No; I have been lying still, musing; Richard, I shall never be better.\"\n\n\"Oh, do not say so!  You will, indeed you will, when spring comes.\"\n\n\"I feel as if I should die,\" said the little boy; \"I think I shall.  But\ndo not grieve, Richard.  I do not feel much afraid.  You said it was\nhappier there than here, and I know it now.\"\n\n\"Where my blessed father is,\" said Richard, thoughtfully.  \"But oh,\nCarloman, you are so young to die!\"\n\n\"I do not want to live.  This is a fighting, hard world, full of cruel\npeople; and it is peace there.  You are strong and brave, and will make\nthem better; but I am weak and fearful--I could only sigh and grieve.\"\n\n\"Oh, Carloman!  Carloman!  I cannot spare you.  I love you like my own\nbrother.  You must not die--you must live to see your father and mother\nagain!\"\n\n\"Commend me to them,\" said Carloman.  \"I am going to my Father in heaven.\nI am glad I am here, Richard; I never was so happy before.  I should have\nbeen afraid indeed to die, if Father Lucas had not taught me how my sins\nare pardoned.  Now, I think the Saints and Angels are waiting for me.\"\n\nHe spoke feebly, and his last words faltered into sleep.  He slept on;\nand when supper was brought, and the lamps were lighted, Fru Astrida\nthought the little face looked unusually pale and waxen; but he did not\nawake.  At night, they carried him to his bed, and he was roused into a\nhalf conscious state, moaning at being disturbed.  Fru Astrida would not\nleave him, and Father Lucas shared her watch.\n\nAt midnight, all were wakened by the slow notes, falling one by one on\nthe ear, of the solemn passing-bell, calling them to waken, that their\nprayers might speed a soul on its way.  Richard and Lothaire were soon at\nthe bedside.  Carloman lay still asleep, his hands folded on his breast,\nbut his breath came in long gasps.  Father Lucas was praying over him,\nand candles were placed on each side of the bed.  All was still, the boys\nnot daring to speak or move.  There came a longer breath--then they heard\nno more.  He was, indeed, gone to a happier home--a truer royalty than\never had been his on earth.\n\nThen the boys' grief burst out.  Lothaire screamed for his mother, and\nsobbed out that he should die too--he must go home.  Richard stood by the\nbed, large silent tears rolling down his cheeks, and his chest heaving\nwith suppressed sobs.\n\nFru Astrida led them from the room, back to their beds.  Lothaire soon\ncried himself to sleep.  Richard lay awake, sorrowful, and in deep\nthought; while that scene in St. Mary's, at Rouen, returned before his\neyes, and though it had passed nearly two years ago, its meaning and its\nteaching had sunk deep into his mind, and now stood before him more\ncompletely.\n\n\"Where shall I go, when I come to die, if I have not returned good for\nevil?\"  And a resolution was taken in the mind of the little Duke.\n\nMorning came, and brought back the sense that his gentle little companion\nwas gone from him; and Richard wept again, as if he could not be\nconsoled, as he beheld the screened couch where the patient smile would\nnever again greet him.  He now knew that he had loved Carloman all the\nmore for his weakness and helplessness; but his grief was not like\nLothaire's, for with the Prince's was still joined a selfish fear: his\ncry was still, that he should die too, if not set free, and violent\nweeping really made him heavy and ill.\n\nThe little corpse, embalmed and lapped in lead, was to be sent back to\nFrance, that it might rest with its forefathers in the city of Rheims;\nand Lothaire seemed to feel this as an additional stroke of desertion.\nHe was almost beside himself with despair, imploring every one, in turn,\nto send him home, though he well knew they were unable to do so.\n\n\n\n\nCHAPTER XII.\n\n\n\"Sir Eric,\" said Richard, \"you told me there was a Parlement to be held\nat Falaise, between Count Bernard and the King of Denmark.  I mean to\nattend it.  Will you come with me, or shall Osmond go, and you remain in\ncharge of the Prince?\"\n\n\"How now, Lord Richard, you were not wont to love a Parlement?\"\n\n\"I have something to say,\" replied Richard.  The Baron made no objection,\nonly telling his mother that the Duke was a marvellous wise child, and\nthat he would soon be fit to take the government himself.\n\nLothaire lamented the more when he found that Richard was going away; his\npresence seemed to him a protection, and he fancied, now Carloman was\ndead, that his former injuries were about to be revenged.  The Duke\nassured him, repeatedly, that he meant him nothing but kindness, adding,\n\"When I return, you will see, Lothaire;\" then, commending him to the care\nand kindness of Fru Astrida, Osmond, and Alberic, Richard set forth upon\nhis pony, attended by Sir Eric and three men-at-arms.\n\nRichard felt sad when he looked back at Bayeux, and thought that it no\nlonger contained his dear little friend; but it was a fresh bright frosty\nmorning, the fields were covered with a silvery-white coating, the flakes\nof hoar-frost sparkled on every bush, and the hard ground rung cheerily\nto the tread of the horses' feet.  As the yellow sun fought his way\nthrough the grey mists that dimmed his brightness, and shone out merrily\nin the blue heights of the sky, Richard's spirits rose, and he laughed\nand shouted, as hare or rabbit rushed across the heath, or as the plover\nrose screaming above his head, flapping her broad wings across the wintry\nsky.\n\nOne night they slept at a Convent, where they heard that Hugh of Paris\nhad passed on to join the conference at Falaise.  The next day they rode\non, and, towards the afternoon, the Baron pointed to a sharp rocky range\nof hills, crowned by a tall solid tower, and told Richard, yonder was his\nkeep of Falaise, the strongest Castle in Normandy.\n\nThe country was far more broken as they advanced--narrow valleys and\nsharp hills, each little vale full of wood, and interspersed with rocks.\n\"A choice place for game,\" Sir Eric said and Richard, as he saw a herd of\ndeer dash down a forest glade, exclaimed, \"that they must come here to\nstay, for some autumn sport.\"\n\nThere seemed to be huntsmen abroad in the woods; for through the frosty\nair came the baying of dogs, the shouts and calls of men, and, now and\nthen, the echoing, ringing notes of a bugle.  Richard's eyes and cheeks\nglowed with excitement, and he pushed his brisk little pony on faster and\nfaster, unheeding that the heavier men and horses of his suite were not\nkeeping pace with him on the rough ground and through the tangled boughs.\n\nPresently, a strange sound of growling and snarling was heard close at\nhand: his pony swerved aside, and could not be made to advance; so\nRichard, dismounting, dashed through some briars, and there, on an open\nspace, beneath a precipice of dark ivy-covered rock, that rose like a\nwall, he beheld a huge grey wolf and a large dog in mortal combat.  It\nwas as if they had fallen or rolled down the precipice together, not\nheeding it in their fury.  Both were bleeding, and the eyes of both\nglared like red fiery glass in the dark shadow of the rock.  The dog lay\nundermost, almost overpowered, making but a feeble resistance; and the\nwolf would, in another moment, be at liberty to spring on the lonely\nchild.\n\nBut not a thought of fear passed through his breast; to save the dog was\nRichard's only idea.  In one moment he had drawn the dagger he wore at\nhis girdle, ran to the two struggling animals, and with all his force,\nplunged it into the throat of the wolf, which, happily, was still held by\nthe teeth of the hound.\n\nThe struggles relaxed, the wolf rolled heavily aside, dead; the dog lay\npanting and bleeding, and Richard feared he was cruelly torn.  \"Poor\nfellow! noble dog! what shall I do to help you?\" and he gently smoothed\nthe dark brindled head.\n\nA voice was now heard shouting aloud, at which the dog raised and crested\nhis head, as a figure in a hunting dress was coming down a rocky pathway,\nan extremely tall, well-made man, of noble features.  \"Ha! holla!  Vige!\nVige!  How now, my brave hound?\" he said in the Northern tongue, though\nnot quite with the accent Richard was accustomed to hear \"Art hurt?\"\n\n\"Much torn, I fear,\" Richard called out, as the faithful creature wagged\nhis tail, and strove to rise and meet his master.\n\n\"Ha, lad! what art thou?\" exclaimed the hunter, amazed at seeing the boy\nbetween the dead wolf and wounded dog.  \"You look like one of those\nFrenchified Norman gentilesse, with your smooth locks and gilded\nbaldrick, yet your words are Norse.  By the hammer of Thor! that is a\ndagger in the wolf's throat!\"\n\n\"It is mine,\" said Richard.  \"I found your dog nearly spent, and I made\nin to the rescue.\"\n\n\"You did?  Well done!  I would not have lost Vige for all the plunder of\nItaly.  I am beholden to you, my brave young lad,\" said the stranger, all\nthe time examining and caressing the hound.  \"What is your name?  You\ncannot be Southern bred?\"\n\nAs he spoke, more shouts came near; and the Baron de Centeville rushed\nthrough the trees holding Richard's pony by the bridle.  \"My Lord, my\nLord!--oh, thank Heaven, I see you safe!\"  At the same moment a party of\nhunters also approached by the path, and at the head of them Bernard the\nDane.\n\n\"Ha!\" exclaimed he, \"what do I see?  My young Lord! what brought you\nhere?\"  And with a hasty obeisance, Bernard took Richard's outstretched\nhand.\n\n\"I came hither to attend your council,\" replied Richard.  \"I have a boon\nto ask of the King of Denmark.\"\n\n\"Any boon the King of Denmark has in his power will be yours,\" said the\ndog's master, slapping his hand on the little Duke's shoulder, with a\nrude, hearty familiarity, that took him by surprise; and he looked up\nwith a shade of offence, till, on a sudden flash of perception, he took\noff his cap, exclaiming, \"King Harald himself!  Pardon me, Sir King!\"\n\n\"Pardon, Jarl Richart!  What would you have me pardon?--your saving the\nlife of Vige here?  No French politeness for me.  Tell me your boon, and\nit is yours.  Shall I take you a voyage, and harry the fat monks of\nIreland?\"\n\nRichard recoiled a little from his new friend.\n\n\"Oh, ha!  I forgot.  They have made a Christian of you--more's the pity.\nYou have the Northern spirit so strong.  I had forgotten it.  Come, walk\nby my side, and let me hear what you would ask.  Holla, you Sweyn! carry\nVige up to the Castle, and look to his wounds.  Now for it, young Jarl.\"\n\n\"My boon is, that you would set free Prince Lothaire.\"\n\n\"What?--the young Frank?  Why they kept you captive, burnt your face, and\nwould have made an end of you but for your clever Bonder.\"\n\n\"That is long past, and Lothaire is so wretched.  His brother is dead,\nand he is sick with grief, and he says he shall die, if he does not go\nhome.\"\n\n\"A good thing too for the treacherous race to die out in him!  What\nshould you care for him? he is your foe.\"\n\n\"I am a Christian,\" was Richard's answer.\n\n\"Well, I promised you whatever you might ask.  All my share of his\nransom, or his person, bond or free, is yours.  You have only to prevail\nwith your own Jarls and Bonders.\"\n\nRichard feared this would be more difficult; but Abbot Martin came to the\nmeeting, and took his part.  Moreover, the idea of their hostage dying in\ntheir hands, so as to leave them without hold upon the King, had much\nweight with them; and, after long deliberation, they consented that\nLothaire should be restored to his father, without ransom but only on\ncondition that Louis should guarantee to the Duke the peaceable\npossession of the country, as far as St. Clair sur Epte, which had been\nlong in dispute; so that Alberic became, indisputably, a vassal of\nNormandy.\n\nPerhaps it was the happiest day in Richard's life when he rode back to\nBayeux, to desire Lothaire to prepare to come with him to St. Clair,\nthere to be given back into the hands of his father.\n\nAnd then they met King Louis, grave and sorrowful for the loss of his\nlittle Carloman, and, for the time, repenting of his misdeeds towards the\norphan heir of Normandy.\n\nHe pressed the Duke in his arms, and his kiss was a genuine one as he\nsaid, \"Duke Richard, we have not deserved this of you.  I did not treat\nyou as you have treated my children.  We will be true lord and vassal\nfrom henceforth.\"\n\nLothaire's last words were, \"Farewell, Richard.  If I lived with you, I\nmight be good like you.  I will never forget what you have done for me.\"\n\nWhen Richard once more entered Rouen in state, his subjects shouting\nround him in transports of joy, better than all his honour and glory was\nthe being able to enter the Church of our Lady, and kneel by his father's\ngrave, with a clear conscience, and the sense that he had tried to keep\nthat last injunction.\n\n\n\n\nCONCLUSION.\n\n\nYears had passed away.  The oaths of Louis, and promises of Lothaire, had\nbeen broken; and Arnulf of Flanders, the murderer of Duke William, had\nincited them to repeated and treacherous inroads on Normandy; so that\nRichard's life, from fourteen to five or six-and-twenty, had been one\nlong war in defence of his country.  But it had been a glorious war for\nhim, and his gallant deeds had well earned for him the title of \"Richard\nthe Fearless\"--a name well deserved; for there was but one thing he\nfeared, and that was, to do wrong.\n\nBy and by, success and peace came; and then Arnulf of Flanders, finding\nopen force would not destroy him, three times made attempts to\nassassinate him, like his father, by treachery.  But all these had\nfailed; and now Richard had enjoyed many years of peace and honour,\nwhilst his enemies had vanished from his sight.\n\nKing Louis was killed by a fall from his horse; Lothaire died in early\nyouth, and in him ended the degenerate line of Charlemagne; Hugh Capet,\nthe son of Richard's old friend, Hugh the White, was on the throne of\nFrance, his sure ally and brother-in-law, looking to him for advice and\naid in all his undertakings.\n\nFru Astrida and Sir Eric had long been in their quiet graves; Osmond and\nAlberic were among Richard's most trusty councillors and warriors; Abbot\nMartin, in extreme old age, still ruled the Abbey of Jumieges, where\nRichard, like his father, loved to visit him, hold converse with him, and\nrefresh himself in the peaceful cloister, after the affairs of state and\nwar.\n\nAnd Richard himself was a grey-headed man, of lofty stature and majestic\nbearing.  His eldest son was older than he had been himself when he\nbecame the little Duke, and he had even begun to remember his father's\nproject, of an old age to be spent in retirement and peace.\n\nIt was on a summer eve, that Duke Richard sat beside the white-bearded\nold Abbot, within the porch, looking at the sun shining with soft\ndeclining beams on the arches and columns.  They spoke together of that\nburial at Rouen, and of the silver key; the Abbot delighting to tell,\nover and over again, all the good deeds and good sayings of William\nLongsword.\n\nAs they sat, a man, also very old and shrivelled and bent, came up to the\ncloister gate, with the tottering, feeble step of one pursued beyond his\nstrength, coming to take sanctuary.\n\n\"What can be the crime of one so aged and feeble?\" said the Duke, in\nsurprise.\n\nAt the sight of him, a look of terror shot from the old man's eye.  He\nclasped his hands together, and turned as if to flee; then, finding\nhimself incapable of escape, he threw himself on the ground before him.\n\n\"Mercy, mercy! noble, most noble Duke!\" was all he said.\n\n\"Rise up--kneel not to me.  I cannot brook this from one who might be my\nfather,\" said Richard, trying to raise him; but at those words the old\nman groaned and crouched lower still.\n\n\"Who art thou?\" said the Duke.  \"In this holy place thou art secure, be\nthy deed what it may.  Speak!--who art thou?\"\n\n\"Dost thou not know me?\" said the suppliant.  \"Promise mercy, ere thou\ndost hear my name.\"\n\n\"I have seen that face under a helmet,\" said the Duke.  \"Thou art Arnulf\nof Flanders!\"\n\nThere was a deep silence.\n\n\"And wherefore art thou here?\"\n\n\"I delayed to own the French King Hugh.  He has taken my towns and\nravaged my lands.  Each Frenchman and each Norman vows to slay me, in\nrevenge for your wrongs, Lord Duke.  I have been driven hither and\nthither, in fear of my life, till I thought of the renown of Duke\nRichard, not merely the most fearless, but the most merciful of Princes.\nI sought to come hither, trusting that, when the holy Father Abbot beheld\nmy bitter repentance, he would intercede for me with you, most noble\nPrince, for my safety and forgiveness.  Oh, gallant Duke, forgive and\nspare!\"\n\n\"Rise up, Arnulf,\" said Richard.  \"Where the hand of the Lord hath\nstricken, it is not for man to exact his own reckoning.  My father's\ndeath has been long forgiven, and what you may have planned against\nmyself has, by the blessing of Heaven, been brought to nought.  From\nNormans at least you are safe; and it shall be my work to ensure your\npardon from my brother the King.  Come into the refectory: you need\nrefreshment.  The Lord Abbot makes you welcome.\" {17}\n\nTears of gratitude and true repentance choked Arnulf's speech, and he\nallowed himself to be raised from the ground, and was forced to accept\nthe support of the Duke's arm.\n\nThe venerable Abbot slowly rose, and held up his hand in an attitude of\nblessing: \"The blessing of a merciful God be upon the sinner who turneth\nfrom his evil way; and ten thousand blessings of pardon and peace are\nalready on the head of him who hath stretched out his hand to forgive and\naid him who was once his most grievous foe!\"\n\n\n\n\nFootnotes:\n\n\n{1}  Richard's place of education was Bayeaux; for, as Duke William says\nin the rhymed Chronicle of Normandy,--\n\n    \"Si a Roem le faz garder\n    E norir, gaires longement\n    Il ne saura parlier neiant\n    Daneis, kar nul n l'i parole.\n    Si voil qu'il seit a tele escole\n    Qu l'en le sache endoctriner\n    Que as Daneis sache parler.\n    Ci ne sevent riens fors Romanz\n    Mais a Baieux en a tanz\n    Qui ne sevent si Daneis non.\"\n\n{2}  Bernard was founder of the family of Harcourt of Nuneham.\nFerrieres, the ancestor of that of Ferrars.\n\n{3}  In the same Chronicle, William Longsword directs that,--\n\n    \"Tant seit apris qu'il lise un bref\n    Kar ceo ne li ert pas trop gref.\"\n\n{4}  Hako of Norway was educated by Ethelstane of England.  It was\nFoulques le Bon, the contemporary Count of Anjou, who, when derided by\nLouis IV. for serving in the choir of Tours, wrote the following retort:\n\"The Count of Anjou to the King of France.  Apprenez, Monseigneur, qu'un\nroi sans lettres est une ane couronne.\"\n\n{5}  The Banner of Normandy was a cross till William the Conqueror\nadopted the lion.\n\n{6}\n\n    \"Sire, soies mon escus, soies mes defendemens.\"\n\n    _Histoire des Ducs de Normandie_ (MICHEL).\n\n{7}  The Cathedral was afterwards built by Richard himself.\n\n{8}  Sus le maistre autel del iglise\nLi unt sa feaute juree.\n\n{9}\n\n    Une clef d'argent unt trovee\n    A sun braiol estreit noee.\n    Tout la gent se merveillont\n    Que cete clef signifiont.\n    * * * *\n    Ni la cuoule e l'estamine\n    En aveit il en un archete,\n    Que disfermeront ceste clavete\n    De sol itant ert tresorier\n    Kar nul tresor n'vait plus cher.\n\nThe history of the adventures of Jumieges is literally true, as is\nMartin's refusal to admit the Duke to the cloister:--\n\n    Dun ne t'a Deus mis e pose\n    Prince gardain de sainte iglise\n    E cur tenir leial justise.\n\n{10}  An attack, in which Riouf, Vicomte du Cotentin, placed Normandy in\nthe utmost danger.  He was defeated on the banks of the Seine, in a field\nstill called the \"Pre de Battaille,\" on the very day of Richard's birth;\nso that the _Te Deum_ was sung at once for the victory and the birth of\nthe heir of Normandy.\n\n{11}  \"Biaus Segnors, vees chi vo segneur, je ne le vous voel tolir, mais\nje estoie venus en ceste ville, prendre consel a vous, comment je poroie\nvengier la mort son pere, qui me rapiela d'Engletiere.  Il me fist roi,\nil me fist avoir l'amour le roi d'Alemaigne, il leva mon fil de fons, il\nme fist toz les biens, et jou en renderai au fill le guerredon se je\npuis.\"--MICHEL.\n\n{12}  In a battle fought with Lothaire at Charmenil, Richard saved the\nlife of Walter the huntsman, who had been with him from his youth.\n\n{13}  At fourteen years of age, Richard was betrothed to Eumacette of\nParis, then but eight years old.  In such esteem did Hugues la Blanc hold\nhis son-in-law, that, on his death-bed, he committed his son Hugues Capet\nto his guardianship, though the Duke was then scarcely above twenty,\nproposing him as the model of wisdom and of chivalry.\n\n{14}  \"Osmons, qui l'enfant enseognoit l'eu mena i jour en riviere, et\nquant il revint, la reine Gerberge dist que se il jamais l'enmenait fors\ndes murs, elle li ferait les jeix crever.\"--MICHEL.\n\n{15}  \"Gules, two wings conjoined in lure, or,\" is the original coat of\nSt. Maur, or Seymour, said to be derived from Osmond de Centeville, who\nassumed them in honour of his flight with Duke Richard.  His direct\ndescendants in Normandy were the Marquises of Osmond, whose arms were\ngules, two wings ermine.  In 1789 there were two survivors of the line of\nCenteville, one a Canon of Notre Dame, the other a Chevalier de St.\nLouis, who died childless.\n\n{16}  Harald of Norway, who made a vow never to trim his hair till he had\nmade himself sole king of the country.  The war lasted ten years, and he\nthus might well come to deserve the title of Horrid-locks, which was\nchanged to that of Harfagre, or fair-haired, when he celebrated his final\nvictory, by going into a bath at More, and committing his shaggy hair to\nbe cut and arranged by his friend Jarl Rognwald, father of Rollo.\n\n{17}  Richard obtained for Arnulf the restitution of Arras, and several\nother Flemish towns.  He died eight years afterwards, in 996, leaving\nseveral children, among whom his daughter Emma is connected with English\nhistory, by her marriage, first, with Ethelred the Unready, and secondly,\nwith Knute, the grandson of his firm friend and ally, Harald Blue-tooth.\nHis son was Richard, called the Good; his grandson, Robert the\nMagnificent; his great-grandson, William the Conqueror, who brought the\nNorman race to England.  Few names in history shine with so consistent a\nlustre as that of Richard; at first the little Duke, afterwards Richard\naux longues jambes, but always Richard sans peur.  This little sketch has\nonly brought forward the perils of his childhood, but his early manhood\nwas likewise full of adventures, in which he always proved himself brave,\nhonourable, pious, and forbearing.  But for these our readers must search\nfor themselves into early French history, where all they will find\nconcerning our hero will only tend to exalt his character.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      36,
      46,
      1
    ],
    [
      "chapter.title",
      17366,
      17377,
      2
    ],
    [
      "chapter.title",
      39841,
      39853,
      3
    ],
    [
      "chapter.title",
      54821,
      54832,
      4
    ],
    [
      "chapter.title",
      70957,
      70967,
      5
    ],
    [
      "chapter.title",
      101542,
      101553,
      6
    ],
    [
      "chapter.title",
      120010,
      120022,
      7
    ],
    [
      "chapter.title",
      144493,
      144506,
      8
    ],
    [
      "chapter.title",
      171883,
      171894,
      9
    ],
    [
      "chapter.title",
      185819,
      185829,
      10
    ],
    [
      "chapter.title",
      196839,
      196850,
      11
    ],
    [
      "chapter.title",
      205248,
      205260,
      12
    ],
    [
      "chapter.title",
      214164,
      214175,
      13
    ]
  ]
}