{
  "content": "The Tale of the Flopsy Bunnies\nBeatrix Potter\n\n    FOR ALL LITTLE FRIENDS\n\n    OF\n\n    MR. MCGREGOR & PETER & BENJAMIN\n\nBOOK 1.\n\n\nIt is said that the effect of eating too much lettuce is \"soporific.\"\n\n_I_ have never felt sleepy after eating lettuces; but then _I_ am not a\nrabbit.\n\nThey certainly had a very soporific effect upon the Flopsy Bunnies!\n\nWhen Benjamin Bunny grew up, he married his Cousin Flopsy. They had a\nlarge family, and they were very improvident and cheerful.\n\nI do not remember the separate names of their children; they were\ngenerally called the \"Flopsy Bunnies.\"\n\n\n\nAs there was not always quite enough to eat,--Benjamin used to borrow\ncabbages from Flopsy's brother, Peter Rabbit, who kept a nursery garden.\n\nSometimes Peter Rabbit had no cabbages to spare.\n\n\n\nWhen this happened, the Flopsy Bunnies went across the field to a rubbish\nheap, in the ditch outside Mr. McGregor's garden.\n\nMr. McGregor's rubbish heap was a mixture. There were jam pots and paper\nbags, and mountains of chopped grass from the mowing machine (which always\ntasted oily), and some rotten vegetable marrows and an old boot or two.\nOne day--oh joy!--there were a quantity of overgrown lettuces, which had\n\"shot\" into flower.\n\n\nThe Flopsy Bunnies simply stuffed lettuces. By degrees, one after another,\nthey were overcome with slumber, and lay down in the mown grass.\n\nBenjamin was not so much overcome as his children. Before going to sleep\nhe was sufficiently wide awake to put a paper bag over his head to keep\noff the flies.\n\nThe little Flopsy Bunnies slept delightfully in the warm sun. From the\nlawn beyond the garden came the distant clacketty sound of the mowing\nmachine. The bluebottles buzzed about the wall, and a little old mouse\npicked over the rubbish among the jam pots.\n\n(I can tell you her name, she was called Thomasina Tittlemouse, a\nwoodmouse with a long tail.)\n\n\n\nShe rustled across the paper bag, and awakened Benjamin Bunny.\n\nThe mouse apologized profusely, and said that she knew Peter Rabbit.\n\nWhile she and Benjamin were talking, close under the wall, they heard a\nheavy tread above their heads; and suddenly Mr. McGregor emptied out a\nsackful of lawn mowings right upon the top of the sleeping Flopsy Bunnies!\nBenjamin shrank down under his paper bag. The mouse hid in a jam pot.\n\n\n\nThe little rabbits smiled sweetly in their sleep under the shower of\ngrass; they did not awake because the lettuces had been so soporific.\n\nThey dreamt that their mother Flopsy was tucking them up in a hay bed.\n\nMr. McGregor looked down after emptying his sack. He saw some funny little\nbrown tips of ears sticking up through the lawn mowings. He stared at them\nfor some time.\n\nPresently a fly settled on one of them and it moved.\n\nMr. McGregor climbed down on to the rubbish heap--\n\n\"One, two, three, four! five! six leetle rabbits!\" said he as he dropped\nthem into his sack. The Flopsy Bunnies dreamt that their mother was\nturning them over in bed. They stirred a little in their sleep, but still\nthey did not wake up.\n\n\n\nMr. McGregor tied up the sack and left it on the wall.\n\nHe went to put away the mowing machine.\n\nWhile he was gone, Mrs. Flopsy Bunny (who had remained at home) came\nacross the field.\n\nShe looked suspiciously at the sack and wondered where everybody was?\n\n\nThen the mouse came out of her jam pot, and Benjamin took the paper bag\noff his head, and they told the doleful tale.\n\nBenjamin and Flopsy were in despair, they could not undo the string.\n\nBut Mrs. Tittlemouse was a resourceful person. She nibbled a hole in the\nbottom corner of the sack.\n\n\nThe little rabbits were pulled out and pinched to wake them.\n\nTheir parents stuffed the empty sack with three rotten vegetable marrows,\nan old blacking-brush and two decayed turnips.\n\n\nThen they all hid under a bush and watched for Mr. McGregor.\n\n\nMr. McGregor came back and picked up the sack, and carried it off.\n\nHe carried it hanging down, as if it were rather heavy.\n\nThe Flopsy Bunnies followed at a safe distance.\n\n\nThe watched him go into his house.\n\nAnd then they crept up to the window to listen.\n\n\nMr. McGregor threw down the sack on the stone floor in a way that would\nhave been extremely painful to the Flopsy Bunnies, if they had happened to\nhave been inside it.\n\nThey could hear him drag his chair on the flags, and chuckle--\n\n\"One, two, three, four, five, six leetle rabbits!\" said Mr. McGregor.\n\n\n\n\"Eh? What's that? What have they been spoiling now?\" enquired Mrs.\nMcGregor.\n\n\"One, two, three, four, five, six leetle fat rabbits!\" repeated Mr.\nMcGregor, counting on his fingers--\"one, two, three--\"\n\n\"Don't you be silly; what do you mean, you silly old man?\"\n\n\"In the sack! one, two, three, four, five, six!\" replied Mr. McGregor.\n\n(The youngest Flopsy Bunny got upon the window-sill.)\n\nMrs. McGregor took hold of the sack and felt it. She said she could feel\nsix, but they must be _old_ rabbits, because they were so hard and all\ndifferent shapes.\n\n\"Not fit to eat; but the skins will do fine to line my old cloak.\"\n\n\"Line your old cloak?\" shouted Mr. McGregor--\"I shall sell them and buy\nmyself baccy!\"\n\n\"Rabbit tobacco! I shall skin them and cut off their heads.\"\n\n\nMrs. McGregor untied the sack and put her hand inside.\n\nWhen she felt the vegetables she became very very angry. She said that Mr.\nMcGregor had \"done it a purpose.\"\n\n\nAnd Mr. McGregor was very angry too. One of the rotten marrows came flying\nthrough the kitchen window, and hit the youngest Flopsy Bunny.\n\nIt was rather hurt.\n\n\nThen Benjamin and Flopsy thought that it was time to go home.\n\n\nSo Mr. McGregor did not get his tobacco, and Mrs. McGregor did not get her\nrabbit skins.\n\n\nBut next Christmas Thomasina Tittlemouse got a present of enough\nrabbit-wool to make herself a cloak and a hood, and a handsome muff and a\npair of warm mittens.\n\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}