{
  "content": "Jackanapes\nJuliana Horatia Ewing\n\n     \"_If I might buffet for my love, or bound my horse for her\n     favors, I could lay on like a butcher, and sit like a\n     Jackanapes, never off_!\"\n\nKING HENRY V, Act 5, Scene 2.\n\nCHAPTER I.\n\n    Last noon beheld them full of lusty life,\n    Last eve in Beauty's circle proudly gay,\n    The midnight brought the signal sound of strife,\n    The morn the marshalling in arms--the day\n    Battle's magnificently stern array!\n    The thunder clouds close o'er it, which when rent\n    The earth is covered thick with other clay,\n    Which her own clay shall cover, heaped and pent,\n    Rider and horse:--friend, foe,--in one red burial blent.\n\n    Their praise is hymn'd by loftier harps than mine:\n    Yet one would I select from that proud throng.\n    ---- to thee, to thousands, of whom each\n    And one as all a ghastly gap did make\n    In his own kind and kindred, whom to teach\n    Forgetfulness were mercy for their sake;\n    The Archangel's trump, not glory's, must awake\n    Those whom they thirst for.--BYRON.\n\n\nTwo Donkeys and the Geese lived on the Green, and all other residents\nof any social standing lived in houses round it. The houses had no\nnames. Everybody's address was, \"The Green,\" but the Postman and the\npeople of the place knew where each family lived. As to the rest of\nthe world, what has one to do with the rest of the world, when he is\nsafe at home on his own Goose Green? Moreover, if a stranger did come\non any lawful business, he might ask his way at the shop.\n\nMost of the inhabitants were long-lived, early deaths (like that of\nthe little Miss Jessamine) being exceptional; and most of the old\npeople were proud of their age, especially the sexton, who would be\nninety-nine come Martinmas, and whose father remembered a man who had\ncarried arrows, as a boy, for the battle of Flodden Field. The Grey\nGoose and the big Miss Jessamine were the only elderly persons who\nkept their ages secret. Indeed, Miss Jessamine never mentioned any\none's age, or recalled the exact year in which anything had happened.\nShe said that she had been taught that it was bad manners to do so \"in\na mixed assembly.\"\n\nThe Grey Goose also avoided dates, but this was partly because her\nbrain, though intelligent, was not mathematical, and computation was\nbeyond her. She never got farther than \"last Michaelmas,\" \"the\nMichaelmas before that,\" and \"the Michaelmas before the Michaelmas\nbefore that.\" After this her head, which was small, became confused,\nand she said, \"Ga, ga!\" and changed the subject.\n\nBut she remembered the little Miss Jessamine, the Miss Jessamine with\nthe \"conspicuous\" hair. Her aunt, the big Miss Jessamine, said it was\nher only fault. The hair was clean, was abundant, was glossy, but do\nwhat you would with it, it never looked like other people's. And at\nchurch, after Saturday night's wash, it shone like the best brass\nfender after a Spring cleaning. In short, it was conspicuous, which\ndoes not become a young woman--especially in church.\n\nThose were worrying times altogether, and the Green was used for\nstrange purposes. A political meeting was held on it with the village\nCobbler in the chair, and a speaker who came by stage coach from the\ntown, where they had wrecked the bakers' shops, and discussed the\nprice of bread. He came a second time, by stage, but the people had\nheard something about him in the meanwhile, and they did not keep him\non the Green. They took him to the pond and tried to make him swim,\nwhich he could not do, and the whole affair was very disturbing to all\nquiet and peaceable fowls. After which another man came, and preached\nsermons on the Green, and a great many people went to hear him; for\nthose were \"trying times,\" and folk ran hither and thither for\ncomfort. And then what did they do but drill the ploughboys on the\nGreen, to get them ready to fight the French, and teach them the\ngoose-step! However, that came to an end at last, for Bony was sent to\nSt. Helena, and the ploughboys were sent back to the plough.\n\nEverybody lived in fear of Bony in those days, especially the naughty\nchildren, who were kept in order during the day by threats of, \"Bony\nshall have you,\" and who had nightmares about him in the dark. They\nthought he was an Ogre in a cocked hat. The Grey Goose thought he was\na fox, and that all the men of England were going out in red coats to\nhunt him. It was no use to argue the point, for she had a very small\nhead, and when one idea got into it there was no room for another.\n\nBesides, the Grey Goose never saw Bony, nor did the children, which\nrather spoilt the terror of him, so that the Black Captain became more\neffective as a Bogy with hardened offenders. The Grey Goose remembered\n_his_ coming to the place perfectly. What he came for she did not\npretend to know. It was all part and parcel of the war and bad times.\nHe was called the Black Captain, partly because of himself, and partly\nbecause of his wonderful black mare. Strange stories were afloat of\nhow far and how fast that mare could go, when her master's hand was on\nher mane and he whispered in her ear. Indeed, some people thought we\nmight reckon ourselves very lucky if we were not out of the frying-pan\ninto the fire, and had not got a certain well-known Gentleman of the\nRoad to protect us against the French. But that, of course, made him\nnone the less useful to the Johnson's Nurse, when the little Miss\nJohnsons were naughty.\n\n\"You leave off crying this minnit, Miss Jane, or I'll give you right\naway to that horrid wicked officer. Jemima! just look out o' the\nwindy, if you please, and see if the Black Cap'n's a-com-ing with his\nhorse to carry away Miss Jane.\"\n\nAnd there, sure enough, the Black Captain strode by, with his sword\nclattering as if it did not know whose head to cut off first. But he\ndid not call for Miss Jane that time. He went on to the Green, where\nhe came so suddenly upon the eldest Master Johnson, sitting in a\npuddle on purpose, in his new nankeen skeleton suit, that the young\ngentleman thought judgment had overtaken him at last, and abandoned\nhimself to the howlings of despair. His howls were redoubled when he\nwas clutched from behind and swung over the Black Captain's shoulder,\nbut in five minutes his tears were stanched, and he was playing with\nthe officer's accoutrements. All of which the Grey Goose saw with her\nown eyes, and heard afterwards that that bad boy had been whining to\ngo back to the Black Captain ever since, which showed how hardened he\nwas, and that nobody but Bonaparte himself could be expected to do him\nany good.\n\nBut those were \"trying times.\" It was bad enough when the pickle of a\nlarge and respectable family cried for the Black Captain; when it came\nto the little Miss Jessamine crying for him, one felt that the sooner\nthe French landed and had done with it the better.\n\nThe big Miss Jessamine's objection to him was that he was a soldier,\nand this prejudice was shared by all the Green. \"A soldier,\" as the\nspeaker from the town had observed, \"is a bloodthirsty, unsettled sort\nof a rascal; that the peaceable, home-loving, bread-winning citizen\ncan never conscientiously look on as a brother, till he has beaten his\nsword into a ploughshare, and his spear into a pruning-hook.\"\n\nOn the other hand there was some truth in what the Postman (an old\nsoldier) said in reply; that the sword has to cut a way for us out of\nmany a scrape into which our bread-winners get us when they drive\ntheir ploughshares into fallows that don't belong to them. Indeed,\nwhilst our most peaceful citizens were prosperous chiefly by means of\ncotton, of sugar, and of the rise and fall of the money-market (not to\nspeak of such salable matters as opium, firearms, and \"black ivory\"),\ndisturbances were apt to arise in India, Africa and other outlandish\nparts, where the fathers of our domestic race were making fortunes for\ntheir families. And, for that matter, even on the Green, we did not\nwish the military to leave us in the lurch, so long as there was any\nfear that the French were coming.[1]\n\n[Footnote 1: \"The political men declare war, and generally for\ncommercial interests; but when the nation is thus embroiled with its\nneighbors the soldier ... draws the sword, at the command of his\ncountry.... One word as to thy comparison of military and commercial\npersons. What manner of men be they who have supplied the Caffres with\nthe firearms and ammunition to maintain their savage and deplorable\nwars? Assuredly they are not military.... Cease then, if thou would'st\nbe counted among the just, to vilify soldiers.\"--W. NAPIER, Lieut.\nGeneral, _November_, 1851.]\n\nTo let the Black Captain have little Miss Jessamine, however, was\nanother matter. Her Aunt would not hear of it; and then, to crown all,\nit appeared that the Captain's father did not think the young lady\ngood enough for his son. Never was any affair more clearly brought to\na conclusion.\n\nBut those were \"trying times;\" and one moon-light night, when the Grey\nGoose was sound asleep upon one leg, the Green was rudely shaken under\nher by the thud of a horse's feet. \"Ga, ga!\" said she, putting down\nthe other leg, and running away.\n\nBy the time she returned to her place not a thing was to be seen or\nheard. The horse had passed like a shot. But next day, there was\nhurrying and skurrying and cackling at a very early hour, all about\nthe white house with the black beams, where Miss Jessamine lived. And\nwhen the sun was so low, and the shadows so long on the grass that the\nGrey Goose felt ready to run away at the sight of her own neck, little\nMiss Jane Johnson, and her \"particular friend\" Clarinda, sat under the\nbig oak-tree on the Green, and Jane pinched Clarinda's little finger\ntill she found that she could keep a secret, and then she told her in\nconfidence that she had heard from Nurse and Jemima that Miss\nJessamine's niece had been a very naughty girl, and that that horrid\nwicked officer had come for her on his black horse, and carried her\nright away.\n\n\n\"Will she never come back?\" asked Clarinda.\n\n\"Oh, no!\" said Jane decidedly. \"Bony never brings people back.\"\n\n\"Not never no more?\" sobbed Clarinda, for she was weak-minded, and\ncould not bear to think that Bony never, never let naughty people go\nhome again.\n\nNext day Jane had heard more.\n\n\"He has taken her to a Green?\"\n\n\"A Goose Green?\" asked Clarinda.\n\n\"No. A Gretna Green. Don't ask so many questions, child,\" said Jane;\nwho, having no more to tell, gave herself airs.\n\nJane was wrong on one point. Miss Jessamine's niece did come back, and\nshe and her husband were forgiven. The Grey Goose remembered it well,\nit was Michaelmastide, the Michaelmas before the Michaelmas before the\nMichaelmas--but ga, ga! What does the date matter? It was autumn,\nharvest-time, and everybody was so busy prophesying and praying about\nthe crops, that the young couple wandered through the lanes, and got\nblackberries for Miss Jessamine's celebrated crab and blackberry jam,\nand made guys of themselves with bryony-wreaths, and not a soul\ntroubled his head about them, except the children, and the Postman.\nThe children dogged the Black Captain's footsteps (his bubble\nreputation as an Ogre having burst), clamoring for a ride on the black\nmare. And the Postman would go somewhat out of his postal way to catch\nthe Captain's dark eye, and show that he had not forgotten how to\nsalute an officer.\n\nBut they were \"trying times.\" One afternoon the black mare was\nstepping gently up and down the grass, with her head at her master's\nshoulder, and as many children crowded on to her silky back as if she\nhad been an elephant in a menagerie; and the next afternoon she\ncarried him away, sword and _sabre-tache_ clattering war-music at her\nside, and the old Postman waiting for them, rigid with salutation, at\nthe four cross roads.\n\nWar and bad times! It was a hard winter, and the big Miss Jessamine\nand the little Miss Jessamine (but she was Mrs. Black-Captain now),\nlived very economically that they might help their poorer neighbors.\nThey neither entertained nor went into company, but the young lady\nalways went up the village as far as the _George and Dragon_, for air\nand exercise, when the London Mail[2] came in.\n\n[Footnote 2: The Mail Coach it was that distributed over the face of\nthe land, like the opening of apocalyptic vials, the heart-shaking\nnews of Trafalgar, of Salamanca, of Vittoria, of Waterloo.... The\ngrandest chapter of our experience, within the whole Mail Coach\nservice, was on those occasions when we went down from London with the\nnews of Victory. Five years of life it was worth paying down for the\nprivilege of an outside place.\n\nDE QUINCEY.]\n\nOne day (it was a day in the following June) it came in earlier than\nusual, and the young lady was not there to meet it.\n\nBut a crowd soon gathered round the _George and Dragon_, gaping to see\nthe Mail Coach dressed with flowers and oak-leaves, and the guard\nwearing a laurel wreath over and above his royal livery. The ribbons\nthat decked the horses were stained and flecked with the warmth and\nfoam of the pace at which they had come, for they had pressed on with\nthe news of Victory.\n\nMiss Jessamine was sitting with her niece under the oak-tree on the\nGreen, when the Postman put a newspaper silently into her hand. Her\nniece turned quickly--\"Is there news?\"\n\n\"Don't agitate yourself, my dear,\" said her aunt. \"I will read it\naloud, and then we can enjoy it together; a far more comfortable\nmethod, my love, than when you go up the village, and come home out of\nbreath, having snatched half the news as you run.\"\n\n\"I am all attention, dear aunt,\" said the little lady, clasping her\nhands tightly on her lap.\n\nThen Miss Jessamine read aloud--she was proud of her reading--and the\nold soldier stood at attention behind her, with such a blending of\npride and pity on his face as it was strange to see:--\n\n\"DOWNING STREET,\n\n\"_June_ 22, 1815, 1 A.M.\"\n\n\"That's one in the morning,\" gasped the Postman; \"beg your pardon,\nmum.\"\n\nBut though he apologized, he could not refrain from echoing here and\nthere a weighty word. \"Glorious victory,\"--\"Two hundred pieces of\nartillery,\"--\"Immense quantity of ammunition,\"--and so forth.\n\n     \"The loss of the British Army upon this occasion has\n     unfortunately been most severe. It had not been possible to\n     make out a return of the killed and wounded when Major Percy\n     left headquarters. The names of the officers killed and\n     wounded, as far as they can be collected, are annexed.\n\n\"I have the honor ----\"\n\n\"The list, aunt! Read the list!\"\n\n\"My love--my darling--let us go in and--\"\n\n\"No. Now! now!\"\n\nTo one thing the supremely afflicted are entitled in their sorrow--to\nbe obeyed--and yet it is the last kindness that people commonly will\ndo them. But Miss Jessamine did. Steadying her voice, as best she\nmight, she read on, and the old soldier stood bareheaded to hear that\nfirst Roll of the Dead at Waterloo, which began with the Duke of\nBrunswick, and ended with Ensign Brown.[3] Five-and-thirty British\nCaptains fell asleep that day on the bed of Honor, and the Black\nCaptain slept among them.\n\n[Footnote 3: \"Brunswick's fated chieftain\" fell at Quatre Bras, the\nday before Waterloo, but this first (very imperfect) list, as it\nappeared in the newspapers of the day, did begin with his name, and\nend with that of an Ensign Brown.]\n\n       *       *       *       *       *\n\nThere are killed and wounded by war, of whom no returns reach Downing\nStreet.\n\nThree days later, the Captain's wife had joined him, and Miss\nJessamine was kneeling by the cradle of their orphan son, a purple-red\nmorsel of humanity, with conspicuously golden hair.\n\n\"Will he live, Doctor?\"\n\n\"Live? GOD bless my soul, ma'am! Look at him! The young Jackanapes!\"\n\n\n\n\nCHAPTER II.\n\n    And he wandered away and away\n    With Nature, the dear old Nurse.\n\nLONGFELLOW.\n\n\nThe Grey Goose remembered quite well the year that Jackanapes began\nto walk, for it was the year that the speckled hen for the first time\nin all her motherly life got out of patience when she was sitting. She\nhad been rather proud of the eggs--they are unusually large--but she\nnever felt quite comfortable on them; and whether it was because she\nused to get cramp, and got off the nest, or because the season was\nbad, or what, she never could tell, but every egg was addled but one,\nand the one that did hatch gave her more trouble than any chick she\nhad ever reared.\n\nIt was a fine, downy, bright yellow little thing, but it had a\nmonstrous big nose and feet, and such an ungainly walk as she knew no\nother instance of in her well-bred and high-stepping family. And as to\nbehavior, it was not that it was either quarrelsome or moping, but\nsimply unlike the rest. When the other chicks hopped and cheeped on\nthe Green all at their mother's feet, this solitary yellow one went\nwaddling off on its own responsibility, and do or cluck what the\nspreckled hen would, it went to play in the pond.\n\nIt was off one day as usual, and the hen was fussing and fuming after\nit, when the Postman, going to deliver a letter at Miss Jessamine's\ndoor, was nearly knocked over by the good lady herself, who, bursting\nout of the house with her cap just off and her bonnet just not on,\nfell into his arms, crying--\n\n\"Baby! Baby! Jackanapes! Jackanapes!\"\n\nIf the Postman loved anything on earth, he loved the Captain's\nyellow-haired child, so propping Miss Jessamine against her own\ndoor-post, he followed the direction of her trembling fingers and made\nfor the Green.\n\nJackanapes had had the start of the Postman by nearly ten minutes. The\nworld--the round green world with an oak tree on it--was just becoming\nvery interesting to him. He had tried, vigorously but ineffectually,\nto mount a passing pig the last time he was taken out walking; but\nthen he was encumbered with a nurse. Now he was his own master, and\nmight, by courage and energy, become the master of that delightful,\ndowny, dumpy, yellow thing, that was bobbing along over the green\ngrass in front of him. Forward! Charge! He aimed well, and grabbed it,\nbut only to feel the delicious downiness and dumpiness slipping\nthrough his fingers as he fell upon his face. \"Quawk!\" said the yellow\nthing, and wobbled off sideways. It was this oblique movement that\nenabled Jackanapes to come up with it, for it was bound for the Pond,\nand therefore obliged to come back into line. He failed again from\ntop-heaviness, and his prey escaped sideways as before, and, as\nbefore, lost ground in getting back to the direct road to the Pond.\n\n\nAnd at the Pond the Postman found them both, one yellow thing rocking\nsafely on the ripples that lie beyond duck-weed, and the other washing\nhis draggled frock with tears, because he too had tried to sit upon\nthe Pond, and it wouldn't hold him.\n\n\n\n\nCHAPTER III.\n\n    ... If studious, copie fair what time hath blurred,\n    Redeem truth from his jawes; if souldier,\n    Chase brave employments with a naked sword\n    Throughout the world. Fool not; for all may have,\n    If they dare try, a glorious life, or grave.\n\n       *       *       *       *       *\n\n    In brief, acquit thee bravely: play the man. Look not on\n    pleasures as they come, but go. Defer not the least vertue:\n    life's poore span Make not an ell, by trifling in thy woe. If\n    thou do ill, the joy fades, not the pains. If well, the pain\n    doth fade, the joy remains.\n\nGEORGE HERBERT.\n\n\nYoung Mrs. Johnson, who was a mother of many, hardly knew which to\npity more; Miss Jessamine for having her little ways and her\nantimacassars rumpled by a young Jackanapes; or the boy himself, for\nbeing brought up by an old maid.\n\nOddly enough, she would probably have pitied neither, had Jackanapes\nbeen a girl. (One is so apt to think that what works smoothest works\nto the highest ends, having no patience for the results of friction.)\nThat Father in GOD, who bade the young men to be pure, and the maidens\nbrave, greatly disturbed a member of his congregation, who thought\nthat the great preacher had made a slip of the tongue.\n\n\"That the girls should have purity, and the boys courage, is what you\nwould say, good Father?\"\n\n\"Nature has done that,\" was the reply; \"I meant what I said.\"\n\nIn good sooth, a young maid is all the better for learning some\nrobuster virtues than maidenliness and not to move the antimacassars.\nAnd the robuster virtues require some fresh air and freedom. As, on\nthe other hand, Jackanapes (who had a boy's full share of the little\nbeast and the young monkey in his natural composition) was none the\nworse, at his tender years, for learning some maidenliness--so far as\nmaidenliness means decency, pity, unselfishness and pretty behavior.\n\nAnd it is due to him to say that he was an obedient boy, and a boy\nwhose word could be depended on, long before his grandfather the\nGeneral came to live at the Green.\n\nHe was obedient; that is he did what his great aunt told him. But--oh\ndear! oh dear!--the pranks he played, which it had never entered into\nher head to forbid!\n\nIt was when he had just been put into skeletons (frocks never suited\nhim) that he became very friendly with Master Tony Johnson, a younger\nbrother of the young gentleman who sat in the puddle on purpose. Tony\nwas not enterprising, and Jackanapes led him by the nose. One summer's\nevening they were out late, and Miss Jessamine was becoming anxious,\nwhen Jackanapes presented himself with a ghastly face all besmirched\nwith tears. He was unusually subdued.\n\n\"I'm afraid,\" he sobbed; \"if you please, I'm very much afraid that\nTony Johnson's dying in the churchyard.\"\n\nMiss Jessamine was just beginning to be distracted, when she smelt\nJackanapes.\n\n\"You naughty, naughty boys! Do you mean to tell me that you've been\nsmoking?\"\n\n\"Not pipes,\" urged Jackanapes; \"upon my honor, Aunty, not pipes. Only\nsegars like Mr. Johnson's! and only made of brown paper with a very,\nvery little tobacco from the shop inside them.\"\n\nWhereupon, Miss Jessamine sent a servant to the churchyard, who found\nTony Johnson lying on a tomb-stone, very sick, and having ceased to\nentertain any hopes of his own recovery.\n\nIf it could be possible that any \"unpleasantness\" could arise between\ntwo such amiable neighbors as Miss Jessamine and Mrs. Johnson--and if\nthe still more incredible paradox can be that ladies may differ over a\npoint on which they are agreed--that point was the admitted fact that\nTony Johnson was \"delicate,\" and the difference lay chiefly in this:\nMrs. Johnson said that Tony was delicate--meaning that he was more\nfinely strung, more sensitive, a properer subject for pampering and\npetting than Jackanapes, and that, consequently, Jackanapes was to\nblame for leading Tony into scrapes which resulted in his being\nchilled, frightened, or (most frequently) sick. But when Miss\nJessamine said that Tony Johnson was delicate, she meant that he was\nmore puling, less manly, and less healthily brought up than\nJackanapes, who, when they got into mischief together, was certainly\nnot to blame because his friend could not get wet, sit a kicking\ndonkey, ride in the giddy-go-round, bear the noise of a cracker, or\nsmoke brown paper with impunity, as he could.\n\nNot that there was ever the slightest quarrel between the ladies. It\nnever even came near it, except the day after Tony had been so very\nsick with riding Bucephalus in the giddy-go-round. Mrs. Johnson had\nexplained to Miss Jessamine that the reason Tony was so easily upset,\nwas the unusual sensitiveness (as a doctor had explained it to her) of\nthe nervous centres in her family--\"Fiddlestick!\" So Mrs. Johnson\nunderstood Miss Jessamine to say, but it appeared that she only said\n\"Treaclestick!\" which is quite another thing, and of which Tony was\nundoubtedly fond.\n\n\nIt was at the fair that Tony was made ill by riding on Bucephalus.\nOnce a year the Goose Green became the scene of a carnival. First of\nall, carts and caravans were rumbling up all along, day and night.\nJackanapes could hear them as he lay in bed, and could hardly sleep\nfor speculating what booths and whirligigs he should find fairly\nestablished, when he and his dog Spitfire went out after breakfast. As\na matter of fact, he seldom had to wait long for news of the Fair. The\nPostman knew the window out of which Jackanapes' yellow head would\ncome, and was ready with his report.\n\n\"Royal Theayter, Master Jackanapes, in the old place, but be careful\no' them seats, sir; they're rickettier than ever. Two sweets and a\nginger-beer under the oak tree, and the Flying Boats is just a-coming\nalong the road.\"\n\nNo doubt it was partly because he had already suffered severely in the\nFlying Boats, that Tony collapsed so quickly in the giddy-go-round. He\nonly mounted Bucephalus (who was spotted, and had no tail) because\nJackanapes urged him, and held out the ingenious hope that the\nround-and-round feeling would very likely cure the up-and-down\nsensation. It did not, however, and Tony tumbled off during the first\nrevolution.\n\nJackanapes was not absolutely free from qualms, but having once\nmounted the Black Prince he stuck to him as a horseman should. During\nthe first round he waved his hat, and observed with some concern that\nthe Black Prince had lost an ear since last Fair; at the second, he\nlooked a little pale but sat upright, though somewhat unnecessarily\nrigid; at the third round he shut his eyes. During the fourth his hat\nfell off, and he clasped his horse's neck. By the fifth he had laid\nhis yellow head against the Black Prince's mane, and so clung anyhow\ntill the hobby-horses stopped, when the proprietor assisted him to\nalight, and he sat down rather suddenly and said he had enjoyed it\nvery much.\n\nThe Grey Goose always ran away at the first approach of the caravans,\nand never came back to the Green till there was nothing left of the\nFair but footmarks and oyster-shells. Running away was her pet\nprinciple; the only system, she maintained, by which you can live long\nand easily, and lose nothing. If you run away when you see danger, you\ncan come back when all is safe. Run quickly, return slowly, hold your\nhead high, and gabble as loud as you can, and you'll preserve the\nrespect of the Goose Green to a peaceful old age. Why should you\nstruggle and get hurt, if you can lower your head and swerve, and not\nlose a feather? Why in the world should any one spoil the pleasure of\nlife, or risk his skin, if he can help it?\n\n    \"'What's the use'\n    Said the Goose.\"\n\nBefore answering which one might have to consider what world--which\nlife--whether his skin were a goose-skin; but the Grey Goose's head\nwould never have held all that.\n\nGrass soon grows over footprints, and the village children took the\noyster-shells to trim their gardens with; but the year after Tony rode\nBucephalus there lingered another relic of Fairtime, in which\nJackanapes was deeply interested. \"The Green\" proper was originally\nonly part of a straggling common, which in its turn merged into some\nwilder waste land where gipsies sometimes squatted if the authorities\nwould allow them, especially after the annual Fair. And it was after\nthe Fair that Jackanapes, out rambling by himself, was knocked over by\nthe Gipsy's son riding the Gipsy's red-haired pony at break-neck pace\nacross the common.\n\nJackanapes got up and shook himself, none the worse, except for being\nheels over head in love with the red-haired pony. What a rate he went\nat! How he spurned the ground with his nimble feet! How his red coat\nshone in the sunshine! And what bright eyes peeped out of his dark\nforelock as it was blown by the wind!\n\nThe Gipsy boy had had a fright, and he was willing enough to reward\nJackanapes for not having been hurt, by consenting to let him have a\nride.\n\n\"Do you mean to kill the little fine gentleman, and swing us all on\nthe gibbet, you rascal?\" screamed the Gipsy-mother, who came up just\nas Jackanapes and the pony set off.\n\n\"He would get on,\" replied her son. \"It'll not kill him. He'll fall on\nhis yellow head, and it's as tough as a cocoanut.\"\n\nBut Jackanapes did not fall. He stuck to the red-haired pony as he had\nstuck to the hobbyhorse; but oh, how different the delight of this\nwild gallop with flesh and blood! Just as his legs were beginning to\nfeel as if he did not feel them, the Gipsy boy cried \"Lollo!\" Round\nwent the pony so unceremoniously, that, with as little ceremony,\nJackanapes clung to his neck, and he did not properly recover himself\nbefore Lollo stopped with a jerk at the place where they had started.\n\n\"Is his name Lollo?\" asked Jackanapes, his hand lingering in the wiry\nmane.\n\n\"Yes.\"\n\n\"What does Lollo mean?\"\n\n\"Red.\"\n\n\"Is Lollo your pony?\"\n\n\"No. My father's.\" And the Gipsy boy led Lollo away.\n\nAt the first opportunity Jackanapes stole away again to the common.\nThis time he saw the Gipsy-father, smoking a dirty pipe.\n\n\"Lollo is your pony, isn't he?\" said Jackanapes.\n\n\"Yes.\"\n\n\"He's a very nice one.\"\n\n\"He's a racer.\"\n\n\"You don't want to sell him, do you?\"\n\n\"Fifteen pounds,\" said the Gipsy-father; and Jackanapes sighed and\nwent home again. That very afternoon he and Tony rode the two donkeys,\nand Tony managed to get thrown, and even Jackanapes' donkey kicked.\nBut it was jolting, clumsy work after the elastic swiftness and the\ndainty mischief of the red-haired pony.\n\nA few days later Miss Jessamine spoke very seriously to Jackanapes.\nShe was a good deal agitated as she told him that his grandfather, the\nGeneral, was coming to the Green, and that he must be on his very best\nbehavior during the visit. If it had been feasible to leave off\ncalling him Jackanapes and to get used to his baptismal name of\nTheodore before the day after to-morrow (when the General was due), it\nwould have been satisfactory. But Miss Jessamine feared it would be\nimpossible in practice, and she had scruples about it on principle. It\nwould not seem quite truthful, although she had always most fully\nintended that he should be called Theodore when he had outgrown the\nridiculous appropriateness of his nickname. The fact was that he had\nnot outgrown it, but he must take care to remember who was meant when\nhis grandfather said Theodore.\n\nIndeed for that matter he must take care all along.\n\n\"You are apt to be giddy, Jackanapes,\" said Miss Jessamine.\n\n\"Yes aunt,\" said Jackanapes, thinking of the hobby-horses.\n\n\"You are a good boy, Jackanapes. Thank GOD, I can tell your\ngrandfather that. An obedient boy, an honorable boy, and a\nkind-hearted boy. But you are--in short, you _are_ a Boy, Jackanapes.\nAnd I hope,\"--added Miss Jessamine, desperate with the results of\nexperience--\"that the General knows that Boys will be Boys.\"\n\nWhat mischief could be foreseen, Jackanapes promised to guard against.\nHe was to keep his clothes and his hands clean, to look over his\ncatechism, not to put sticky things in his pockets, to keep that hair\nof his smooth--(\"It's the wind that blows it, Aunty,\" said\nJackanapes--\"I'll send by the coach for some bear's-grease,\" said Miss\nJessamine, tying a knot in her pocket-handkerchief)--not to burst in\nat the parlor door, not to talk at the top of his voice, not to\ncrumple his Sunday frill, and to sit quite quiet during the sermon, to\nbe sure to say \"sir\" to the General, to be careful about rubbing his\nshoes on the doormat, and to bring his lesson-books to his aunt at\nonce that she might iron down the dogs' ears. The General arrived, and\nfor the first day all went well, except that Jackanapes' hair was as\nwild as usual, for the hair-dresser had no bear's-grease left. He\nbegan to feel more at ease with his grandfather, and disposed to talk\nconfidentially with him, as he did with the Postman. All that the\nGeneral felt it would take too long to tell, but the result was the\nsame. He was disposed to talk confidentially with Jackanapes.\n\n\n\"Mons'ous pretty place this,\" he said, looking out of the lattice on\nto the Green, where the grass was vivid with sunset, and the shadows\nwere long and peaceful.\n\n\"You should see it in Fair-week, sir,\" said Jackanapes, shaking his\nyellow mop, and leaning back in his one of the two Chippendale\narm-chairs in which they sat.\n\n\"A fine time that, eh?\" said the General, with a twinkle in his left\neye. (The other was glass.)\n\nJackanapes shook his hair once more. \"I enjoyed this last one the best\nof all,\" he said. \"I'd so much money.\"\n\n\"By George, it's not a common complaint in these bad times. How much\nhad ye?\"\n\n\"I'd two shillings. A new shilling Aunty gave me, and elevenpence I\nhad saved up, and a penny from the Postman--_sir_!\" added Jackanapes\nwith a jerk, having forgotten it.\n\n\"And how did ye spend it--_sir_?\" inquired the General. Jackanapes\nspread his ten fingers on the arms of his chair, and shut his eyes\nthat he might count the more conscientiously.\n\n\"Watch-stand for Aunty, threepence. Trumpet for myself, twopence,\nthat's fivepence. Ginger-nuts for Tony, twopence, and a mug with a\nGrenadier on for the Postman, fourpence, that's elevenpence.\nShooting-gallery a penny, that's a shilling. Giddy-go-round, a penny,\nthat's one and a penny. Treating Tony, one and twopence. Flying Boats\n(Tony paid for himself), a penny, one and threepence. Shooting-gallery\nagain, one and fourpence; Fat Woman a penny, one and fivepence.\nGiddy-go-round again, one and sixpence. Shooting-gallery, one and\nsevenpence. Treating Tony, and then he wouldn't shoot, so I did, one\nand eightpence. Living Skeleton, a penny--no, Tony treated me, the\nLiving Skeleton doesn't count. Skittles, a penny, one and ninepence.\nMermaid (but when we got inside she was dead), a penny, one and\ntenpence. Theatre, a penny (Priscilla Partington, or the Green Lane\nMurder. A beautiful young lady, sir, with pink cheeks and a real\npistol), that's one and elevenpence. Ginger beer, a penny (I _was_ so\nthirsty!) two shillings. And then the Shooting-gallery man gave me a\nturn for nothing, because, he said, I was a real gentleman, and spent\nmy money like a man.\"\n\n\"So you do, sir, so you do!\" cried the General. \"Why, sir, you spend\nit like a prince.--And now I suppose you've not got a penny in your\npocket?\"\n\n\"Yes I have,\" said Jackanapes. \"Two pennies. They are saving up.\" And\nJackanapes jingled them with his hand.\n\n\"You don't want money except at fair-times, I suppose?\" said the\nGeneral.\n\nJackanapes shook his mop.\n\n\"If I could have as much as I want, I should know what to buy,\" said\nhe.\n\n\"And how much do you want, if you could get it?\"\n\n\"Wait a minute, sir, till I think what twopence from fifteen pounds\nleaves. Two from nothing you can't, but borrow twelve. Two from\ntwelve, ten, and carry one. Please remember ten, sir, when I ask you.\nOne from nothing you can't, borrow twenty. One from twenty, nineteen,\nand carry one. One from fifteen, fourteen. Fourteen pounds nineteen\nand--what did I tell you to remember?\"\n\n\"Ten,\" said the General.\n\n\"Fourteen pounds nineteen shillings and tenpence then, is what I\nwant,\" said Jackanapes.\n\n\"Bless my soul, what for?\"\n\n\"To buy Lollo with. Lollo means red, sir. The Gipsy's red-haired pony,\nsir. Oh, he is beautiful! You should see his coat in the sunshine! You\nshould see his mane! You should see his tail! Such little feet, sir,\nand they go like lightning! Such a dear face, too, and eyes like a\nmouse! But he's a racer, and the Gipsy wants fifteen pounds for him.\"\n\n\"If he's a racer, you couldn't ride him. Could you?\"\n\n\"No--o, sir, but I can stick to him. I did the other day.\"\n\n\"You did, did you? Well, I'm fond of riding myself, and if the beast\nis as good as you say, he might suit me.\"\n\n\"You're too tall for Lollo, I think,\" said Jackanapes, measuring his\ngrandfather with his eye.\n\n\"I can double up my legs, I suppose. We'll have a look at him\nto-morrow.\"\n\n\"Don't you weigh a good deal?\" asked Jackanapes.\n\n\"Chiefly waistcoats,\" said the General, slapping the breast of his\nmilitary frock-coat. \"We'll have the little racer on the Green the\nfirst thing in the morning. Glad you mentioned it, grandson. Glad you\nmentioned it.\"\n\nThe General was as good as his word. Next morning the Gipsy and Lollo,\nMiss Jessamine, Jackanapes and his grandfather and his dog Spitfire,\nwere all gathered at one end of the Green in a group, which so aroused\nthe innocent curiosity of Mrs. Johnson, as she saw it from one of her\nupper windows, that she and the children took their early promenade\nrather earlier than usual. The General talked to the Gipsy, and\nJackanapes fondled Lollo's mane, and did not know whether he should be\nmore glad or miserable if his grandfather bought him.\n\n\"Jackanapes!\"\n\n\"Yes, sir!\"\n\n\"I've bought Lollo, but I believe you were right. He hardly stands\nhigh enough for me. If you can ride him to the other end of the Green,\nI'll give him to you.\"\n\nHow Jackanapes tumbled on to Lollo's back he never knew. He had just\ngathered up the reins when the Gipsy-father took him by the arm.\n\n\"If you want to make Lollo go fast, my little gentleman--\"\n\n\"_I_ can make him go!\" said Jackanapes, and drawing from his pocket\nthe trumpet he had bought in the fair, he blew a blast both loud and\nshrill.\n\nAway went Lollo, and away went Jackanapes' hat. His golden hair flew\nout an aureole from which his cheeks shone red and distended with\ntrumpeting. Away went Spitfire, mad with the rapture of the race, and\nthe wind in his silky ears. Away went the geese, the cocks, the hens,\nand the whole family of Johnson. Lucy clung to her mamma, Jane saved\nEmily by the gathers of her gown, and Tony saved himself by a\nsomersault.\n\nThe Grey Goose was just returning when Jackanapes and Lollo rode back,\nSpitfire panting behind.\n\n\"Good, my little gentleman, good!\" said the Gipsy. \"You were born to\nthe saddle. You've the flat thigh, the strong knee, the wiry back,\nand the light caressing hand, all you want is to learn the whisper.\nCome here!\"\n\n\"What was that dirty fellow talking about, grandson?\" asked the\nGeneral.\n\n\"I can't tell you, sir. It's a secret.\"\n\nThey were sitting in the window again, in the two Chippendale\narm-chairs, the General devouring every line of his grandson's face,\nwith strange spasms crossing his own.\n\n\"You must love your aunt very much, Jackanapes?\"\n\n\"I do, sir,\" said Jackanapes warmly.\n\n\"And whom do you love next best to your aunt?\"\n\nThe ties of blood were pressing very strongly on the General himself,\nand perhaps he thought of Lollo. But Love is not bought in a day, even\nwith fourteen pounds nineteen shillings and tenpence. Jackanapes\nanswered quite readily, \"The Postman.\"\n\n\"Why the Postman?\"\n\n\"He knew my father,\" said Jackanapes, \"and he tells me about him, and\nabout his black mare. My father was a soldier, a brave soldier. He\ndied at Waterloo. When I grow up I want to be a soldier too.\"\n\n\"So you shall, my boy. So you shall.\"\n\n\"Thank you, grandfather. Aunty doesn't want me to be a soldier for\nfear of being killed.\"\n\n\"Bless my life! Would she have you get into a feather-bed and stay\nthere? Why, you might be killed by a thunderbolt, if you were a\nbutter-merchant!\"\n\n\"So I might. I shall tell her so. What a funny fellow you are, sir! I\nsay, do you think my father knew the Gipsy's secret? The Postman says\nhe used to whisper to his black mare.\"\n\n\"Your father was taught to ride as a child, by one of those horsemen\nof the East who swoop and dart and wheel about a plain like swallows\nin autumn. Grandson! Love me a little too. I can tell you more about\nyour father than the Postman can.\"\n\n\"I do love you,\" said Jackanapes. \"Before you came I was frightened.\nI'd no notion you were so nice.\"\n\n\"Love me always, boy, whatever I do or leave undone. And--GOD help\nme--whatever you do or leave undone, I'll love you! There shall never be\na cloud between us for a day; no, sir, not for an hour. We're imperfect\nenough, all of us, we needn't be so bitter; and life is uncertain enough\nat its safest, we needn't waste its opportunities. Look at me! Here sit\nI, after a dozen battles and some of the worst climates in the world,\nand by yonder lych gate lies your mother, who didn't move five miles, I\nsuppose, from your aunt's apron-strings,--dead in her teens; my\ngolden-haired daughter, whom I never saw.\"\n\nJackanapes was terribly troubled.\n\n\"Don't cry, grandfather,\" he pleaded, his own blue eyes round with\ntears. \"I will love you very much, and I will try to be very good. But\nI should like to be a soldier.\"\n\n\"You shall, my boy, you shall. You've more claims for a commission\nthan you know of. Cavalry, I suppose; eh, ye young Jackanapes? Well,\nwell; if you live to be an honor to your country, this old-heart\nshall grow young again with pride for you; and if you die in the\nservice of your country--GOD bless me, it can but break for ye!\"\n\nAnd beating the region which he said was all waistcoats, as if they\nstifled him, the old man got up and strode out on to the Green.\n\n\n\n\nCHAPTER IV.\n\n     \"Greater love hath no man than this, that a man lay down his\n     life for his friends.\"--JOHN XV. 13.\n\n\nTwenty and odd years later the Grey Goose was still alive, and in full\npossession of her faculties, such as they were. She lived slowly and\ncarefully, and she lived long. So did Miss Jessamine; but the General\nwas dead.\n\nHe had lived on the Green for many years, during which he and the\nPostman saluted each other with a punctiliousness that it almost\ndrilled one to witness. He would have completely spoiled Jackanapes if\nMiss Jessamine's conscience would have let him; otherwise he somewhat\ndragooned his neighbors, and was as positive about parish matters as a\nratepayer about the army. A stormy-tempered, tender-hearted soldier,\nirritable with the suffering of wounds of which he never spoke, whom\nall the village followed to his grave with tears.\n\nThe General's death was a great shock to Miss Jessamine, and her\nnephew stayed with her for some little time after the funeral. Then he\nwas obliged to join his regiment, which was ordered abroad.\n\nOne effect of the conquest which the General had gained over the\naffections of the village, was a considerable abatement of the popular\nprejudice against \"the military.\" Indeed the village was now somewhat\nimportantly represented in the army. There was the General himself,\nand the Postman, and the Black Captain's tablet in the church, and\nJackanapes, and Tony Johnson, and a Trumpeter.\n\n\nTony Johnson had no more natural taste for fighting than for riding,\nbut he was as devoted as ever to Jackanapes, and that was how it came\nabout that Mr. Johnson bought him a commission in the same cavalry\nregiment that the General's grandson (whose commission had been given\nhim by the Iron Duke) was in, and that he was quite content to be the\nbutt of the mess where Jackanapes was the hero; and that when\nJackanapes wrote home to Miss Jessamine, Tony wrote with the same\npurpose to his mother; namely, to demand her congratulations that they\nwere on active service at last, and were ordered to the front. And he\nadded a postscript to the effect that she could have no idea how\npopular Jackanapes was, nor how splendidly he rode the wonderful red\ncharger whom he had named after his old friend Lollo.\n\n       *       *       *       *       *\n\n\"Sound Retire!\"\n\nA Boy Trumpeter, grave with the weight of responsibilities and\naccoutrements beyond his years, and stained, so that his own mother\nwould not have known him, with the sweat and dust of battle, did as he\nwas bid; and then pushing his trumpet pettishly aside, adjusted his\nweary legs for the hundredth time to the horse which was a world too\nbig for him, and muttering, \"'Tain't a pretty tune,\" tried to see\nsomething of this, his first engagement, before it came to an end.\n\nBeing literally in the thick of it, he could hardly have seen less or\nknown less of what happened in that particular skirmish if he had been\nat home in England. For many good reasons; including dust and smoke,\nand that what attention he dared distract from his commanding officer\nwas pretty well absorbed by keeping his hard-mouthed troop-horse in\nhand, under pain of execration by his neighbors in the mêlée.\nBy-and-by, when the newspapers came out, if he could get a look at one\nbefore it was thumbed to bits, he would learn that the enemy had\nappeared from ambush in overwhelming numbers, and that orders had been\ngiven to fall back, which was done slowly and in good order, the men\nfighting as they retired.\n\nBorn and bred on the Goose Green, the youngest of Mr. Johnson's\ngardener's numerous off-spring, the boy had given his family \"no\npeace\" till they let him \"go for a soldier\" with Master Tony and\nMaster Jackanapes. They consented at last, with more tears than they\nshed when an elder son was sent to jail for poaching, and the boy was\nperfectly happy in his life, and full of _esprit de corps_. It was\nthis which had been wounded by having to sound retreat for \"the young\ngentlemen's regiment,\" the first time he served with it before the\nenemy, and he was also harassed by having completely lost sight of\nMaster Tony. There had been some hard fighting before the backward\nmovement began, and he had caught sight of him once, but not since. On\nthe other hand, all the pulses of his village pride had been stirred\nby one or two visions of Master Jackanapes whirling about on his\nwonderful horse. He had been easy to distinguish, since an eccentric\nblow had bared his head without hurting it, for his close golden mop\nof hair gleamed in the hot sunshine as brightly as the steel of the\nsword flashing round it.\n\nOf the missiles that fell pretty thickly, the Boy Trumpeter did not\ntake much notice. First, one can't attend to everything, and his hands\nwere full. Secondly, one gets used to anything. Thirdly, experience\nsoon teaches one, in spite of proverbs, how very few bullets find\ntheir billet. Far more unnerving is the mere suspicion of fear or even\nof anxiety in the human mass around you. The Boy was beginning to\nwonder if there were any dark reason for the increasing pressure, and\nwhether they would be allowed to move back more quickly, when the\nsmoke in front lifted for a moment, and he could see the plain, and\nthe enemy's line some two hundred yards away.\n\n\nAnd across the plain between them, he saw Master Jackanapes galloping\nalone at the top of Lollo's speed, their faces to the enemy, his\ngolden head at Lollo's ear.\n\nBut at this moment noise and smoke seemed to burst out on every side,\nthe officer shouted to him to sound retire, and between trumpeting and\nbumping about on his horse, he saw and heard no more of the incidents\nof his first battle.\n\nTony Johnson was always unlucky with horses, from the days of the\ngiddy-go-round onwards. On this day--of all days in the year--his own\nhorse was on the sick list, and he had to ride an inferior,\nill-conditioned beast, and fell off that, at the very moment when it\nwas a matter of life or death to be able to ride away. The horse fell\non him, but struggled up again, and Tony managed to keep hold of it.\nIt was in trying to remount that he discovered, by helplessness and\nanguish, that one of his legs was crushed and broken, and that no feat\nof which he was master would get him into the saddle. Not able even to\nstand alone, awkwardly, agonizingly unable to mount his restive horse,\nhis life was yet so strong within him! And on one side of him rolled\nthe dust and smoke-cloud of his advancing foe, and on the other, that\nwhich covered his retreating friends.\n\nHe turned one piteous gaze after them, with a bitter twinge, not of\nreproach, but of loneliness; and then, dragging himself up by the side\nof his horse, he turned the other way and drew out his pistol, and\nwaited for the end. Whether he waited seconds or minutes he never\nknew, before some one gripped him by the arm.\n\n\"_Jackanapes_! _GOD bless you_! It's my left leg. If you could get me\non--\"\n\nIt was like Tony's luck that his pistol went off at his horse's tail,\nand made it plunge; but Jackanapes threw him across the saddle.\n\n\"Hold on anyhow, and stick your spur in. I'll lead him. Keep your head\ndown, they're firing high.\"\n\nAnd Jackanapes laid his head down--to Lollo's ear.\n\nIt was when they were fairly off, that a sudden upspringing of the\nenemy in all directions had made it necessary to change the gradual\nretirement of our force into as rapid a retreat as possible. And when\nJackanapes became aware of this, and felt the lagging and swerving of\nTony's horse, he began to wish he had thrown his friend across his own\nsaddle, and left their lives to Lollo.\n\nWhen Tony became aware of it, several things came into his head.\n1. That the dangers of their ride for life were now more than doubled.\n2. That if Jackanapes and Lollo were not burdened with him they would\nundoubtedly escape. 3. That Jackanapes' life was infinitely valuable,\nand his--Tony's--was not. 4. That this--if he could seize it--was the\nsupremest of all the moments in which he had tried to assume the\nvirtues which Jackanapes had by nature; and that if he could be\ncourageous and unselfish now--\n\nHe caught at his own reins and spoke very loud--\n\n\"Jackanapes! It won't do. You and Lollo must go on. Tell the fellows I\ngave you back to them, with all my heart. Jackanapes, if you love me,\nleave me!\"\n\nThere was a daffodil light over the evening sky in front of them, and\nit shone strangely on Jackanapes' hair and face. He turned with an odd\nlook in his eyes that a vainer man than Tony Johnson might have taken\nfor brotherly pride. Then he shook his mop and laughed at him.\n\n\"_Leave you?_ To save my skin? No, Tony, not to save my soul!\"\n\n\n\n\nCHAPTER V.\n\n     Mr. VALIANT _summoned. His will. His last words._\n\n     Then, said he, \"I am going to my Father's.... My Sword I\n     give to him that shall succeed me in my Pilgrimage, and my\n     Courage and Skill to him that can get it.\" ... And as he\n     went down deeper, he said, \"Grave, where is thy Victory?\"\n\n     So he passed over, and all the Trumpets sounded for him on\n     the other side.\n\nBUNYAN'S _Pilgrim's, Progress_.\n\n\nComing out of a hospital-tent, at headquarters, the surgeon cannonaded\nagainst, and rebounded from, another officer; a sallow man, not young,\nwith a face worn more by ungentle experiences than by age; with weary\neyes that kept their own counsel, iron gray hair, and a moustache that\nwas as if a raven had laid its wing across his lips and sealed them.\n\n\"Well?\"\n\n\"Beg pardon, Major. Didn't see you. Oh, compound fracture and bruises,\nbut it's all right. He'll pull through.\"\n\n\"Thank GOD.\"\n\nIt was probably an involuntary expression, for prayer and praise were\nnot much in the Major's line, as a jerk of the surgeon's head would\nhave betrayed to an observer. He was a bright little man, with his\nfeelings showing all over him, but with gallantry and contempt of\ndeath enough for both sides of his profession; who took a cool head, a\nwhite handkerchief and a case of instruments, where other men went\nhot-blooded with weapons, and who was the biggest gossip, male or\nfemale, of the regiment. Not even the Major's taciturnity daunted him.\n\n\"Didn't think he'd as much pluck about him as he has. He'll do all\nright if he doesn't fret himself into a fever about poor Jackanapes.\"\n\n\"Whom are you talking about?\" asked the Major hoarsely.\n\n\"Young Johnson. He--\"\n\n\"What about Jackanapes?\"\n\n\"Don't you know? Sad business. Rode back for Johnson, and brought him\nin; but, monstrous ill-luck, hit as they rode. Left lung--\"\n\n\"Will he recover?\"\n\n\"No. Sad business.\" \"What a frame--what limbs--what health--and what\ngood looks? Finest young fellow--\"\n\n\"Where is he?\"\n\n\"In his own tent,\" said the surgeon sadly.\n\nThe Major wheeled and left him.\n\n       *       *       *       *       *\n\n\"Can I do anything else for you?\"\n\n\"Nothing, thank you. Except--Major! I wish I could get you to\nappreciate Johnson.\"\n\n\"This is not an easy moment, Jackanapes.\"\n\n\"Let me tell you, sir--_he_ never will--that if he could have driven\nme from him, he would be lying yonder at this moment, and I should be\nsafe and sound.\"\n\nThe Major laid his hand over his mouth, as if to keep back a wish he\nwould have been ashamed to utter.\n\n\"I've known old Tony from a child. He's a fool on impulse, a good man\nand a gentleman in principle. And he acts on principle, which it's not\nevery--some water, please! Thank you, sir. It's very hot, and yet\none's feet get uncommonly cold. Oh, thank you, thank you. He's no\nfire-eater, but he has a trained conscience and a tender heart, and\nhe'll do his duty when a braver and more selfish man might fail you.\nBut he wants encouragement; and when I'm gone--\"\n\n\"He shall have encouragement. You have my word for it. Can I do\nnothing else?\"\n\n\"Yes, Major. A favor.\"\n\n\"Thank you, Jackanapes.\"\n\n\"Be Lollo's master, and love him as well as you can. He's used to it.\"\n\n\"Wouldn't you rather Johnson had him?\"\n\nThe blue eyes twinkled in spite of mortal pain.\n\n\"Tony _rides_ on principle, Major. His legs are bolsters, and will be\nto the end of the chapter. I couldn't insult dear Lollo, but if you\ndon't care--\"\n\n\"Whilst I live--which will be longer than I desire or deserve--Lollo\nshall want nothing, but--you. I have too little tenderness for--my\ndear boy, you're faint. Can you spare me for a moment?\"\n\n\"No, stay--Major!\"\n\n\"What? What?\"\n\n\"My head drifts so--if you wouldn't mind.\"\n\n\"Yes! Yes!\"\n\n\"Say a prayer by me. Out loud please, I am getting deaf.\"\n\n\"My dearest Jackanapes--my dear boy--\"\n\n\"One of the Church Prayers--Parade Service, you know--\"\n\n\"I see. But the fact is--GOD forgive me, Jackanapes--I'm a very\ndifferent sort of fellow to some of you youngsters. Look here, let me\nfetch--\"\n\nBut Jackanapes' hand was in his, and it wouldn't let go.\n\nThere was a brief and bitter silence.\n\n\"'Pon my soul I can only remember the little one at the end.\"\n\n\"Please,\" whispered Jackanapes.\n\nPressed by the conviction that what little he could do it was his duty\nto do, the Major--kneeling--bared his head, and spoke loudly, clearly,\nand very reverently--\n\n\"The Grace of our Lord Jesus Christ--\"\n\nJackanapes moved his left hand to his right one, which still held the\nMajor's--\n\n\"--The love of GOD.\"\n\nAnd with that--Jackanapes died.\n\n\n\n\n\nCHAPTER VI.\n\n    \"Und so ist der blaue Himmel grösser als jedes\n    Gewölk darin, und dauerhafter dazu.\"\n\nJEAN PAUL RICHTER.\n\n\nJackanapes' death was sad news for the Goose Green, a sorrow justly\nqualified by honorable pride in his gallantry and devotion. Only the\nCobbler dissented, but that was his way. He said he saw nothing in it\nbut foolhardiness and vain-glory. They might both have been killed,\nas easy as not, and then where would ye have been? A man's life was a\nman's life, and one life was as good as another. No one would catch\nhim throwing his away. And, for that matter, Mrs. Johnson could spare\na child a great deal better than Miss Jessamine.\n\nBut the parson preached Jackanapes' funeral sermon on the text,\n\"Whosoever will save his life shall lose it; and whosoever will lose\nhis life for My sake shall find it;\" and all the village went and wept\nto hear him.\n\nNor did Miss Jessamine see her loss from the Cobbler's point of view.\nOn the contrary, Mrs. Johnson said she never to her dying day should\nforget how, when she went to condole with her, the old lady came\nforward, with gentle-womanly self-control, and kissed her, and thanked\nGOD that her dear nephew's effort had been blessed with success, and\nthat this sad war had made no gap in her friend's large and happy home\ncircle.\n\n\"But she's a noble, unselfish woman,\" sobbed Mrs. Johnson, \"and she\ntaught Jackanapes to be the same, and that's how it is that my Tony\nhas been spared to me. And it must be sheer goodness in Miss\nJessamine, for what can she know of a mother's feelings? And I'm sure\nmost people seem to think that if you've a large family you don't know\none from another any more than they do, and that a lot of children are\nlike a lot of store-apples, if one's taken it won't be missed.\"\n\nLollo--the first Lollo, the Gipsy's Lollo--very aged, draws Miss\nJessamine's bath-chair slowly up and down the Goose Green in the\nsunshine.\n\nThe Ex-postman walks beside him, which Lollo tolerates to the level of\nhis shoulder. If the Postman advances any nearer to his head, Lollo\nquickens his pace, and were the Postman to persist in the injudicious\nattempt, there is, as Miss Jessamine says, no knowing what might\nhappen.\n\nIn the opinion of the Goose Green, Miss Jessamine has borne her\ntroubles \"wonderfully.\" Indeed, to-day, some of the less delicate and\nless intimate of those who see everything from the upper windows, say\n(well behind her back) that \"the old lady seems quite lively with her\nmilitary beaux again.\"\n\nThe meaning of this is, that Captain Johnson is leaning over one side\nof her chair, whilst by the other bends a brother officer who is\nstaying with him, and who has manifested an extraordinary interest in\nLollo. He bends lower and lower, and Miss Jessamine calls to the\nPostman to request Lollo to be kind enough to stop, whilst she is\nfumbling for something which always hangs by her side, and has got\nentangled with her spectacles.\n\nIt is a two-penny trumpet, bought years ago in the village fair, and\nover it she and Captain Johnson tell, as best they can, between them,\nthe story of Jackanapes' ride across the Goose Green; and how he won\nLollo--the Gipsy's Lollo--the racer Lollo--dear Lollo--faithful\nLollo--Lollo the never vanquished--Lollo the tender servant of his old\nmistress. And Lollo's ears twitch at every mention of his name.\n\nTheir hearer does not speak, but he never moves his eyes from the\ntrumpet, and when the tale is told, he lifts Miss Jessamine's hand and\npresses his heavy black moustache in silence to her trembling fingers.\n\nThe sun, setting gently to his rest, embroiders the sombre foliage of\nthe oak-tree with threads of gold. The Grey Goose is sensible of an\natmosphere of repose, and puts up one leg for the night. The grass\nglows with a more vivid green, and, in answer to a ringing call from\nTony, his sisters, fluttering over the daisies in pale-hued muslins,\ncome out of their ever-open door, like pretty pigeons form a dovecote.\n\nAnd, if the good gossips' eyes do not deceive them, all the Miss\nJohnsons, and both the officers, go wandering off into the lanes,\nwhere bryony wreaths still twine about the brambles.\n\n       *       *       *       *       *\n\nA sorrowful story, and ending badly?\n\nNay, Jackanapes, for the end is not yet.\n\nA life wasted that might have been useful?\n\nMen who have died for men, in all ages, forgive the thought!\n\nThere is a heritage of heroic example and noble obligation, not\nreckoned in the Wealth of Nations, but essential to a nation's life;\nthe contempt of which, in any people, may, not slowly, mean even its\ncommercial fall. Very sweet are the uses of prosperity, the harvests\nof peace and progress, the fostering sunshine of health and happiness,\nand length of days in the land.\n\nBut there be things--oh, sons of what has deserved the name of Great\nBritain, forget it not!--\"the good of\" which and \"the use of\" which\nare beyond all calculation of worldly goods and earthly uses; things\nsuch as Love, and Honor, and the Soul of Man, which cannot be bought\nwith a price, and which do not die with death. And they who would fain\nlive happily EVER after, should not leave these things out of the\nlessons of their lives.\n\n\n       *       *       *       *       *\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      219,
      229,
      1
    ],
    [
      "chapter.title",
      15735,
      15746,
      2
    ],
    [
      "chapter.title",
      18758,
      18770,
      3
    ],
    [
      "chapter.title",
      40630,
      40641,
      4
    ],
    [
      "chapter.title",
      49293,
      49303,
      5
    ],
    [
      "chapter.title",
      53854,
      53865,
      6
    ]
  ]
}