{
  "content": "The Tale of Jemima Puddle-Duck\nBeatrix Potter\n\n\n\n\n\n\n\n    A FARMYARD TALE\n    FOR\n    RALPH AND BETSY\n\n\nBOOK 1.\n\n\n\nWhat a funny sight it is to see a brood of ducklings with a hen!\n\n--Listen to the story of Jemima Puddle-duck, who was annoyed because the\nfarmer's wife would not let her hatch her own eggs.\n\n\nHer sister-in-law, Mrs. Rebeccah Puddle-duck, was perfectly willing to\nleave the hatching to some one else--\"I have not the patience to sit on a\nnest for twenty-eight days; and no more have you, Jemima. You would let\nthem go cold; you know you would!\"\n\n\"I wish to hatch my own eggs; I will hatch them all by myself,\" quacked\nJemima Puddle-duck.\n\n\nShe tried to hide her eggs; but they were always found and carried off.\n\nJemima Puddle-duck became quite desperate. She determined to make a nest\nright away from the farm.\n\n\nShe set off on a fine spring afternoon along the cart-road that leads over\nthe hill.\n\nShe was wearing a shawl and a poke bonnet.\n\n\nWhen she reached the top of the hill, she saw a wood in the distance.\n\nShe thought that it looked a safe quiet spot.\n\n\nJemima Puddle-duck was not much in the habit of flying. She ran downhill a\nfew yards flapping her shawl, and then she jumped off into the air.\n\n\nShe flew beautifully when she had got a good start.\n\nShe skimmed along over the tree-tops until she saw an open place in the\nmiddle of the wood, where the trees and brushwood had been cleared.\n\n\nJemima alighted rather heavily, and began to waddle about in search of a\nconvenient dry nesting-place. She rather fancied a tree-stump amongst some\ntall fox-gloves.\n\nBut--seated upon the stump, she was startled to find an elegantly dressed\ngentleman reading a newspaper.\n\nHe had black prick ears and sandy coloured whiskers.\n\n\"Quack?\" said Jemima Puddle-duck, with her head and her bonnet on one\nside--\"Quack?\"\n\n\nThe gentleman raised his eyes above his newspaper and looked curiously at\nJemima--\n\n\"Madam, have you lost your way?\" said he. He had a long bushy tail which\nhe was sitting upon, as the stump was somewhat damp.\n\nJemima thought him mighty civil and handsome. She explained that she had\nnot lost her way, but that she was trying to find a convenient dry\nnesting-place.\n\n\n\"Ah! is that so? indeed!\" said the gentleman with sandy whiskers, looking\ncuriously at Jemima. He folded up the newspaper, and put it in his\ncoat-tail pocket.\n\nJemima complained of the superfluous hen.\n\n\"Indeed! how interesting! I wish I could meet with that fowl. I would\nteach it to mind its own business!\"\n\n\n\"But as to a nest--there is no difficulty: I have a sackful of feathers in\nmy wood-shed. No, my dear madam, you will be in nobody's way. You may sit\nthere as long as you like,\" said the bushy long-tailed gentleman.\n\nHe led the way to a very retired, dismal-looking house amongst the\nfox-gloves.\n\nIt was built of faggots and turf, and there were two broken pails, one on\ntop of another, by way of a chimney.\n\n\n\"This is my summer residence; you would not find my earth--my winter\nhouse--so convenient,\" said the hospitable gentleman.\n\nThere was a tumble-down shed at the back of the house, made of old\nsoap-boxes. The gentleman opened the door, and showed Jemima in.\n\n\nThe shed was almost quite full of feathers--it was almost suffocating; but\nit was comfortable and very soft.\n\nJemima Puddle-duck was rather surprised to find such a vast quantity of\nfeathers. But it was very comfortable; and she made a nest without any\ntrouble at all.\n\n\nWhen she came out, the sandy whiskered gentleman was sitting on a log\nreading the newspaper--at least he had it spread out, but he was looking\nover the top of it.\n\nHe was so polite, that he seemed almost sorry to let Jemima go home for\nthe night. He promised to take great care of her nest until she came back\nagain next day.\n\nHe said he loved eggs and ducklings; he should be proud to see a fine\nnestful in his wood-shed.\n\n\nJemima Puddle-duck came every afternoon; she laid nine eggs in the nest.\nThey were greeny white and very large. The foxy gentleman admired them\nimmensely. He used to turn them over and count them when Jemima was not\nthere.\n\nAt last Jemima told him that she intended to begin to sit next day--\"and I\nwill bring a bag of corn with me, so that I need never leave my nest until\nthe eggs are hatched. They might catch cold,\" said the conscientious\nJemima.\n\n\n\"Madam, I beg you not to trouble yourself with a bag; I will provide oats.\nBut before you commence your tedious sitting, I intend to give you a\ntreat. Let us have a dinner-party all to ourselves!\n\n\"May I ask you to bring up some herbs from the farm-garden to make a\nsavoury omelette? Sage and thyme, and mint and two onions, and some\nparsley. I will provide lard for the stuff--lard for the omelette,\" said\nthe hospitable gentleman with sandy whiskers.\n\n\nJemima Puddle-duck was a simpleton: not even the mention of sage and\nonions made her suspicious.\n\nShe went round the farm-garden, nibbling off snippets of all the different\nsorts of herbs that are used for stuffing roast duck.\n\n\nAnd she waddled into the kitchen, and got two onions out of a basket.\n\nThe collie-dog Kep met her coming out, \"What are you doing with those\nonions? Where do you go every afternoon by yourself, Jemima Puddle-duck?\"\n\nJemima was rather in awe of the collie; she told him the whole story.\n\nThe collie listened, with his wise head on one side; he grinned when she\ndescribed the polite gentleman with sandy whiskers.\n\n\nHe asked several questions about the wood, and about the exact position of\nthe house and shed.\n\nThen he went out, and trotted down the village. He went to look for two\nfox-hound puppies who were out at walk with the butcher.\n\n\nJemima Puddle-duck went up the cart-road for the last time, on a sunny\nafternoon. She was rather burdened with bunches of herbs and two onions in\na bag.\n\nShe flew over the wood, and alighted opposite the house of the bushy\nlong-tailed gentleman.\n\n\nHe was sitting on a log; he sniffed the air, and kept glancing uneasily\nround the wood. When Jemima alighted he quite jumped.\n\n\"Come into the house as soon as you have looked at your eggs. Give me the\nherbs for the omelette. Be sharp!\"\n\nHe was rather abrupt. Jemima Puddle-duck had never heard him speak like\nthat.\n\nShe felt surprised, and uncomfortable.\n\n\nWhile she was inside she heard pattering feet round the back of the shed.\nSome one with a black nose sniffed at the bottom of the door, and then\nlocked it.\n\nJemima became much alarmed.\n\n\nA moment afterwards there were most awful noises--barking, baying, growls\nand howls, squealing and groans.\n\nAnd nothing more was ever seen of that foxy-whiskered gentleman.\n\nPresently Kep opened the door of the shed, and let out Jemima Puddle-duck.\n\n\nUnfortunately the puppies rushed in and gobbled up all the eggs before he\ncould stop them.\n\nHe had a bite on his ear and both the puppies were limping.\n\n\nJemima Puddle-duck was escorted home in tears on account of those eggs.\n\n\nShe laid some more in June, and she was permitted to keep them herself:\nbut only four of them hatched.\n\nJemima Puddle-duck said that it was because of her nerves; but she had\nalways been a bad sitter.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}