{
  "content": "Jessica's First Prayer--Jessica's Mother\nHesba Stretton\n\nBOOK I. Jessica's First Prayer\n\nCHAPTER I. THE COFFEE-STALL AND ITS KEEPER.\n\n\nIn a screened and secluded corner of one of the many railway-bridges\nwhich span the streets of London there could be seen, a few years\nago, from five o’clock every morning until half-past eight, a tidily\nset out coffee-stall, consisting of a trestle and board, upon which\nstood two large tin cans with a small fire of charcoal burning under\neach, so as to keep the coffee boiling during the early hours of the\nmorning when the work-people were thronging into the city on their\nway to their daily toil. The coffee-stall was a favorite one, for\nbesides being under shelter, which was of great consequence upon rainy\nmornings, it was also in so private a niche that the customers taking\ntheir out-of-door breakfast were not too much exposed to notice; and,\nmoreover, the coffee-stall keeper was a quiet man, who cared only\nto serve the busy workmen without hindering them by any gossip. He\nwas a tall, spare, elderly man, with a singularly solemn face and a\nmanner which was grave and secret. Nobody knew either his name or\ndwelling-place; unless it might be the policeman who strode past the\ncoffee-stall every half-hour and nodded familiarly to the solemn man\nbehind it. There were very few who cared to make any inquiries about\nhim; but those who did could only discover that he kept the furniture\nof his stall at a neighboring coffee-house, whither he wheeled his\ntrestle and board and crockery every day not later than half-past\neight in the morning; after which he was wont to glide away with a\nsoft footstep and a mysterious and fugitive air, with many backward\nand sidelong glances, as if he dreaded observation, until he was lost\namong the crowds which thronged the streets. No one had ever had the\npersevering curiosity to track him all the way to his house, or to find\nout his other means of gaining a livelihood; but in general his stall\nwas surrounded by customers, whom he served with silent seriousness,\nand who did not grudge to pay him his charge for the refreshing coffee\nhe supplied to them.\n\nFor several years the crowd of work-people had paused by the\ncoffee-stall under the railway-arch, when one morning, in a partial\nlull of his business, the owner became suddenly aware of a pair of very\nbright dark eyes being fastened upon him and the slices of bread and\nbutter on his board, with a gaze as hungry as that of a mouse which has\nbeen driven by famine into a trap. A thin and meagre face belonged to\nthe eyes, which was half hidden by a mass of matted hair hanging over\nthe forehead and down the neck--the only covering which the head or\nneck had; for a tattered frock, scarcely fastened together with broken\nstrings, was slipping down over the shivering shoulders of the little\ngirl. Stooping down to a basket behind his stall, he caught sight of\ntwo bare little feet curling up from the damp pavement, as the child\nlifted up first one and then other and laid them one over another to\ngain a momentary feeling of warmth. Whoever the wretched child was, she\ndid not speak; only at every steaming cupful which he poured out of his\ncan her dark eyes gleamed hungrily, and he could hear her smack her\nthin lips as if in fancy she was tasting the warm and fragrant coffee.\n\n“Oh, come now,” he said at last, when only one boy was left taking his\nbreakfast leisurely, and he leaned over his stall to speak in a low and\nquiet tone, “why don’t you go away, little girl? Come, come; you’re\nstaying too long, you know.”\n\n“I’m just going, sir,” she answered, shrugging her small shoulders to\ndraw her frock up higher about her neck; “only it’s raining cats and\ndogs outside; and mother’s been away all night, and she took the key\nwith her; and it’s so nice to smell the coffee; and the police has left\noff worriting me while I’ve been here. He thinks I’m a customer taking\nmy breakfast.” And the child laughed a shrill laugh of mockery at\nherself and the policeman.\n\n“You’ve had no breakfast, I suppose,” said the coffee-stall keeper, in\nthe same low and confidential voice, and leaning over his stall till\nhis face nearly touched the thin, sharp features of the child.\n\n“No,” she replied, coolly, “and I shall want my dinner dreadful bad\nafore I get it, I know. You don’t often feel dreadful hungry, do you,\nsir? I’m not griped yet, you know; but afore I taste my dinner it’ll be\npretty bad, I tell you. Ah! very bad indeed!”\n\nShe turned away with a knowing nod, as much as to say she had one\nexperience in life to which he was quite a stranger; but before she had\ngone half a dozen steps she heard the quiet voice calling to her in\nrather louder tones, and in an instant she was back at the stall.\n\n“Slip in here,” said the owner, in a cautious whisper; “here’s a little\ncoffee left and a few crusts. There. You must never come again, you\nknow. I never give to beggars; and if you’d begged I’d have called the\npolice. There; put your poor feet towards the fire. Now, aren’t you\ncomfortable?”\n\nThe child looked up with a face of intense satisfaction. She was seated\nupon an empty basket, with her feet near the pan of charcoal, and a cup\nof steaming coffee on her lap; but her mouth was too full for her to\nreply except by a very deep nod, which expressed unbounded delight.\nThe man was busy for a while packing up his crockery; but every now and\nthen he stopped to look down upon her, and to shake his head.\n\n“What’s your name?” he asked, at length; “but there, never mind! I\ndon’t care what it is. What’s your name to do with me, I wonder?”\n\n“It’s Jessica,” said the girl: “but mother and every body calls me\nJess. You’d be tired of being called Jess, if you were me. It’s Jess\nhere, and Jess there: and every body wanting me to go errands. And they\nthink nothing of giving me smacks, and kicks, and pinches. Look here!”\n\nWhether her arms were black and blue from the cold or from ill-usage\nhe could not tell; but he shook his head again seriously and the child\nfelt encouraged to go on.\n\n“I wish I could stay here for ever and ever, just as I am!” she cried.\n“But you’re going away, I know; and I’m never to come again, or you’ll\nset the police on me!”\n\n“Yes,” said the coffee-stall keeper very softly; and looking round to\nsee if there were any other ragged children within sight, “if you’ll\npromise not to come again for a whole week, and not to tell any body\nelse, you may come once more. I’ll give you one other treat. But you\nmust be off now.”\n\n“I’m off, sir,” she said, sharply; “but if you’ve a errand I could go\non I’d do it all right, I would. Let me carry some of your things.”\n\n“No, no,” cried the man; “you run away, like a good girl; and, mind!\nI’m not to see you again for a whole week.”\n\n“All right,” answered Jess, setting off down the rainy street at a\nquick run, as if to show her willing agreement to the bargain; while\nthe coffee-stall keeper, with many a cautious glance around him,\nremoved his stock in trade to the coffee-house near at hand, and\nwas seen no more for the rest of the day in the neighborhood of the\nrailway-bridge.\n\n\n\n\nCHAPTER II. JESSICA’S TEMPTATION.\n\n\nHer part of the bargain Jessica faithfully kept; and though the solemn\nand silent man under the dark shadow of the bridge looked for her every\nmorning as he served his customers, he caught no glimpse of her wan\nface and thin little frame. But when the appointed time was finished\nshe presented herself at the stall, with her hungry eyes fastened\nagain upon the piles of buns and bread and butter, which were fast\ndisappearing before the demands of the buyers. The business was at its\nheight, and the famished child stood quietly on one side watching for\nthe throng to melt away. But as soon as the nearest church clock had\nchimed eight she drew a little nearer to the stall, and at a signal\nfrom its owner she slipped between the trestles of his stand and took\nup her former position on the empty basket. To his eyes she seemed even\na little thinner, and certainly more ragged, than before; and he laid a\nwhole bun, a stale one which was left from yesterday’s stock, upon her\nlap, as she lifted the cup of coffee to her lips with both her benumbed\nhands.\n\n“What’s your name?” she asked, looking up to him with her keen eyes.\n\n“Why,” he answered, hesitatingly, as if he was reluctant to tell so\nmuch of himself, “my christened name is Daniel.”\n\n“And where do you live, Mr. Dan’el?” she inquired.\n\n“Oh, come now!” he exclaimed, “if you’re going to be impudent, you’d\nbetter march off. What business is it of yours where I live? I don’t\nwant to know where you live, I can tell you.”\n\n“I didn’t mean no offence,” said Jess humbly; “only I thought I’d like\nto know where a good man like you lived. You’re a very good man, aren’t\nyou, Mr. Dan’el?”\n\n“I don’t know,” he answered uneasily; “I’m afraid I’m not.”\n\n“Oh, but you are, you know,” continued Jess. “You make good\ncoffee; prime! And buns too! And I’ve been watching you hundreds of\ntimes afore you saw me, and the police leaves you alone, and never\ntells you to move on. Oh, yes! you must be a very good man.”\n\nDaniel sighed, and fidgeted about his crockery with a grave and\noccupied air, as if he were pondering over the child’s notion of\ngoodness. He made good coffee, and the police left him alone! It was\nquite true; yet still as he counted up the store of pence which had\naccumulated in his strong canvas bag, he sighed again still more\nheavily. He purposely let one of his pennies fall upon the muddy\npavement, and went on counting the rest busily, while he furtively\nwatched the little girl sitting at his feet. Without a shade of change\nupon her small face she covered the penny with her foot and drew it in\ncarefully towards her, while she continued to chatter fluently to him.\nFor a moment a feeling of pain shot a pang through Daniel’s heart;\nand then he congratulated himself on having entrapped the young thief.\nIt was time to be leaving now; but before he went he would make her\nmove her bare foot and disclose the penny concealed beneath it, and\nthen he would warn her never to venture near his stall again. This was\nher gratitude, he thought; he had given her two breakfasts and more\nkindness than he had shown to any fellow-creature for many a long year,\nand at the first chance the young jade turned upon him and robbed him!\nHe was brooding over it painfully in his mind when Jessica’s uplifted\nface changed suddenly, a dark flush crept over her pale cheeks, and the\ntears started to her eyes. She stooped down, and picking up the coin\nfrom among the mud she rubbed it bright and clean upon her rags and\nlaid it upon the stall close to his hand, but without speaking a word.\nDaniel looked down upon her solemnly and searchingly.\n\n“What’s this?” he asked.\n\n“Please, Mr. Dan’el,” she answered, “it dropped, and you didn’t hear\nit.”\n\n“Jess,” he said sternly, “tell me all about it.”\n\n“Oh, please,” she sobbed, “I never had a penny of my own but once; and\nit rolled close to my foot; and you didn’t see it; and I hid it up\nsharp; and then I thought how kind you’d been, and how good the coffee\nand buns are, and how you let me warm myself at your fire; and, please,\nI couldn’t keep the penny any longer. You’ll never let me come again, I\nguess.”\n\nDaniel turned away for a moment, busying himself with putting his cups\nand saucers into the basket, while Jessica stood by trembling, with\nthe large tears rolling slowly down her cheeks. The snug, dark corner,\nwith its warm fire of charcoal and its fragrant smell of coffee, had\nbeen a paradise to her for these two brief spans of time; but she had\nbeen guilty of the sin which would drive her from it. All beyond the\nrailway-arch the streets stretched away, cold and dreary, with no\nfriendly face to meet hers and no warm cups of coffee to refresh her;\nyet she was only lingering sorrowfully to hear the words spoken which\nshould forbid her to return to this pleasant spot. Mr. Daniel turned\nround at last, and met her tearful gaze, with a look of strange emotion\nupon his own solemn face.\n\n“Jess,” he said, “I could never have done it myself. But you may come\nhere every Wednesday morning, as this is a Wednesday, and there’ll\nalways be a cup of coffee for you.”\n\nShe thought he meant that he could not have hidden the penny under his\nfoot, and she went away a little saddened and subdued, notwithstanding\nher great delight in the expectation of such a treat every week; while\nDaniel, pondering over the struggle that must have passed through her\nchildish mind, went on his way, from time to time shaking his head,\nmuttering to himself, “I couldn’t have done it myself: I never could\nhave done it myself.”\n\n\n\n\nCHAPTER III. AN OLD FRIEND IN A NEW DRESS.\n\n\nWeek after week, through the three last months of the year, Jessica\nappeared every Wednesday at the coffee-stall and, after waiting\npatiently till the close of the breakfasting business, received her\npittance from the charity of her new friend. After a while Daniel\nallowed her to carry some of his load to the coffee-house, but he\nnever suffered her to follow him farther, and he was always particular\nto watch her out of sight before he turned off through the intricate\nmazes of the streets in the direction of his own home. Neither did he\nencourage her to ask him any more questions; and often but very few\nwords passed between them during Jessica’s breakfast time.\n\nAs to Jessica’s home, she made no secret of it, and Daniel might have\nfollowed her any time he pleased. It was a single room, which had once\nbeen a hay-loft, over the stable of an old inn, now in use for two or\nthree donkeys, the property of costermongers dwelling in the court\nabout it. The mode of entrance was by a wooden ladder, whose rungs were\ncrazy and broken, and which led up through a trap-door in the floor\nof the loft. The interior of the home was as desolate and comfortless\nas that of the stable below, with only a litter of straw for the\nbedding and a few bricks and boards for the furniture. Every thing that\ncould be pawned had disappeared long ago, and Jessica’s mother often\nlamented that she could not thus dispose of her child. Yet Jessica was\nhardly a burden to her. It was a long time since she had taken any\ncare to provide her with food or clothing, and the girl had to earn or\nbeg for herself the meat which kept a scanty life within her. Jess was\nthe drudge and errand-girl of the court; and what with being cuffed\nand beaten by her mother, and overworked and ill-used by her numerous\nemployers, her life was a hard one. But now there was always Wednesday\nmorning to count upon and look forward to; and by and by a second scene\nof amazed delight opened upon her.\n\nJessica had wandered far away from home in the early darkness of a\nwinter’s evening, after a violent outbreak of her drunken mother, and\nshe was still sobbing now and then with long-drawn sobs of pain and\nweariness, when she saw a little way before her the tall, well-known\nfigure of her friend Mr. Daniel. He was dressed in a suit of black,\nwith a white neckcloth, and he was pacing with brisk yet measured steps\nalong the lighted streets. Jessica felt afraid of speaking to him, but\nshe followed at a little distance, until presently he stopped before\nthe iron gates of a large building and, unlocking them, passed on to\nthe arched doorway, and with a heavy key opened the folding-doors and\nentered in. The child stole after him but paused for a few minutes,\ntrembling upon the threshold, until the gleam of a light lit up within\ntempted her to venture a few steps forward, and to push a little way\nopen an inner door, covered with crimson baize, only so far as to\nenable her to peep through at the inside. Then, growing bolder by\ndegrees, she crept through herself, drawing the door to noiselessly\nbehind her. The place was in partial gloom, but Daniel was kindling\nevery gaslight, and each minute lit it up in more striking grandeur.\nShe stood in a carpeted aisle, with high oaken pews on each side\nalmost as black as ebony. A gallery of the same dark old oak ran round\nthe walls, resting upon massive pillars, behind one of which she was\npartly concealed, gazing with eager eyes at Daniel, as he mounted the\npulpit steps and kindled the lights there, disclosing to her curious\ndelight the glittering pipes of an organ behind it. Before long the\nslow and soft-footed chapel-keeper disappeared for a moment or two into\na vestry; and Jessica, availing herself of his short absence, stole\nsilently up under the shelter of the dark pews until she reached the\nsteps of the organ loft, with its golden show. But at this moment Mr.\nDaniel appeared again, arrayed in a long gown of black serge; and as\nshe stood spell-bound gazing at the strange appearance of her patron,\nhis eyes fell upon her, and he also was struck speechless for a minute,\nwith an air of amazement and dismay upon his grave face.\n\n“Come, now,” he exclaimed, harshly, as soon as he could recover his\npresence of mind, “you must take yourself out of this. This isn’t any\nplace for such as you. It’s for ladies and gentlemen; so you must run\naway sharp before any body comes. How did you ever find your way here?”\n\nHe had come very close to her, and bent down to whisper in her ear,\nlooking nervously round to the entrance all the time. Jessica’s eager\ntongue was loosened.\n\n“Mother beat me,” she said, “and turned me into the streets, and I see\nyou there, so I followed you up. I’ll run away this minute, Mr. Daniel;\nbut it’s a nice place. What do the ladies and gentlemen do when they\ncome here? Tell me, and I’ll be off sharp.”\n\n“They come here to pray,” whispered Daniel.\n\n“What is pray?” asked Jessica.\n\n“Bless the child!” cried Daniel, in perplexity. “Why, they kneel down\nin those pews; most of them sit, though; and the minister up in the\npulpit tells God what they want.”\n\nJessica gazed into his face with such an air of bewilderment that a\nfaint smile crept over the sedate features of the pew-opener.\n\n“What is a minister and God?” she said; “and do ladies and gentlemen\nwant any thing? I thought they’d every thing they wanted, Mr. Daniel.”\n\n“Oh!” cried Daniel, “you must be off, you know. They’ll be coming in a\nminute, and they’d be shocked to see a ragged little heathen like you.\nThis is the pulpit, where the minister stands and preaches to ’em; and\nthere are the pews, where they sit to listen to him, or to go to sleep,\nmay be; and that’s the organ to play music to their singing. There,\nI’ve told you every thing, and you must never come again; never.”\n\n“Mr. Daniel,” said Jessica, “I don’t know nothing about it. Isn’t there\na dark little corner somewhere that I could hide in?”\n\n“No, no,” interrupted Daniel impatiently; “we couldn’t do with such\na little heathen, with no shoes or bonnet on. Come, now, it’s only a\nquarter to the time, and somebody will be here in a minute. Run away,\ndo!”\n\nJessica retraced her steps slowly to the crimson door, casting many a\nlonging look backwards; but Mr. Daniel stood at the end of the aisle,\nfrowning upon her whenever she glanced behind. She gained the lobby at\nlast, but already some one was approaching the chapel door, and beneath\nthe lamp at the gate stood one of her natural enemies, a policeman. Her\nheart beat fast, but she was quickwitted, and in another instant she\nspied a place of concealment behind one of the doors, into which she\ncrept for safety until the policeman passed on upon his beat.\n\n\nThe congregation began to arrive quickly. She heard the rustling of\nsilk dresses, and she could see the gentlemen and ladies pass by the\nniche between the door and the post. Once she ventured to stretch out a\nthin little finger and touch a velvet mantle as the wearer of it swept\nby, but no one caught her in the act, or suspected her presence behind\nthe door. Mr. Daniel, she could see, was very busy ushering the people\nto their seats; but there was a startled look lingering upon his face,\nand every now and then he peered anxiously into the outer gloom and\ndarkness, and even once called to the policeman to ask if he had seen\na ragged child hanging about. After a while the organ began to sound,\nand Jessica crouched down in her hiding-place, listening entranced to\nthe sweet music. She could not tell what made her cry, but the tears\ncame so rapidly that it was of no use to rub the corners of her eyes\nwith her hard knuckles; so she lay down upon the ground and buried her\nface in her hands and wept without restraint. When the singing was over\nshe could only catch a confused sound of a voice speaking. The lobby\nwas empty now, and the crimson doors closed. The policeman also had\nwalked on. This was the moment to escape. She raised herself from the\nground with a feeling of weariness and sorrow; and thinking sadly of\nthe light, and warmth, and music that were within the closed doors, she\nstepped out into the cold and darkness of the streets, and loitered\nhomeward with a heavy heart.\n\n\n\n\nCHAPTER IV. PEEPS INTO FAIRY-LAND.\n\n\nIt was not the last time that Jessica concealed herself behind the\nbaize-covered door. She could not overcome the urgent desire to enjoy\nagain and again the secret and perilous pleasure, and Sunday after\nSunday she watched in the dark streets for the moment when she could\nslip in unseen. She soon learned the exact time when Daniel would\nbe occupied in lighting up, before the policeman would take up his\nstation at the entrance, and again, the very minute at which it would\nbe wise and safe to take her departure. Sometimes the child laughed\nnoiselessly to herself until she shook with suppressed merriment, as\nshe saw Daniel standing unconsciously, in the lobby, with his solemn\nface and grave air, to receive the congregation, much as he faced his\ncustomers at the coffee-stall. She learned to know the minister by\nsight, the tall, thin, pale gentleman who passed through a side door,\nwith his head bent as if in deep thought, while two little girls, about\nher own age, followed him with sedate yet pleasant faces. Jessica took\na great interest in the minister’s children. The younger one was fair,\nand the elder was about as tall as herself, and had eyes and hair as\ndark; but oh, how cared for, how plainly waited on by tender hands!\nSometimes, when they were gone by, she would close her eyes, and wonder\nwhat they would do in one of the high black pews inside, where there\nwas no place for a ragged barefooted girl like her; and now and then\nher wonderings almost ended in a sob, which she was compelled to stifle.\n\nIt was an untold relief to Daniel that Jessica did not ply him with\nquestions, as he feared, when she came for breakfast every Wednesday\nmorning; but she was too shrewd and cunning for that. She wished him\nto forget that she had ever been there, and by-and-by her wish was\naccomplished, and Daniel was no longer uneasy, while he was lighting\nthe lamps, with the dread of seeing the child’s wild face starting up\nbefore him.\n\nBut the light evenings of summer-time were drawing near apace, and\nJessica foresaw with dismay that her Sunday treats would soon be over.\nThe risk of discovery increased every week, for the sun was later in\nsetting, and there would be no chance of creeping in and out unseen in\nthe broad daylight. Already it needed both watchfulness and alertness\nto dart in at the right moment in the gray twilight; but still she\ncould not give it up; and if it had not been for the fear of offending\nMr. Daniel, she would have resolved upon going until she was found out.\nThey could not punish her very much for standing in the lobby of a\nchapel.\n\nJessica was found out, however, before the dusky evenings were quite\ngone. It happened one night that the minister’s children, coming early\nto the chapel, saw a small tattered figure, bareheaded and barefooted,\ndart swiftly up the steps before them and disappear within the lobby.\nThey paused and looked at one another, and then, hand in hand, their\nhearts beating quickly, and the color coming and going on their faces,\nthey followed this strange new member of their father’s congregation.\nThe pew-opener was nowhere to be seen, but their quick eyes detected\nthe prints of the wet little feet which had trodden the clean pavement\nbefore them, and in an instant they discovered Jessica crouching behind\nthe door.\n\n“Let us call Daniel Standring,” said Winny, the younger child, clinging\nto her sister; but she had spoken aloud and Jessica overheard her, and\nbefore they could stir a step she stood before them with an earnest and\nimploring face.\n\n“Oh, don’t have me drove away,” she cried; “I’m a very poor little\ngirl, and it’s all the pleasure I’ve got. I’ve seen you lots of times,\nwith that tall gentleman as stoops, and I didn’t think you’d have me\ndrove away. I don’t do any harm behind the door, and if Mr. Daniel\nfinds me out he wont give me any more coffee.”\n\n“Little girl,” said the elder child, in a composed and demure voice,\n“we don’t mean to be unkind to you; but what do you come here for, and\nwhy do you hide yourself behind the door?”\n\n“I like to hear the music,” answered Jessica, “and I want to find out\nwhat pray is, and the minister, and God. I know it’s only for ladies\nand gentlemen, and fine children like you; but I’d like to go inside,\njust for once, and see what you do.”\n\n“You shall come with us into our pew,” cried Winny, in an eager and\nimpulsive tone; but Jane laid her hand upon her outstretched arm, with\na glance at Jessica’s ragged clothes and matted hair. It was a question\ndifficult enough to perplex them. The little outcast was plainly too\ndirty and neglected for them to invite her to sit side by side with\nthem in their crimson-lined pew, and no poor people attended the chapel\nwith whom she could have a seat. But Winny, with flushed cheeks and\nindignant eyes, looked reproachfully at her elder sister.\n\n“Jane,” she said, opening her Testament, and turning over the leaves\nhurriedly, “this was papa’s text a little while ago: ‘For if there come\nunto your assembly a man with a gold ring, in goodly apparel, and there\ncome in also a poor man in vile raiment; and ye have respect to him\nthat weareth the gay clothing, and say unto him, Sit thou here in a\ngood place; and say to the poor, Stand thou there, or sit here under my\nfootstool; are ye not then partial in yourselves, and are become judges\nof evil thoughts?’ If we don’t take this little girl into our pew we\n‘have the faith of our Lord Jesus Christ, the Lord of glory, with\nrespect of persons.’”\n\n“I don’t know what to do,” answered Jane, sighing; “the Bible\nseems plain, but I’m sure papa would not like it. Let us ask the\nchapel-keeper.”\n\n“Oh, no, no!” cried Jessica, “don’t let Mr. Daniel catch me here. I\nwont come again, indeed; and I’ll promise not to try to find out about\nGod and the minister, if you’ll only let me go.”\n\n“But, little girl,” said Jane, in a sweet but grave manner, “we ought\nto teach you about God, if you don’t know him. Our papa is the\nminister, and if you’ll come with us we’ll ask him what we must do.”\n\n“Will Mr. Daniel see me?” asked Jessica.\n\n“Nobody but papa is in the vestry,” answered Jane, “and he’ll tell us\nall, you and us, what we ought to do. You’ll not be afraid of him, will\nyou?”\n\n“No,” said Jessica cheerfully, following the minister’s children as\nthey led her along the side of the chapel towards the vestry.\n\n“He is not such a terrible personage,” said Winny, looking round\nencouragingly, as Jane tapped softly at the door, and they heard a\nvoice saying, “Come in.”\n\n\n\n\nCHAPTER V. A NEW WORLD OPENS.\n\n\nThe minister was siting in an easy chair before a comfortable fire with\na hymn-book in his hand, which he closed as the three children appeared\nin the open doorway. Jessica had seen his pale and thoughtful face many\na time from her hiding-place, but she had never met the keen, earnest,\nsearching gaze of his eyes, which seemed to pierce through all her\nwretchedness and misery, and to read at once the whole history of her\ndesolate life. But before her eyelids could droop, or she could drop\na reverential courtesy, the minister’s face kindled with such a glow\nof pitying tenderness and compassion as fastened her eyes upon him,\nand gave her new heart and courage. His children ran to him, leaving\nJessica upon the mat at the door, and with eager voices and gestures\ntold him the difficulty they were in.\n\n“Come here, little girl,” he said, and Jessica walked across the\ncarpeted floor till she stood right before him, with folded hands, and\neyes that looked frankly into his.\n\n“What is your name, my child?” he asked.\n\n“Jessica,” she answered.\n\n“Jessica?” he repeated, with a smile; “that is a strange name.”\n\n“Mother used to play ‘Jessica’ at the theatre, sir,” she said, “and I\nused to be a fairy in the pantomime, till I grew too tall and ugly. If\nI’m pretty when I grow up mother says I shall play too; but I’ve a\nlong time to wait. Are you the minister, sir?”\n\n“Yes,” he answered, smiling again.\n\n“What is a minister?” she inquired.\n\n“A servant!” he replied, looking away thoughtfully into the red embers\nof the fire.\n\n“Papa!” cried Jane and Winny, in tones of astonishment; but Jessica\ngazed steadily at the minister, who was now looking back again into her\nbright eyes.\n\n“Please, sir, whose servant are you?” she asked.\n\n“The servant of God and of man,” he answered solemnly. “Jessica, I am\nyour servant.”\n\nThe child shook her head, and laughed shrilly as she gazed round the\nroom and at the handsome clothing of the minister’s daughters, while\nshe drew her rags closer about her and shivered a little, as if she\nfelt a sting of the east wind which was blowing keenly through the\nstreets. The sound of her shrill childish laugh made the minister’s\nheart ache.\n\n“Who is God?” asked the child. “When mother’s in a good temper,\nsometimes she says ‘God bless me!’ Do you know him, please, minister?”\n\nBut before there was time to answer the door into the chapel was\nopened and Daniel stood upon the threshold. At first he stared blandly\nforward, but then his grave face grew ghastly pale, and he laid his\nhand upon the door to support himself until he could recover his speech\nand senses. Jessica also looked about her, scared and irresolute, as if\nanxious to run away or to hide herself. The minister was the first to\nspeak.\n\n“Jessica,” he said, “there is a place close under my pulpit where you\nshall sit, and where I can see you all the time. Be a good girl, and\nlisten, and you will hear something about God. Standring, put this\nlittle one in front of the pews by the pulpit steps.”\n\nBefore she could believe it, for very gladness, Jessica found herself\ninside the chapel, facing the glittering organ, from which a sweet\nstrain of music was sounding. Not far from her Jane and Winny were\npeeping over the front of their pew with friendly smiles and glances.\nIt was evident that the minister’s elder daughter was anxious about\nher behavior, and she made energetic signs to her when to stand and\nwhen to kneel; but Winny was content with smiling at her whenever her\nhead rose above the top of the pew. Jessica was happy, but not in the\nleast abashed. The ladies and gentlemen were not at all unlike those\nwhom she had often seen when she was a fairy at the theatre; and very\nsoon her attention was engrossed by the minister, whose eyes often\nfell upon her, as she gazed eagerly, with uplifted face, upon him. She\ncould scarcely understand a word of what he said, but she liked the\ntones of his voice and the tender pity of his face as he looked down\nupon her. Daniel hovered about a good deal, with an air of uneasiness\nand displeasure, but she was unconscious of his presence. Jessica was\nintent upon finding out what a minister and God were.\n\n\n\n\nCHAPTER VI. THE FIRST PRAYER.\n\n\nWhen the service was ended the minister descended the pulpit steps\njust as Daniel was about to hurry Jessica away, and taking her by the\nhand in the face of all the congregation he led her into the vestry,\nwhither Jane and Winny quickly followed them. He was fatigued with\nthe services of the day, and his pale face was paler than ever, as he\nplaced Jessica before his chair, into which he threw himself with an\nair of exhaustion; but bowing his head upon his hands he said, in a low\nbut clear tone, “Lord, these are the lambs of thy flock. Help me to\nfeed thy lambs!”\n\n“Children,” he said, with a smile upon his weary face, “it is no\neasy thing to know God. But this one thing we know, that he is our\nFather--my Father and your Father, Jessica. He loves you, and cares for\nyou more than I do for my little girls here.”\n\nHe smiled at them, and they at him, with an expression which Jessica\nfelt and understood, though it made her sad. She trembled a little, and\nthe minister’s ear caught the sound of a faint though bitter sob.\n\n“I never had any father,” she said sorrowfully.\n\n“God is your Father,” he answered very gently: “he knows all about you,\nbecause he is present everywhere. We cannot see him, but we have only\nto speak and he hears us, and we may ask him for whatever we want.”\n\n“Will he let me speak to him, as well as these fine children, that are\nclean and have got nice clothes?” asked Jessica, glancing anxiously at\nher muddy feet, and her soiled and tattered frock.\n\n“Yes,” said the minister, smiling, yet sighing at the same time; “you\nmay ask him this moment for what you want.”\n\nJessica gazed round the room with large wide-open eyes, as if she were\nseeking to see God; but then she shut her eyelids tightly, and bending\nher head upon her hands, as she had seen the minister do, she said, “O\nGod! I want to know about you. And please pay Mr. Daniel for all the\nwarm coffee he’s give me.”\n\nJane and Winny listened with faces of unutterable amazement; but the\ntears stood in the minister’s eyes, and he added “Amen” to Jessica’s\nfirst prayer.\n\n\n\n\nCHAPTER VII. HARD QUESTIONS.\n\n\nAfter waiting until the minister left the vestry Daniel found that\nJessica had gone away by the side entrance. He had to wait, therefore,\nuntil Wednesday morning for an opportunity to speak to her, and the\nsight of her pinched little face was welcome to him when he saw it\nlooking wistfully over the coffee-stall. Yet he had made up his mind to\nforbid her to come again, and to threaten her with the policeman if he\never caught her at the chapel, where for the future he intended to keep\na sharper lookout. But before he could speak Jess had slipped under\nthe stall and taken her old seat upon the upturned basket.\n\n“Mr. Daniel,” she said, “has God paid you for my sups of coffee yet?”\n\n“Paid me?” he repeated, “God? No.”\n\n“Well, he will,” she answered, nodding her head sagely; “don’t you be\nafraid for your money, Mr. Daniel; I’ve asked him a many times, and the\nminister says he’s sure to do it.”\n\n“Jess,” said Daniel, sternly, “have you been and told the minister\nabout my coffee-stall?”\n\n“No,” she answered, with a beaming smile, “but I’ve told God lots and\nlots of times since Sunday, and he’s sure to pay in a day or two.”\n\n“Jess,” continued Daniel, more gently, “you’re a sharp little girl, I\nsee; and now, mind, I’m going to trust you. You’re never to say a word\nabout me or my coffee-stall; because the folks at our chapel are very\ngrand, and might think it low and mean of me to keep a coffee-stall.\nVery likely they’d say I mustn’t be chapel-keeper any longer, and I\nshould lose a deal of money.”\n\n“Why do you keep the stall then?” asked Jessica.\n\n“Don’t you see what a many pennies I get every morning?” he said,\nshaking his canvas bag. “I get a good deal of money that way in a year.”\n\n“What do you want such a deal of money for?” she inquired; “do you give\nit to God?”\n\nDaniel did not answer, but the question went to his heart like a\nsword-thrust. What did he want so much money for? He thought of his\nbare and solitary room, where he lodged alone, a good way from the\nrailway-bridge, with very few comforts in it, but containing a desk,\nstrong, securely fastened, and in which were his savings’ bank book,\nhis receipts for money put out at interest, and a bag of sovereigns,\nfor which he had been toiling and slaving both on Sunday and week-days.\nHe could not remember giving any thing away, except the dregs of the\ncoffee and the stale buns for which Jessica was asking God to pay him.\nHe coughed, and cleared his throat, and rubbed his eyes; and then,\nwith nervous and hesitating fingers, he took a penny from his bag and\nslipped it into Jessica’s hand.\n\n“No, no, Mr. Daniel,” she said; “I don’t want you to give me any of\nyour pennies. I want God to pay you.”\n\n“Ay, he’ll pay me,” muttered Daniel; “there’ll be a day of reckoning\nby and by.”\n\n“Does God have reckoning days?” asked Jessica. “I used to like\nreckoning days when I was a fairy.”\n\n“Ay, ay,” he answered, “but there’s few folks like God’s reckoning\ndays.”\n\n“But you’ll be glad; wont you?” she said.\n\nDaniel bade her get on with her breakfast, and then he turned over in\nhis mind the thoughts which her questions had awakened. Conscience told\nhim he would not be glad to meet God’s reckoning day.\n\n“Mr. Daniel,” said Jessica, when they were about to separate, and he\nwould not take back his gift of a penny, “if you wouldn’t mind, I’d\nlike to come and buy a cup of coffee to-morrow, like a customer, you\nknow; and I wont let out a word about the stall to the minister next\nSunday. Don’t you be afraid.”\n\nShe tied the penny carefully into a corner of her rags, and with a\ncheerful smile upon her thin face she glided from under the shadow of\nthe bridge and was soon lost to Daniel’s sight.\n\n\n\n\nCHAPTER VIII. AN UNEXPECTED VISITOR.\n\n\nWhen Jessica came to the street into which the court where she\nlived opened, she saw an unusual degree of excitement among the\ninhabitants, a group of whom were gathered about a tall gentleman\nwhom she recognized in an instant to be the minister. She elbowed her\nway through the midst of them, and the minister’s face brightened as\nshe presented herself before him. He followed her up the low entry,\nacross the squalid court, through the stable, empty of the donkeys just\nthen, up the creaking rounds of the ladder, and into the miserable\nloft where the tiles were falling in and the broken window-panes were\nstuffed with rags and paper. Near to the old rusty stove, which served\nas a grate when there was any fire, there was a short board laid across\nsome bricks, and upon this the minister took his seat, while Jessica\nsat upon the floor before him.\n\n“Jessica,” he said, sadly, “is this where you live?”\n\n“Yes,” she answered; “but we’d a nicer room than this when I was a\nfairy and mother played at the theatre; we shall be better off when I’m\ngrown up, if I’m pretty enough to play like her.”\n\n“My child,” he said, “I’m come to ask your mother to let you go to\nschool in a pleasant place down in the country. Will she let you go?”\n\n“No,” answered Jessica; “mother says she’ll never let me learn to\nread, or go to church; she says it would make me good for nothing. But\nplease, sir, she doesn’t know any thing about your church, it’s such\na long way off, and she hasn’t found me out yet. She always gets very\ndrunk of a Sunday.”\n\nThe child spoke simply, and as if all she said was a matter of course;\nbut the minister shuddered, and he looked through the broken window to\nthe little patch of gloomy sky overhead.\n\n“What can I do?” he cried mournfully, as though speaking to himself.\n\n“Nothing, please, sir,” said Jessica, “only let me come to hear\nyou of a Sunday, and tell me about God. If you was to give me fine\nclothes--like your little girls’--mother ’ud only pawn them for gin.\nYou can’t do any thing more for me.”\n\n“Where is your mother?” he asked.\n\n“Out on a spree,” said Jessica. “She wont be home for a day or two.\nShe’d not hearken to you, sir. There’s the missionary came, and she\npushed him down the ladder till he was nearly killed. They used to call\nmother ‘the vixen’ at the theatre, and nobody durst say a word to her.”\n\nThe minister was silent for some minutes, thinking painful thoughts,\nfor his eyes seemed to darken as he looked round the miserable room,\nand his face wore an air of sorrow and disappointment. At last he spoke\nagain.\n\n“Who is Mr. Daniel, Jessica?” he inquired.\n\n“Oh,” she said cunningly, “he’s only a friend of mine as gives me sups\nof coffee. You don’t know all the folks in London, sir!”\n\n“No,” he answered, smiling, “but does he keep a coffee-stall?”\n\nJessica nodded her head, but did not trust herself to speak.\n\n“How much does a cup of coffee cost?” asked the minister.\n\n“A full cup’s a penny,” she answered promptly; “but you can have half a\ncup; and there are half-penny and penny buns.”\n\n“Good coffee and buns?” he said, with another smile.\n\n“Prime,” replied Jessica, smacking her lips.\n\n“Well,” continued the minister, “tell your friend to give you a full\ncup of coffee and a penny bun every morning, and I’ll pay for them as\noften as he chooses to come to me for the money.”\n\nJessica’s face beamed with delight, but in an instant it clouded over\nas she recollected Daniel’s secret, and her lips quivered as she spoke\nher disappointed reply.\n\n“Please, sir,” she said, “I’m sure he couldn’t come; oh! he couldn’t.\nIt’s such a long way, and Mr. Daniel has plenty of customers. No, he\nnever would come to you for money.”\n\n“Jessica,” he answered, “I will tell you what I will do. I will trust\nyou with a shilling every Sunday, if you’ll promise to give it to your\nfriend the very first time you see him. I shall be sure to know if you\ncheat me.” And the keen, piercing eyes of the minister looked down into\nJessica’s, and once more the tender and pitying smile returned to his\nface.\n\n“I can do nothing else for you?” he said, in a tone of mingled sorrow\nand questioning.\n\n“No, minister,” answered Jessica, “only tell me about God.”\n\n“I will tell you one thing about him now,” he replied. “If I took you\nto live in my house with my little daughters you would have to be\nwashed and clothed in new clothing to make you fit for it. God wanted\nus to go and live at home with him in heaven, but we were so sinful\nthat we could never have been fit for it. So he sent his own Son to\nlive among us, and die for us, to wash us from our sins, and to give us\nnew clothing, and to make us ready to live in God’s house. When you ask\nGod for any thing you must say, ‘For Jesus Christ’s sake.’ Jesus Christ\nis the Son of God.”\n\nAfter these words the minister carefully descended the ladder,\nfollowed by Jessica’s bare and nimble feet, and she led him by the\nnearest way into one of the great thoroughfares of the city, where he\nsaid good-by to her, adding, “God bless you, my child,” in a tone which\nsank into Jessica’s heart.\n\nHe had put a silver sixpence into her hand to provide for her breakfast\nthe next three mornings, and with a feeling of being very rich she\nreturned to her miserable home.\n\nThe next morning Jessica presented herself proudly as a customer at\nDaniel’s stall, and paid over the sixpence in advance.\n\nHe felt a little troubled as he heard her story, lest the minister\nshould endeavor to find him out; but he could not refuse to let the\nchild come daily for her comfortable breakfast. If he was detected, he\nwould promise to give up his coffee-stall rather than offend the great\npeople of the chapel; but unless he was it would be foolish of him to\nlose the money it brought in week after week.\n\n\n\n\nCHAPTER IX. JESSICA’S FIRST PRAYER ANSWERED.\n\n\nEvery Sunday evening the barefooted and bareheaded child might be seen\nadvancing confidently up to the chapel where rich and fashionable\npeople worshipped God; but before taking her place she arrayed herself\nin a little cloak and bonnet which had once belonged to the minister’s\nelder daughter, and which was kept with Daniel’s serge gown, so that\nshe presented a somewhat more respectable appearance in the eyes of\nthe congregation. The minister had no listener more attentive, and he\nwould have missed the pinched, earnest little face if it were not to\nbe seen in the seat just under the pulpit. At the close of each service\nhe spoke to her for a minute or two in his vestry, often saying no\nmore than a single sentence, for the day’s labor had wearied him. The\nshilling, which was always lying upon the chimney-piece, placed there\nby Jane and Winny in turns, was immediately handed over, according to\npromise, to Daniel as she left the chapel, and so Jessica’s breakfast\nwas provided for her week after week.\n\nBut at last there came a Sunday evening when the minister, going up\ninto his pulpit, did miss the wistful, hungry face, and the shilling\nlay unclaimed upon the vestry chimney-piece. Daniel looked out for\nher anxiously every morning, but no Jessica glided into his secluded\ncorner, to sit beside him with her breakfast on her lap and with a\nnumber of strange questions to ask. He felt her absence more keenly\nthan he could have expected. The child was nothing to him, he kept\nsaying to himself; and yet he felt that she was something, and that he\ncould not help being uneasy and anxious about her. Why had he never\ninquired where she lived? The minister knew, and for a minute Daniel\nthought he would go and ask him; but that might awaken suspicion. How\ncould he account for so much anxiety when he was supposed only to know\nof her absence from chapel one Sunday evening? It would be running a\nrisk, and, after all, Jessica was nothing to him. So he went home and\nlooked over his savings bank book and counted his money, and he found\nto his satisfaction that he had gathered together nearly four hundred\npounds, and that he was adding more every week.\n\nBut when upon the next Sunday Jessica’s seat was again empty the\nanxiety of the solemn chapel-keeper overcame his prudence and his\nfears. The minister had retired to his vestry, and was standing with\nhis arm resting upon the chimney-piece, and his eyes fixed upon the\nunclaimed shilling which Winny had laid there before the service, when\nthere was a tap at the door, and Daniel entered with a respectful but\nhesitating air.\n\n“Well, Standring?” said the minister questioningly.\n\n“Sir,” he said, “I’m uncomfortable about that little girl, and I know\nyou’ve been once to see after her; she told me about it; and so I make\nbold to ask you where she lives, and I’ll see what’s become of her.”\n\n“Right, Standring,” answered the minister; “I am troubled about the\nchild, and so are my little girls. I thought of going myself, but my\ntime is very much occupied just now.”\n\n“I’ll go, sir,” replied Daniel promptly; and after receiving the\nnecessary information about Jessica’s home he put out the lights,\nlocked the door, and turned towards his lonely lodgings.\n\nBut though it was getting late upon Sunday evening, and Jessica’s home\nwas a long way distant, Daniel found that his anxiety would not suffer\nhim to return to his solitary room. It was of no use to reason with\nhimself, as he stood at the corner of the street, feeling perplexed\nand troubled, and promising his conscience that he would go the very\nfirst thing in the morning after he shut up his coffee-stall. In the\ndim, dusky light, as the summer evening drew to a close, he fancied he\ncould see Jessica’s thin figure and wan face gliding on before him,\nand turning around from time to time to see if he were following. It\nwas only fancy, and he laughed a little at himself; but the laugh was\nhusky, and there was a choking sensation in his throat, so he buttoned\nhis Sunday coat over his breast, where his silver watch and chain hung\ntemptingly, and started off at a rapid pace for the centre of the city.\n\nIt was not quite dark when he reached the court, and stumbled up the\nnarrow entry leading to it; but Daniel did hesitate when he opened the\nstable-door, and looked into a blank, black space, in which he could\ndiscern nothing. He thought he had better retreat while he could do\nso safely; but as he still stood with his hand upon the rusty latch he\nheard a faint, small voice through the nicks of the unceiled boarding\nabove his head.\n\n“Our Father,” said the little voice, “please to send somebody to me,\nfor Jesus Christ’s sake. Amen.”\n\n“I’m here, Jess,” cried Daniel, with a sudden bound of his heart, such\nas he had not felt for years, and which almost took away his breath as\nhe peered into the darkness until at last he discerned dimly the ladder\nwhich led up into the loft.\n\n\nVery cautiously, but with an eagerness which surprised himself, he\nclimbed up the creaking rounds of the ladder and entered the dismal\nroom, where the child was lying in desolate darkness. Fortunately he\nhad his box of matches in his pocket, and the end of a wax candle with\nwhich he kindled the lamps, and in another minute a gleam of light\nshone upon Jessica’s white features. She was stretched upon a scanty\nlitter of straw under the slanting roof where the tiles had not fallen\noff, with her poor rags for her only covering; but as her eyes looked\nup into Daniel’s face bending over her a bright smile of joy sparkled\nin them.\n\n“Oh!” she cried, gladly, but in a feeble voice, “it’s Mr. Daniel! Has\nGod told you to come here, Mr. Daniel?”\n\n“Yes,” said Daniel, kneeling beside her, taking her wasted hand in his,\nand parting the matted hair upon her damp forehead.\n\n“What did he say to you?” said Jessica.\n\n“He told me I was a great sinner,” replied Daniel. “He told me I\nloved a little bit of dirty money better than a poor, friendless,\nhelpless child, whom he had sent to me to see if I would do her a\nlittle good for his sake. He looked at me, or the minister did, through\nand through, and he said, ‘Thou fool, this night thy soul shall be\nrequired of thee: then whose shall those things be which thou hast\nprovided?’ And I could answer him nothing, Jess. He had come to a\nreckoning with me, and I could not say a word to him.”\n\n“Aren’t you a good man, Mr. Daniel?” whispered Jessica.\n\n“No; I’m a wicked sinner,” he cried, while the tears rolled down his\nsolemn face. “I’ve been constant at God’s house, but only to get money;\nI’ve been steady and industrious, but only to get money; and now God\nlooks at me, and he says, ‘Thou fool!’ Oh, Jess, Jess, you’re more fit\nfor heaven than I ever was in my life!”\n\n“Why don’t you ask him to make you good for Jesus Christ’s sake?” asked\nthe child.\n\n“I can’t,” he said. “I’ve been kneeling down Sunday after Sunday\nwhen the minister’s been praying, but all the time I was thinking\nhow rich some of the carriage people were. I’ve been loving money and\nworshipping money all along, and I’ve nearly let you die rather than\nrun the risk of losing part of my earnings. I’m a very sinful man.”\n\n“But you know what the minister often says,” murmured Jessica:\n\n“‘Herein is love, not that we loved God, but that he loved us, and sent\nhis Son to be the propitiation for our sins.’”\n\n“I’ve heard it so often that I don’t feel it,” said Daniel. “I used to\nlike to hear the minister say it, but now it goes in at one ear and out\nat the other. My heart is very hard, Jessica.”\n\nBy the feeble glimmer of the candle Daniel saw Jessica’s wistful eyes\nfixed upon him with a sad and loving glance; and then she lifted up\nher weak hand to her face, and laid it over her closed eyelids, and her\nfeverish lips moved slowly.\n\n“God,” she said, “please to make Mr. Daniel’s heart soft, for Jesus\nChrist’s sake. Amen.”\n\nShe did not speak again, nor Daniel, for some time.\n\nHe took off his Sunday coat and laid it over the tiny, shivering frame,\nwhich was shaking with cold even in the summer evening; and as he did\nso he remembered the words which the Lord says he will pronounce at the\nlast day of reckoning:\n\n“Forasmuch as ye have done it unto one of the least of these my\nbrethren, ye have done it unto me.”\n\nDaniel Standring felt his heart turning with love to the Saviour,\nand he bowed his head upon his hands, and cried, in the depths of his\ncontrite spirit, “God be merciful to me, a sinner.”\n\n\n\n\nCHAPTER X. THE SHADOW OF DEATH.\n\n\nThere was no coffee-stall opened under the railway arch the following\nmorning, and Daniel’s regular customers stood amazed as they drew\nnear the empty corner where they were accustomed to get their early\nbreakfast. It would have astonished them still more if they could have\nseen how he was occupied in the miserable loft. He had intrusted a\nfriendly woman out of the court to buy food and fuel, and all night\nlong he had watched beside Jessica, who was light-headed and delirious,\nbut in the wanderings of her thoughts and words often spoke to God,\nand prayed for her Mr. Daniel. The neighbor informed him that the\nchild’s mother had gone off some days before, fearing that she was ill\nof some infectious fever, and that she, alone, had taken a little care\nof her from time to time. As soon as the morning came he sent for a\ndoctor, and after receiving permission from him he wrapped the poor\ndeserted Jessica in his coat, and bearing her tenderly in his arms down\nthe ladder he carried her to a cab, which the neighbor brought to the\nentrance of the court. It was to no other than his own solitary home\nthat he had resolved to take her; and when the mistress of the lodgings\nstood at her door with her arms a-kimbo, to forbid the admission of the\nwretched and neglected child, her tongue was silenced by the gleam of a\nhalf-sovereign which Daniel slipped into the palm of her hard hand.\n\nBy that afternoon’s post the minister received the following letter:\n\n“REVERED SIR,\n\n“If you will condescend to enter under my humble roof you will have\nthe pleasure of seeing little Jessica, who is at the point of death,\nunless God in his mercy restores her. Hoping you will excuse this\nliberty, as I cannot leave the child, I remain with duty,\n\n                            “Your respectful servant,\n                                              “D. STANDRING.\n\n“P. S. Jessica desires her best love and duty to Miss Jane and Winny.”\n\nThe minister laid aside the book he was reading, and without any delay\nstarted off for his chapel-keeper’s dwelling. There was Jessica lying\nrestfully upon Daniel’s bed, but the pinched features were deadly\npale, and the sunken eyes shone with a waning light. She was too feeble\nto turn her head when the door opened, and he paused for a moment,\nlooking at her and at Daniel, who, seated at the head of the bed, was\nturning over the papers in his desk, and reckoning up once more the\nsavings of his lifetime. But when the minister advanced into the middle\nof the room Jessica’s white cheeks flushed into deep red.\n\n“Oh, minister,” she cried, “God has given me every thing I wanted\nexcept paying Mr. Daniel for the coffee he used to give me!”\n\n“Ah! but God has paid me over and over again,” said Daniel, rising to\nreceive the minister. “He’s given me my own soul in exchange for it.\nLet me make bold to speak to you this once, sir. You’re a very learned\nman, and a great preacher, and many people flock to hear you till I’m\nhard put to it to find seats for them at times; but all the while,\nhearkening to you every blessed Sabbath, I was losing my soul, and you\nnever once said to me, though you saw me scores and scores of times,\n‘Standring, are you a saved man?’”\n\n“Standring,” said the minister in a tone of great distress and regret,\n“I always took it for granted that you were a Christian.”\n\n“Ah,” continued Daniel, thoughtfully, “but God wanted somebody to ask\nme that question, and he did not find anybody in the congregation, so\nhe sent this poor little lass to me. Well, I don’t mind telling now,\neven if I lose the place; but for a long time, nigh upon ten years,\nI’ve kept a coffee-stall on week-days in the city, and cleared,\none week with another, about ten shillings: but I was afraid the\nchapel-wardens wouldn’t approve of the coffee business, as low, so I\nkept it a close secret, and always shut up early of a morning. It’s me\nthat sold Jessica her cup of coffee, which you paid for, sir.”\n\n“There’s no harm in it, my good fellow,” said the minister kindly; “you\nneed make no secret of it.”\n\n“Well,” resumed Daniel, “the questions this poor little creature has\nasked me have gone quicker and deeper down to my conscience than all\nyour sermons, if I may make so free as to say it. She’s come often and\noften of a morning, and looked into my face with those clear eyes of\nhers, and said, ‘Don’t you love Jesus Christ, Mr. Daniel?’ ‘Doesn’t\nit make you very glad that God is your Father, Mr. Daniel?’ ‘Are we\ngetting nearer heaven every day, Mr. Daniel?’ And one day says she,\n‘Are you going to give all your money to God, Mr. Daniel?’ Ah, that\nquestion made me think indeed, and it’s never been answered till this\nday. While I’ve been sitting beside the bed here I’ve counted up all my\nsavings: £397 18s. it is; and I’ve said, ‘Lord, it’s all thine; and I’d\ngive every penny of it rather than lose the child, if it be thy blessed\nwill to spare her life.’”\n\nDaniel’s voice quavered at the last words, and his face sank upon the\npillow where Jessica’s feeble and motionless head lay. There was a very\nsweet yet surprised smile upon her face, and she lifted her wasted\nfingers to rest upon the bowed head beside her, while she shut her\neyes and shaded them with her other weak hand.\n\n\n“Our Father,” she said in a faint whisper, which still reached the\nears of the minister and the beadle, “I asked you to let me come home\nto heaven; but if Mr. Daniel wants me, please to let me stay a little\nlonger, for Jesus Christ’s sake. Amen.”\n\nFor some minutes after Jessica’s prayer there was a deep and unbroken\nsilence in the room, Daniel still hiding his face upon the pillow, and\nthe minister standing beside them with bowed head and closed eyes, as\nif he also were praying. When he looked up again at the forsaken and\ndesolate child he saw that her feeble hand had fallen from her face,\nwhich looked full of rest and peace, while her breath came faintly but\nregularly through her parted lips. He took her little hand into his\nown with a pang of fear and grief; but instead of the mortal chillness\nof death he felt the pleasant warmth and moisture of life. He touched\nDaniel’s shoulder, and as he lifted up his head in sudden alarm he\nwhispered to him, “The child is not dead, but is only asleep.”\n\nBefore Jessica was fully recovered Daniel rented a little house for\nhimself and his adopted daughter to dwell in. He made many inquiries\nafter her mother, but she never appeared again in her old haunts, and\nhe was well pleased that there was nobody to interfere with his charge\nof Jessica. When Jessica grew strong enough, many a cheerful walk had\nthey together, in the early mornings, as they wended their way to the\nrailway bridge, where the little girl took her place behind the stall\nand soon learned to serve the daily customers; and many a happy day was\nspent in helping to sweep and dust the chapel, into which she had crept\nso secretly at first, her great delight being to attend to the pulpit\nand the vestry, and the pew where the minister’s children sat, while\nDaniel and the woman he employed cleaned the rest of the building.\nMany a Sunday also the minister in his pulpit, and his little\ndaughters in their pew, and Daniel treading softly about the aisles, as\ntheir glance fell upon Jessica’s eager, earnest, happy face, thought\nof the first time they saw her sitting among the congregation, and of\nJessica’s first prayer.\n\n\nBOOK II. Jessica's Mother\n\nCHAPTER I. GREAT PLANS.\n\n\nIt was a gloomy Sunday in the gloomiest part of the year, when the\nfog hung over London day and night, only lifting itself off a little\nfor two or three hours about noon time. The bells which rang from\nthe church towers might have been chiming from some region above the\nclouds, so distant they sounded and so hidden were the belfries in\nwhich they hung.\n\nIn the early part of the day the congregations went to and from their\nvarious places of worship with a feeling of sombre depression at the\nlong continuance of the gloom; but after nightfall the darkness was\nonly natural, and though the lamps gave but little light, and shone\nmerely like yellow balls in the fog, the passengers in the street moved\nmore briskly and talked more cheerfully than in the morning. Here and\nthere the brilliantly illuminated windows of some church or chapel cast\na pleasant gleam upon the pavement, and the open doors seemed to invite\nany cold or weary passer-by to enter into its light and warmth; but\nas if these buildings, the temples of God, were designed only for the\nrich, and for those who had comfort enough in their own dwellings, it\nwas noticeable that but a very scanty sprinkling of worshippers dressed\nin vile raiment were to be seen among the congregations, though there\nwas no lack of those who wore goodly apparel and gay clothing.\n\nThe fashionable chapel of which Daniel Standring was the chapel-keeper\nwas no exception to the general rule, for there were no poor to be\nfound in it. There was within it every appliance of comfort and style\nsuch as could give satisfaction to a wealthy congregation. The oak pews\nwere high enough for the head of an occasional slumberer to repose in\nquiet indulgence, and they were well lined and carpeted and cushioned.\nThe shades for the lamps toned down their light to a clear yet soft\nlustre, and the apparatus for heating the building was of the most\nefficient kind.\n\nThe crowds who flocked to hear the minister were increasing every\nSunday, and Daniel Standring had, with some reluctance, yielded to the\nnecessity of sharing his office of pew-opener with a colleague; a man,\nhowever, of less dignity and solemnity of deportment than himself, and\nwho was quite willing to look up to him as a superior. Moreover, the\nold members of the church, the “carriage people” especially, recognized\nhim only as their chapel-keeper, and entrusted any message or any\ncommission to him alone; and he also retained the charge of attending\nupon the vestry. The other man was no more than a subordinate; and\nafter a while he was reconciled to this division of the office.\n\nThere had been two things much talked about among the people for some\ntime past: the first, that the minister himself should have a colleague\nfound for him, and the second, that a large and still more fashionable\nchapel should be built.\n\nAs to the colleague there were several difficulties in the way, the\nchief one being to find such a preacher as would attract the same\ncongregations as those which came in crowds to listen to the minister;\nfor it was found that whenever it was known that he would be absent\nfrom his pulpit the numbers dwindled away, until during his yearly\nholiday the chapel would seem almost empty, compared to the throng of\ncurious and eager listeners who hung upon his words, and scarcely dared\nto sigh over his representations of their misery and peril lest they\nshould miss hearing a single syllable of the eloquence which described\nit.\n\nStill every member of the congregation said it was essential that\na colleague should be found for their beloved pastor before he had\nquite worn himself out; and great blame was thrown back upon the small\nprovincial church which five-and-twenty years ago had thrust him, a\nmere youth of twenty, upon the exhausting duties of the ministry. As\nfor the second subject, it was settled without much difficulty, for\nonly money, not a man, was wanted; and upon the vestry table there was\na subscription-list already promising some thousands of pounds, and\nbeside it lay the plans for the new chapel, drawn up by an eminent\narchitect.\n\nThe chapel doors had been opened by Daniel, and the gas toned down to\nprecisely the brilliance and softness which the congregation loved,\nespecially the lamps on each side of the pulpit, which shed a revealing\nlight upon the minister’s thoughtful face and upon his dark hair\njust tinged with grey. In the vestry Jessica had just given a final\nand delicate stroke of dusting, and was wiping the large pulpit Bible\nand hymn-book with her clean pocket-handkerchief ready for Daniel to\ncarry up into the pulpit while the organist was playing the opening\nvoluntary, which he did with so solemn and ministerial an aspect that\na stranger, not accustomed to the etiquette of the place, might be\nbetrayed into the supposition that he was the minister himself.\n\nDaniel was waiting now in the porch like some faithful steward ready\nto receive his master’s guests; and as carriage after carriage rolled\nup almost a smile of satisfaction softened his rigid features. The\nminister’s children had passed him with a smile and a nod, and he had\nshut the door of their pew in the corner, so he knew the minister\nwas come, and putting a little additional briskness in his manner he\nlooked out for seats for the strangers who were filling the aisles, at\nthe same time listening for the first notes of the organ.\n\nThe minister had entered the vestry just as Jessica had finished wiping\nthe imaginary dust off the Bible and hymn-book, and he drew his chair\nup close to the fire, as if coming through the fog had chilled him. He\nlooked sad and downcast, and his head sank forward upon his breast.\nFor a minute Jessica stood behind his chair in silence, and then she\nstretched out her hand, a small thin hand still, and laid it timidly\nupon his arm.\n\n“Jessica,” said the minister, covering her small palm with his\nscholarly hand, “I am sorrowful to-night, and I have great heaviness of\nheart. Tell me, my child, do you understand what I preach about in my\npulpit?”\n\n“Oh, no, no!” answered Jessica, shaking her head deprecatingly, “only\nwhen you say God, and Jesus Christ, and heaven! I know what you mean\nby them.”\n\n“Do you?” said the minister, with a very tender smile; “and do I say\nthem often, Jessica?”\n\n“Sometimes they come over and over again,” replied Jessica, “and then I\nfeel very glad, because I know what you are preaching about. There is\nalways God in your sermon, but sometimes there isn’t Jesus Christ and\nheaven.”\n\n“And what do I mean by God, and Jesus Christ, and heaven?” he asked.\n\n“I don’t know anything but what you’ve taught me,” said Jessica,\nfolding her brown hands meekly over one another; “you’ve told me that\nGod is the Father of our souls, and Jesus Christ is our elder brother,\nwho came down from heaven to save us, and heaven is the home of God,\nwhere we shall all go if we love and serve him. I don’t know any more\nthan that.”\n\n“It is enough!” said the minister, lifting up his head with a brighter\nlook; “one soul has learned the truth from me. God bless you, Jessica,\nand keep you in his fear and love for evermore.”\n\nAs he spoke the deep tones of the organ fell upon their ears, and the\nvestry door was opened by Daniel, coming for the pulpit books. There\nwas an air of solemn pride upon his face, and he bowed lower than usual\nto his minister.\n\n“There’s a vast crush of people to-night, sir,” he said; “the aisles\nand the galleries are all full, and there’s a many standing at the door\nyet who will have to go away, for there’s no room for them.”\n\nThe minister covered his face with his hands and shivered, with the\ncold no doubt; and Daniel and Jessica were leaving the vestry when they\nwere called back by his voice speaking in husky and agitated tones.\n\n“Standring,” he said, “I have something of importance to say to you\nafter the service this evening, so come back here as soon as the\ncongregation is gone. And, Jessica, take care to sit in your own\nplace, where I can see you; for I will preach about Jesus Christ and\nheaven to-night.”\n\nJessica answered only by a little nod, and left the vestry by a door\nwhich did not open into the chapel. In a minute or two afterwards she\nwas making her way up the crowded aisles to her usual seat at the foot\nof the pulpit steps, where, with her head thrown back, her face lifted\nitself up to the minister’s gaze.\n\nShe had just time to settle herself and glance at the minister’s\nchildren, who were looking out for her, when the last quiet notes of\nthe organ ceased, and the vestry door opened. The minister mounted the\nstairs slowly, and with his head bent down, but as soon as he was in\nthe pulpit he looked round upon the faces whose eyes were all fastened\nupon him.\n\nMany of the faces he knew, and had seen thus upraised to him for scores\nof Sundays, and his eyes passed from one to another swiftly, but with\na distinguishing regard of which he had never been conscious before,\nand their names swept across his memory like sudden flashes of light.\nThere sat his own children, and his eyes rested fondly upon them as\nthey looked up to him; and he smiled tenderly to himself as his glance\ncaught the flushed and fervent face of Jessica.\n\nThe sermon he had prepared during the week was one of great research\nand of studied oratory, which should hold his hearers in strained\nand breathless attention; but as he bowed down his head in silent\nsupplication for the blessing of God he said to himself, “I will preach\nto this people from the saying of Christ, ‘He calleth His own sheep by\nname, and leadeth them out.’”\n\n\n\n\nCHAPTER II. IT’S ONLY A STROKE.\n\n\nThe first part of the service passed by as usual, disturbed only by the\noccasional rustle of a silk dress, or the carefully hushed footstep up\nthe aisles of some late comer, and the moment for the prayer before the\nsermon was come. Every head was bent, and a deep stillness prevailed,\nwhich grew more and more profound as the minister’s voice still\nremained silent, as if he was waiting until there was no stir or rustle\nor movement to be heard throughout the congregation.\n\nThere was something awful in this solemn pause before his voice was\nlifted up to God; and, as it prolonged itself, a sigh, it might have\nbeen from the minister’s inmost heart, was heard by those nearest to\nthe pulpit. One or two looked up, and saw his head bowed down, with\nthe softened light of the lamps falling upon the silvery streaks of his\nhair, and they dropped their faces again upon their hands, waiting.\nThen there ran a thrill and a shiver through all the congregation,\nand here and there a sob which could no longer be repressed broke the\nlaboring silence.\n\nAfter that there were whispers and murmurs, and faces lifted up with\na vague dread upon them; and still the minister did not raise his\nface from the crimson cushion that his voice might allay the growing\nagitation. His children were looking up at last; and Jessica had risen\nfrom her knees and was gazing up with eager eyes to his drooping head.\n\nThere was a stir now, and the spell of silence was broken; while\nJessica, forgetful of everything but her deep love for him, ran swiftly\nup the steps and touched him timidly with her hand. The minister\nneither spoke nor moved.\n\nThe great congregation was in a tumult instantly, standing up, and\ntalking, and crying out with hysterical sobs, and pushing out of their\npews, and thronging towards the pulpit. In a few minutes the minister\nwas carried down into the vestry, and the crowd gathered about the\ndoor of it. Some of the chief men belonging to the chapel urged the\ncongregation to disperse and return to their homes; but they were\ntoo much excited to leave before it was known what had befallen the\nminister.\n\nJessica pushed her way--being small and nimble, and used to crowds--to\nthe very door of the vestry, where Daniel stood to guard it from being\ninvaded by too many strangers; and she waited there beside him until\nthe door was opened by a hand-breadth, and a physician whispered from\nwithin, “It is not death, but a stroke.”\n\nMore quickly than the words could be carried from lip to lip among the\ncrowd Jessica glided through the midst to the pew where the minister’s\nchildren were kneeling, with arms about one another, sobbing out\ninarticulate prayers to God. She stood for a moment beside them,\nscarcely knowing what to say, and then she fell down on her knees by\nWinny, and put her lips close to her ear.\n\n“Miss Winny,” she said with a trembling voice, “the doctor says it’s\nnothing but a stroke. He isn’t taken with death, Miss Jane; it’s only a\nstroke.”\n\nThe children started up eagerly and caught Jessica’s hands, clinging\nto her as some one older and wiser than themselves. They had had no\nbitter taste of life’s troubles before this, for their mother had been\ntaken from them before they were old enough to understand their loss,\nand their lives had been tenderly smoothed and cared for. That Jessica\nshould bring them some intelligence and consolation in their sudden\npanic of dread invested her with a kind of superiority; so now they\nlooked to her as one who could help and counsel them.\n\n“What is a stroke, Jessica?” asked Jane, looking imploringly towards\nher with her white face.\n\n“I don’t hardly know,” answered Jessica. “I know what strokes used to\nbe when I lived with mother; but this is different, Miss Jane; this\nstroke comes from God, and it cannot be very bad.”\n\nThe children were all three of them silent after Jessica had spoken:\nbut each one of them was gathering comfort and strength from her\nwords. It was a stroke which had come from God, and therefore it could\nnot be very bad. No one had seen it fall; no one had known that the\nFather’s hand was lifted up to strike, and it had come down softly\nand gently, only hushing the voice and shutting up the gateway of the\nsenses. Now that it was known, the chapel was gradually emptying as\nthe congregation went away, and Jane and Winny, feeling calmed and\nstrengthened, were ready to listen to their nurse, who was now anxious\nto take them home.\n\n“Let Jessica come home with us, nurse,” said Winny, who still held\nJessica’s hand between both her own. The nurse consented willingly,\nand in a few minutes they were walking homewards, one on each side\nof Jessica. They felt strangely bewildered still; but Jessica was\nlike a guide to them, leading them through the fog and over the slimy\ncrossings with familiar confidence, until they reached the door of the\nminister’s house, when she hung back shyly, as if not meaning to go in\nwith them.\n\n“You mustn’t leave us yet,” cried Winny, impetuously. “Papa is not come\nhome, and I’m a little bit afraid. Aren’t you afraid, Jessica?”\n\n“No,” answered Jessica cheerfully. “It can’t be anything dreadful bad.”\n\n“You must come in and stay with us,” said Jane, the calm sedateness of\nher manner a little shaken by her fears. “Nurse, we will take Jessica\ninto papa’s study till he comes home.”\n\nThe three children went quietly up stairs to the study and sat down\nby the fire, which was burning brightly, as if waiting to welcome\nthe minister’s return after the labors of the day. The minister had\ngathered about him many books, so that every part of the large room was\nfilled with them.\n\nOn the table lay those which he had been studying during the week,\nwhile he was preparing his elaborate sermon which was to have\nastonished and electrified even his accustomed hearers; and upon the\ndesk there were scattered about the slips of paper upon which he\nhad jotted down some of the profound thoughts which only a few of\nhis people could comprehend. But upon the chimney-piece, at the end\nwhere his easy-chair was placed, and close to his hand, lay a small\npocket-Bible, so worn with much reading that there was no book in his\nstudy like it.\n\nThe troubled children sitting on the hearth knew nothing of the\nprofound and scholarly volumes on the table; but they were familiar\nwith the little Bible, and Winny, taking it in her hand, lifted it to\nher lips and kissed it fondly.\n\n“Papa always used to read and talk to us on a Sunday night after we had\ncome home,” she said sorrowfully, speaking already as if the custom was\none long past, which could never be resumed.\n\n“Does a stroke last long, Jessica?” inquired Jane, with a look of deep\nanxiety.\n\n“I’m not sure,” answered Jessica. “Mother’s strokes were sharp and soon\nover, but the smart lasted a long while. Maybe the stroke is now over,\nbut perhaps the smart will last a little while. God knows.”\n\n“Yes,” said Jane, the tears standing in her eyes, “and God knows what\nis best for papa and us. We’ve known that a long time, but now we must\nbelieve it with our hearts.”\n\n“Believing is a deal harder than knowing,” remarked Winny, with\na look wonderfully like her father’s, and the three children were\nsilent again, their minds full of thought, while they listened for the\nminister’s return to his home.\n\n\n\n\nCHAPTER III. JESSICA’S MOTHER.\n\n\nThey were heavy steps which the three listening children heard at\nlast in the hall below, and upon the staircase the sounds of carrying\na helpless burden up the stairs, and Jane and Winny pressed closer\nto Jessica, who looked from one to the other with an air of tender\nencouragement. As the sounds drew near, they crept by one impulse to\nthe door, and opening it a little way they saw their father’s face as\nhe was carried past them, pale but peaceful, with the eyelids closed\nas if he were in a deep sleep. Jessica’s quick eyes detected Daniel\nstanding in the darkness at the end of the passage, and as soon as the\nsad procession had passed into the minister’s chamber, and the door was\nshut, she darted out and led him eagerly to the study.\n\n“Oh, Standring!” cried Jane and Winny in one breath, “tell us\neverything about papa.”\n\n“Come, come, you needn’t be frightened, my little ladies,” answered\nDaniel soothingly. “Please God, your papa will be all right again in a\nweek or two. The doctors say he’s been studying too much to make his\ngrand sermons, and he hasn’t given his brain rest enough. But he’ll\ncome all right again by and by, or I don’t know whatever will become of\nthe chapel.”\n\n“He won’t die?” murmured Jane, with quivering lips.\n\n“Die!--oh, no!” said Daniel. “Why, my dears, you’re all of a tremble.\nIt would be the best for you to go to bed, for you can’t do any good\nsitting up.”\n\n“Standring,” said Winny, “I wish you’d let Jessica stay all night with\nus. She could sleep with nurse; and our room is inside nurse’s, and if\nwe leave the door open we could talk to one another.”\n\n“She may stay and welcome, if nurse likes, Miss Winny,” answered\nDaniel; and as the nurse was anxious for her children to feel their new\nsorrow as lightly as possible she was glad to grant their request.\n\nSo after a while it happened that Daniel was wending his way alone,\nthrough the fog and the damp of the streets, towards a little house in\na quiet and respectable sort of court, where for the last three years\nhe had dwelt with his adopted child. His mind had been fully occupied\nwith the strange events of the night and the paralysis of his stricken\nmaster; but now that he was alone, and his thoughts were free to return\nto his own affairs, they suddenly recalled to him the minister’s last\nwords to himself.\n\nWhat could it be of importance that he had to say to him when the\nevening service was finished? His brain had been busy with guesses, in\nspite of his conscience, during the singing of the hymns, and even\nduring the first prayer, when he stood at the chapel-door to arrest\nthe entrance of any late comer until it should be ended. Something of\nimportance, and now the minister could not reveal it to him!\n\nHe knew that at a private committee meeting, during the past week, a\nplan had been proposed for erecting a small residence close to the new\nchapel and schoolrooms, where the chapel-keeper might dwell; and it had\nbeen suggested that his salary should be raised to such a sum as would\nfree him from the necessity of seeking any other employment. In fact,\nthe care of the chapel would be work enough, for it was to be very\nlarge and magnificent; and already his duties filled up four clear days\nof the week.\n\nCould it be to speak about this the minister had desired him to come\ninto his vestry immediately after the congregation had departed? But\nit was not so much the minister’s business as that of the chief men\nbelonging to the church. Could it be anything about Jessica? It did\nnot seem very likely; yet the minister was very partial to Jessica, and\nalways seemed pleased to see her about the vestry, and he was talking\nto her very kindly when Daniel went to fetch the pulpit books. It was\na hard thing to pacify his awakened curiosity, and he supposed nobody\ncould satisfy it but the minister himself. How long was the stroke\nlikely to last?\n\nDaniel was asking himself this question, which neither he nor any one\nelse could answer, just as he reached the door of his dwelling. There\nwas a dim light from a lamp at the entrance of the court, and there\nwas the red gleam of his own fire shining upon the white window-blind\nwithin, so that he could distinguish pretty plainly the figure of a\nperson, which looked more like a heap of rags, crouching upon his\ndoor-sill. A tattered coat was tied round the neck by the sleeves,\nand an old brimless hat was drawn over the back of the head; but\nthe tangled hair, which hung in ragged locks over the face, was too\nlong for a man’s; and as he stooped down to look more closely it was\ncertainly a woman’s face which was turned towards him.\n\n“Come, come,” he said, “you’ve no business here, you know; so you’d\nbetter get up and go home. You don’t belong to this place, and you’ve\nmade a mistake coming here. This is my house.”\n\nHe had his key in his hand, ready to let himself in where the\ncomfortable fire was waiting for him; but he could not open the door\nuntil the miserable creature had moved, and, though she raised herself\na little, she did not get up on her feet.\n\n“I don’t belong to any place,” she answered suddenly, yet fiercely;\n“and I haven’t made a mistake in coming here. You’re Daniel Standring,\nand I’m Jessica’s mother.”\n\nDaniel reeled for a instant as if he had been struck by a very heavy\nblow. He had long ago ceased to trouble himself about Jessica’s mother,\nor to dread her reappearance; and the minister had assured him that,\nif she should ever return to claim her daughter, he would use all his\ninfluence to protect Jessica from her, as being an unfit person to have\nthe training of a child. The woman was standing up now, but leaning\nher back against his door, snapping her fingers at him with her face\nstretched out, with a glare of angry defiance in her bright eyes which\nsparkled through the gloom.\n\n“I’ve nearly had the door down,” she said, with a hoarse laugh, “till\nall your neighbors came out to see what was the matter; but I scared\nthem in again. The police himself turned tail like a coward.” And she\nlaughed again so loud that the quiet court seemed to ring with the\nsound, and a door or two was cautiously opened, and Daniel saw his\nneighbors peeping out; all of them decent people, who held him in\nrespect as the chapel-keeper of so fashionable a chapel.\n\n“I want my daughter,” she cried, in high, shrill notes; “my Jessica, my\ndaughter. Where is she, you scoundrel?”\n\n“Come, now, then,” answered Daniel, emboldened by the advance of two or\nthree of the men, who came up to form a flank of defence or resistance,\n“this behavior won’t do. Jessica isn’t here; so you’d better take\nyourself off. I wouldn’t give her up to you if she was here; but she\nisn’t here, and there’s an end of it.”\n\nThe woman seated herself once more upon the sill and leaned her head\nagainst the door-post.\n\n“If you go in, I go in,” she said, doggedly; “and if I stay out, you\nstay out. I want my Jessica.”\n\nIt was an embarrassing position for Daniel. He did not like to resort\nto force in order to enter his house, for several reasons. First,\nand chiefly, he was now too sincere a Christian to choose any violent\nor ungentle measures, but, besides this, the person before him was a\nwoman, and the mother of Jessica; and he was himself in a softened\nmood, from the excitement and sorrow of the evening. He stretched out\nhis arm and fitted the key into the lock, but before he turned it he\nlooked as closely as he could through the gloom into the woman’s face.\n\n“You’re not drunk, are you?” he said.\n\n“Neither sup nor drop has passed my lips to-day,” she answered, with a\ngroan of suffering.\n\n“Well, well!--come in,” said Daniel; “and you too, Mr. Brookes, if you\nplease. I’m not myself at all to-night; and it ’ud hearten me to have\nsomebody to back me. Come in.”\n\nHe opened the door into a comfortable and neat room, where everything\nwas arranged with scrupulous order; for he was an orderly man by\nnature and Jessica had already the thrifty habits of a housekeeper. The\nfire had been well raked over with small coals before he and Jessica\nstarted for chapel, and now it was a bank of glowing embers.\n\nThe woman tottered across to the hearth and flung herself into Daniel’s\narm-chair. They could see now how wan and hollow her face was, with the\ncheeks fallen in and the burning eyes sunk deep into the head, while,\nas she stretched out her thin and yellow hands over the fire, the red\ngleam shone through them. The poor tatters she wore were limp and\ndank with fog, and the slippers into which her naked feet were thrust\nwere worn out at the toes, so as to give free inlet to the mud of the\npavement.\n\nDaniel regarded her in silence for a minute or two, and he then passed\non into a small kitchen at the back and returned quickly with some\nbread and cheese and some coffee, which he warmed up in a little\nsaucepan. She drank the coffee eagerly, but she could not swallow more\nthan a mouthful or two of the bread.\n\n“And this is Jessica’s home,” she said, when she was revived a little;\n“and a very comfortable home too. Eh! but I’m a lucky mother, and she’s\na lucky girl. Will she be in to-night, Mr. Standring?”\n\n“No,” answered Daniel, shortly.\n\n“Well, I can make myself comfortable,” she said, with a laugh which\nmade Daniel shiver. “I dare say her bed is softer than any I’ve slept\non of late. Last night I slept under a scaffolding on some shavings.\nDon’t put yourself out about me. I can make myself comfortable.”\n\n“But you cannot stay here all night,” replied Daniel decisively.\n\n“And why not?” she rejoined. “I suppose I’m as good as my daughter. Ah,\nshe’ll never be the woman I’ve been! I rode in my carriage once, man,\nI can tell you. And what should hinder me staying a night, or a week,\nor a month in your paltry little house? No, no! you’ll not see my back\nto-night, I promise you.”\n\n“I wouldn’t give you a night’s lodging for five shillings,” said Daniel\nhastily.\n\n“I not going to give you five farthings for it,” said the woman,\nsettling herself in his arm-chair with an air of impudent defiance.\n“Jessica’s home is my home. If you turn me out, out she goes with me.”\n\nDaniel drew his neighbor aside into the kitchen, where he consulted\nwith him in whispers while he kept his eye upon his terrible visitor\nthrough the open door.\n\n“What am I to do with her?” he asked. “I wouldn’t have her stop\nhere for anything. Jessica is staying all night with the minister’s\nchildren; but she’ll come back to-morrow. Whatever am I to do?”\n\n“Give her some money to go away,” answered Brookes; and after a little\nheavy-hearted hesitation Daniel resolved to act upon his advice. He\nreturned into his comfortable little parlor, which in some way had\nnever looked even to himself so comfortable and pleasant; and he\naddressed his visitor with a determined and resolute aspect.\n\n“Now,” he said, “if you won’t go away peaceable I’ll send for a\npoliceman, as sure as I’m the chapel-keeper of St. John’s Chapel. I\ndon’t want to be violent with you, for I’m a Christian man; but I don’t\nknow that a Christian man is bound to give you a lodging in his own\nhouse. I should rather think he wasn’t. But if you will go away quiet,\nhere is a shilling to pay for a bed and breakfast elsewhere. That’s all\nI can do or say. It’s that, or the police.”\n\nThe woman deliberated for a few minutes, looking hard into Daniel’s\nface; but there was no sign of irresolution or relenting upon his grave\nfeatures; and at last she raised herself slowly and weariedly from the\nchair, and dragged her slip-shod feet across the floor towards him. She\ntook the shilling sullenly from his hand and without a word passed into\nthe cold and damp of the streets, while Daniel watched her unsteady\nsteps down the court with a feeling of relief.\n\nBut when Brookes was gone, and the door was locked for the night, and\nthe agreeable warmth of the glowing fire wrapped round him, he could\nnot keep his thoughts from wondering where the wretched woman had found\na shelter. His mind also looked onwards with misgiving to the future\nwhich lay immediately before him and Jessica; and again he lamented\non his own account that he could not go for counsel to Jessica’s\nother friend, the minister who had been stricken into silence and\nunconsciousness even concerning interests still nearer and dearer to\nhis heart.\n\n\n\n\nCHAPTER IV. JESSICA’S CHOICE.\n\n\nEarly the next morning Daniel went to the minister’s house, half hoping\nthat he should hear that the malady of the night before had been only a\ntemporary insensibility, from which he had recovered. But the minister\nlay in the same state of unconsciousness, and showed no sign of\nreturning life. The nurse told him that a ragged and miserable woman,\nwho called herself Jessica’s mother, had seen him during the Sunday\nafternoon, and held a long conversation with him, after which he had\nordered some food to be given her in the kitchen.\n\nThis, then, no doubt, was the subject upon which the minister wished to\nspeak to Daniel; and the latter felt more than ever lost in doubt as to\nwhat he ought to do, as it was now impossible to hear the advice which\nhis master had intended to give to him.\n\nHe walked thoughtfully towards the chapel, with Jessica beside him,\nscarcely knowing how to break the news to her. She was a little sad,\nand less talkative than usual, and her small hand was thrust lovingly\ninto his own, as if she felt that it was needful to assure herself\nthat it could return her warm grasp. When they opened the vestry-door,\nand, going in, saw all the confusion which bore testimony of the last\nnight’s calamity, Daniel drew the child closer to him with his arm, and\nbending down stiffly kissed her uplifted face.\n\n“He isn’t going to die,” said Jessica, with a trembling voice; “he is\nonly resting himself, the doctor says, and then he will know us again,\nand speak to us all.”\n\n“To think,” cried Daniel, in a mournful amazement, “that he should have\nspoken thousands and thousands of words, ay! millions! and I scarce\ngave an ear to them; and now I’d almost offer a golden guinea for every\nword he could speak to me! Ay! Jessica, so that he spoke pretty short\nand simple, I’d give a guinea a word if he could tell me what I ought\nto do.”\n\n“Do you want him to say something particular?” asked Jessica.\n\n“Ay! very particular,” answered Daniel.\n\n“Couldn’t you ask God?” suggested Jessica.\n\n“Well,” he answered, doubtfully, “of course I could; but then there’s\nno direct answer, which I couldn’t mistake. My mother used to open her\nBible and take the first words she set her eyes on for answer; and very\nqueer answers they were sometimes. I’m not good enough yet to expect a\nvery clear answer to my prayers.”\n\nJessica made no answer, for Daniel’s mode of reasoning was a little\nobscure to her; but she set to work to put the scattered chairs in\norder, while Daniel looked on with loving but troubled eyes.\n\n“Jessica,” he said, “the trouble I’d like to talk to him about is that\nyour mother’s come back again.”\n\nShe started, and looked at him with great, wide-open eyes of amazement\nand terror, while her face quivered, and she twitched her small\nshoulders a little, as if already shrinking from a blow. But the\nexpression of pain and fear passed away quickly, and though her face\nwas pale a smile came upon it.\n\n“Doesn’t God know that mother’s come back?” she asked.\n\nThere was no need for Daniel to answer her question, but he turned\nit over and over again in his own mind with something very much like\ndoubt. It seemed as if it would have been so much better, especially\nat this crisis, for Jessica’s mother to remain absent that it was as\nif God had given up His particular providence over the affairs of\ninsignificant people like himself and Jessica. It would be no wonder\nif amid all the affairs of the hosts of angels, and the myriads of\nworlds of which he had a vague idea, that God should overlook a little\nmatter like the tramping to and fro of a drunken woman. It was a\nsaddening thought; but Daniel was in the mood to cherish it.\n\n“Do you know where mother is?” asked Jessica.\n\n“No, deary,” answered Daniel. “I gave her a shilling last night to pay\nfor her lodging and breakfast. She told me she’d had nothing to eat\nor drink all day; but the nurse said she’d been to see the minister\nyesterday afternoon and had a good meal. She’s sure to come again.”\n\n“Ay, she’s sure to come again,” echoed Jessica.\n\n“And so,” continued Daniel, “nurse and me have agreed you’d better stay\nwith the young ladies for a bit, out of the way like, till I can see\nhow I can settle with your mother. You’d be glad to stay with Miss\nJane and Winny, Jessica?”\n\n“Yes,” she answered, her face quivering again, as if she could scarcely\nkeep herself from crying, “but I’d like to see my mother.”\n\n“See your mother!” repeated Daniel, with unfeigned astonishment;\n“whatever for, Jessica?”\n\n“She’s my mother,” replied Jessica, “and the Lord Jesus Christ had a\nmother. Oh! I’d like to see her again, and tell her about God, and\nJesus Christ, and heaven. Perhaps she’d become a good woman!”\n\nShe could control herself no longer, and throwing herself on her knees\nbefore the minister’s chair she hid her face in her hands, and Daniel\nheard that amid her sobs she was murmuring some prayer to God for her\nmother. This was a new perplexity, that Jessica should wish to see her\ncruel and hard-hearted mother; but there was something in it which he\ncould neither blame nor gainsay. He would rather have kept Jessica in\nsafety at the minister’s house than have her exposed to the frequent\nand violent visits of the drunken woman to his own little dwelling; but\nif Jessica decided otherwise he would not oppose her. His house did not\nseem the same place without her presence in it.\n\n“Choose for yourself, deary,” he said, very gently: “come home with me,\nand run the chance of your mother coming again soon; or go back to Miss\nJane and Winny, who are so fond of you, and where everything is fine,\nand you’ll be in such good company. Choose for yourself.”\n\n“I’ll go home with you,” said Jessica, getting up from her knees with a\ncheerful smile. “I couldn’t think this morning who’d sweep the kitchen,\nand get the breakfast. I’d rather go home with you, if you please.”\n\nIt was impossible for Daniel not to be gratified at Jessica’s choice,\nhowever troubled he might be with the idea of her mother’s disturbance\nof their peace; for home was not home without her. They kept very near\nto one another all day at their work, and it was late at night before\nthey returned home, where they found no one sitting upon the doorsteps,\nas Daniel timorously expected. But their neighbor Brookes informed them\nthat Jessica’s mother had been sobbing and crying before the closed\ndoor during a great part of the evening.\n\n\n\n\nCHAPTER V. HOW A CHRISTIAN OUGHT TO ACT.\n\n\nDaniel was very anxious that Jessica should not be exposed to her\nmother’s violence at any time during his absence, when he would not\nbe there to protect her from any ill-usage; and as he was almost\nconstantly engaged with the chapel affairs for the next two or three\ndays he and Jessica were never at home until late in the evening.\n\nBut upon Thursday night as they turned into the court Jessica’s quick\neye saw a woman’s figure leaning against the door-post of their house.\nShe stood still for an instant, clasping Daniel’s hand with close and\ntimid grasp and then, quitting him, she ran forward, and stretching\nout both her hands, almost as if she wished to throw herself into her\nmother’s arms, she cried, “Mother! mother!”\n\nThe woman laughed loudly and shrilly, and flung her shriveled arms\nabout Jessica, fondling her with a maudlin fondness; Jessica drew back\nsorrowfully, and lifted herself on tip-toe to whisper into Daniel’s ear:\n\n“She’s a little drunk, you know,” she said, “but she isn’t very bad\nyet. She isn’t furious. What shall we do?”\n\nIt was precisely the question Daniel was asking of himself, for he\ncould not bear the idea of taking a drunken woman into his respectable\nand orderly house; and yet, could he turn out Jessica’s mother before\nJessica’s eyes? He paused for some minutes before unlocking the door,\nwhile the woman continued to talk in a foolish strain to her child, but\nat last he felt compelled to open it, and she was the first to push her\nway in. She took possession again of his arm-chair, and tossed her old,\ntattered hat into a corner of the room, while he looked on in helpless\nand deep dismay.\n\n“Mother,” said Jessica, speaking to her in gentle but steady tones,\n“this isn’t your house at all, and you can’t stay here. It’s Mr.\nDaniel’s house: but I dare say he’ll let me give you some supper, and\nthen you’d better go away, and come to see me again when you’re quite\nyourself.”\n\nThe woman fastened her red and sunken eyes upon Jessica, and then burst\ninto a fit of passionate lamenting, while she drew the child closer to\nher.\n\n“Oh! I wish I was a better woman!” she cried. “I’ve been driven to it,\nJessica. But I’m coming to live here with you now, and be decent like\nthe rest of you. I’m going to turn over a new leaf, and you’ll see how\nsteady I’ll be. I’ll be no disgrace to any of you.”\n\n“But, mother,” said Jessica, “you can’t live here, because it’s Mr.\nDaniel’s house, and he only took me out of charity, when I was ill and\nyou left me. We can’t look for him to take you.”\n\n“If you stay, I stay,” said her mother, in a tone of obstinacy, setting\nher elbows firmly upon the arms of the chair, and planting her feet on\nthe floor; “or, if I go, you go. I’d like to know who’d have the heart\nto separate a mother from her own child!”\n\nJessica stood for a minute or two looking at her mother with eyes full\nof sadness and pity, and then she crept to Daniel’s side, and whispered\nto him with an air of pleading:\n\n“I don’t think she ever knew that God is our Father,” she said.\n\nDaniel found himself at a complete loss as to what he ought to do.\nThe miserable creature before him shocked every sense of decency and\npropriety, which had been firmly and rigidly rooted in his nature; and\nthe very sight of her, drunken and disorderly, upon his hearth, was an\nabomination to him. Since she had last spoken she had fallen into a\nbrief slumber, and her grey, uncovered head was shaking and nodding\nwith an imbecile aspect. Jessica was going upstairs, for what he did\nnot know, unless it was to make some arrangement for her mother’s\naccommodation; and he remained motionless, staring at the wretched\nwoman with a feeling of abhorrence and disgust which increased every\nmoment.\n\nBut presently he heard Jessica’s light steps descending the stairs, and\nstarted with surprise when she came into the room. She had changed her\ntidy dress for the poorest and oldest clothing in her possession, and\nshe approached him with a sorrowful but patient look upon her face.\n\n“Mr. Daniel,” she said, unconsciously falling back into speaking the\nold name by which she had first called him, “you mustn’t go to take\nmother in out of charity, as well as me. That ’ud never do. So I’ll go\naway with her to-night, and in the morning, when she’s sober, I’ll\ntell her all about God, and Jesus Christ, and heaven. She doesn’t know\nit yet, but maybe when she hears every thing she’ll be a different\nwoman; like me, you know; and then we can all help her to be good. Only\nI must go away with her to-night, or she’ll get into a raging fury like\nshe used to do.”\n\n“No, no, no!” cried Daniel vehemently. “I couldn’t let you go, dear.\nWhy, Jessica, I love you more than my money, don’t I? God knows I\nlove you better. I’d rather lose all my money, ay, and my place as\nchapel-keeper, than lose you.”\n\n“You aren’t going to lose me,” said Jessica, with the same patient\nbut sorrowful light in her eyes, “I’m only going away for a little\nwhile with my mother. She’s my mother, and I want to tell her all\nI know--that she may go to heaven as well as us. I’ll come back\nto-morrow.”\n\n“She shall stay here,” said Daniel, hesitatingly.\n\n“No, no,” answered Jessica, “that ’ud never do. She’ll be for stopping\nalways if you give in once. You’d better let me go with her this one\nnight; and to-morrow morning, when she’s all right, I’ll tell her\neverything. She’ll be very low then, and she’ll hearken to me. Mother!\nI’m ready to go with you.”\n\nThe woman opened her swollen eyelids and staggered to her feet, laying\nher hand heavily upon the slight shoulder of Jessica, who looked from\nher to Daniel with a clear, sad, brave smile, as she bent her childish\nshoulders a little under her mother’s hand, as if they felt already the\nheavy burden that was falling upon her life. It was a hard moment for\nDaniel, and he was yet doubtful whether he should let them both go, or\nkeep them both; but Jessica had led her mother to the door, and already\nher hand was upon the latch.\n\n“Stop a minute, Jessica,” he said; “I’ll let you go with her this once,\nonly there’s a lodging-house not far off, and I’ll come with you and\nsee you safe for the night, and pay your lodgings.”\n\n“All right!” answered Jessica, with a quick, sagacious nod; and in a\nfew minutes they were walking along the streets, Jessica between her\nmother and Daniel, all of them very silent, except when the woman broke\nout into a stave or two of some old, long-forgotten song. Before long\nthey reached the lodging-house of which Daniel had spoken, and he saw\nthem safely into the little, close, dark closet which was to be their\nbedroom.\n\n“Good-night,” said Daniel, kissing Jessica with more than usual\ntenderness; “you don’t feel as if you’d like to come back with me, now\nwe’ve seen your mother comfortable, do you?”\n\n“No,” answered Jessica, with a wistful look from him to her mother, who\nhad thrown herself upon the bed and was fast asleep already. “I think\nI’m doing what God would like me to do; aren’t I? He knows she is my\nmother.”\n\n“Ay, God bless you, my dear,” said Daniel, turning away quickly, and\nclosing the door behind him. He stumbled down the dark stairs into the\nstreet, and returned to his desolate home, saying to himself, “I’m sure\nI don’t know how a Christian ought to act in this case; and there’s\nnobody to go and ask now.”\n\n\n\n\nCHAPTER VI. DANIEL’S PRAYER.\n\n\nThe two following days, Friday and Saturday, were always a busy time\nat the chapel, for the whole place had to be swept and dusted in\npreparation for the coming Sunday. Never had Daniel felt so depressed\nand downhearted as when he entered the chilly and empty chapel early in\nthe morning and alone; for Jessica was to follow him by and by, when\nher mother had strolled away for the day to her old haunts.\n\nOnly a week ago he and Jessica had gone cheerfully about their work\ntogether, Jessica’s blithe, clear young voice echoing through the place\nas she sang to herself, or called to him from some far-off pew, or down\nfrom the gallery. But now everything was upset and in confusion. He\nmounted the pulpit steps, and after shaking the cushions, and dusting\nevery ledge and crevice, he stood upright in a strange and solemn\nreverie, as he looked round upon the empty pews, which were wont to be\nso crowded on a Sunday.\n\nIt would make a wonderful difference to the place, he thought, if\nanything worse should happen to his master; for even to himself Daniel\ncould not bear to say the sad word, death. They could never find his\nlike again. Never! he repeated, laying his hand reverently upon the\ncrimson cushion, where the minister’s grey head had sunk in sudden\ndumbness before God; and two large solemn tears forced themselves into\nDaniel’s eyes, and rolled slowly down his cheeks.\n\nHe did not know who ever would fill the pulpit even on the coming\nSabbath; but he felt that he could never bear to stay at the chapel\nafter its glory was departed, and see the congregation dwindling down,\nand growing more and more scanty every week, until only a few drowsy\nhearers came to listen sleepily to a lifeless preacher. No! no! That\nwould go a good way towards breaking his heart.\n\nBesides all this, how he longed to be able to ask the minister what\nhe ought to do about Jessica’s mother! But whether for instruction in\nthe pulpit or for counsel in private the minister’s voice was hushed;\nand Daniel’s heart was not a whit lighter, as he slowly descended the\npulpit steps.\n\nIt was getting on for noon before Jessica followed him, bringing his\ndinner with her in a little basket. Her eyes were red with tears, and\nshe was very quiet while he ate with a poor appetite the food she set\nbefore him. He felt reluctant to ask after her mother; but when the\nmeal was finished Jessica drew near to him, and took hold of his hand\nin both her own.\n\n“Mr. Daniel,” she said, very sorrowfully, “when mother awoke this\nmorning I told her everything about Jesus Christ, and God, and heaven;\nand she knew it all before! Before I was born, she said!”\n\n“Ah!” ejaculated Daniel, but not in a tone of surprise; only because\nJessica paused and looked mournfully into his face.\n\n“Yes,” continued Jessica, shaking her head hopelessly, “she knew about\nit, and she never told me; never! She never spoke of God at all, only\nwhen she was cursing. I don’t know now anything that’ll make her a good\nwoman. I thought that if she only heard what I said she’d love God, but\nshe only laughed at me, and said it’s an old story. I don’t know what\ncan be done for her now.”\n\nJessica’s tears were falling fast again, and Daniel did not know how to\ncomfort her. There was little hope, he knew, of a woman so enslaved by\ndrunkenness being brought back again to religion and God.\n\n“If the minister could only see her!” said Jessica. “He speaks as if he\nhad seen God, and talked to him sometimes; and she’d be sure to believe\nhim. I don’t know how to say the right things.”\n\n“No, no!” answered Daniel. “She saw him on Sunday, before he had the\nstroke, and he talked a long time to her. No! she won’t be changed by\nhim.”\n\n“She’s my mother, you know,” repeated Jessica anxiously.\n\n“Ay!” said Daniel, “and that puzzles me, Jessica; I don’t know what to\ndo.”\n\n“Couldn’t we pray to God,” suggested Jessica, again, “now, before we go\non any farther?”\n\n“Maybe it would be the best thing to do,” agreed Daniel, rising\nfrom his chair and kneeling down with Jessica beside him. At first\nhe attempted to pray like some of the church-members at the weekly\nprayer-meeting, in set and formal phrases; but he felt that if he\nwished to obtain any real blessing he must ask for it in simple and\nchildlike words, as if speaking face to face with his Heavenly Father;\nand this was the prayer he made, after freeing himself from the\nceremonial etiquette of the prayer-meetings:\n\n“Lord, thou knowest that Jessica’s mother is come back, and what a\ndrunken and disorderly woman she is, and we don’t know what to do with\nher, and the minister cannot give us his advice. Sometimes I’m afraid\nI love my money too much yet, but, Lord, if it’s that, or anything\nelse that’s hard in my heart, so as to hinder me from doing what the\nSaviour, Jesus Christ, would do if he was in my place, I pray thee to\ntake it away, and make me see clearly what my Christian duty is. Dear\nLord, I beseech thee, keep both me and Jessica from evil.”\n\nDaniel rose from his knees a good deal relieved and lightened in\nspirit. He had simply, with the heart of a child, laid his petition\nbefore God; and now he felt that it was God’s part to direct him.\nJessica herself seemed brighter, for if the matter had been laid in\nGod’s hands she felt that it was certain to come out all right in the\nend.\n\nThey went back to their work in the chapel, and though it was\nmelancholy to remember that their own minister would be absent from the\npulpit on the Sunday which was drawing near, they felt satisfied with\nthe thought that God knew all, and was making all things work together\nfor the good of those who loved him.\n\n\n\n\nCHAPTER VII. A BUSY DAY FOR DANIEL.\n\n\nDaniel went home with Jessica, still disturbed a little with the dread\nof finding his unwelcome visitor awaiting their arrival; but she\nwas not there, and there was no interruption to their quiet evening\ntogether, though both of them started and looked towards the door at\nevery sound of a footstep in the court.\n\nAfter they had had their tea, and while Jessica was putting away the\ntea-things in the kitchen, Daniel unlocked his desk, and took out his\nreceipts for the money he had out on interest. Since he had adopted\nJessica he had not added much to his savings; for besides the cost of\nher maintenance there had also been the expenses of housekeeping. In\nformer times he had scarcely cared how uncomfortable his lodgings\nwere, provided that they were cheap; and he had found that to have a\ntidy and comfortable house of his own involved a great outlay of money.\n\nSometimes a thought had crossed his mind, of which he was secretly\nashamed, that the minister, who seemed so fond of Jessica, or at\nleast some of the rich members of the congregation, might have borne\npart of the charge of her living; but no one had ever offered to do\nanything for her. He had spent his money with a half grudge, and now\nthe question upon his mind was, did God require him to waste--he said\n“waste” to himself--his hardly-earned savings upon a drunken and wicked\nwoman?\n\nIt was a hard trial. He loved Jessica, as he had said, more than his\nmoney, and had never really regretted taking her into his home; she\nwas like a daughter to him, and he was a happier and a better man for\nher companionship. But this woman was an abhorrence to him, a disgust\nand disgrace. She had no more claim upon him than any other of the\nthousands of lost men and women who thronged the streets of London.\n\nSurely God did not require him to take this money, which was the sole\nprovision for his old age; and now that the minister was so stricken\nthere would be no new chapel built for him, and no house for the\nchapel-keeper, and no increase of salary. That was already a settled\npoint, for the physicians who were attending the minister declared\npositively that never again would his over-worked brain be capable of\nsustaining any long strain of thought, such as had drawn together his\neager and attentive congregations.\n\nIt was scarcely even a question whether he would be able to resume his\nposition as pastor of this old church; and under a new minister it\nwas probable the place might be half emptied, and his emoluments as\nchapel-keeper be considerably lessened. He was getting older, too,\nand there was not more than ten years’ work in him. He looked at his\ntreasured receipts, and asked himself, Could it be possible that God\nrequired him to sacrifice his past gains and risk his future comforts\nupon Jessica’s mother?\n\nThen another question, in the very depths of his conscience, was\nwhispered to his heart, which at first was willing to remain deaf to\nthe small and quiet voice; but it grew louder and more clamorous, until\nDaniel found that it must be heard and answered.\n\n“What think you Christ would have done with this woman?” it asked. If\nGod had brought her to that door where He dwelt as a poor carpenter,\nwould He have thrust her back upon the misery of the life which drove\nher again and again to the vilest of her sins? Would Jesus, who came\nto seek as well as to save those who are lost, have balanced a book of\nsavings against the hope, faint though it was, of rescuing the woman’s\nsoul?\n\n“Daniel, Daniel,” answered the quiet voice to his inmost heart, “what\nwould thy Lord have done?” He tried to set it aside, and hush it up,\nwhile he turned the key upon his receipts, telling himself that he had\ndone all that his duty as a Christian demanded of him when he rescued\nand adopted Jessica. But the Spirit of God has a gracious tyranny which\nrequires more and more from the soul which begins to sacrifice itself.\nHe had mastered his love of money for the sake of a child whom he\nloved; now he must conquer it to rescue a wretched woman whom he shrank\nfrom.\n\nThe struggle seemed to last long, but it was ended before Jessica came\nback to the fireside. Daniel’s prayer in the afternoon had been too\nsincere for him to be left in darkness to grope along a wrong path. His\nface wore a smile as Jessica took her sewing and sat down opposite to\nhim; such a smile as rarely lit up his rigid features.\n\n“Jessica,” he said, “God has shown me what to do.”\n\n“Perhaps it’ll be better than the minister himself,” answered Jessica.\n\n“Ay!” answered Daniel. “I don’t think the minister could have told\nme plainer. Why, Jessica, suppose the Lord had been living here, and\nyour mother had come to his door, wouldn’t he have cared for her, and\ngrieved over her, and done everything he could to prevent her going on\nin sin? Well, dear, it seems to me it wouldn’t be altogether right to\ntake her to live with us all at once, because you are a young girl and\nought not to see such ways, and I might get angry with her; but I’ll\nhire a room for her somewhere, that shall be always kept for her, and\nwhenever she comes to it there will be a bed, and a meal for her; and\nwe’ll be very kind to her, and see if by any means we can help to make\nher good.”\n\nJessica had dropped her sewing and drawn near to Daniel; and now she\nflung her arms round his neck, and hid her face upon his breast, crying.\n\n“Why, now, now, my dear!” said Daniel, “what ails you, Jessica?\nWouldn’t the Lord Jesus have made a plan something like that? Come,\ncome; we’ll pray to him to make her a good woman, and then--who\nknows?--she may come here to live with us.”\n\n“She’s my own mother, you know,” sobbed Jessica, as if these words\nalone were thoughts in her heart.\n\n“Yes!” answered Daniel, “and we must do our best for her. Jessica, I\nknow now that I love God more than aught else in this world or the\nnext.”\n\nIt was a knowledge worth more than all the riches of earth; and as\nDaniel sat in his chimney-corner he could hardly realize his own\nhappiness. To be sure that he loved God supremely, and to have the\nwitness in himself that he did so! He felt as if he could take all\nthe world of lost and ruined sinners to his heart, and, like Christ\nhimself, lay down his life for them. There was only one shadow, if\nit could be called a shadow, upon his joy unspeakable, and full of\ncomfort--it was that he could not gladden the heart of the minister by\ntelling him of this change in his nature.\n\nThe next day was a very busy one for Daniel; for besides his ordinary\nduties he charged himself with finding a suitable place for Jessica’s\nmother. He met with a room at last in the dwelling of a poor widow, who\nwas glad to let him have it on condition that he paid the rent of the\nhouse.\n\nHe and Jessica bought a bed and a chair and a table, and put everything\nin readiness for their expected visitor. Scanty as was the furniture,\nit was a warm and certain shelter for the poor vagrant, who spent half\nher nights shivering under archways or in unfinished buildings; and\nnever had Daniel felt so pure a gratification as when he gave a last\nlook at the room, and taking Jessica by the hand went back to his own\nhome, no longer afraid of meeting the woman on his threshold.\n\n\n\n\nCHAPTER VIII. HOPES OF RECOVERY.\n\n\nIt was a happy Sunday for Daniel, in spite of the minister’s absence\nand the downcast looks of the congregation as they occupied their\naccustomed seats. The chapters read out of the Bible had new meaning\nfor him, and the singing brought happy tears to his eyes. It seemed as\nif he had never truly known God before; and though the sermon, by a\nstudent merely, was one which he would have criticised with contempt\na week ago, now it was pleasant only to hear the names of his God and\nSaviour; just as one is pleased to hear even a stammering tongue speak\nthe praises of those we love.\n\nDuring the evening service Jessica went to stay with the minister’s\nchildren. Jane came down to her in the hall and told her they were to\nsit in their father’s room while the strange nurse and their own nurse\nwere having tea together in an adjoining room.\n\n“Nurse thinks,” said Jane, “that, if papa knew, he would like us to\nsit with him this Sunday evening; and sometimes we think he does know,\nthough he never speaks, and he seems to be asleep all the time. We\nare to read our chapter and say our hymns just as if he could hear.\nAnd nurse says he told your mother only last Sunday that he loves you\nalmost like one of his own little girls. So we said we should like you\nto come and read with us; for you are not a bit afraid, Jessica.”\n\nThey had mounted the stairs while Jane was whispering these sentences;\nand now, hand in hand, they entered the minister’s room.\n\nThere was a fire burning and a lamp lit upon a table, so that the\nminister’s face could be plainly seen, as they stole with tender\ncaution to his side.\n\nIt had been a pale face always, but it was very colorless now; the lids\nwere closed lightly over the eyeballs, which seemed almost to burn and\nshine through them; and the lips, which might have been speaking words\nthat seemed to bring his listeners almost into the presence of God,\nwere locked in silence. Yet the face was full of life, which rippled\nunderneath, as it were; as if the colorless cheeks, and thin eyelids,\nand furrowed forehead were only a light mask; and while the children\ngazed upon it the lips moved slowly, but soundlessly.\n\n“He is talking to God,” whispered Jessica, in a tone of awe.\n\n“Jessica,” said Winny, pressing close to her, “I can’t help thinking\nabout Paul, when he was caught up into the third heaven and heard\nunspeakable words. I think perhaps he looked like my father.”\n\nShe had never called him father before, and she uttered it in a\nstrangely solemn voice, as if it was a more fitting title than the\nfamiliar one they had called him by on ordinary days. They stood beside\nhim for a few minutes, and then they crept on tiptoe across to the\nhearth. The children read their chapter, and said their hymns, and\nsang a favorite one of their father’s, in soft low tones which could\nscarcely have been heard outside the room; and the little timepiece\nover the fireplace chimed seven as they finished.\n\n“It was just this time last Sunday,” said Jane, “when papa had the\nstroke. He was just going to pray when the chapel-clock struck seven.”\n\n“I wonder what he was going to say?” said Winny, sorrowfully.\n\n“Our Father!” murmured a voice behind them, very low and weak, like the\nvoice of one who has only strength to utter a single cry; and turning\nquickly, with a feeling of fear, they saw their father’s eyes opened,\nand looking towards them with inexpressible tenderness. Jessica laid\nher finger on her lips as a sign to them to be still, and with timid\ncourage she went to the minister’s side.\n\n“Do you know us again?” she asked, trembling between fear and joy; “do\nyou know who we are, minister?”\n\n“Jessica, and my children,” he whispered, with a feeble smile\nfluttering upon his face.\n\n“He is come back!” cried Jessica, returning with swift but noiseless\nsteps to Jane and Winny. “Let us make haste and tell the others. Maybe\nhe is hungry and weak and faint. But he knows us--he is come back to us\nagain.”\n\nIn a few minutes the joyful news was known throughout the house, and\nwas carried to the chapel before the evening service was over; and the\ncongregation, as they dispersed, spoke hopefully of the minister’s\nrecovery. It was the crowning gladness of the day to Daniel, and he\nlingered at the minister’s house, to which he hastened as soon as he\nhad closed the chapel, until it was getting on for midnight; and then\nhe left Jessica with the children and started off for his home with a\nheart in which joy was full.\n\n\n\n\nCHAPTER IX. THE GATE OF DEATH.\n\n\nDaniel had a good way to go, for the minister’s house was in an\nopposite direction to his own from the chapel. The November fogs still\nhung about London, and the lamps gave only a dim light through the\ngloom. Those who were yet walking about the streets marched quickly, as\nif anxious to reach whatever shelter they called their own.\n\nDaniel himself was making his way as fast as he could along the muddy\npavement, when he came to a part of the streets where the drainage was\nbeing repaired, and where charcoal fires were burning in braziers here\nand there, at once to give warning to the passers-by and to afford\nwarmth to the watchmen who stayed beside them all night. One of the\nwatchmen had brought an old door and reared it up against a rude wall\nof stone and bricks so as to form some protection from the rain, which\nnow and then fell in short showers.\n\nHe had quitted his shed, for some reason or other, and as Daniel\ndrew near his steps were arrested; for crouching underneath it, and\nstretching out her shrivelled arms over the brazier full of charcoal,\nwas Jessica’s mother. The fitful light was shining strongly upon her\nface, and showed the deep lines which misery and degradation had\nploughed upon it and the sullenness and stupidity which were stamped\nupon her features.\n\nHe stood still, gazing at her with disgust; but very soon a feeling of\nprofound pity took its place. He had been wondering what had become of\nher since Friday morning, and had even felt a kind of anxiety about\nher; and now, as he thought of the room with its comfortable bed which\nwas waiting for her, instead of the brief shelter of the shed, he\nclimbed over the heaps of rubbish which lay between them, calling to\nher, for he did not know her name, “Jessica’s mother!”\n\nThe woman started to her feet at the sound of his voice, and looked him\nfull in the face with an expression of utter wretchedness. Her eyes\nwere inflamed and swollen with tears, and every feature was quivering\nas if she had no control over them. She was so miserable a creature\nthat Daniel did not know in what words to speak to her; but his heart\nwas moved with an unutterable compassion, unknown to him till now.\n\nHe even felt a sympathy for her, as if he had once been in the same\ndepths of degradation, as he looked down shudderingly into the deep\nabyss where she had fallen by her sins; and the sense of her misery\ntouched him so closely that he would have given his life for her\nsalvation. He stretched out his hand towards her, but she pushed it\naway, and with a groan of despair she fled from the light, and sought\nto hide herself in the darkness of the foggy streets.\n\nBut Daniel was not easily turned aside from his desire to bring some\nhelp to Jessica’s mother, even if it were no more than to rescue her\nfrom the chilliness of the November night. He followed her with steps\nas rapid as her own, and only that she had the first start he would\nhave been quickly at her side. She fled swiftly along the streets to\nescape from him, and he pursued her, hoping that she would soon weary\nand would turn to speak to him.\n\nBut she kept on until Daniel found himself at the entrance of one of\nthe old bridges of the city which span the wide waters of the river.\nSide by side with it a new bridge was being constructed with massive\nbeams of timber, and huge blocks of stone, and vast girders of iron,\nlying like some giant skeleton enveloped in the fog, yet showing dimly\nthrough it by the glare of red lights and blazing torches, which were\nkindled here and there, and cast flickering gleams upon the black\nwaters beneath, into which Daniel looked down with a shiver, as he\npaused for a moment in his pursuit.\n\nBut he had lost sight of the woman when he lifted up his eyes again,\nunless the strange dark figure on one of the great beams stretching\nover the river was the form of Jessica’s mother. He pressed towards it,\nquitting the safety of the old bridge; but, as a wild and very mournful\ncry smote upon his ear, he missed his footing, and fell heavily upon a\npile of masonry at some distance below him.\n\nIt could only have been a minute that he was unconscious, for the\ndeep-toned clock of St. Paul’s had chimed the first stroke of midnight\nas he lost footing, and the boom of the last stroke was still ringing\nthrough the air when he tried to raise himself and look again for the\ndark figure which he had seen hanging over the river; but he could not\nmove, and he lay quietly, without making a second effort, and thinking\nclearly over what had happened.\n\nThere was little doubt that the wretched woman whom he had sought to\nsave had hurried away from all salvation, whether of God or man; and\nyet how was it that, instead of the shock of horror, a perfect peace\npossessed his soul? For a moment it seemed to him that he could hear a\nvoice speaking, through the dull and monotonous splashing of the cold\nwater against the arches below him, and it said to him, “Because thou\nhast been faithful unto death, I will give thee a crown of life.”\n\nWas he going to die? he asked himself, as a pang of extreme agony ran\nthrough all his frame, and extorted a moan from his lips. He was ready\nand willing, if it was the will of God; but he would like to see his\nlittle Jessica again and tell her gently with his own lips that her\nmother was dead, and gone--he could say nothing gentler--to her own\nplace, which God knew of.\n\nThe midnight hour was quieter than usual in the busy city, for it was\nSunday and the night was damp; so Daniel lay for some time before he\nheard the tread of a passer-by upon the bridge above him. He could hear\nmany sounds at a little distance; but he could not raise his voice\nloudly enough to be audible through the splash of the waters. But\nas soon as he heard footsteps on the bridge he cried, with a strong\neffort, “Help me, or I shall die before morning!”\n\nIt seemed a long time, and one of great suffering to him, before he was\nraised up and laid upon the smooth pathway of the bridge. But he did\nnot cry out or groan; and as the little crowd which gathered around him\nspoke in tones of commiseration and kindness he thanked them calmly,\nand with a cheerfulness which deceived them. They bore him to the\nnearest hospital, but as they would have laid him on a bed there he\nstopped them, with great energy and earnestness.\n\n“Let the doctor see me first,” he said, “and tell me whether I am\nlikely to die or live.”\n\nThe doctor’s hand touched him, and there were a few questions put to\nhim, which he answered calmly; and then, as the doctor looked down upon\nhim with a grave face, he looked back with perfect composure.\n\n“I’m a Christian man,” said Daniel, “and I’m not afraid to die. But if\nyou think there’s no chance for me I’d rather go home. I’ve a little\ngirl at home who’d like to be with me all the time till I’m taken away\nfrom her. The key of my house is in my pocket. Let me be taken home.”\n\nThey could not refuse his request; but the doctor told him he might\nlive yet for some days, though the injuries he had received gave no\nhope of his life; to which Daniel replied only by a solemn smile. It\nwas nearly morning before he reached his house, under the care of a\nnurse and a student from the hospital; and thus he entered for the last\ntime the home where he had spent the three happiest years of his life\nwith Jessica.\n\n\n\n\nCHAPTER X. SPEAK OF HIS LOVE.\n\n\nFor several days Daniel suffered great pain, but with such perfect\npeace and joy in his heart that it seemed as if he could scarcely\nrealize or feel his bodily anguish. Jessica was with him constantly;\nand when he was free from pain she read aloud to him, or talked with\nhim of the heaven to which he was going, and which seemed to be open\nto his gaze already, as one catches a glimpse from afar off of some\nbeautiful country basking in the glory of a full noontide sunshine.\n\nThe chapel people came to see him, some of them in the carriages which\nof old set him pondering on their riches; and they left him, marveling\nthat they had known so little of the religiousness of the man who\nhad ushered them to their pews Sunday after Sunday. But as yet the\nminister had not visited him, though he had sent him word that as soon\nas it was possible he would come to see him.\n\nThe last day had arrived; both Daniel and Jessica knew that it was\nthe last day, and she had not stirred from his side since morning;\nand still the minister had not come--had not been able to come to the\ndeath-bed of his old friend. For they were old friends, having met many\ntimes a week for a dozen years in the same chapel; and since Jessica\nhad drawn them closer together the learned and eloquent preacher had\ncared for Daniel’s illiterate soul, and the chapel-keeper had learned\nto pick up some crumbs of nourishment from the great feast which the\nminister prepared week after week for his intellectual congregation. He\nhad not been, but Daniel was undisturbed, and so, patient and peaceful,\nwith a smile upon his lips when he met Jessica’s wistful eyes, he\nwaited for the last hour and the last moment to come.\n\nYet before it was too late, and before his eye grew dim, and his tongue\nnumbed with the chillness of death, the minister arrived, pale in face,\nand bowed down with weakness, and with a trembling voice which faltered\noften as he spoke. They clasped one another’s hands, and looked into\none another’s face with a strange recognition, as if both had seen\nfurther into the other world than they had ever done before, and then\nthe minister sank feebly into the chair beside Daniel’s pillow.\n\n“I will rest here, and stay with you for an hour,” he said.\n\n“It is the last hour,” answered Daniel.\n\n“Be it so,” replied the minister. “I too have looked death in the face.”\n\nThey were silent for a while, while the minister rallied his strength,\nand then he bent his head, his head only, for he was too feeble yet to\nkneel beside the dying man, and he poured forth a prayer to God in his\ninmost heart, but with hesitating lips, which no longer uttered with\nready speech the thoughts which thronged to his brain. The Amen with\nwhich he ended was almost a groan.\n\n“My power is taken from me,” he said; “the Almighty has stricken me in\nthe pride of my heart. I shall never more speak as I used to do, of his\nglory and majesty, and the greatness of his salvation.”\n\n“You can speak of his love,” murmured Daniel.\n\n“Yes,” he answered despondently, “but only as a child speaks. I shall\nnever stir the hearts of the congregation again. My speech will be\ncontemptible.”\n\n“Jessica, tell him what you and I have been talking about,” said Daniel.\n\nJessica lifted up her face from the pillow, and turned it towards the\nminister, a smile struggling through her tears; and though her voice\nwas unsteady to begin it grew calm and clear before she had spoken\nmany words.\n\n“We were talking how he’d never be the chapel-keeper any more, and go\nup into the pulpit to carry the books before you; and then we thought\nit was true, maybe, what the doctor says, that you’d never be well\nenough again to preach in such a big chapel; and so we went on talking\nabout the time when we shall all be in heaven. We said that perhaps God\nwould give you more beautiful thoughts there, and grander words, and\nyou’d still be our minister; and the angels ’ud all come thronging up\nin crowds all about you and us to hearken to what you’d thought about\nJesus Christ and about God; and there’d be a great congregation again.\nOnly whenever you were silent for a minute we could look up and see the\nSaviour himself listening to us all.”\n\nThen the minister bowed his pale face upon his hands; but he did not\nanswer a word.\n\n“There is one thing still I want to say,” said Daniel. “I’ve made my\nwill, and left all I had to Jessica; but I don’t know where she’ll find\na home. If you’d look out for her--”\n\n“Jessica shall come home to me,” interrupted the minister, laying his\nhand upon hers and Daniel’s and clasping them both warmly.\n\n“I’m a Christian man,” whispered Daniel. “I know that I love God, and\nthat he has made me something like himself. There’s a verse about it in\nthe Bible.”\n\n“‘Beloved,’” said the minister, “‘now are we the sons of God, and it\ndoth not yet appear what we shall be: but we know that, when he shall\nappear, we shall be like him; for we shall see him as he is.’”\n\nThere was no stammering of the minister’s speech as he pronounced these\nwords, and his face grew bright, as did the face of the dying man.\nDaniel’s mind wandered a little, and he groped about, as in the dark,\nfor the Bible, which lay upon the bed; and he murmured,\n\n“It’s time to take up the books, for the congregation is waiting, and\nthe minister is ready. I will take them up to heaven.”\n\nHe spoke no more; but the Bible after a while fell from his hand, and\nJessica and the minister, looking upon his face, saw that in heaven he\nwas beholding the face of the Father.\n\nIt proved true that the minister could never again preach a sermon such\nas in former times, when the people listened with strained attention,\nand he was to them as a very lovely song of one that hath a pleasant\nvoice, and playeth well on an instrument; but they heard his words\nand did them not. Yet he was a man of calmer happiness than before;\nand in his quiet country home, where sometimes of a Sunday he mounted\nthe pulpit-steps of a little chapel, and taught a simple congregation\nsimple truths, he drew nearer day by day in spirit to the great\ncongregation who were waiting for him, and before whom his lips should\nnever more be silenced.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      89,
      132,
      1
    ],
    [
      "chapter.title",
      7106,
      7139,
      2
    ],
    [
      "chapter.title",
      12665,
      12707,
      3
    ],
    [
      "chapter.title",
      20907,
      20941,
      4
    ],
    [
      "chapter.title",
      27443,
      27472,
      5
    ],
    [
      "chapter.title",
      31630,
      31659,
      6
    ],
    [
      "chapter.title",
      33726,
      33754,
      7
    ],
    [
      "chapter.title",
      37430,
      37466,
      8
    ],
    [
      "chapter.title",
      43219,
      43263,
      9
    ],
    [
      "chapter.title",
      51701,
      51732,
      10
    ],
    [
      "chapter.title",
      59127,
      59150,
      11
    ],
    [
      "chapter.title",
      68709,
      68740,
      12
    ],
    [
      "chapter.title",
      76013,
      76043,
      13
    ],
    [
      "chapter.title",
      88286,
      88315,
      14
    ],
    [
      "chapter.title",
      94708,
      94748,
      15
    ],
    [
      "chapter.title",
      102055,
      102083,
      16
    ],
    [
      "chapter.title",
      107699,
      107734,
      17
    ],
    [
      "chapter.title",
      114937,
      114969,
      18
    ],
    [
      "chapter.title",
      119432,
      119462,
      19
    ],
    [
      "chapter.title",
      126782,
      126811,
      20
    ]
  ]
}