{
  "content": "The Tale of Two Bad Mice\nBeatrix Potter\n\n\nBOOK 1.\n\n\nONCE upon a time there was a very beautiful doll's-house; it was red\nbrick with white windows, and it had real muslin curtains and a front\ndoor and a chimney.\n\nIT belonged to two Dolls called Lucinda and Jane; at least it belonged\nto Lucinda, but she never ordered meals.\n\nJane was the Cook; but she never did any cooking, because the dinner\nhad been bought ready-made, in a box full of shavings.\n\n\n\nTHERE were two red lobsters and a ham, a fish, a pudding, and some\npears and oranges.\n\nThey would not come off the plates, but they were extremely beautiful.\n\nONE morning Lucinda and Jane had gone out for a drive in the doll's\nperambulator. There was no one in the nursery, and it was very quiet.\nPresently there was a little scuffling, scratching noise in a corner\nnear the fire-place, where there was a hole under the skirting-board.\n\nTom Thumb put out his head for a moment, and then popped it in again.\n\nTom Thumb was a mouse.\n\n\n\nA MINUTE afterwards, Hunca Munca, his wife, put her head out, too; and\nwhen she saw that there was no one in the nursery, she ventured out on\nthe oilcloth under the coal-box.\n\nTHE doll's-house stood at the other side of the fire-place. Tom Thumb\nand Hunca Munca went cautiously across the hearthrug. They pushed the\nfront door--it was not fast.\n\n\n\nTOM THUMB and Hunca Munca went upstairs and peeped into the\ndining-room. Then they squeaked with joy!\n\nSuch a lovely dinner was laid out upon the table! There were tin\nspoons, and lead knives and forks, and two dolly-chairs--all _so_\nconvenient!\n\nTOM THUMB set to work at once to carve the ham. It was a beautiful\nshiny yellow, streaked with red.\n\nThe knife crumpled up and hurt him; he put his finger in his mouth.\n\n\"It is not boiled enough; it is hard. You have a try, Hunca Munca.\"\n\n\n\nHUNCA MUNCA stood up in her chair, and chopped at the ham with another\nlead knife.\n\n\"It's as hard as the hams at the cheesemonger's,\" said Hunca Munca.\n\nTHE ham broke off the plate with a jerk, and rolled under the table.\n\n\"Let it alone,\" said Tom Thumb; \"give me some fish, Hunca Munca!\"\n\n\n\nHUNCA MUNCA tried every tin spoon in turn; the fish was glued to the\ndish.\n\nThen Tom Thumb lost his temper. He put the ham in the middle of the\nfloor, and hit it with the tongs and with the shovel--bang, bang,\nsmash, smash!\n\nThe ham flew all into pieces, for underneath the shiny paint it was\nmade of nothing but plaster!\n\nTHEN there was no end to the rage and disappointment of Tom Thumb and\nHunca Munca. They broke up the pudding, the lobsters, the pears and the\noranges.\n\nAs the fish would not come off the plate, they put it into the red-hot\ncrinkly paper fire in the kitchen; but it would not burn either.\n\n\n\nTOM THUMB went up the kitchen chimney and looked out at the top--there\nwas no soot.\n\nWHILE Tom Thumb was up the chimney, Hunca Munca had another\ndisappointment. She found some tiny canisters upon the dresser,\nlabelled--Rice--Coffee--Sago--but when she turned them upside down,\nthere was nothing inside except red and blue beads.\n\n\n\nTHEN those mice set to work to do all the mischief they\ncould--especially Tom Thumb! He took Jane's clothes out of the chest of\ndrawers in her bedroom, and he threw them out of the top floor window.\n\nBut Hunca Munca had a frugal mind. After pulling half the feathers out\nof Lucinda's bolster, she remembered that she herself was in want of a\nfeather bed.\n\nWITH Tom Thumb's assistance she carried the bolster downstairs, and\nacross the hearth-rug. It was difficult to squeeze the bolster into the\nmouse-hole; but they managed it somehow.\n\n\n\nTHEN Hunca Munca went back and fetched a chair, a book-case, a\nbird-cage, and several small odds and ends. The book-case and the\nbird-cage refused to go into the mouse-hole.\n\nHUNCA MUNCA left them behind the coal-box, and went to fetch a cradle.\n\n\n\nHUNCA MUNCA was just returning with another chair, when suddenly there\nwas a noise of talking outside upon the landing. The mice rushed back\nto their hole, and the dolls came into the nursery.\n\nWHAT a sight met the eyes of Jane and Lucinda!\n\nLucinda sat upon the upset kitchen stove and stared; and Jane leant\nagainst the kitchen dresser and smiled--but neither of them made any\nremark.\n\n\n\nTHE book-case and the bird-cage were rescued from under the\ncoal-box--but Hunca Munca has got the cradle, and some of Lucinda's\nclothes.\n\nSHE also has some useful pots and pans, and several other things.\n\n\n\nTHE little girl that the doll's-house belonged to, said,--\"I will get\na doll dressed like a policeman!\"\n\nBUT the nurse said,--\"I will set a mouse-trap!\"\n\n\nSO that is the story of the two Bad Mice,--but they were not so very\nvery naughty after all, because Tom Thumb paid for everything he broke.\n\nHe found a crooked sixpence under the hearthrug; and upon Christmas\nEve, he and Hunca Munca stuffed it into one of the stockings of Lucinda\nand Jane.\n\n\n\nAND very early every morning--before anybody is awake--Hunca Munca\ncomes with her dust-pan and her broom to sweep the Dollies' house!\n\n    THE END.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}