{
  "content": "Mopsa the Fairy\nJean Ingelow\n\nDEDICATED TO MY DEAR LITTLE COUSIN JANE HOLLWAY.\n\n\n[THE ENCHANTED BAY.\n\n\"Look at those five grand ones with high prows: they were part of the\nSpanish Armada.\"--PAGE 16.]\n\n\nCHAPTER I. ABOVE THE CLOUDS.\n\n  \"And can this be my own world?\n    'Tis all gold and snow,\n  Save where scarlet waves are hurled\n    Down yon gulf below.\"\n  \"'Tis thy world, 'tis my world,\n    City, mead, and shore,\n  For he that hath his own world\n    Hath many worlds more.\"\n\n\nA boy, whom I knew very well, was once going through a meadow, which\nwas full of buttercups. The nurse and his baby sister were with him;\nand when they got to an old hawthorn, which grew in the hedge and was\ncovered with blossom, they all sat down in its shade, and the nurse\ntook out three slices of plum-cake, gave one to each of the children,\nand kept one for herself.\n\nWhile the boy was eating, he observed that this hedge was very high\nand thick, and that there was a great hollow in the trunk of the old\nthorn-tree, and he heard a twittering, as if there was a nest\nsomewhere inside; so he thrust his head in, twisted himself round, and\nlooked up.\n\nIt was a very great thorn-tree, and the hollow was so large that two\nor three boys could have stood upright in it; and when he got used to\nthe dim light in that brown, still place, he saw that a good way above\nhis head there was a nest,--rather a curious one, too, for it was as\nlarge as a pair of blackbirds would have built,--and yet it was made\nof fine white wool and delicate bits of moss; in short, it was like a\ngoldfinch's nest magnified three times.\n\nJust then he thought he heard some little voices cry, \"Jack! Jack!\"\nHis baby sister was asleep, and the nurse was reading a story-book, so\nit could not have been either of them who called. \"I must get in\nhere,\" said the boy. \"I wish this hole was larger.\" So he began to\nwriggle and twist himself through, and just as he pulled in his last\nfoot, he looked up, and three heads which had been peeping over the\nedge of the nest suddenly popped down again.\n\n\"Those heads had no beaks, I am sure,\" said Jack, and he stood on\ntiptoe and poked in one of his fingers. \"And the things have no\nfeathers,\" he continued; so, the hollow being rather rugged, he\nmanaged to climb up and look in.\n\nHis eyes were not used yet to the dim light; but he was sure those\nthings were not birds,--no. He poked them, and they took no notice;\nbut when he snatched one of them out of the nest, it gave a loud\nsqueak, and said, \"O don't, Jack!\" as plainly as possible, upon which\nhe was so frightened that he lost his footing, dropped the thing, and\nslipped down himself. Luckily, he was not hurt, nor the thing either;\nhe could see it quite plainly now: it was creeping about like rather\nan old baby, and had on a little frock and pinafore.\n\n\"It's a fairy!\" exclaimed Jack to himself. \"How curious! and this must\nbe a fairy's nest. Oh, how angry the old mother will be if this little\nthing creeps away and gets out of the hole!\" So he looked down. \"Oh,\nthe hole is on the other side,\" he said; and he turned round, but the\nhole was not on the other side; it was not on any side; it must have\nclosed up all on a sudden, while he was looking into the nest, for,\nlook whichever way he would, there was no hole at all, excepting a\nvery little one high up over the nest, which let in a very small\nsunbeam.\n\nJack was very much astonished, but he went on eating his cake, and was\nso delighted to see the young fairy climb up the side of the hollow\nand scramble again into her nest, that he laughed heartily; upon which\nall the nestlings popped up their heads, and, showing their pretty\nwhite teeth, pointed at the slice of cake.\n\n\"Well,\" said Jack, \"I may have to stay inside here for a long time,\nand I have nothing to eat but this cake; however, your mouths are very\nsmall, so you shall have a piece;\" and he broke off a small piece, and\nput it into the nest, climbing up to see them eat it.\n\nThese young fairies were a long time dividing and munching the cake,\nand before they had finished, it began to be rather dark, for a black\ncloud came over and covered the little sunbeam. At the same time the\nwind rose, and rocked the boughs, and made the old tree creak and\ntremble. Then there was thunder and rain, and the little fairies were\nso frightened that they got out of the nest and crept into Jack's\npockets. One got into each waistcoat pocket, and the other two were\nvery comfortable, for he took out his handkerchief and made room for\nthem in the pocket of his jacket.\n\nIt got darker and darker, till at last Jack could only just see the\nhole, and it seemed to be a very long way off. Every time he looked at\nit, it was farther off, and at last he saw a thin crescent moon\nshining through it.\n\n\"I am sure it cannot be night yet,\" he said; and he took out one of\nthe fattest of the young fairies, and held it up towards the hole.\n\n\"Look at that,\" said he; \"what is to be done now? the hole is so far\noff that it's night up there, and down here I haven't done eating my\nlunch.\"\n\n\"Well,\" answered the young fairy, \"then why don't you whistle?\"\n\nJack was surprised to hear her speak in this sensible manner, and in\nthe light of the moon he looked at her very attentively.\n\n\"When first I saw you in the nest,\" said he, \"you had a pinafore on,\nand now you have a smart little apron, with lace round it.\"\n\n\"That is because I am much older now,\" said the fairy; \"we never take\nsuch a long time to grow up as you do.\"\n\n\"But your pinafore?\" said Jack.\n\n\"Turned into an apron, of course,\" replied the fairy, \"just as your\nvelvet jacket will turn into a tail-coat when you are old enough.\"\n\n\"It won't,\" said Jack.\n\n\"Yes it will,\" answered the fairy, with an air of superior wisdom.\n\"Don't argue with me; I am older now than you are,--nearly grown up,\nin fact. Put me into your pocket again, and whistle as loudly as you\ncan.\"\n\nJack laughed, put her in, and pulled out another. \"Worse and worse,\"\nhe said; \"why, this was a boy fairy, and now he has a mustache and a\nsword, and looks as fierce as possible!\"\n\n\"I think I heard my sister tell you to whistle?\" said this fairy, very\nsternly.\n\n\"Yes, she did,\" said Jack. \"Well, I suppose I had better do it.\" So he\nwhistled very loudly indeed.\n\n\"Why did you leave off so soon?\" said another of them, peeping out.\n\n\"Why, if you wish to know,\" answered Jack, \"it was because I thought\nsomething took hold of my legs.\"\n\n\"Ridiculous child!\" cried the last of the four, \"how do you think you\nare ever to get out, if she doesn't take hold of your legs?\"\n\nJack thought he would rather have done a long-division sum than have\nbeen obliged to whistle; but he could not help doing it when they told\nhim, and he felt something take hold of his legs again, and then give\nhim a jerk, which hoisted him on to its back, where he sat astride,\nand wondered whether the thing was a pony; but it was not, for he\npresently observed that it had a very slender neck, and then that it\nwas covered with feathers. It was a large bird, and he presently found\nthat they were rising towards the hole, which had become so very far\noff, and in a few minutes she dashed through the hole, with Jack on\nher back and all the fairies in his pockets.\n\nIt was so dark that he could see nothing, and he twined his arms round\nthe bird's neck, to hold on, upon which this agreeable fowl told him\nnot to be afraid, and said she hoped he was comfortable.\n\n\"I should be more comfortable,\" replied Jack, \"if I knew how I could\nget home again. I don't wish to go home just yet, for I want to see\nwhere we are flying to, but papa and mamma will be frightened if I\nnever do.\"\n\n\"Oh no,\" replied the albatross (for she was an albatross), \"you need\nnot be at all afraid about that. When boys go to Fairyland, their\nparents never are uneasy about them.\"\n\n\"Really?\" exclaimed Jack.\n\n\"Quite true,\" replied the albatross.\n\n\"And so we are going to Fairyland?\" exclaimed Jack; \"how delightful!\"\n\n\"Yes,\" said the albatross; \"the back way, mind; we are only going the\nback way. You could go in two minutes by the usual route; but these\nyoung fairies want to go before they are summoned, and therefore you\nand I are taking them.\" And she continued to fly on in the dark sky\nfor a very long time.\n\n\"They seem to be all fast asleep,\" said Jack.\n\n\"Perhaps they will sleep till we come to the wonderful river,\"\nreplied the albatross; and just then she flew with a great bump\nagainst something that met her in the air.\n\n\"What craft is this that hangs out no light?\" said a gruff voice.\n\n\"I might ask the same question of you,\" answered the albatross,\nsullenly.\n\n\"I'm only a poor Will-o'-the-wisp,\" replied the voice, \"and you know\nvery well that I have but a lantern to show.\" Thereupon a lantern\nbecame visible, and Jack saw by the light of it a man, who looked old\nand tired, and he was so transparent that you could see through him,\nlantern and all.\n\n\"I hope I have not hurt you, William,\" said the albatross; \"I will\nlight up immediately. Good-night.\"\n\n\"Good-night,\" answered the Will-o'-the-wisp. \"I am going down as fast\nas I can; the storm blew me up, and I am never easy excepting in my\nnative swamps.\"\n\nJack might have taken more notice of Will, if the albatross had not\nbegun to light up. She did it in this way. First, one of her eyes\nbegan to gleam with a beautiful green light, which cast its rays far\nand near, and then, when it was as bright as a lamp, the other eye\nbegan to shine, and the light of that eye was red. In short, she was\nlighted up just like a vessel at sea.\n\nJack was so happy that he hardly knew which to look at first, there\nreally were so many remarkable things.\n\n\"They snore,\" said the albatross, \"they are very fast asleep, and\nbefore they wake I should like to talk to you a little.\"\n\nShe meant that the fairies snored, and so they did, in Jack's\npockets.\n\n\"My name,\" continued the albatross, \"is Jenny. Do you think you shall\nremember that? because, when you are in Fairyland and want some one to\ntake you home again, and call 'Jenny,' I shall be able to come to you;\nand I shall come with pleasure, for I like boys better than fairies.\"\n\n\"Thank you,\" said Jack. \"Oh yes, I shall remember your name, it is\nsuch a very easy one.\"\n\n\"If it is in the night that you want me, just look up,\" continued the\nalbatross, \"and you will see a green and a red spark moving in the\nair; you will then call Jenny, and I will come; but remember that I\ncannot come unless you do call me.\"\n\n\"Very well,\" said Jack; but he was not attending, because there was so\nmuch to be seen.\n\nIn the first place, all the stars excepting a few large ones were\ngone, and they looked frightened; and as it got lighter, one after the\nother seemed to give a little start in the blue sky and go out. And\nthen Jack looked down and saw, as he thought, a great country, covered\nwith very jagged snow mountains with astonishingly sharp peaks. Here\nand there he saw a very deep lake,--at least he thought it was a lake;\nbut while he was admiring the mountains, there came an enormous crack\nbetween two of the largest, and he saw the sun come rolling up among\nthem, and it seemed to be almost smothered.\n\n\"Why, those are clouds!\" exclaimed Jack; \"and O how rosy they have all\nturned! I thought they were mountains.\"\n\n\"Yes, they are clouds,\" said the albatross; and then they turned gold\ncolor; and next they began to plunge and tumble, and every one of the\npeaks put on a glittering crown; and next they broke themselves to\npieces, and began to drift away. In fact, Jack had been out all night,\nand now it was morning.\n\n\n\n\nCHAPTER II. CAPTAIN JACK.\n\n  \"It has been our lot to sail with many captains, not one\n  of whom is fit to be a patch on your back.\"--_Letter of\n  the Ship's Company of H. M. S. S. Royalist to Captain W.\n  T. Bate._\n\n\nAll this time the albatross kept dropping down and down like a stone,\ntill Jack was quite out of breath, and they fell or flew, whichever\nyou like to call it, straight through one of the great chasms which he\nhad thought were lakes, and he looked down, as he sat on the bird's\nback, to see what the world is like when you hang a good way above it\nat sunrise.\n\nIt was a very beautiful sight; the sheep and lambs were still fast\nasleep on the green hills, and the sea-birds were asleep in long rows\nupon the ledges of the cliffs, with their heads under their wings.\n\n\"Are those young fairies awake yet?\" asked the albatross.\n\n\"As sound asleep as ever,\" answered Jack; \"but, Albatross, is not that\nthe sea which lies under us? You are a sea-bird, I know, but I am not\na sea boy, and I cannot live in the water.\"\n\n\"Yes, that is the sea,\" answered the albatross. \"Don't you observe\nthat it is covered with ships?\"\n\n\"I see boats and vessels,\" answered Jack, \"and all their sails are\nset, but they cannot sail, because there is no wind.\"\n\n\"The wind never does blow in this great bay,\" said the bird; \"and\nthose ships would all lie there becalmed till they dropped to pieces\nif one of them was not wanted now and then to go up the wonderful\nriver.\"\n\n\"But how did they come there?\" asked Jack.\n\n\"Some of them had captains who ill-used their cabin-boys, some were\npirate ships, and others were going out on evil errands. The\nconsequence was, that when they chanced to sail within this great bay\nthey got becalmed; the fairies came and picked all the sailors out and\nthrew them into the water; they then took away the flags and pennons\nto make their best coats of, threw the ship-biscuits and other\nprovisions to the fishes, and set all the sails. Many ships which are\nsupposed by men to have foundered lie becalmed in this quiet sea. Look\nat those five grand ones with high prows; they are moored close\ntogether; they were part of the Spanish Armada: and those open boats\nwith blue sails belonged to the Romans; they sailed with Cæsar when he\ninvaded Britain.\"\n\nBy this time the albatross was hovering about among the vessels,\nmaking choice of one to take Jack and the fairies up the wonderful\nriver.\n\n\"It must not be a large one,\" she said, \"for the river in some places\nis very shallow.\"\n\nJack would have liked very much to have a fine three-master, all to\nhimself; but then he considered that he did not know anything about\nsails and rigging; he thought it would be just as well to be\ncontented with whatever the albatross might choose, so he let her set\nhim down in a beautiful little open boat, with a great carved\nfigure-head to it. There he seated himself in great state, and the\nalbatross perched herself on the next bench, and faced him.\n\n\"You remember my name?\" asked the albatross.\n\n\"Oh yes,\" said Jack; but he was not attending,--he was thinking what a\nfine thing it was to have such a curious boat all to himself.\n\n\"That's well,\" answered the bird; \"then, in the next place, are those\nfairies awake yet?\"\n\n\"No, they are not,\" said Jack; and he took them out of his pockets,\nand laid them down in a row before the albatross.\n\n\"They are certainly asleep,\" said the bird. \"Put them away again, and\ntake great care of them. Mind you don't lose any of them, for I really\ndon't know what will happen if you do. Now I have one thing more to\nsay to you, and that is, are you hungry?\"\n\n\"Rather,\" said Jack.\n\n\"Then,\" replied the albatross, \"as soon as you feel _very_ hungry, lie\ndown in the bottom of the boat and go to sleep. You will dream that\nyou see before you a roasted fowl, some new potatoes, and an\napple-pie. Mind you don't eat too much in your dream, or you will be\nsorry for it when you wake. That is all. Good-by! I must go.\"\n\nJack put his arms round the neck of the bird, and hugged her; then she\nspread her magnificent wings and sailed slowly away. At first he felt\nvery lonely, but in a few minutes he forgot that, because the little\nboat began to swim so fast.\n\nShe was not sailing, for she had no sail, and he was not rowing, for\nhe had no oars; so I am obliged to call her motion swimming, because I\ndon't know of a better word. In less than a quarter of an hour they\npassed close under the bows of a splendid three-decker, a seventy-gun\nship. The gannets who live in those parts had taken possession of\nher, and she was so covered with nests that you could not have walked\none step on her deck without treading on them. The father birds were\naloft in the rigging, or swimming in the warm, green sea, and they\nmade such a clamor when they saw Jack that they nearly woke the\nfairies,--nearly, but not quite, for the little things turned round in\nJack's pockets, and sneezed, and began to snore again.\n\nThen the boat swam past a fine brig. Some sea fairies had just flung\nher cargo overboard, and were playing at leap-frog on deck. These were\nnot at all like Jack's own fairies; they were about the same height\nand size as himself, and they had brown faces, and red flannel shirts\nand red caps on. A large fleet of the pearly nautilus was collected\nclose under the vessel's lee. The little creatures were feasting on\nwhat the sea fairies had thrown overboard, and Jack's boat, in its\neagerness to get on, went plunging through them so roughly that\nseveral were capsized. Upon this the brown sea fairies looked over,\nand called out angrily, \"Boat ahoy!\" and the boat stopped.\n\n\"Tell that boat of yours to mind what she is about,\" said the fairy\nsea-captain to Jack.\n\nJack touched his hat, and said, \"Yes, sir,\" and then called out to his\nboat, \"You ought to be ashamed of yourself, running down these little\nlive fishing-vessels so carelessly. Go at a more gentle pace.\"\n\nSo it swam more slowly; and Jack, being by this time hungry, curled\nhimself up in the bottom of the boat, and fell asleep.\n\nHe dreamt directly about a fowl and some potatoes, and he ate a wing,\nand then he ate a merry-thought, and then somebody said to him that he\nhad better not eat any more, but he did,--he ate another wing; and\npresently an apple-pie came, and he ate some of that, and then he ate\nsome more, and then he immediately woke.\n\n\"Now that bird told me not to eat too much,\" said Jack, \"and yet I\nhave done it. I never felt so full in my life;\" and for more than\nhalf an hour he scarcely noticed anything.\n\nAt last he lifted up his head, and saw straight before him two great\nbrown cliffs, and between them flowed in the wonderful river. Other\nrivers flow out, but this river flowed in, and took with it far into\nthe land dolphins, sword-fish, mullet, sun-fish, and many other\nstrange creatures; and that is one reason why it was called the magic\nriver, or the wonderful river.\n\nAt first it was rather wide, and Jack was alarmed to see what\nmultitudes of soldiers stood on either side to guard the banks, and\nprevent any person from landing.\n\nHe wondered how he should get the fairies on shore. However, in about\nan hour the river became much narrower, and then Jack saw that the\nguards were not real soldiers, but rose-colored flamingoes. There they\nstood, in long regiments, among the reeds, and never stirred. They are\nthe only foot-soldiers the fairies have in their pay; they are very\nfierce, and never allow anything but a fairy ship to come up the\nriver.\n\nThey guarded the banks for miles and miles, many thousands of them,\nstanding a little way into the water among the flags and rushes; but\nat last there were no more reeds and no soldier guards, for the stream\nbecame narrower, and flowed between such steep rocks that no one could\npossibly have climbed them.\n\n\n\n\nCHAPTER III. WINDING-UP TIME.\n\n  \"Wake, baillie, wake! the crafts are out;\n    Wake!\" said the knight, \"be quick!\n  For high street, bye street, over the town\n    They fight with poker and stick.\"\n  Said the squire, \"A fight so fell was ne'er\n    In all thy bailliewick.\"\n  What said the old clock in the tower?\n          \"Tick, tick, tick!\"\n\n  \"Wake, daughter, wake! the hour draws on;\n    Wake!\" quoth the dame, \"be quick!\n  The meats are set, the guests are coming,\n    The fiddler waxing his stick.\"\n  She said, \"The bridegroom waiting and waiting\n    To see thy face is sick.\"\n  What said the new clock in her bower?\n          \"Tick, tick, tick!\"\n\n\nJack looked at these hot, brown rocks, first on the left bank and then\non the right, till he was quite tired; but at last the shore on the\nright bank became flat, and he saw a beautiful little bay, where the\nwater was still, and where grass grew down to the brink.\n\nHe was so much pleased at this change, that he cried out hastily, \"Oh\nhow I wish my boat would swim into that bay and let me land!\" He had\nno sooner spoken than the boat altered her course, as if somebody had\nbeen steering her, and began to make for the bay as fast as she could\ngo.\n\n\"How odd!\" thought Jack. \"I wonder whether I ought to have spoken; for\nthe boat certainly did not intend to come into this bay. However, I\nthink I will let her alone now, for I certainly do wish very much to\nland here.\"\n\nAs they drew towards the strand, the water got so shallow that you\ncould see crabs and lobsters walking about at the bottom. At last the\nboat's keel grated on the pebbles; and just as Jack began to think of\njumping on shore, he saw two little old women approaching, and gently\ndriving a white horse before them.\n\nThe horse had panniers, one on each side; and when his feet were in\nthe water he stood still; and Jack said to one of the old women,--\"Will\nyou be so kind as to tell me whether this is Fairyland?\"\n\n\"What does he say?\" asked one old woman of the other.\n\n\"I asked if this was Fairyland?\" repeated Jack, for he thought the\nfirst old woman might have been deaf. She was very handsomely\ndressed in a red satin gown, and did not look in the least like a\nwasher-woman, though it afterwards appeared that she was one.\n\n\"He says, 'Is this Fairyland?'\" she replied; and the other, who had a\nblue satin cloak, answered, \"Oh, does he?\" and then they began to\nempty the panniers of many small blue, and pink, and scarlet shirts,\nand coats, and stockings; and when they had made them into two little\nheaps they knelt down and began to wash them in the river, taking no\nnotice of him whatever.\n\nJack stared at them. They were not much taller than himself, and they\nwere not taking the slightest care of their handsome clothes; then he\nlooked at the old white horse, who was hanging his head over the\nlovely clear water with a very discontented air.\n\nAt last the blue washer-woman said, \"I shall leave off now; I've got a\npain in my works.\"\n\n\"Do,\" said the other. \"We'll go home and have a cup of tea.\" Then she\nglanced at Jack, who was still sitting in the boat, and said, \"Can you\nstrike?\"\n\n\"I can if I choose,\" replied Jack, a little astonished at this speech.\nAnd the red and blue washer-women wrung out the clothes, put them\nagain into the panniers, and taking the old horse by the bridle, began\ngently to lead him away.\n\n\"I have a great mind to land,\" thought Jack. \"I should not wonder at\nall if this is Fairyland. So as the boat came here to please me, I\nshall ask it to stay where it is, in case I should want it again.\"\n\nSo he sprang ashore, and said to the boat, \"Stay just where you are,\nwill you?\" and he ran after the old women, calling to them,--\n\n\"Is there any law to prevent my coming into your country?\"\n\n\"Wo!\" cried the red-coated old woman, and the horse stopped, while the\nblue-coated woman repeated, \"Any law? No, not that I know of; but if\nyou are a stranger here you had better look out.\"\n\n\"Why?\" asked Jack.\n\n\"You don't suppose, do you,\" she answered, \"that our Queen will wind\nup strangers?\"\n\nWhile Jack was wondering what she meant, the other said,--\n\n\"I shouldn't wonder if he goes eight days. Gee!\" and the horse went\non.\n\n\"No, wo!\" said the other.\n\n\"No, no. Gee! I tell you,\" cried the first.\n\nUpon this, to Jack's intense astonishment, the old horse stopped, and\nsaid, speaking through his nose,--\n\n\"Now, then, which is it to be? I'm willing to gee, and I'm agreeable\nto wo; but what's a fellow to do when you say them both together?\"\n\n\"Why, he talks!\" exclaimed Jack.\n\n\"It's because he's got a cold in his head,\" observed one of the\nwasher-women; \"he always talks when he's got a cold, and there's no\npleasing him; whatever you say, he's not satisfied. Gee, Boney, do!\"\n\n\"Gee it is, then,\" said the horse, and began to jog on.\n\n\"He spoke again!\" said Jack, upon which the horse laughed, and Jack\nwas quite alarmed.\n\n\"It appears that your horses don't talk?\" observed the blue-coated\nwoman.\n\n\"Never,\" answered Jack; \"they can't.\"\n\n\"You mean they won't,\" observed the old horse; and though he spoke the\nwords of mankind, it was not in a voice like theirs. Still Jack felt\nthat his was just the natural tone for a horse, and that it did not\narise only from the length of his nose. \"You'll find out some day,\nperhaps,\" he continued, \"whether horses can talk or not.\"\n\n\"Shall I?\" said Jack, very earnestly.\n\n\"They'll TELL,\" proceeded the white horse. \"I wouldn't be you when\nthey tell how you've used them.\"\n\n\"Have you been ill used?\" said Jack, in an anxious tone.\n\n\"Yes, yes, of course he has,\" one of the women broke in; \"but he has\ncome here to get all right again. This is a very wholesome country for\nhorses; isn't it, Boney?\"\n\n\"Yes,\" said the horse.\n\n\"Well, then, jog on, there's a dear,\" continued the old woman. \"Why,\nyou will be young again soon, you know,--young, and gamesome, and\nhandsome; you'll be quite a colt, by and by, and then we shall set you\nfree to join your companions in the happy meadows.\"\n\nThe old horse was so comforted by this kind speech, that he pricked up\nhis ears and quickened his pace considerably.\n\n\"He was shamefully used,\" observed one washer-woman. \"Look at him,\nhow lean he is! You can see all his ribs.\"\n\n\"Yes,\" said the other, as if apologizing for the poor old horse. \"He\ngets low-spirited when he thinks of all he has gone through; but he is\na vast deal better already than he was. He used to live in London; his\nmaster always carried a long whip to beat him with, and never spoke\ncivilly to him.\"\n\n\"London!\" exclaimed Jack; \"why that is in my country. How did the\nhorse get here?\"\n\n\"That's no business of yours,\" answered one of the women. \"But I can\ntell you he came because he was wanted, which is more than you are.\"\n\n\"You let him alone,\" said the horse, in a querulous tone. \"I don't\nbear any malice.\"\n\n\"No; he has a good disposition, has Boney,\" observed the red old\nwoman. \"Pray, are you a boy?\"\n\n\"Yes,\" said Jack.\n\n\"A real boy, that wants no winding up?\" inquired the old woman.\n\n\"I don't know what you mean,\" answered Jack; \"but I am a real boy,\ncertainly.\"\n\n\"Ah!\" she replied. \"Well, I thought you were, by the way Boney spoke\nto you. How frightened you must be! I wonder what will be done to all\nyour people for driving, and working, and beating so many beautiful\ncreatures to death every year that comes? They'll have to pay for it\nsome day, you may depend.\"\n\nJack was a little alarmed, and answered that he had never been unkind\nhimself to horses, and he was glad that Boney bore no malice.\n\n\"They worked him, and often drove him about all night in the miserable\nstreets, and never let him have so much as a canter in a green field,\"\nsaid one of the women; \"but he'll be all right now, only he has to\nbegin at the wrong end.\"\n\n\"What do you mean?\" said Jack.\n\n\"Why, in this country,\" answered the old woman, \"they begin by being\nterribly old and stiff, and they seem miserable and jaded at first,\nbut by degrees they get young again, as you heard me reminding him.\"\n\n\"Indeed,\" said Jack; \"and do you like that?\"\n\n\"It has nothing to do with me,\" she answered. \"We are only here to\ntake care of all the creatures that men have ill used. While they are\nsick and old, which they are when first they come to us,--after they\nare dead, you know,--we take care of them, and gradually bring them up\nto be young and happy again.\"\n\n\"This must be a very nice country to live in, then,\" said Jack.\n\n\"For horses it is,\" said the old lady, significantly.\n\n\"Well,\" said Jack, \"it does seem very full of haystacks, certainly,\nand all the air smells of fresh grass.\"\n\nAt this moment they came to a beautiful meadow, and the old horse\nstopped, and, turning to the blue-coated woman, said, \"Faxa, I think I\ncould fancy a handful of clover.\" Upon this Faxa snatched Jack's cap\noff his head, and in a very active manner jumped over a little ditch,\nand gathering some clover, presently brought it back full, handing it\nto the old horse with great civility.\n\n\"You shouldn't be in such a hurry,\" observed the old horse; \"your\nweights will be running down some day, if you don't mind.\"\n\n\"It's all zeal,\" observed the red-coated woman.\n\nJust then a little man, dressed like a groom, came running up, out of\nbreath. \"Oh, here you are, Dow!\" he exclaimed to the red-coated woman.\n\"Come along, will you? Lady Betty wants you; it's such a hot day, and\nnobody, she says, can fan her so well as you can.\"\n\nThe red-coated woman, without a word, went off with the groom, and\nJack thought he would go with them, for this Lady Betty could surely\ntell him whether the country was called Fairyland, or whether he must\nget into his boat and go farther. He did not like either to hear the\nway in which Faxa and Dow talked about their works and their weights;\nso he asked Faxa to give him his cap, which she did, and he heard a\ncurious sort of little ticking noise as he came close to her, which\nstartled him.\n\n\"Oh, this must be Fairyland, I am sure,\" thought Jack, \"for in my\ncountry our pulses beat quite differently from that.\"\n\n\"Well,\" said Faxa, rather sharply, \"do you find any fault with the way\nI go?\"\n\n\"No,\" said Jack, a little ashamed of having listened. \"I think you\nwalk beautifully; your steps are so regular.\"\n\n\"She's machine-made,\" observed the old horse, in a melancholy voice,\nand with a deep sigh. \"In the largest magnifying-glass you'll hardly\nfind the least fault with her chain. She's not like the goods they\nturn out in Clerkenwell.\"\n\nJack was more and more startled, and so glad to get his cap and run\nafter the groom and Dow to find Lady Betty, that he might be with\nordinary human beings again; but when he got up to them, he found that\nLady Betty was a beautiful brown mare! She was lying in a languid and\nrather affected attitude, with a load of fresh hay before her, and\ntwo attendants, one of whom stood holding a parasol over her head, and\nthe other was fanning her.\n\n\"I'm so glad you are come, my good Dow,\" said the brown mare. \"Don't\nyou think I am strong enough to-day to set off for the happy\nmeadows?\"\n\n\"Well,\" said Dow, \"I'm afraid not yet; you must remember that it is of\nno use your leaving us till you have quite got over the effects of the\nfall.\"\n\nJust then Lady Betty observed Jack, and said, \"Take that boy away; he\nreminds me of a jockey.\"\n\nThe attentive groom instantly started forward, but Jack was too nimble\nfor him; he ran and ran with all his might, and only wished he had\nnever left the boat. But still he heard the groom behind him; and in\nfact the groom caught him at last, and held him so fast that\nstruggling was of no use at all.\n\n\"You young rascal!\" he exclaimed, as he recovered breath. \"How you do\nrun! It's enough to break your mainspring.\"\n\n\"What harm did I do?\" asked Jack. \"I was only looking at the mare.\"\n\n\"Harm!\" exclaimed the groom; \"harm indeed! Why, you reminded her of a\njockey. It's enough to hold her back, poor thing!--and we trying so\nhard, too, to make her forget what a cruel end she came to in the old\nworld.\"\n\n\"You need not hold me so tightly,\" said Jack, \"I shall not run away\nagain; but,\" he added, \"if this is Fairyland, it is not half such a\nnice country as I expected.\"\n\n\"Fairyland!\" exclaimed the groom, stepping back with surprise. \"Why,\nwhat made you think of such a thing? This is only one of the border\ncountries, where things are set right again that people have caused to\ngo wrong in the world. The world, you know, is what men and women call\ntheir own home.\"\n\n\"I know,\" said Jack; \"and that's where I came from.\" Then, as the\ngroom seemed no longer to be angry, he went on: \"And I wish you would\ntell me about Lady Betty.\"\n\n\"She was a beautiful fleet creature, of the racehorse breed,\" said the\ngroom; \"and she won silver cups for her master, and then they made her\nrun a steeple-chase, which frightened her, but still she won it; and\nthen they made her run another, and she cleared some terribly high\nhurdles, and many gates and ditches, till she came to an awful one,\nand at first she would not take it, but her rider spurred and beat her\ntill she tried. It was beyond her powers, and she fell and broke both\nher forelegs. Then they shot her. After she had died that miserable\ndeath, we had her here, to make her all right again.\"\n\n\"Is this the only country where you set things right?\" asked Jack.\n\n\"Certainly not,\" answered the groom; \"they lie about in all\ndirections. Why, you might wander for years, and never come to the end\nof this one.\"\n\n\"I am afraid I shall not find the one I am looking for,\" said Jack,\n\"if your countries are so large.\"\n\n\"I don't think our world is much larger than yours,\" answered the\ngroom. \"But come along: I hear the bell, and we are a good way from\nthe palace.\"\n\nJack, in fact, heard the violent ringing of a bell at some distance;\nand when the groom began to run, he ran beside him, for he thought he\nshould like to see the palace. As they ran, people gathered from all\nsides,--fields, cottages, mills,--till at last there was a little\ncrowd, among whom Jack saw Dow and Faxa, and they were all making for\na large house, the wide door of which was standing open. Jack stood\nwith the crowd, and peeped in. There was a woman sitting inside upon a\nrocking-chair,--a tall, large woman, with a gold-colored gown on,--and\nbeside her stood a table, covered with things that looked like keys.\n\n\"What is that woman doing?\" said he to Faxa, who was standing close to\nhim.\n\n\"Winding us up, to be sure,\" answered Faxa. \"You don't suppose,\nsurely, that we can go forever?\"\n\n\"Extraordinary!\" said Jack. \"Then are you wound up every evening, like\nwatches?\"\n\n\"Unless we have misbehaved ourselves,\" she answered; \"and then she\nlets us run down.\"\n\n\"And what then?\"\n\n\"What then?\" repeated Faxa, \"why, then we have to stop and stand\nagainst a wall, till she is pleased to forgive us, and let our friends\ncarry us in to be set going again.\"\n\nJack looked in, and saw the people pass in and stand close by the\nwoman. One after the other she took by the chin with her left hand,\nand with her right hand found a key that pleased her. It seemed to\nJack that there was a tiny key-hole in the back of their heads, and\nthat she put the key in and wound them up.\n\n\"You must take your turn with the others,\" said the groom.\n\n\"There's no key-hole in my head,\" said Jack; \"besides, I do not want\nany woman to wind me up.\"\n\n\"But you must do as others do,\" he persisted; \"and if you have no\nkey-hole, our Queen can easily have one made, I should think.\"\n\n\"Make one in my head!\" exclaimed Jack. \"She shall do no such thing.\"\n\n\"We shall see,\" said Faxa, quietly. And Jack was so frightened that he\nset off, and ran back towards the river with all his might. Many of\nthe people called to him to stop, but they could not run after him,\nbecause they wanted winding up. However, they would certainly have\ncaught him if he had not been very quick, for before he got to the\nriver he heard behind him the footsteps of those who had been first\nattended to by the Queen, and he had only just time to spring into the\nboat when they reached the edge of the water.\n\nNo sooner was he on board than the boat swung round, and got out again\ninto the middle of the stream; but he could not feel safe till not\nonly was there a long reach of water between him and the shore, but\ntill he had gone so far down the river that the beautiful bay had\npassed out of sight, and the sun was going down. By this time he began\nto feel very tired and sleepy; so, having looked at his fairies, and\nfound that they were all safe and fast asleep, he laid down in the\nbottom of the boat, and fell into a doze, and then into a dream.\n\n\n\n\nCHAPTER IV. BEES AND OTHER FELLOW-CREATURES.\n\n  The dove laid some little sticks,\n    Then began to coo;\n  The gnat took his trumpet up\n    To play the day through;\n  The pie chattered soft and long--\n    But that she always does;\n  The bee did all he had to do,\n    And only said, \"Buzz.\"\n\n\nWhen Jack at length opened his eyes, he found that it was night, for\nthe full moon was shining; but it was not at all a dark night, for he\ncould see distinctly some black birds, that looked like ravens. They\nwere sitting in a row on the edge of the boat.\n\nNow that he had fairies in his pockets, he could understand\nbird-talk, and he heard one of these ravens saying, \"There is no meat\nso tender; I wish I could pick their little eyes out.\"\n\n\"Yes,\" said another, \"fairies are delicate eating indeed. We must\nspeak Jack fair if we want to get at them.\" And she heaved up a deep\nsigh.\n\nJack lay still, and thought he had better pretend to be asleep; but\nthey soon noticed that his eyes were open, and one of them presently\nwalked up his leg and bowed, and asked if he was hungry.\n\nJack said, \"No.\"\n\n\"No more am I,\" replied the raven; \"not at all hungry.\" Then she\nhopped off his leg, and Jack sat up.\n\n\"And how are the sweet fairies that my young master is taking to their\nhome?\" asked another of the ravens. \"I hope they are safe in my young\nmaster's pockets?\"\n\nJack felt in his pockets. Yes, they were all safe; but he did not take\nany of them out, lest the ravens should snatch at them.\n\n\"Eh?\" continued the raven, pretending to listen; \"did this dear young\ngentleman say that the fairies were asleep?\"\n\n\"It doesn't amuse me to talk about fairies,\" said Jack; \"but if you\nwould explain some of the things in this country that I cannot make\nout, I should be very glad.\"\n\n\"What things?\" asked the blackest of the ravens.\n\n\"Why,\" said Jack, \"I see a full moon lying down there among the\nwater-flags, and just going to set, and there is a half-moon overhead\nplunging among those great gray clouds, and just this moment I saw a\nthin crescent moon peeping out between the branches of that tree.\"\n\n\"Well,\" said all the ravens at once, \"did the young master never see a\ncrescent moon in the men and women's world?\"\n\n\"Oh yes,\" said Jack.\n\n\"Did he never see a full moon?\" asked the ravens.\n\n\"Yes, of course,\" said Jack; \"but they are the same moon. I could\nnever see all three of them at the same time.\"\n\nThe ravens were very much surprised at this, and one of them said,--\n\n\"If my young master did not see the moons it must have been because he\ndidn't look. Perhaps my young master slept in a room, and had only one\nwindow; if so, he couldn't see all the sky at once.\"\n\n\"I tell you, Raven,\" said Jack, laughing, \"that I KNOW there is never\nmore than one moon in my country, and sometimes there is no moon at\nall!\"\n\nUpon this all the ravens hung down their heads, and looked very much\nashamed; for there is nothing that birds hate so much as to be laughed\nat, and they believed that Jack was saying this to mock them, and that\nhe knew what they had come for. So first one and then another hopped\nto the other end of the boat and flew away, till at last there was\nonly one left, and she appeared to be out of spirits, and did not\nspeak again till he spoke to her.\n\n\"Raven,\" said Jack, \"there's something very cold and slippery lying\nat the bottom of the boat. I touched it just now, and I don't like it\nat all.\"\n\n\"It's a water-snake,\" said the raven; and she stooped and picked up a\nlong thing with her beak, which she threw out, and then looked over.\n\"The water swarms with them, wicked, murderous creatures; they smell\nthe young fairies, and they want to eat them.\"\n\nJack was so thrown off his guard that he snatched one fairy out, just\nto make sure that it was safe. It was the one with the mustache; and,\nalas! in one instant the raven flew at it, got it out of his hand, and\npecked off its head before it had time to wake or Jack to rescue it.\nThen, as she slowly rose, she croaked, and said to Jack, \"You'll catch\nit for this, my young master!\" and she flew to the bough of a tree,\nwhere she finished eating the fairy, and threw his little empty coat\ninto the river.\n\nOn this Jack began to cry bitterly, and to think what a foolish boy he\nhad been. He was the more sorry because he did not even know that\npoor little fellow's name. But he had heard the others calling by name\nto their companions, and very grand names they were too. One was\nJovinian,--he was a very fierce-looking gentleman; the other two were\nRoxaletta and Mopsa.\n\nPresently, however, Jack forgot to be unhappy, for two of the moons\nwent down, and then the sun rose, and he was delighted to find that\nhowever many moons there might be, there was only one sun, even in the\ncountry of the wonderful river.\n\nSo on and on they went; but the river was very wide, and the waves\nwere boisterous. On the right brink was a thick forest of trees, with\nsuch heavy foliage that a little way off they looked like a bank,\ngreen, and smooth, and steep; but as the light became clearer, Jack\ncould see here and there the great stems, and see creatures like\nfoxes, wild boars, and deer, come stealing down to drink in the\nriver.\n\nIt was very hot here; not at all like the spring weather he had left\nbehind. And as the low sunbeams shone into Jack's face he said\nhastily, without thinking of what would occur, \"I wish I might land\namong those lovely glades on the left bank.\"\n\nNo sooner said than the boat began to make for the left bank, and the\nnearer they got towards it the more beautiful it became; but also the\nmore stormy were the reaches of water they had to traverse.\n\nA lovely country indeed! It sloped gently down to the water's edge,\nand beautiful trees were scattered over it, soft, mossy grass grew\neverywhere, great old laburnum trees stretched their boughs down in\npatches over the water, and higher up camellias, almost as large as\nhawthorns, grew together and mingled their red and white flowers.\n\nThe country was not so open as a park,--it was more like a half-cleared\nwoodland; but there was a wide space just where the boat was steering\nfor, that had no trees, only a few flowering shrubs. Here groups of\nstrange-looking people were bustling about, and there were shrill\nfifes sounding, and drums.\n\nFarther back he saw rows of booths or tents under the shade of the\ntrees.\n\nIn another place some people dressed like gypsies had made fires of\nsticks just at the skirts of the woodland, and were boiling their\npots. Some of these had very gaudy tilted carts, hung all over with\ngoods, such as baskets, brushes, mats, little glasses, pottery, and\nbeads.\n\nIt seemed to be a kind of fair, to which people had gathered from all\nparts; but there was not one house to be seen. All the goods were\neither hung upon trees or collected in strange-looking tents.\n\nThe people were not all of the same race; indeed, he thought the only\nhuman beings were the gypsies, for the folks who had tents were no\ntaller than himself.\n\nHow hot it was that morning! and as the boat pushed itself into a\nlittle creek, and made its way among the beds of yellow and purple\niris which skirted the brink, what a crowd of dragon-flies and large\nbutterflies rose from them!\n\n\"Stay where you are!\" cried Jack to the boat; and at that instant such\na splendid moth rose slowly, that he sprang on shore after it, and\nquite forgot the fair and the people in his desire to follow it.\n\nThe moth settled on a great red honey-flower, and he stole up to look\nat it. As large as a swallow, it floated on before him. Its wings were\nnearly black, and they had spots of gold on them.\n\nWhen it rose again Jack ran after it, till he found himself close to\nthe rows of tents where the brown people stood; and they began to cry\nout to him, \"What'll you buy? what'll you buy, sir?\" and they crowded\nabout him, so that he soon lost sight of the moth, and forgot\neverything else in his surprise at the booths.\n\nThey were full of splendid things,--clocks and musical boxes, strange\nchina ornaments, embroidered slippers, red caps, and many kinds of\nsplendid silks and small carpets. In other booths were swords and\ndirks, glittering with jewels; and the chatter of the people when they\ntalked together was not in a language that Jack could understand.\n\nSome of the booths were square, and evidently made of common canvas,\nfor when you went into them, and the sun shone, you could distinctly\nsee the threads.\n\nBut scattered a little farther on in groups were some round tents,\nwhich were far more curious. They were open on all sides, and\nconsisted only of a thick canopy overhead, which was supported by one\nbeautiful round pillar in the middle.\n\nOutside the canopy was white or brownish; but when Jack stood under\nthese tents, he saw that they were lined with splendid flutings of\nbrown or pink silk: what looked like silk, at least, for it was\nimpossible to be sure whether these were real tents or gigantic\nmushrooms.\n\nThey varied in size, also, as mushrooms do, and in shape: some were\nlarge enough for twenty people to stand under them, and had flat tops\nwith a brown lining; others had dome-shaped roofs; these were lined\nwith pink, and would only shelter six or seven.\n\nThe people who sold in these tents were as strange as their neighbors;\neach had a little high cap on his head, in shape just like a beehive,\nand it was made of straw, and had a little hole in front. In fact,\nJack very soon saw bees flying in and out, and it was evident that\nthese people had their honey made on the premises. They were chiefly\nselling country produce. They had cheeses so large as to reach to\ntheir waists, and the women trundled them along as boys do their\nhoops. They sold a great many kinds of seed, too, in wooden bowls, and\ncakes and good things to eat, such as gilt gingerbread. Jack bought\nsome of this, and found it very nice indeed. But when he took out his\nmoney to pay for it, the little man looked rather strangely at it, and\nturned it over with an air of disgust. Then Jack saw him hand it to\nhis wife, who also seemed to dislike it; and presently Jack observed\nthat they followed him about, first on one side, then on the other.\nAt last, the little woman slipped her hand into his pocket, and Jack,\nputting his hand in directly, found his sixpence had been returned.\n\n\"Why, you've given me back my money!\" he said.\n\nThe little woman put her hands behind her. \"I do not like it,\" she\nsaid; \"it's dirty; at least, it's not new.\"\n\n\"No, it's not new,\" said Jack, a good deal surprised, \"but it is a\ngood sixpence.\"\n\n\"The bees don't like it,\" continued the little woman. \"They like\nthings to be neat and new, and that sixpence is bent.\"\n\n\"What shall I give you then?\" said Jack.\n\nThe good little woman laughed and blushed. \"This young gentleman has a\nbeautiful whistle round his neck,\" she observed, politely, but did not\nask for it.\n\nJack had a dog-whistle, so he took it off and gave it to her.\n\n\"Thank you for the bees,\" she said. \"They love to be called home when\nwe've collected flowers for them.\"\n\nSo she made a pretty little courtesy, and went away to her customers.\n\nThere were some very strange creatures also, about the same height as\nJack, who had no tents, and seemed there to buy, not to sell. Yet they\nlooked poorer than the other folks, and they were also very cross and\ndiscontented; nothing pleased them. Their clothes were made of moss,\nand their mantles of feathers; and they talked in a queer whistling\ntone of voice, and carried their skinny little children on their backs\nand on their shoulders.\n\nThey were treated with great respect by the people in the tents; and\nwhen Jack asked his friend to whom he had given the whistle what they\nwere, and where they got so much money as they had, she replied that\nthey lived over the hills, and were afraid to come in their best\nclothes. They were rich and powerful at home, and they came shabbily\ndressed, and behaved humbly, lest their enemies should envy them. It\nwas very dangerous, she said, to fairies to be envied.\n\nJack wanted to listen to their strange whistling talk, but he could\nnot for the noise and cheerful chattering of the brown folks, and more\nstill for the screaming and talking of parrots.\n\nAmong the goods were hundreds of splendid gilt cages, which were hung\nby long gold chains from the trees. Each cage contained a parrot and\nhis mate, and they all seemed to be very unhappy indeed.\n\nThe parrots could talk, and they kept screaming to the discontented\nwomen to buy things for them, and trying very hard to attract\nattention.\n\nOne old parrot made himself quite conspicuous by these efforts. He\nflung himself against the wires of his cage, he squalled, he screamed,\nhe knocked the floor with his beak, till Jack and one of the customers\ncame running up to see what was the matter.\n\n\"What do you make such a fuss for?\" cried the discontented woman.\n\"You've set your cage swinging with knocking yourself about; and what\ngood does that do? I cannot break the spell and open it for you.\"\n\n\"I know that,\" answered the parrot, sobbing; \"but it hurts my feelings\nso that you should take no notice of me now that I have come down in\nthe world.\"\n\n\"Yes,\" said the parrot's mate, \"it hurts our feelings.\"\n\n\"I haven't forgotten you,\" answered the woman, more crossly than ever;\n\"I was buying a measure of maize for you when you began to make such a\nnoise.\"\n\nJack thought this was the queerest conversation he had ever heard in\nhis life; and he was still more surprised when the bird answered,--\n\n\"I would much rather you would buy me a pocket-handkerchief. Here we\nare, shut up, without a chance of getting out, and with nobody to pity\nus; and we can't even have the comfort of crying, because we've got\nnothing to wipe our eyes with.\"\n\n\"But at least,\" replied the woman, \"you CAN cry now if you please, and\nwhen you had your other face you could not.\"\n\n\"Buy me a handkerchief,\" sobbed the parrot.\n\n\"I can't afford both,\" whined the cross woman, \"and I've paid now for\nthe maize.\" So saying, she went back to the tent to fetch her present\nto the parrots; and as their cage was still swinging Jack put out his\nhand to steady it for them, and the instant he did so they became\nperfectly silent, and all the other parrots on that tree, who had been\nflinging themselves about in their cages, left off screaming, and\nbecame silent too.\n\nThe old parrot looked very cunning. His cage hung by such a long gold\nchain that it was just on a level with Jack's face, and so many odd\nthings had happened that day that it did not seem more odd than usual\nto hear him say, in a tone of great astonishment,--\n\n\"It's a BOY, if ever there was one!\"\n\n\"Yes,\" said Jack; \"I'm a boy.\"\n\n\"You won't go yet, will you?\" said the parrot.\n\n\"No, don't,\" said a great many other parrots. Jack agreed to stay a\nlittle while, upon which they all thanked him.\n\n\"I had no notion you were a boy till you touched my cage,\" said the\nold parrot.\n\nJack did not know how this could have told him, so he only answered,\n\"Indeed!\"\n\n\"I'm a fairy,\" observed the parrot, in a confidential tone. \"We are\nimprisoned here by our enemies the gypsies.\"\n\n\"So we are,\" answered a chorus of other parrots.\n\n\"I'm sorry for that,\" replied Jack. \"I'm friends with the fairies.\"\n\n\"Don't tell,\" said the parrot, drawing a film over his eyes, and\npretending to be asleep. At that moment his friend in the moss\npetticoat and feather cloak came up with a little measure of maize,\nand poured it into the cage.\n\n\"Here, neighbor,\" she said; \"I must say good-by now, for the gypsy is\ncoming this way, and I want to buy some of her goods.\"\n\n\"Well, thank you,\" answered the parrot, sobbing again; \"but I could\nhave wished it had been a pocket-handkerchief.\"\n\n\"I'll lend you my handkerchief,\" said Jack. \"Here!\" And he drew it\nout, and pushed it between the wires.\n\nThe parrot and his wife were in a great hurry to get Jack's\nhandkerchief. They pulled it in very hastily; but instead of using it\nthey rolled it up into a ball, and the parrot-wife tucked it under her\nwing.\n\n\"It makes me tremble all over,\" said she, \"to think of such good\nluck.\"\n\n\"I say,\" observed the parrot to Jack, \"I know all about it now. You've\ngot some of my people in your pockets,--not of my own tribe, but\nfairies.\"\n\nBy this Jack was sure that the parrot really was a fairy himself, and\nhe listened to what he had to say the more attentively.\n\n\n\n\nCHAPTER V. THE PARROT IN HIS SHAWL.\n\n          That handkerchief\n  Did an Egyptian to my mother give;\n  She was a charmer, and could almost read\n  The thoughts of people.--_Othello._\n\n\n\"That gypsy woman who is coming with her cart,\" said the parrot, \"is a\nfairy too, and very malicious. It was she and others of her tribe who\ncaught us and put us into these cages, for they are more powerful than\nwe. Mind you do not let her allure you into the woods, nor wheedle you\nor frighten you into giving her any of those fairies.\"\n\n\"No,\" said Jack; \"I will not.\"\n\n\"She sold us to the brown people,\" continued the parrot. \"Mind you do\nnot buy anything of her, for your money in her palm would act as a\ncharm against you.\"\n\n\"She has a baby,\" observed the parrot-wife, scornfully.\n\n\"Yes, a baby,\" repeated the old parrot; \"and I hope by means of that\nbaby to get her driven away, and perhaps get free myself. I shall try\nto put her in a passion. Here she comes.\"\n\nThere she was indeed, almost close at hand. She had a little cart; her\ngoods were hung all about it, and a small horse drew it slowly on, and\nstopped when she got a customer.\n\nSeveral gypsy children were with her, and as the people came running\ntogether over the grass to see her goods, she sang a curious kind of\nsong, which made them wish to buy them.\n\nJack turned from the parrot's cage as she came up. He had heard her\nsinging a little way off, and now, before she began again, he felt\nthat already her searching eyes had found him out, and taken notice\nthat he was different from the other people.\n\nWhen she began to sing her selling song, he felt a most curious\nsensation. He felt as if there were some cobwebs before his face, and\nhe put up his hand as if to clear them away. There were no real\ncobwebs, of course; and yet he again felt as if they floated from the\ngypsy woman to him, like gossamer threads, and attracted him towards\nher. So he gazed at her, and she at him, till Jack began to forget how\nthe parrot had warned him.\n\nHe saw her baby too, wondered whether it was heavy for her to carry,\nand wished he could help her. I mean, he saw that she had a baby on\nher arm. It was wrapped in a shawl, and had a handkerchief over its\nface. She seemed very fond of it, for she kept hushing it; and Jack\nsoftly moved nearer and nearer to the cart, till the gypsy woman\nsmiled, and suddenly began to sing,--\n\n  My good man--he's an old, old man\n    And my good man got a fall,\n  To buy me a bargain so fast he ran\n    When he heard the gypsies call:\n        \"Buy, buy brushes,\n        Baskets wrought o' rushes.\n        Buy them, buy them, take them, try them,\n              Buy, dames all.\"\n\n  My old man, he has money and land,\n    And a young, young wife am I.\n  Let him put the penny in my white hand\n    When he hears the gypsies cry:\n        \"Buy, buy laces,\n        Veils to screen your faces.\n        Buy them, buy them, take and try them.\n              Buy, maids, buy.\"\n\nWhen the gypsy had finished her song, Jack felt as if he was covered\nall over with cobwebs; but he could not move away, and he did not mind\nthem now. All his wish was to please her, and get close to her; so\nwhen she said, in a soft, wheedling voice, \"What will you please to\nbuy, my pretty gentleman?\" he was just going to answer that he would\nbuy anything she recommended, when, to his astonishment and\ndispleasure, for he thought it very rude, the parrot suddenly burst\ninto a violent fit of coughing, which made all the customers stare.\n\"That's to clear my throat,\" he said, in a most impertinent tone of\nvoice; and then he began to beat time with his foot, and sing, or\nrather scream out, an extremely saucy imitation of the gypsy's song,\nand all his parrot friends in the other cages joined in the chorus.\n\n  My fair lady's a dear, dear lady--\n    I walked by her side to woo.\n  In a garden alley, so sweet and shady,\n    She answered, \"I love not you,\n        John, John Brady,\"\n        Quoth my dear lady,\n  \"Pray now, pray now, go your way now,\n        Do, John, do!\"\n\nAt first the gypsy did not seem to know where that mocking song came\nfrom, but when she discovered that it was her prisoner, the old\nparrot, who was thus daring to imitate her, she stood silent and\nglared at him, and her face was almost white with rage.\n\nWhen he came to the end of the verse he pretended to burst into a\nviolent fit of sobbing and crying, and screeched out to his wife,\n\"Mate! mate! hand up my handkerchief. Oh! oh! it's so affecting, this\nsong is.\"\n\nUpon this the other parrot pulled Jack's handkerchief from under her\nwing, hobbled up, and began, with a great show of zeal, to wipe his\nhorny beak with it. But this was too much for the gypsy; she took a\nlarge brush from her cart, and flung it at the cage with all her\nmight.\n\nThis set it violently swinging backwards and forwards, but did not\nstop the parrot, who screeched out, \"How delightful it is to be\nswung!\" And then he began to sing another verse in the most impudent\ntone possible, and with a voice that seemed to ring through Jack's\nhead, and almost pierce it:--\n\n  Yet my fair lady's my own, own lady,\n    For I passed another day;\n  While making her moan, she sat all alone,\n    And thus and thus did she say:\n        \"John, John Brady,\"\n        Quoth my dear lady,\n  \"Do now, do now, once more woo now,\n        Pray, John, pray!\"\n\n\"It's beautiful!\" screeched the parrot-wife, \"and so ap-pro-pri-ate.\"\nJack was delighted when she managed slowly to say this long word with\nher black tongue, and he burst out laughing. In the mean time a good\nmany of the brown people came running together, attracted by the noise\nof the parrots and the rage of the gypsy, who flung at his cage, one\nafter the other, all the largest things she had in her cart. But\nnothing did the parrot any harm; the more violently his cage swung,\nthe louder he sang, till at last the wicked gypsy seized her poor\nlittle young baby, who was lying in her arms, rushed frantically at\nthe cage as it flew swiftly through the air towards her, and struck at\nit with the little creature's head. \"Oh, you cruel, cruel woman!\"\ncried Jack, and all the small mothers who were standing near with\ntheir skinny children on their shoulders, screamed out with terror and\nindignation; but only for one instant, for the handkerchief flew off\nthat had covered its face, and was caught in the wires of the cage,\nand all the people saw that it was not a real baby at all, but a\nbundle of clothes, and its head was a turnip.\n\nYes, a turnip! You could see that as plainly as possible, for though\nthe green leaves had been cut off, their stalks were visible through\nthe lace cap that had been tied on it.\n\nUpon this all the crowd pressed closer, throwing her baskets, and\nbrushes, and laces, and beads at the gypsy, and calling out, \"We will\nhave none of your goods, you false woman! Give us back our money, or\nwe will drive you out of the fair. You've stuck a stick into a turnip,\nand dressed it up in baby clothes. You're a cheat! a cheat!\"\n\n\"My sweet gentlemen, my kind ladies,\" began the gypsy; but baskets and\nbrushes flew at her so fast that she was obliged to sit down on the\ngrass and hold up the sham baby to screen her face.\n\nWhile this was going on, Jack felt that the cobwebs which had seemed\nto float about his face were all gone; he did not care at all any more\nabout the gypsy, and began to watch the parrots with great attention.\n\nHe observed that when the handkerchief stuck between the cage wires,\nthe parrots caught it, and drew it inside; and then Jack saw the\ncunning old bird himself lay it on the floor, fold it crosswise like\na shawl, and put it on his wife.\n\nThen she jumped upon the perch, and held it with one foot, looking\nprecisely like an old lady with a parrot's head. Then he folded Jack's\nhandkerchief in the same way, put it on, and got upon the perch beside\nhis wife, screaming out, in his most piercing tone,--\n\n\"I like shawls; they're so becoming.\"\n\nNow the gypsy did not care at all what those inferior people thought\nof her, and she was calmly counting out their money, to return it; but\nshe was very desirous to make Jack forget her behavior, and had begun\nto smile again, and tell him she had only been joking, when the parrot\nspoke, and, looking up, she saw the two birds sitting side by side,\nand the parrot-wife was screaming in her mate's ear, though neither of\nthem was at all deaf,--\n\n\"If Jack lets her allure him into the woods, he'll never come out\nagain. She'll hang him up in a cage, as she did us. I say, how does\nmy shawl fit?\"\n\nSo saying, the parrot-wife whisked herself round on the perch, and lo!\nin the corner of the handkerchief were seen some curious letters,\nmarked in red. When the crowd saw these, they drew a little farther\noff, and glanced at one another with alarm.\n\n\"You look charming, my dear; it fits well!\" screamed the old parrot in\nanswer. \"A word in your ear; 'Share and share alike' is a fine\nmotto.\"\n\n\"What do you mean by all this?\" said the gypsy, rising, and going with\nslow steps to the cage, and speaking cautiously.\n\n\"Jack,\" said the parrot, \"do they ever eat handkerchiefs in your part\nof the country?\"\n\n\"No, never,\" answered Jack.\n\n\"Hold your tongue and be reasonable,\" said the gypsy, trembling. \"What\ndo you want? I'll do it, whatever it is.\"\n\n\"But do they never pick out the marks?\" continued the parrot. \"O\nJack! are you sure they never pick out the marks?\"\n\n\"The marks?\" said Jack, considering. \"Yes, perhaps they do.\"\n\n\"Stop!\" cried the gypsy, as the old parrot made a peck at the strange\nletters. \"Oh! you're hurting me. What do you want? I say again, tell\nme what you want, and you shall have it.\"\n\n\"We want to get out,\" replied the parrot; \"you must undo the spell.\"\n\n\"Then give me my handkerchief,\" answered the gypsy, \"to bandage my\neyes. I dare not say the words with my eyes open. You had no business\nto steal it. It was woven by human hands, so that nobody can see\nthrough it; and if you don't give it to me, you'll never get out,--no,\nnever!\"\n\n\"Then,\" said the old parrot, tossing his shawl off, \"you may have\nJack's handkerchief; it will bandage your eyes just as well. It was\nwoven over the water, as yours was.\"\n\n\"It won't do!\" cried the gypsy, in terror; \"give me my own.\"\n\n\"I tell you,\" answered the parrot, \"that you shall have Jack's\nhandkerchief; you can do no harm with that.\"\n\nBy this time the parrots all around had become perfectly silent, and\nnone of the people ventured to say a word, for they feared the malice\nof the gypsy. She was trembling dreadfully, and her dark eyes, which\nhad been so bright and piercing, had become dull and almost dim; but\nwhen she found there was no help for it, she said,--\n\n\"Well, pass out Jack's handkerchief. I will set you free if you will\nbring out mine with you.\"\n\n\"Share and share alike,\" answered the parrot; \"you must let all my\nfriends out too.\"\n\n\"Then I won't let you out,\" answered the gypsy. \"You shall come out\nfirst, and give me my handkerchief, or not one of their cages will I\nundo. So take your choice.\"\n\n\"My friends, then,\" answered the brave old parrot; and he poked\nJack's handkerchief out to her through the wires.\n\nThe wondering crowd stood by to look, and the gypsy bandaged her eyes\ntightly with the handkerchief; and then, stooping low, she began to\nmurmur something and clap her hands--softly at first, but by degrees\nmore and more violently. The noise was meant to drown the words she\nmuttered; but as she went on clapping, the bottom of cage after cage\nfell clattering down. Out flew the parrots by hundreds, screaming and\ncongratulating one another; and there was such a deafening din that\nnot only the sound of her spell, but the clapping of her hands, was\nquite lost in it.\n\nBut all this time Jack was very busy; for the moment the gypsy had\ntied up her eyes, the old parrot snatched the real handkerchief off\nhis wife's shoulders, and tied it round her neck. Then she pushed out\nher head through the wires, and the old parrot called to Jack, and\nsaid, \"Pull!\"\n\nJack took the ends of the handkerchief, pulled terribly hard, and\nstopped. \"Go on! go on!\" screamed the old parrot.\n\n\"I shall pull her head off,\" cried Jack.\n\n\"No matter,\" cried the parrot; \"no matter,--only pull.\"\n\nWell, Jack did pull, and he actually did pull her head off! nearly\ntumbling backward himself as he did it; but he saw what the whole\nthing meant then, for there was another head inside,--a fairy's head.\n\nJack flung down the old parrot's head and great beak, for he saw that\nwhat he had to do was to clear the fairy of its parrot covering. The\npoor little creature seemed nearly dead, it was so terribly squeezed\nin the wires. It had a green gown or robe on, with an ermine collar;\nand Jack got hold of this dress, stripped the fairy out of the parrot\nfeathers, and dragged her through,--velvet robe, and crimson girdle,\nand little yellow shoes. She was very much exhausted, but a kind brown\nwoman took her instantly, and laid her in her bosom. She was a\nsplendid little creature, about half a foot long.\n\n\"There's a brave boy!\" cried the parrot. Jack glanced round, and saw\nthat not all the parrots were free yet, the gypsy was still muttering\nher spell.\n\nHe returned the handkerchief to the parrot, who put it round his own\nneck, and again Jack pulled. But oh! what a tough old parrot that was,\nand how Jack tugged before his cunning head would come off! It did,\nhowever, at last; and just as a fine fairy was pulled through, leaving\nhis parrot skin and the handkerchief behind him, the gypsy untied her\neyes, and saw what Jack had done.\n\n\"Give me my handkerchief!\" she screamed, in despair.\n\n\"It's in the cage, gypsy,\" answered Jack; \"you can get it yourself.\nSay your words again.\"\n\nBut the gypsy's spell would only open places where she had confined\nfairies, and no fairies were in the cage now.\n\n\"No, no, no!\" she screamed; \"too late! Hide me! O good people, hide\nme!\"\n\nBut it was indeed too late. The parrots had been wheeling in the air,\nhundreds and hundreds of them, high above her head; and as she ceased\nspeaking, she fell shuddering on the ground, drew her cloak over her\nface, and down they came, swooping in one immense flock, and settled\nso thickly all over her that she was completely covered; from her\nshoes to her head not an atom of her was to be seen.\n\nAll the people stood gravely looking on. So did Jack, but he could not\nsee much for the fluttering of the parrots, nor hear anything for\ntheir screaming voices; but at last he made one of the cross people\nhear when he shouted to her, \"What are they going to do to the poor\ngypsy?\"\n\n\"Make her take her other form,\" she replied; \"and then she cannot hurt\nus while she stays in our country. She is a fairy, as we have just\nfound out, and all fairies have two forms.\"\n\n\"Oh!\" said Jack; but he had no time for more questions.\n\nThe screaming and fighting, and tossing about of little bits of cloth\nand cotton, ceased; a black lump heaved itself up from the ground\namong the parrots; and as they flew aside, an ugly great condor, with\na bare neck, spread out its wings, and, skimming the ground, sailed\nslowly away.\n\n\"They have pecked her so that she can hardly rise,\" exclaimed the\nparrot fairy. \"Set me on your shoulder, Jack, and let me see the end\nof it.\"\n\nJack set him there; and his little wife, who had recovered herself,\nsprang from her friend the brown woman, and sat on the other shoulder.\nHe then ran on,--the tribe of brown people and mushroom people, and\nthe feather-coated folks running too,--after the great black bird, who\nskimmed slowly on before them till she got to the gypsy carts, when\nout rushed the gypsies, armed with poles, milking-stools, spades, and\neverything they could get hold of to beat back the people and the\nparrots from hunting their relation, who had folded her tired wings,\nand was skulking under a cart, with ruffled feathers and a scowling\neye.\n\nJack was so frightened at the violent way in which the gypsies and the\nother tribes were knocking each other about, that he ran off, thinking\nhe had seen enough of such a dangerous country.\n\nAs he passed the place where that evil-minded gypsy had been changed,\nhe found the ground strewed with little bits of her clothes. Many\nparrots were picking them up, and poking them into the cage where the\nhandkerchief was; and presently another parrot came with a lighted\nbrand, which she had pulled from one of the gypsies' fires.\n\n\"That's right,\" said the fairy on Jack's shoulder, when he saw his\nfriend push the brand between the wires of what had been his cage, and\nset the gypsy's handkerchief on fire, and all the bits of her clothes\nwith it. \"She won't find much of herself here,\" he observed, as Jack\nwent on. \"It will not be very easy to put herself together again.\"\n\nSo Jack moved away. He was tired of the noise and confusion; and the\nsun was just setting as he reached the little creek where his boat\nlay.\n\nThen the parrot fairy and his wife sprang down, and kissed their hands\nto him as he stepped on board, and pushed the boat off. He saw, when\nhe looked back, that a great fight was still going on; so he was glad\nto get away, and he wished his two friends good-by, and set off, the\nold parrot fairly calling after him, \"My relations have put some of\nour favorite food on board for you.\" Then they again thanked him for\nhis good help, and sprang into a tree, and the boat began to go down\nthe wonderful river.\n\n\"This has been a most extraordinary day,\" thought Jack; \"the strangest\nday I have had yet.\" And after he had eaten a good supper of what the\nparrots had brought, he felt so tired and sleepy that he laid down in\nthe boat, and presently fell fast asleep. His fairies were sound\nasleep too in his pockets, and nothing happened of the least\nconsequence; so he slept comfortably till morning.\n\n\n\n\nCHAPTER VI. THE TOWN WITH NOBODY IN IT.\n\n  \"Master,\" quoth the auld hound,\n    \"Where will ye go?\"\n  \"Over moss, over muir.\n    To court my new jo.\"\n  \"Master, though the night be merk,\n    I'se follow through the snow.\n\n  \"Court her, master, court her,\n    So shall ye do weel;\n  But and ben she'll guide the house,\n    I'se get milk and meal.\n  Ye'se get lilting while she sits\n    With her rock and reel.\"\n\n  \"For, oh! she has a sweet tongue,\n    And een that look down,\n  A gold girdle for her waist,\n    And a purple gown.\n  She has a good word forbye\n    Fra a' folk in the town.\"\n\n\nSoon after sunrise they came to a great city, and it was perfectly\nstill. There were grand towers and terraces, wharves, too, and a\nlarge market, but there was nobody anywhere to be seen. Jack thought\nthat might be because it was so early in the morning; and when the\nboat ran itself up against a wooden wharf and stopped, he jumped\nashore, for he thought this must be the end of his journey. A\ndelightful town it was, if only there had been any people in it! The\nmarket-place was full of stalls, on which were spread toys, baskets,\nfruit, butter, vegetables, and all the other things that are usually\nsold in a market.\n\nJack walked about in it. Then he looked in at the open doors of the\nhouses, and at last, finding that they were all empty, he walked into\none, looked at the rooms, examined the picture-books, rang the bells,\nand set the musical-boxes going. Then, after he had shouted a good\ndeal, and tried in vain to make some one hear, he went back to the\nedge of the river where his boat was lying, and the water was so\ndelightfully clear and calm, that he thought he would bathe. So he\ntook off his clothes, and folding them very carefully, so as not to\nhurt the fairies, laid them down beside a hay-cock, and went in, and\nran about and paddled for a long time,--much longer than there was any\noccasion for; but then he had nothing to do.\n\nWhen at last he had finished, he ran to the hay-cock and began to\ndress himself; but he could not find his stockings, and after looking\nabout for some time he was obliged to put on his clothes without them,\nand he was going to put his boots on his bare feet, when, walking to\nthe other side of the hay-cock, he saw a little old woman about as\nlarge as himself. She had a pair of spectacles on, and she was\nknitting.\n\nShe looked so sweet-tempered that Jack asked her if she knew anything\nabout his stockings.\n\n\"It will be time enough to ask for them when you have had your\nbreakfast,\" said she. \"Sit down. Welcome to our town. How do you like\nit?\"\n\n[JACK'S NEW FRIEND.\n\n\"She had a pair of spectacles on, and she was knitting.\"--PAGE 82.]\n\n\"I should like it very much indeed,\" said Jack, \"if there was anybody\nin it.\"\n\n\"I'm glad of that,\" said the woman. \"You've seen a good deal of it;\nbut it pleases me to find that you are a very honest boy. You did not\ntake anything at all. I am honest too.\"\n\n\"Yes,\" said Jack, \"of course you are.\"\n\n\"And as I am pleased with you for being honest,\" continued the little\nwoman, \"I shall give you some breakfast out of my basket.\" So she took\nout a saucer full of honey, a roll of bread, and a cup of milk.\n\n\"Thank you,\" said Jack, \"but I am not a beggar-boy; I have got a\nhalf-crown, a shilling, a sixpence, and two pence; so I can buy this\nbreakfast of you, if you like. You look very poor.\"\n\n\"Do I?\" said the little woman, softly; and she went on knitting, and\nJack began to eat the breakfast.\n\n\"I wonder what has become of my stockings,\" said Jack.\n\n\"You will never see them any more,\" said the old woman. \"I threw them\ninto the river, and they floated away.\"\n\n\"Why did you?\" asked Jack.\n\nThe little woman took no notice; but presently she had finished a\nbeautiful pair of stockings, and she handed them to Jack, and said,--\n\n\"Is that like the pair you lost?\"\n\n\"Oh no,\" said Jack; \"these are much more beautiful stockings than\nmine.\"\n\n\"Do you like them as well?\" asked the fairy woman.\n\n\"I like them much better,\" said Jack, putting them on. \"How clever you\nare!\"\n\n\"Would you like to wear these,\" said the woman, \"instead of yours?\"\n\nShe gave Jack such a strange look when she said this, that he was\nafraid to take them, and answered,--\n\n\"I shouldn't like to wear them if you think I had better not.\"\n\n\"Well,\" she answered, \"I am very honest, as I told you; and therefore\nI am obliged to say that if I were you I would not wear those\nstockings on any account.\"\n\n\"Why not?\" said Jack; for she looked so sweet-tempered that he could\nnot help trusting her.\n\n\"Why not?\" repeated the fairy; \"why, because when you have those\nstockings on, your feet belong to me.\"\n\n\"Oh!\" said Jack. \"Well, if you think that matters, I'll take them off\nagain. Do you think it matters?\"\n\n\"Yes,\" said the fairy woman; \"it matters, because I am a slave, and my\nmaster can make me do whatever he pleases, for I am completely in his\npower. So, if he found out that I had knitted these stockings for you,\nhe would make me order you to walk into his mill,--the mill which\ngrinds the corn for the town; and there you would have to grind and\ngrind till I got free again.\"\n\nWhen Jack heard this, he pulled off the beautiful stockings, and laid\nthem on the old woman's lap. Upon this she burst out crying, as if\nher heart would break.\n\n\"If my fairies that I have in my pocket would only wake,\" said Jack,\n\"I would fight your master; for if he is no bigger than you are,\nperhaps I could beat him, and get you away.\"\n\n\"No, Jack,\" said the little woman; \"that would be of no use. The only\nthing you could do would be to buy me; for my cruel master has said\nthat if ever I am late again he shall sell me in the slave market to\nthe brown people, who work underground. And, though I am dreadfully\nafraid of my master, I mean to be late to-day, in hopes (as you are\nkind, and as you have some money) that you will come to the\nslave-market and buy me. Can you buy me, Jack, to be your slave?\"\n\n\"I don't want a slave,\" said Jack; \"and, besides, I have hardly any\nmoney to buy you with.\"\n\n\"But it is real money,\" said the fairy woman, \"not like what my master\nhas. His money has to be made every week, for if there comes a hot\nday it cracks, so it never has time to look old, as your half-crown\ndoes; and that is how we know the real money, for we cannot imitate\nanything that is old. Oh, now, now it is twelve o'clock! now I am late\nagain! and though I said I would do it, I am so frightened!\"\n\nSo saying, the little woman ran off towards the town, wringing her\nhands, and Jack ran beside her.\n\n\"How am I to find your master?\" he said.\n\n\"O Jack, buy me! buy me!\" cried the fairy woman. \"You will find me in\nthe slave-market. Bid high for me. Go back and put your boots on, and\nbid high.\"\n\nNow Jack had nothing on his feet, so he left the poor little woman to\nrun into the town by herself, and went back to put his boots on. They\nwere very uncomfortable, as he had no stockings; but he did not much\nmind that, and he counted his money. There was the half-crown that his\ngrandmamma had given him on his birthday, there was a shilling, a\nsixpence, and two pence, besides a silver fourpenny-piece which he had\nforgotten. He then marched into the town; and now it was quite full of\npeople,--all of them little men and women about his own height. They\nthought he was somebody of consequence, and they called out to him to\nbuy their goods. And he bought some stockings, and said, \"What I want\nto buy now is a slave.\"\n\nSo they showed him the way to the slave-market, and there whole rows\nof odd-looking little people were sitting, while in front of them\nstood the slaves.\n\nNow Jack had observed as he came along how very disrespectful the dogs\nof that town were to the people. They had a habit of going up to them\nand smelling at their legs, and even gnawing their feet as they sat\nbefore the little tables selling their wares; and what made this more\nsurprising was that the people did not always seem to find out when\nthey were being gnawed. But the moment the dogs saw Jack they came and\nfawned on him, and two old hounds followed him all the way to the\nslave-market; and when he took a seat one of them laid down at his\nfeet, and said, \"Master, set your handsome feet on my back, that they\nmay be out of the dust.\"\n\n\"Don't be afraid of him,\" said the other hound; \"he won't gnaw your\nfeet. He knows well enough that they are real ones.\"\n\n\"Are the other people's feet not real?\" asked Jack.\n\n\"Of course not,\" said the hound. \"They had a feud long ago with the\nfairies, and they all went one night into a great corn-field which\nbelonged to these enemies of theirs, intending to steal the corn. So\nthey made themselves invisible, as they are always obliged to do till\ntwelve o'clock at noon; but before morning dawn, the wheat being quite\nripe, down came the fairies with their sickles, surrounded the field,\nand cut the corn. So all their legs of course got cut off with it, for\nwhen they are invisible they cannot stir. Ever since that they have\nbeen obliged to make their legs of wood.\"\n\nWhile the hound was telling this story Jack looked about, but he did\nnot see one slave who was in the least like his poor little friend,\nand he was beginning to be afraid that he should not find her, when he\nheard two people talking together.\n\n\"Good-day!\" said one. \"So you have sold that good-for-nothing slave of\nyours?\"\n\n\"Yes,\" answered a very cross-looking old man. \"She was late again this\nmorning, and came to me crying and praying to be forgiven; but I was\ndetermined to make an example of her, so I sold her at once to\nClink-of-the-Hole, and he has just driven her away to work in his\nmine.\"\n\nJack, on hearing this, whispered to the hound at his feet, \"If you\nwill guide me to Clink's hole, you shall be my dog.\"\n\n\"Master, I will do my best,\" answered the hound; and he stole softly\nout of the market, Jack following him.\n\n\n\n\nCHAPTER VII. HALF-A-CROWN.\n\n  So useful it is to have money, heigh ho!\n    So useful it is to have money!\n\n  A. H. CLOUGH.\n\n\nThe old hound went straight through the town, smelling Clink's\nfootsteps, till he came into a large field of barley; and there,\nsitting against a sheaf, for it was harvest time, they found\nClink-of-the-Hole. He was a very ugly little brown man, and he was\nsmoking a pipe in the shade; while crouched near him was the poor\nlittle woman, with her hands spread before her face.\n\n\"Good-day, sir,\" said Clink to Jack. \"You are a stranger here, no\ndoubt?\"\n\n\"Yes,\" said Jack; \"I only arrived this morning.\"\n\n\"Have you seen the town?\" asked Clink, civilly; \"there is a very fine\nmarket.\"\n\n\"Yes, I have seen the market,\" answered Jack. \"I went into it to buy a\nslave, but I did not see one that I liked.\"\n\n\"Ah!\" said Clink; \"and yet they had some very fine articles.\" Here he\npointed to the poor little woman, and said, \"Now that's a useful body\nenough, and I had her very cheap.\"\n\n\"What did you give for her?\" said Jack, sitting down.\n\n\"Three pitchers,\" said Clink, \"and fifteen cups and saucers, and two\nshillings in the money of the town.\"\n\n\"Is their money like this?\" said Jack, taking out his shilling.\n\nWhen Clink saw the shilling he changed color, and said, very\nearnestly, \"Where did you get that, dear sir?\"\n\n\"Oh, it was given me,\" said Jack, carelessly.\n\nClink looked hard at the shilling, and so did the fairy woman, and\nJack let them look some time, for he amused himself with throwing it\nup several times and catching it. At last he put it back in his\npocket, and then Clink heaved a deep sigh. Then Jack took out a penny,\nand began to toss that up, upon which, to his great surprise, the\nlittle brown man fell on his knees, and said, \"Oh, a shilling and a\npenny,--a shilling and a penny of mortal coin! What would I not give\nfor a shilling and a penny!\"\n\n\"I don't believe you have got anything to give,\" said Jack, cunningly;\n\"I see nothing but that ring on your finger, and the old woman.\"\n\n\"But I have a great many things at home, sir,\" said the brown man,\nwiping his eyes; \"and besides, that ring would be cheap at a\nshilling,--even a shilling of mortal coin.\"\n\n\"Would the slave be cheap at a penny?\" said Jack.\n\n\"Would you give a penny for her, dear sir?\" inquired Clink, trembling\nwith eagerness.\n\n\"She is honest,\" answered Jack; \"ask her whether I had better buy her\nwith this penny.\"\n\n\"It does not matter what she says,\" replied the brown man; \"I would\nsell twenty such as she is for a penny,--a real one.\"\n\n\"Ask her,\" repeated Jack; and the poor little woman wept bitterly, but\nshe said, \"No.\"\n\n\"Why not?\" asked Jack; but she only hung down her head and cried.\n\n\"I'll make you suffer for this,\" said the brown man. But when Jack\ntook out the shilling, and said, \"Shall I buy you with this, slave?\"\nhis eyes actually shot out sparks, he was so eager.\n\n\"Speak!\" he said to the fairy woman; \"and if you don't say 'Yes,' I'll\nstrike you.\"\n\n\"He cannot buy me with that,\" answered the fairy woman, \"unless it is\nthe most valuable coin he has got.\"\n\nThe brown man, on hearing this, rose up in a rage, and was just going\nto strike her a terrible blow, when Jack cried out, \"Stop!\" and took\nout his half-crown.\n\n\"Can I buy you with this?\" said he; and the fairy woman answered,\n\"Yes.\"\n\nUpon this Clink drew a long breath, and his eyes grew bigger and\nbigger as he gazed at the half-crown.\n\n\"Shall she be my slave forever, and not yours,\" said Jack, \"if I give\nyou this?\"\n\n\"She shall,\" said the brown man. And he made such a low bow, as he\ntook the money, that his head actually knocked the ground. Then he\njumped up; and, as if he was afraid Jack should repent of his bargain,\nhe ran off towards the hole in the hill with all his might, shouting\nfor joy as he went.\n\n\"Slave,\" said Jack, \"that is a very ragged old apron that you have\ngot, and your gown is quite worn out. Don't you think we had better\nspend my shilling in buying you some new clothes? You look so very\nshabby.\"\n\n\"Do I?\" said the fairy woman, gently. \"Well, master, you will do as\nyou please.\"\n\n\"But you know better than I do,\" said Jack, \"though you are my\nslave.\"\n\n\"You had better give me the shilling, then,\" answered the little old\nwoman; \"and then I advise you to go back to the boat, and wait there\ntill I come.\"\n\n\"What!\" said Jack; \"can you go all the way back into the town again? I\nthink you must be tired, for you know you are so very old.\"\n\nThe fairy woman laughed when Jack said this, and she had such a sweet\nlaugh that he loved to hear it; but she took the shilling, and trudged\noff to the town, and he went back to the boat, his hound running after\nhim.\n\nHe was a long time going, for he ran a good many times after\nbutterflies, and then he climbed up several trees; and altogether he\namused himself for such a long while that when he reached the boat his\nfairy woman was there before him. So he stepped on board, the hound\nfollowed, and the boat immediately began to swim on.\n\n\"Why, you have not bought any new clothes!\" said Jack to his slave.\n\n\"No, master,\" answered the fairy woman; \"but I have bought what I\nwanted.\" And she took out of her pocket a little tiny piece of\npurple ribbon, with a gold-colored satin edge, and a very small\ntortoise-shell comb.\n\nWhen Jack saw these he was vexed, and said, \"What do you mean by being\nso silly? I can't scold you properly, because I don't know what name\nto call you by, and I don't like to say 'Slave,' because that sounds\nso rude. Why, this bit of ribbon is such a little bit that it's of no\nuse at all. It's not large enough even to make one mitten of.\"\n\n\"Isn't it?\" said the slave. \"Just take hold of it, master, and let us\nsee if it will stretch.\"\n\nSo Jack did. And she pulled, and he pulled, and very soon the silk had\nstretched till it was nearly as large as a handkerchief; and then she\nshook it, and they pulled again. \"This is very good fun,\" said Jack;\n\"why now it is as large as an apron.\"\n\nSo she shook it again, and gave it a twitch here and a pat there; and\nthen they pulled again, and the silk suddenly stretched so wide that\nJack was very nearly falling overboard. So Jack's slave pulled off her\nragged gown and apron, and put it on. It was a most beautiful robe of\npurple silk; it had a gold border, and it just fitted her.\n\n[JACK'S SLAVE.\n\n\"These are fairies,\" said Jack's slave; \"but what are you?\"--PAGE 99.]\n\n\"That will do,\" she said. And then she took out the little tortoise-shell\ncomb, pulled off her cap, and threw it into the river. She had a little\nknot of soft, gray hair, and she let it down, and began to comb. And as\nshe combed the hair got much longer and thicker, till it fell in waves\nall about her throat. Then she combed again, and it all turned\ngold-color, and came tumbling down to her waist; and then she stood up\nin the boat, and combed once more, and shook out the hair, and there was\nsuch a quantity that it reached down to her feet, and she was so\ncovered with it that you could not see one bit of her, excepting her\neyes, which peeped out, and looked bright and full of tears.\n\nThen she began to gather up her lovely locks; and when she had dried\nher eyes with them, she said, \"Master, do you know what you have done?\nlook at me now!\" So she threw back the hair from her face, and it was\na beautiful young face; and she looked so happy that Jack was glad he\nhad bought her with his half-crown,--so glad that he could not help\ncrying, and the fair slave cried too; and then instantly the little\nfairies woke, and sprang out of Jack's pockets. As they did so,\nJovinian cried out, \"Madam, I am your most humble servant\"; and\nRoxaletta said, \"I hope your Grace is well\"; but the third got on\nJack's knee, and took hold of the buttons of his waistcoat, and when\nthe lovely slave looked at her, she hid her face and blushed with\npretty childish shyness.\n\n\"These are fairies,\" said Jack's slave; \"but what are you?\"\n\n\"Jack kissed me,\" said the little thing; \"and I want to sit on his\nknee.\"\n\n\"Yes,\" said Jack; \"I took them out, and laid them in a row, to see\nthat they were safe, and this one I kissed, because she looked such a\nlittle dear.\"\n\n\"Was she not like the others, then?\" asked the slave.\n\n\"Yes,\" said Jack; \"but I liked her the best; she was my favorite.\"\n\nNow, the instant these three fairies sprang out of Jack's pockets,\nthey got very much larger; in fact, they became fully grown,--that is\nto say, they measured exactly one foot one inch in height, which, as\nmost people know, is exactly the proper height for fairies of that\ntribe. The two who had sprung out first were very beautifully dressed.\nOne had a green velvet coat, and a sword, the hilt of which was\nincrusted with diamonds. The second had a white spangled robe, and the\nloveliest rubies and emeralds round her neck and in her hair; but the\nthird, the one who sat on Jack's knee, had a white frock and a blue\nsash on. She had soft, fat arms, and a face just like that of a sweet\nlittle child.\n\nWhen Jack's slave saw this, she took the little creature on her\nknee, and said to her, \"How comes it that you are not like your\ncompanions?\"\n\nAnd she answered, in a pretty lisping voice, \"It's because Jack kissed\nme.\"\n\n\"Even so it must be,\" answered the slave; \"the love of a mortal works\nchanges indeed. It is not often that we win anything so precious.\nHere, master, let her sit on your knee sometimes, and take care of\nher, for she cannot now take the same care of herself that others of\nher race are capable of.\"\n\nSo Jack let little Mopsa sit on his knee; and when he was tired of\nadmiring his slave, and wondering at the respect with which the other\ntwo fairies treated her, and at their cleverness in getting\nwater-lilies for her, and fanning her with feathers, he curled himself\nup in the bottom of the boat with his own little favorite, and taught\nher how to play at cat's-cradle.\n\nWhen they had been playing some time, and Mopsa was getting quite\nclever at the game, the lovely slave said, \"Master, it is a long time\nsince you spoke to me.\"\n\n\"And yet,\" said Jack, \"there is something that I particularly want to\nask you about.\"\n\n\"Ask it then,\" she replied.\n\n\"I don't like to have a slave,\" answered Jack; \"and as you are so\nclever, don't you think you can find out how to be free again?\"\n\n\"I am very glad you asked me about that,\" said the fairy woman. \"Yes,\nmaster, I wish very much to be free; and as you were so kind as to\ngive the most valuable piece of real money you possessed in order to\nbuy me, I can be free if you can think of anything that you really\nlike better than that half-crown, and if I can give it you.\"\n\n\"Oh, there are many things,\" said Jack. \"I like going up this river\nto Fairyland much better.\"\n\n\"But you are going there, master,\" said the fairy woman; \"you were on\nthe way before I met with you.\"\n\n\"I like this little child better,\" said Jack; \"I love this little\nMopsa. I should like her to belong to me.\"\n\n\"She is yours,\" answered the fairy woman; \"she belongs to you already.\nThink of something else.\"\n\nJack thought again, and was so long about it that at last the\nbeautiful slave said to him, \"Master, do you see those purple\nmountains?\"\n\nJack turned round in the boat, and saw a splendid range of purple\nmountains, going up and up. They were very great and steep, each had a\ncrown of snow, and the sky was very red behind them, for the sun was\ngoing down.\n\n\"At the other side of those mountains is Fairyland,\" said the slave;\n\"but if you cannot think of something that you should like better to\nhave than your half-crown, I can never enter in. The river flows\nstraight up to yonder steep precipice, and there is a chasm in it\nwhich pierces it, and through which the river runs down beneath, among\nthe very roots of the mountains, till it comes out at the other side.\nThousands and thousands of the small people will come when they see\nthe boat, each with a silken thread in his hand; but if there is a\nslave in it, not all their strength and skill can tow it through. Look\nat those rafts on the river; on them are the small people coming up.\"\n\nJack looked, and saw that the river was spotted with rafts, on which\nwere crowded brown fairy sailors, each one with three green stripes on\nhis sleeve, which looked like good conduct marks. All these sailors\nwere chattering very fast, and the rafts were coming down to meet the\nboat.\n\n\"All these sailors to tow my slave!\" said Jack. \"I wonder, I do\nwonder, what you are?\" But the fairy woman only smiled, and Jack went\non: \"I have thought of something that I should like much better than\nmy half-crown. I should like to have a little tiny bit of that purple\ngown of yours with the gold border.\"\n\nThen the fairy woman said, \"I thank you, master. Now I can be free.\"\nSo she told Jack to lend her his knife, and with it she cut off a very\nsmall piece of the skirt of her robe, and gave it to him. \"Now mind,\"\nshe said, \"I advise you never to stretch this unless you want to make\nsome particular thing of it, for then it will only stretch to the\nright size; but if you merely begin to pull it for your own amusement,\nit will go on stretching and stretching, and I don't know where it\nwill stop.\"\n\n\n\n\nCHAPTER VIII. A STORY.\n\n  In the night she told a story,\n    In the night and all night through,\n  While the moon was in her glory,\n    And the branches dropped with dew.\n\n  'Twas my life she told, and round it\n    Rose the years as from a deep;\n  In the world's great heart she found it,\n    Cradled like a child asleep.\n\n  In the night I saw her weaving\n    By the misty moonbeam cold,\n  All the weft her shuttle cleaving\n    With a sacred thread of gold.\n\n  Ah! she wept me tears of sorrow,\n    Lulling tears so mystic sweet;\n  Then she wove my last to-morrow,\n    And her web lay at my feet.\n\n  Of my life she made the story:\n    I must weep--so soon 'twas told!\n  But your name did lend it glory,\n    And your love its thread of gold!\n\n\nBy this time, as the sun had gone down, and none of the moons had\nrisen, it would have been dark but that each of the rafts was rigged\nwith a small mast that had a lantern hung to it.\n\nBy the light of these lanterns Jack saw crowds of little brown faces;\nand presently many rafts had come up to the boat, which was now\nswimming very slowly. Every sailor in every raft fastened to the\nboat's side a silken thread; then the rafts were rowed to shore, and\nthe sailors jumped out, and began to tow the boat along.\n\n[A STORY.--PAGE 106.]\n\nThese crimson threads looked no stronger than the silk that ladies sew\nwith, yet by means of them the small people drew the boat along\nmerrily. There were so many of them that they looked like an army as\nthey marched in the light of the lanterns and torches. Jack thought\nthey were very happy, though the work was hard, for they shouted and\nsang.\n\nThe fairy woman looked more beautiful than ever now, and far more\nstately. She had on a band of precious stones to bind back her hair,\nand they shone so brightly in the night that her features could be\nclearly seen.\n\nJack's little favorite was fast asleep, and the other two fairies had\nflown away. He was beginning to feel rather sleepy himself, when he\nwas roused by the voice of his free lady, who said to him, \"Jack,\nthere is no one listening now, so I will tell you my story. I am the\nFairy Queen!\"\n\nJack opened his eyes very wide, but he was so much surprised that he\ndid not say a word.\n\n\"One day, long, long ago,\" said the Queen, \"I was discontented with my\nown happy country. I wished to see the world, so I set forth with a\nnumber of the one-foot-one fairies, and went down the wonderful river,\nthinking to see the world.\n\n\"So we sailed down the river till we came to that town which you know\nof; and there, in the very middle of the stream, stood a tower,--a\ntall tower, built upon a rock.\n\n\"Fairies are afraid of nothing but of other fairies, and we did not\nthink this tower was fairy-work, so we left our ship and went up the\nrock and into the tower, to see what it was like; but just as we had\ndescended into the dungeon keep, we heard the gurgling of water\noverhead, and down came the tower. It was nothing but water enchanted\ninto the likeness of stone, and we all fell down with it into the very\nbed of the river.\n\n\"Of course we were not drowned, but there we were obliged to lie, for\nwe have no power out of our own element; and the next day the\ntowns-people came down with a net and dragged the river, picked us all\nout of the meshes, and made us slaves. The one-foot-one fairies got\naway shortly; but from that day to this, in sorrow and distress, I\nhave had to serve my masters. Luckily, my crown had fallen off in the\nwater, so I was not known to be the Queen; but till you came, Jack, I\nhad almost forgotten that I had ever been happy and free, and I had\nhardly any hope of getting away.\"\n\n\"How sorry your people must have been,\" said Jack, \"when they found\nyou did not come home again.\"\n\n\"No,\" said the Queen: \"they only went to sleep, and they will not wake\ntill to-morrow morning, when I pass in again. They will think I have\nbeen absent for a day, and so will the apple-woman. You must not\nundeceive them; if you do, they will be very angry.\"\n\n\"And who is the apple-woman?\" inquired Jack; but the Queen blushed,\nand pretended not to hear the question, so he repeated,--\n\n\"Queen, who is the apple-woman?\"\n\n\"I've only had her for a very little while,\" said the Queen,\nevasively.\n\n\"And how long do you think you have been a slave. Queen?\" asked Jack.\n\n\"I don't know,\" said the Queen. \"I have never been able to make up my\nmind about that.\"\n\nAnd now all the moons began to shine, and all the trees lighted\nthemselves up, for almost every leaf had a glowworm or a fire-fly on\nit, and the water was full of fishes that had shining eyes. And now\nthey were close to the steep mountain side; and Jack looked and saw an\nopening in it, into which the river ran. It was a kind of cave,\nsomething like a long, long church with a vaulted roof, only the\npavement of it was that magic river, and a narrow towing-path ran on\neither side.\n\nAs they entered the cave there was a hollow, murmuring sound, and the\nQueen's crown became so bright that it lighted up the whole boat; at\nthe same time she began to tell Jack a wonderful story, which he liked\nvery much to hear, but every fresh thing she said he forgot what had\ngone before; and at last, though he tried very hard to listen, he was\nobliged to go to sleep; and he slept soundly, and never dreamed of\nanything, till it was morning.\n\nHe saw such a curious sight when he woke! They had been going through\nthis underground cavern all night, and now they were approaching its\nopening on the other side. This opening, because they were a good way\nfrom it yet, looked like a lovely little round window of blue and\nyellow and green glass, but as they drew on he could see far-off\nmountains, blue sky, and a country all covered with sunshine.\n\nHe heard singing, too, such as fairies make; and he saw some beautiful\npeople, such as those fairies whom he had brought with him. They were\ncoming along the towing-path. They were all lady fairies; but they\nwere not very polite, for as each one came up she took a silken rope\nout of a brown sailor's hand, and gave him a shove which pushed him\ninto the water. In fact, the water became filled with such swarms of\nthese sailors that the boat could hardly get on. But the poor little\nbrown fellows did not seem to mind this conduct, for they plunged and\nshook themselves about, scattering a good deal of spray. Then they all\nsuddenly dived, and when they came up again they were ducks,--nothing\nbut brown ducks, I assure you, with green stripes on their wings; and\nwith a great deal of quacking and floundering, they all began to swim\nback again as fast as they could.\n\nThen Jack was a good deal vexed, and he said to himself, \"If nobody\nthanks the ducks for towing us I will\"; so he stood up in the boat and\nshouted, \"Thank you, ducks; we are very much obliged to you!\" But\nneither the Queen nor these new towers took the least notice, and\ngradually the boat came out of that dim cave and entered Fairyland,\nwhile the river became so narrow that you could hear the song of the\ntowers quite easily; those on the right bank sang the first verse, and\nthose on the left bank answered:--\n\n  Drop, drop from the leaves of lign aloes,\n    O honey-dew! drop from the tree.\n  Float up through your clear river shallows,\n    White lilies, beloved of the bee.\n\n  Let the people, O Queen! say, and bless thee,\n    Her bounty drops soft as the dew,\n  And spotless in honor confess thee,\n    As lilies are spotless in hue.\n\n  On the roof stands yon white stork awaking,\n    His feathers flush rosy the while,\n  For, lo! from the blushing east breaking,\n    The sun sheds the bloom of his smile.\n\n  Let them boast of thy word, \"It is certain;\n    We doubt it no more,\" let them say,\n  \"Than to-morrow that night's dusky curtain\n    Shall roll back its folds for the day.\"\n\n\"Master,\" whispered the old hound, who was lying at Jack's feet.\n\n\"Well,\" said Jack.\n\n\"They didn't invent that song themselves,\" said the hound; \"the old\napple-woman taught it to them,--the woman whom they love because she\ncan make them cry.\"\n\nJack was rather ashamed of the hound's rudeness in saying this; but\nthe Queen took no notice. And now they had reached a little\nlanding-place, which ran out a few feet into the river, and was\nstrewed thickly with cowslips and violets.\n\n[THE QUEEN.\n\n\"Here the boat stopped, and the Queen rose and got out.\"--PAGE 114.]\n\nHere the boat stopped, and the Queen rose and got out.\n\nJack watched her. A whole crowd of one-foot-one fairies came down a\ngarden to meet her, and he saw them conduct her to a beautiful tent,\nwith golden poles and a silken covering; but nobody took the slightest\nnotice of him, or of little Mopsa, or of the hound, and after a long\nsilence the hound said, \"Well, master, don't you feel hungry? Why\ndon't you go with the others and have some breakfast?\"\n\n\"The Queen didn't invite me,\" said Jack.\n\n\"But do you feel as if you couldn't go?\" asked the hound.\n\n\"Of course not,\" answered Jack; \"but perhaps I may not.\"\n\n\"Oh, yes, master,\" replied the hound; \"whatever you _can_ do in\nFairyland you _may_ do.\"\n\n\"Are you sure of that?\" asked Jack.\n\n\"Quite sure, master,\" said the hound; \"and I am hungry too.\"\n\n\"Well,\" said Jack, \"I will go there and take Mopsa. She shall ride on\nmy shoulder; you may follow.\"\n\nSo he walked up that beautiful garden till he came to the great tent.\nA banquet was going on inside. All the one-foot-one fairies sat down\nthe sides of the table, and at the top sat the Queen on a larger\nchair; and there were two empty chairs, one on each side of her.\n\nJack blushed; but the hound whispering again, \"Master, whatever you\ncan do you may do,\" he came slowly up the table towards the Queen, who\nwas saying, as he drew near, \"Where is our trusty and well-beloved,\nthe apple-woman?\" And she took no notice of Jack; so, though he could\nnot help feeling rather red and ashamed, he went and sat in the chair\nbeside her with Mopsa still on his shoulder. Mopsa laughed for joy\nwhen she saw the feast. The Queen said, \"O Jack, I am so glad to see\nyou!\" and some of the one-foot-one fairies cried out, \"What a\ndelightful little creature that is! She can laugh! Perhaps she can\nalso cry!\"\n\nJack looked about, but there was no seat for Mopsa; and he was afraid\nto let her run about on the floor, lest she should be hurt.\n\nThere was a very large dish standing before the Queen; for though the\npeople were small, the plates and dishes were exactly like those we\nuse, and of the same size.\n\nThis dish was raised on a foot, and filled with grapes and peaches.\nJack wondered at himself for doing it, but he saw no other place for\nMopsa; so he took out the fruit, laid it round the dish, and set his\nown little one-foot-one in the dish.\n\nNobody looked in the least surprised; and there she sat very happily,\nbiting an apple with her small white teeth.\n\nThen, as they brought him nothing to eat, Jack helped himself from\nsome of the dishes before him, and found that a fairy breakfast was\nvery nice indeed.\n\nIn the meantime there was a noise outside, and in stumped an elderly\nwoman. She had very thick boots on, a short gown of red print, an\norange cotton handkerchief over her shoulders, and a black silk\nbonnet. She was exactly the same height as the Queen,--for of course\nnobody in Fairyland is allowed to be any bigger than the Queen; so, if\nthey are not children when they arrive, they are obliged to shrink.\n\n\"How are you, dear?\" said the Queen.\n\n\"I am as well as can be expected,\" answered the apple-woman, sitting\ndown in the empty chair. \"Now, then, where's my tea? They're never\nready with my cup of tea.\"\n\nTwo attendants immediately brought a cup of tea, and set it down\nbefore the apple-woman, with a plate of bread and butter; and she\nproceeded to pour it into the saucer, and blow it, because it was hot.\nIn so doing her wandering eyes caught sight of Jack and little Mopsa,\nand she set down the saucer, and looked at them with attention.\n\nNow Mopsa, I am sorry to say, was behaving so badly that Jack was\nquite ashamed of her. First, she got out of her dish, took something\nnice out of the Queen's plate with her fingers, and ate it; and then,\nas she was going back, she tumbled over a melon, and upset a glass of\nred wine, which she wiped up with her white frock; after which she got\ninto her dish again, and there she sat smiling, and daubing her pretty\nface with a piece of buttered muffin.\n\n\"Mopsa,\" said Jack, \"you are very naughty; if you behave in this way,\nI shall never take you out to parties again.\"\n\n\"Pretty lamb!\" said the apple-woman; \"It's just like a child.\" And\nthen she burst into tears, and exclaimed, sobbing, \"It's many a long\nday since I've seen a child. Oh dear! oh deary me!\"\n\nUpon this, to the astonishment of Jack, every one of the guests began\nto cry and sob too.\n\n\"Oh dear! oh dear!\" they said to one another, \"we're crying; we can\ncry just as well as men and women. Isn't it delightful? What a luxury\nit is to cry, to be sure!\"\n\nThey were evidently quite proud of it; and when Jack looked at the\nQueen for an explanation, she only gave him a still little smile.\n\nBut Mopsa crept along the table to the apple-woman, let her take her\nand hug her, and seemed to like her very much; for as she sat on her\nknee, she patted her brown face with a little dimpled hand.\n\n\"I should like vastly well to be her nurse,\" said the apple-woman,\ndrying her eyes, and looking at Jack.\n\n\"If you'll always wash her, and put clean frocks on her, you may,\"\nsaid Jack; \"for just look at her,--what a figure she is already!\"\n\nUpon this the apple-woman laughed for joy, and again every one else\ndid the same. The fairies can only laugh and cry when they see mortals\ndo so.\n\n\n\n\nCHAPTER IX. AFTER THE PARTY.\n\n  _Stephano._--This will prove a brave kingdom to me,\n              Where I shall have my music for nothing.\n\n  _The Tempest._\n\n\nWhen breakfast was over, the guests got up, one after the other,\nwithout taking the least notice of the Queen; and the tent began to\nget so thin and transparent that you could see the trees and the sky\nthrough it. At last, it looked only like a colored mist, with blue,\nand green, and yellow stripes, and then it was gone; and the table and\nall the things on it began to go in the same way. Only Jack, and the\napple-woman, and Mopsa were left, sitting on their chairs, with the\nQueen between them.\n\nPresently, the Queen's lips began to move, and her eyes looked\nstraight before her, as she sat upright in her chair. Whereupon the\napple-woman snatched up Mopsa, and, seizing Jack's hand, hurried him\noff, exclaiming, \"Come away! come away! She is going to tell one of\nher stories; and if you listen, you'll be obliged to go to sleep, and\nsleep nobody knows how long.\"\n\nJack did not want to go to sleep; he wished to go down to the river\nagain, and see what had become of his boat, for he had left his cap\nand several other things in it.\n\nSo he parted from the apple-woman,--who took Mopsa with her, and said\nhe would find her again when he wanted her at her apple-stall,--and\nwent down to the boat, where he saw that his faithful hound was there\nbefore him.\n\n\"It was lucky, master, that I came when I did,\" said the hound, \"for a\ndozen or so of those one-foot-one fellows were just shoving it off,\nand you will want it at night to sleep in.\"\n\n\"Yes,\" said Jack; \"and I can stretch the bit of purple silk to make a\ncanopy over head,--a sort of awning,--for I should not like to sleep\nin tents or palaces that are inclined to melt away.\"\n\nSo the hound with his teeth, and Jack with his hands, pulled and\npulled at the silk till it was large enough to make a splendid canopy,\nlike a tent; and it reached down to the water's edge, and roofed in\nall the after part of the boat.\n\nSo now he had a delightful little home of his own; and there was no\nfear of its being blown away, for no wind ever blows in Fairyland. All\nthe trees are quite still, no leaf rustles, and the flowers lie on the\nground exactly where they fall.\n\nAfter this Jack told the hound to watch his boat, and went himself in\nsearch of the apple-woman. Not one fairy was to be seen, any more than\nif he had been in his own country, and he wandered down the green\nmargin of the river till he saw the apple-woman sitting at a small\nstall with apples on it, and cherries tied to sticks, and some\ndry-looking nuts. She had Mopsa on her knee, and had washed her face,\nand put a beautiful clean white frock on her.\n\n\"Where are all the fairies gone to?\" asked Jack.\n\n\"I never take any notice of that common trash and their doings,\" she\nanswered. \"When the Queen takes to telling her stories they are\ngenerally frightened, and go and sit in the tops of the trees.\"\n\n\"But you seem very fond of Mopsa,\" said Jack, \"and she is one of them.\nYou will help me to take care of her, won't you, tills she grows a\nlittle older?\"\n\n\"Grows!\" said the apple-woman, laughing. \"Grows! Why you don't think,\nsurely, that she will ever be any different from what she is now?\"\n\n\"I thought she would grow up,\" said Jack.\n\n\"They never change so long as they last,\" answered the apple-woman,\n\"when once they are one-foot-one high.\"\n\n\"Mopsa,\" said Jack, \"come here, and I'll measure you.\"\n\nMopsa came dancing towards Jack, and he tried to measure her, first\nwith a yard measure that the apple-woman took out of her pocket, and\nthen with a stick, and then with a bit of string; but Mopsa would not\nstand steady, and at last it ended in their having a good game of\nromps together, and a race; but when he carried her back, sitting on\nhis shoulder, he was sorry to see that the apple-woman was crying\nagain, and he asked her kindly what she did it for.\n\n\"It is because,\" she answered, \"I shall never see my own country any\nmore, nor any men and women and children, excepting such as by a rare\nchance stray in for a little while as you have done.\"\n\n\"I can go back whenever I please,\" said Jack. \"Why don't you?\"\n\n\"Because I came in of my own good-will, after I had had fair warning\nthat if I came at all it would end in my staying always. Besides, I\ndon't know that I exactly wish to go home again: I should be afraid.\"\n\n\"Afraid of what?\" asked Jack.\n\n\"Why, there's the rain and the cold, and not having anything to eat\nexcepting what you earn. And yet,\" said the apple-woman, \"I have three\nboys of my own at home; one of them must be nearly a man by this time,\nand the youngest is about as old as you are. If I went home I might\nfind one or more of those boys in jail, and then how miserable I\nshould be.\"\n\n\"But you are not happy as it is,\" said Jack. \"I have seen you cry.\"\n\n\"Yes,\" said the apple-woman; \"but now I live here I don't care about\nanything so much as I used to do. 'May I have a satin gown and a\ncoach?' I asked, when first I came. 'You may have a hundred and fifty\nsatin gowns if you like,' said the Queen, 'and twenty coaches with six\ncream-colored horses to each.' But when I had been here a little time,\nand found I could have everything I wished for, and change it as\noften as I pleased, I began not to care for anything; and at last I\ngot so sick of all their grand things that I dressed myself in my own\nclothes that I came in, and made up my mind to have a stall and sit at\nit, as I used to do, selling apples. And I used to say to myself, 'I\nhave but to wish with all my heart to go home, and I can go, I know\nthat;' but oh dear! oh dear! I couldn't wish enough, for it would come\ninto my head that I should be poor, or that my boys would have\nforgotten me, or that my neighbors would look down on me, and so I\nalways put off wishing for another day. Now here is the Queen coming.\nSit down on the grass and play with Mopsa. Don't let her see us\ntalking together, lest she should think I have been telling you things\nwhich you ought not to know.\"\n\nJack looked, and saw the Queen coming slowly towards them, with her\nhands held out before her, as if it was dark. She felt her way, yet\nher eyes were wide open, and she was telling her stories all the\ntime.\n\n\"Don't you listen to a word she says,\" whispered the apple-woman; and\nthen, in order that Jack might not hear what the Queen was talking\nabout, she began to sing.\n\nShe had no sooner begun than up from the river came swarms of\none-foot-one fairies to listen, and hundreds of them dropped down from\nthe trees. The Queen, too, seemed to attend as they did, though she\nkept murmuring her story all the time; and nothing that any of them\ndid appeared to surprise the apple-woman,--she sang as if nobody was\ntaking any notice at all:--\n\n  When I sit on market-days amid the comers and the goers,\n    Oh! full oft I have a vision of the days without alloy,\n  And a ship comes up the river with a jolly gang of towers,\n    And a \"pull'e haul'e, pull'e haul'e, yoy! heave, hoy!\"\n\n  There is busy talk around me, all about mine ears it hummeth,\n    But the wooden wharves I look on, and a dancing, heaving buoy,\n  For 'tis tidetime in the river, and she cometh--oh, she cometh!\n    With a \"pull'e haul'e, pull'e haul'e, yoy! heave, hoy!\"\n\n  Then I hear the water washing, never golden waves were brighter,\n    And I hear the capstan creaking--'tis a sound that cannot cloy.\n  Bring her to, to ship her lading, brig or schooner, sloop or\n        lighter,\n    With a \"pull'e haul'e, pull'e haule, yoy! heave, hoy!\"\n\n  \"Will ye step aboard, my dearest? for the high seas lie before us.\"\n    So I sailed adown the river in those days without alloy.\n  We are launched! But when, I wonder, shall a sweeter sound float\n        o'er us\n    Than yon \"pull'e haul'e, pull'e haul'e, yoy! heave, hoy!\"\n\nAs the apple-woman left off singing, the Queen moved away, still\nmurmuring the words of her story, and Jack said,--\n\n\"Does the Queen tell stories of what has happened, or of what is going\nto happen?\"\n\n\"Why, of what is going to happen, of course,\" replied the woman.\n\"Anybody could tell the other sort.\"\n\n\"Because I heard a little of it,\" observed Jack. \"I thought she was\ntalking of me. She said 'So he took the measure, and Mopsa stood\nstill for once, and he found she was only one foot high, and she grew\na great deal after that. Yes, she can grow.'\"\n\n\"That's a fine hearing, and a strange hearing,\" said the apple-woman;\n\"and what did she mutter next?\"\n\n\"Of how she heard me sobbing,\" replied Jack; \"and while you went on\nabout stepping on board the ship, she said, 'He was very good to me,\ndear little fellow! But Fate is the name of my old mother, and she\nreigns here. Oh, she reigns! The fatal F is in her name, and I cannot\ntake it out!'\"\n\n\"Ah!\" replied the apple-woman, \"they all say that, and that they are\nfays, and that mortals call their history fable; they are always\ncrying out for an alphabet without the fatal F.\"\n\n\"And then she told how she heard Mopsa sobbing too,\" said Jack;\n\"sobbing among the reeds and rushes by the river side.\"\n\n\"There are no reeds, and no rushes either, here,\" said the\napple-woman, \"and I have walked the river from end to end. I don't\nthink much of that part of the story. But you are sure she said that\nMopsa was short of her proper height?\"\n\n\"Yes, and that she would grow; but that's nothing. In my country we\nalways grow.\"\n\n\"Hold your tongue about you country!\" said the apple-woman, sharply.\n\"Do you want to make enemies of them all?\"\n\nMopsa had been listening to this, and now she said, \"I don't love the\nQueen. She slapped my arm as she went by, and it hurts.\"\n\nMopsa showed her little fat arm as she spoke, and there was a red\nplace on it.\n\n\"That's odd, too,\" said the apple-woman; \"there's nothing red in a\ncommon fairy's veins. They have sap in them: that's why they can't\nblush.\"\n\nJust then the sun went down, and Mopsa got up on the apple-woman's\nlap, and went to sleep; and Jack, being tired, went to his boat and\nlay down under the purple canopy, his old hound lying at his feet to\nkeep guard over him.\n\nThe next morning, when he woke, a pretty voice called to him, \"Jack!\nJack!\" and he opened his eyes and saw Mopsa. The apple-woman had\ndressed her in a clean frock and blue shoes, and her hair was so long!\nShe was standing on the landing-place, close to him. \"O Jack! I'm so\nbig,\" she said. \"I grew in the night; look at me.\"\n\nJack looked. Yes, Mopsa had grown indeed; she had only just reached to\nhis knee the day before, and now her little bright head, when he\nmeasured her, came as high as the second button of his waistcoat.\n\n\"But I hope you will not go on growing so fast as this,\" said Jack,\n\"or you will be as tall as my mamma is in a week or two,--much too big\nfor me to play with.\"\n\n\n\n\nCHAPTER X. MOPSA LEARNS HER LETTERS.\n\n  A----apple-pie.\n  B----bit it.\n\n\n\"How ashamed I am,\" Jack said, \"to think that you don't know even your\nletters!\"\n\nMopsa replied that she thought that did not signify, and then she and\nJack began to play at jumping from the boat on to the bank, and back\nagain; and afterwards, as not a single fairy could be seen, they had\nbreakfast with the apple-woman.\n\n\"Where is the Queen?\" asked Jack.\n\nThe apple-woman answered, \"It's not the fashion to ask questions in\nFairyland.\"\n\n\"That's a pity,\" said Jack, \"for there are several things that I\nparticularly want to know about this country. Mayn't I even ask how\nbig it is?\"\n\n\"How big?\" said Mopsa,--little Mopsa looking as wise as possible.\n\"Why, the same size as your world, of course.\"\n\nJack laughed. \"It's the same world that you call yours,\" continued\nMopsa; \"and when I'm a little older, I'll explain it all to you.\"\n\n\"If it's our world,\" said Jack, \"why are none of us in it, excepting\nme and the apple-woman?\"\n\n\"That's because you've got something in your world that you call\nTIME,\" said Mopsa; \"so you talk about NOW, and you talk about THEN.\"\n\n\"And don't you?\" asked Jack.\n\n\"I do if I want to make you understand,\" said Mopsa.\n\nThe apple-woman laughed, and said, \"To think of the pretty thing\ntalking so queen-like already! Yes, that's right, and just what the\ngrown-up fairies say. Go on, and explain it to him if you can.\"\n\n\"You know,\" said Mopsa, \"that your people say there was a time when\nthere were none of them in the world,--a time before they were made.\nWell, THIS is that time. This is long ago.\"\n\n\"Nonsense!\" said Jack. \"Then how do I happen to be here?\"\n\n\"Because,\" said Mopsa, \"when the albatross brought you, she did not\nfly with you a long way off, but a long way back,--hundreds and\nhundreds of years. This is your world, as you can see; but none of\nyour people are here, because they are not made yet. I don't think any\nof them will be made for a thousand years.\"\n\n\"But I saw the old ships,\" answered Jack, \"in the enchanted bay.\"\n\n\"That was a border country,\" said Mopsa. \"I was asleep while you went\nthrough those countries; but these are the real Fairylands.\"\n\nJack was very much surprised when he heard Mopsa say these strange\nthings; and as he looked at her, he felt that a sleep was coming over\nhim, and he could not hold up his head. He felt how delightful it was\nto go to sleep; and though the apple-woman sprang to him, when she\nobserved that he was shutting his eyes, and though he heard her\nbegging and entreating him to keep awake, he did not want to do so;\nbut he let his head sink down on the mossy grass, which was as soft as\na pillow, and there, under the shade of a Guelder rose-tree, that kept\ndropping its white flowerets all over him, he had this dream:\n\nHe thought that Mopsa came running up to him, as he stood by the\nriver, and that he said to her, \"Oh, Mopsa, how old we are! We have\nlived back to the times before Adam and Eve!\"\n\n\"Yes,\" said Mopsa; \"but I don't feel old. Let us go down the river,\nand see what we can find.\"\n\nSo they got into the boat, and it floated into the middle of the\nriver, and then made for the opposite bank, where the water was warm\nand very muddy, and the river became so very wide that it seemed to be\nafternoon when they got near enough to see it clearly; and what they\nsaw was a boggy country, green, and full of little rills; but the\nwater,--which, as I told you, was thick and muddy,--the water was full\nof small holes! You never saw water with eyelet-holes in it; but Jack\ndid. On all sides of the boat he saw holes moving about in pairs, and\nsome were so close that he looked and saw their lining: they were\nlined with pink, and they snorted! Jack was afraid, but he considered\nthat this was such a long time ago that the holes, whatever they were,\ncould not hurt him; but it made him start, notwithstanding, when a\nhuge flat-head reared itself up close to the boat, and he found that\nthe holes were the nostrils of creatures who kept all the rest of\nthemselves under water.\n\nIn a minute or two, hundreds of ugly flat-heads popped up, and the\nboat danced among them as they floundered about in the water.\n\n\"I hope they won't upset us,\" said Jack. \"I wish you would land.\"\n\nMopsa said she would rather not, because she did not like the hairy\nelephants.\n\n\"There are no such things as hairy elephants,\" said Jack, in his\ndream; but he had hardly spoken when out of a wood close at hand some\nhuge creatures, far larger than our elephants, came jogging down to\nthe water. There were forty or fifty of them, and they were covered\nwith what looked like tow. In fact, so coarse was their shaggy hair\nthat they looked as if they were dressed in door-mats; and when they\nstood still and shook themselves, such clouds of dust flew out that,\nas it swept over the river, it almost stifled Jack and Mopsa.\n\n\"Odious!\" exclaimed Jack, sneezing. \"What terrible creatures these\nare!\"\n\n\"Well,\" answered Mopsa, at the other end of the boat (but he could\nhardly see her for the dust), \"then why do you dream of them?\"\n\nJack had just decided to dream of something else, when, with a noise\ngreater than fifty trumpets, the elephants, having shaken out all the\ndust, came thundering down to the water to bathe in the liquid mud.\nThey shook the whole country as they plunged; but that was not all.\nThe awful river-horses rose up, and, with shrill screams, fell upon\nthem, and gave them battle; while up from every rill peeped above the\nrushes frogs as large as oxen, and with blue and green eyes that\ngleamed like the eyes of cats.\n\nThe frogs croaking, and the shrill trumpeting of the elephants,\ntogether with the cries of the river-horses, as all these creatures\nfought with horn and tusk, and fell on one another, lashing the water\ninto whirlpools, among which the boat danced up and down like a\ncork,--the blinding spray, and the flapping about of great bats over\nthe boat and in it,--so confused Jack, that Mopsa had spoken to him\nseveral times before he answered.\n\n\"O Jack!\" she said, at last; \"if you can't dream any better, I must\ncall the Craken.\"\n\n\"Very well,\" said Jack. \"I'm almost wrapped up and smothered in bats'\nwings, so call anything you please.\"\n\nThereupon Mopsa whistled softly, and in a minute or two he saw, almost\nspanning the river, a hundred yards off, a thing like a rainbow, or a\nslender bridge, or still more, like one ring or coil of an enormous\nserpent; and presently the creature's head shot up like a fountain,\nclose to the boat, almost as high as a ship's mast. It was the Craken;\nand when Mopsa saw it, she began to cry, and said, \"We are caught in\nthis crowd of creatures, and we cannot get away from the land of\ndreams. Do help us, Craken!\"\n\nSome of the bats that hung to the edges of the boat had wings as large\nas sails; and the first thing the Craken did was to stoop its lithe\nneck, pick two or three of them off, and eat them.\n\n\"You can swim your boat home under my coils where the water is calm,\"\nthe Craken said, \"for she is so extremely old now, that if you do not\ntake care she will drop to pieces before you get back to the present\ntime.\"\n\nJack knew it was of no use saying anything to this formidable\ncreature, before whom the river-horses and the elephants were rushing\nto the shore; but when he looked and saw down the river rainbow behind\nrainbow,--I mean coil behind coil,--glittering in the sun, like so\nmany glorious arches that did not reach to the banks, he felt\nextremely glad that this was a dream, and besides that, he thought to\nhimself, \"It's only a fabled monster.\"\n\n\"No, it's only a fable to these times,\" said Mopsa, answering his\nthought; \"but in spite of that we shall have to go through all the\nrings.\"\n\nThey went under one,--silver, green, and blue, and gold. The water\ndripped from it upon them, and the boat trembled, either because of\nits great age, or because it felt the rest of the coil underneath.\n\nA good way off was another coil, and they went so safely under that,\nthat Jack felt himself getting used to Crakens, and not afraid. Then\nthey went under thirteen more. These kept getting nearer and nearer\ntogether, but, besides that, the fourteenth had not quite such a high\nspan as the former ones; but there were a great many to come, and yet\nthey got lower and lower.\n\nBoth Jack and Mopsa noticed this, but neither said a word. The\nthirtieth coil brushed Jack's cap off, then they had to stoop to pass\nunder the two next, and then they had to lie down in the bottom of the\nboat, and they got through with the greatest difficulty; but still\nbefore them was another! The boat was driving straight towards it, and\nit lay so close to the water that the arch it made was only a foot\nhigh. When Jack saw it, he called out, \"No! that I cannot bear.\nSomebody else may do the rest of this dream. I shall jump overboard.\"\n\nMopsa seemed to answer in quite a pleasant voice, as if she was not\nafraid,--\n\n\"No, you'd much better wake.\" And then she went on, \"Jack! Jack! why\ndon't you wake!\"\n\nThen all on a sudden Jack opened his eyes, and found that he was lying\nquietly on the grass, that little Mopsa really had asked him why he\ndid not wake. He saw the Queen too, standing by, looking at him, and\nsaying to herself, \"_I_ did not put him to sleep. _I_ did not put him\nto sleep.\"\n\n\"We don't want any more stories to-day, Queen,\" said the apple-woman,\nin a disrespectful tone, and she immediately began to sing, clattering\nsome tea-things all the time, for a kettle was boiling on some sticks,\nand she was going to make tea out of doors:--\n\n  The marten flew to the finch's nest,\n    Feathers, and moss, and a wisp of hay:\n  \"The arrow it sped to thy brown mate's breast;\n    Low in the broom is thy mate to-day.\"\n\n  \"Liest thou low, love? low in the broom?\n    Feathers and moss, and a wisp of hay,\n  Warm the white eggs till I learn his doom.\"\n    She beateth her wings, and away, away.\n\n  \"Ah, my sweet singer, thy days are told\n    (Feathers and moss, and a wisp of hay)!\n  Thine eyes are dim, and the eggs grow cold.\n    O mournful morrow! O dark to-day!\"\n\n  The finch flew back to her cold, cold nest,\n    Feathers and moss, and a wisp of hay,\n  Mine is the trouble that rent her breast,\n    And home is silent, and love is clay.\n\nJack felt very tired indeed,--as much tired as if he had really been\nout all day on the river, and gliding under the coils of the Craken.\nHe however rose up, when the apple-woman called him, and drank his\ntea, and had some fairy bread with it, which refreshed him very much.\n\nAfter tea he measured Mopsa again, and found that she had grown up to\na higher button. She looked much wiser too, and when he said she must\nbe taught to read she made no objection, so he arranged daisies and\nbuttercups into the forms of the letters, and she learnt nearly all of\nthem that one evening, while crowds of the one-foot-one fairies looked\non, hanging from the boughs and sitting in the grass, and shouting\nout the names of the letters as Mopsa said them. They were very\npolite to Jack, for they gathered all these flowers for him, and\nemptied them from their little caps at his feet as fast as he wanted\nthem.\n\n\n\n\nCHAPTER XI. GOOD-MORNING, SISTER.\n\n  Sweet is childhood--childhood's over,\n          Kiss and part.\n  Sweet is youth; but youth's a rover--\n          So's my heart.\n  Sweet is rest; but by all showing\n          Toil is nigh.\n  We must go. Alas! the going,\n          Say \"good-bye.\"\n\n\nJack crept under his canopy, went to sleep early that night, and did\nnot wake till the sun had risen, when the apple-woman called him, and\nsaid breakfast was nearly ready.\n\nThe same thing never happens twice in Fairyland, so this time the\nbreakfast was not spread in a tent, but on the river. The Queen had\ncut off a tiny piece of her robe, the one-foot-one fairies had\nstretched it till it was very large, and then they had spread it on\nthe water, where it floated and lay like a great carpet of purple and\ngold. One corner of it was moored to the side of Jack's boat; but he\nhad not observed this, because of his canopy. However, that was now\nlooped up by the apple-woman, and Jack and Mopsa saw what was going\non.\n\nHundreds of swans had been towing the carpet along, and were still\nholding it with their beaks, while a crowd of doves walked about on\nit, smoothing out the creases and patting it with their pretty pink\nfeet till it was quite firm and straight. The swans then swam away,\nand they flew away.\n\nPresently troops of fairies came down to the landing-place, jumped\ninto Jack's boat without asking leave, and so got on to the carpet,\nwhile at the same time a great tree which grew on the bank began to\npush out fresh leaves, as large as fans, and shoot out long branches,\nwhich again shot out others, till very soon there was shade all over\nthe carpet,--a thick shadow as good as a tent, which was very\npleasant, for the sun was already hot.\n\nWhen the Queen came down, the tree suddenly blossomed out with\nthousands of red and white flowers.\n\n\"You must not go on to that carpet,\" said the apple-woman; \"let us sit\nstill in the boat, and be served here.\" She whispered this as the\nQueen stepped into the boat.\n\n\"Good-morning, Jack,\" said the Queen. \"Good-morning, dear.\" This was\nto the apple-woman; and then she stood still for a moment and looked\nearnestly at little Mopsa, and sighed.\n\n\"Well,\" she said to her, \"don't you mean to speak to me?\" Then Mopsa\nlifted up her pretty face and blushed very rosy red, and said, in a\nshy voice, \"Good morning----sister.\"\n\n\"I said so!\" exclaimed the Queen; \"I said so!\" and she lifted up her\nbeautiful eyes, and murmured out, \"What is to be done now?\"\n\n\"Never mind, Queen dear,\" said Jack. \"If it was rude of Mopsa to say\nthat, she is such a little young thing that she does not know\nbetter.\"\n\n\"It was not rude,\" said Mopsa, and she laughed and blushed again. \"It\nwas not rude, and I am not sorry.\"\n\nAs she said this the Queen stepped on to the carpet, and all the\nflowers began to drop down. They were something like camellias, and\nthere were thousands of them.\n\nThe fairies collected them in little heaps. They had no tables and\nchairs, nor any plates and dishes for this breakfast; but the Queen\nsat down on the carpet close to Jack's boat, and leaned her cheek on\nher hand, and seemed to be lost in thought. The fairies put some\nflowers into her lap, then each took some, and they all sat down and\nlooked at the Queen, but she did not stir.\n\nAt last Jack said, \"When is the breakfast coming?\"\n\n\"This is the breakfast,\" said the apple-woman; \"these flowers are most\ndelicious eating. You never tasted anything so good in your life; but\nwe don't begin till the Queen does.\"\n\nQuantities of blossoms had dropped into the boat. Several fairies\ntumbled into it almost head over heels, they were in such a hurry, and\nthey heaped them into Mopsa's lap, but took no notice of Jack, nor of\nthe apple-woman either.\n\nAt last, when every one had waited some time, the Queen pulled a petal\noff one flower, and began to eat, so every one else began; and what\nthe apple-woman had said was quite true. Jack knew that he never had\ntasted anything half so nice, and he was quite sorry when he could not\neat any more. So, when every one had finished, the Queen leaned her\narm on the edge of the boat, and, turning her lovely face towards\nMopsa, said, \"I want to whisper to you, sister.\"\n\n\"Oh!\" said Mopsa, \"I wish I was in Jack's waistcoat pocket again; but\nI'm so big now.\" And she took hold of the two sides of his velvet\njacket, and hid her face between them.\n\n\"My old mother sent a message last night,\" continued the Queen, in a\nsoft, sorrowful voice. \"She is much more powerful than we are.\"\n\n\"What is the message?\" asked Mopsa; but she still hid her face.\n\nSo the Queen moved over, and put her lips close to Mopsa's ear, and\nrepeated it: \"There cannot be two Queens in one hive.\"\n\n\"If Mopsa leaves the hive, a fine swarm will go with her,\" said the\napple-woman. \"I shall, for one; that I shall!\"\n\n\"No!\" answered the Queen. \"I hope not, dear; for you know well that\nthis is my old mother's doing, not mine.\"\n\n\"Oh!\" said Mopsa; \"I feel as if I must tell a story too, just as the\nQueen does.\" But the apple-woman broke out in a very cross voice,\n\"It's not at all like Fairyland, if you go on in this way, and I would\nas lieve be out of it as in it.\" Then she began to sing, that she and\nJack might not hear Mopsa's story:--\n\n  On the rocks by Aberdeen,\n  Where the whislin' wave had been,\n  As I wandered and at e'en\n          Was eerie;\n  There I saw thee sailing west,\n  And I ran with joy opprest--\n  Ay, and took out all my best,\n          My dearie.\n\n  Then I busked mysel' wi' speed,\n  And the neighbors cried \"What need?\n  'Tis a lass in any weed\n          Aye bonny!\"\n  Now my heart, my heart is sair.\n  What's the good, though I be fair,\n  For thou'lt never see me mair,\n          Man Johnnie!\n\nWhile the apple-woman sang Mopsa finished her story; and the Queen\nuntied the fastening which held her carpet to the boat, and went\nfloating upon it down the river.\n\n\"Good-by,\" she said, kissing her hand to them. \"I must go and prepare\nfor the deputation.\"\n\nSo Jack and Mopsa played about all the morning, sometimes in the boat\nand sometimes on the shore, while the apple-woman sat on the grass,\nwith her arms folded, and seemed to be lost in thought. At last she\nsaid to Jack, \"What was the name of the great bird that carried you\ntwo here?\"\n\n\"I have forgotten,\" answered Jack. \"I've been trying to remember ever\nsince we heard the Queen tell her first story, but I cannot.\"\n\n\"I remember,\" said Mopsa.\n\n\"Tell it then,\" replied the apple-woman; but Mopsa shook her head.\n\n\"I don't want Jack to go,\" she answered.\n\n\"I don't want to go, nor that you should,\" said Jack.\n\n\"But the Queen said, 'there cannot be two queens in one hive,' and\nthat means that you are going to be turned out of this beautiful\ncountry.\"\n\n\"The other fairy lands are just as nice,\" answered Mopsa; \"she can\nonly turn me out of this one.\"\n\n\"I never heard of more than one Fairyland,\" observed Jack.\n\n\"It's my opinion,\" said the apple-woman, \"that there are hundreds! And\nthose one-foot-one fairies are such a saucy set, that if I were you I\nshould be very glad to get away from them. You've been here a very\nlittle while as yet, and you've no notion what goes on when the leaves\nbegin to drop.\"\n\n\"Tell us,\" said Jack.\n\n\"Well, you must know,\" answered the apple-woman, \"that fairies cannot\nabide cold weather; so, when the first rime frost comes, they bury\nthemselves.\"\n\n\"Bury themselves?\" repeated Jack.\n\n\"Yes, I tell you, they bury themselves. You've seen fairy rings, of\ncourse, even in your own country; and here the fields are full of\nthem. Well, when it gets cold, a company of fairies forms itself into\na circle, and every one digs a little hole. The first that has\nfinished jumps into his hole, and his next neighbor covers him up,\nand then jumps into his own little hole, and he gets covered up in his\nturn, till at last there is only one left, and he goes and joins\nanother circle, hoping he shall have better luck than to be last\nagain. I've often asked them why they do that, but no fairy can ever\ngive a reason for anything. They always say that old Mother Fate makes\nthem do it. When they come up again, they are not fairies at all, but\nthe good ones are mushrooms, and the bad ones are toadstools.\"\n\n\"Then you think there are no one-foot-one fairies in the other\ncountries,\" said Jack.\n\n\"Of course not,\" answered the apple-woman; \"all the fairy lands are\ndifferent. It's only the queens that are alike.\"\n\n\"I wish the fairies would not disappear for hours,\" said Jack. \"They\nall seem to run off and hide themselves.\"\n\n\"That's their way,\" answered the apple-woman. \"All fairies are part of\ntheir time in the shape of human creatures, and the rest of it in the\nshape of some animal. These can turn themselves, when they please,\ninto Guinea-fowl. In the heat of the day they generally prefer to be\nin that form, and they sit among the leaves of the trees.\n\n[THE APPLE WOMAN.\n\n\"So she began to sing.\"--PAGE 156.]\n\n\"A great many are now with the Queen, because there is a deputation\ncoming; but if I were to begin to sing, such a flock of Guinea-hens\nwould gather round, that the boughs of the trees would bend with their\nweight, and they would light on the grass all about so thickly that\nnot a blade of grass would be seen as far as the song was heard.\"\n\nSo she began to sing, and the air was darkened by great flocks of\nthese Guinea-fowl. They alighted just as she had said, and kept time\nwith their heads and their feet, nodding like a crowd of mandarins;\nand yet it was nothing but a stupid old song that you would have\nthought could have no particular meaning for them.\n\n\nLIKE A LAVEROCK IN THE LIFT.\n\n  I.\n\n  It's we two, it's we two, it's we two for aye,\n  All the world and we two, and Heaven be our stay.\n  Like a laverock in the lift, sing, O bonny bride!\n  All the world was Adam once, with Eve by his side.\n\n  II.\n\n  What's the world, my lass, my love!--what can it do?\n  I am thine, and thou art mine; life is sweet and new.\n  If the world have missed the mark, let it stand by,\n  For we two have gotten leave, and once more we'll try.\n\n  III.\n\n  Like a laverock in the lift, sing, O bonny bride!\n  It's we two, it's we two, happy side by side.\n  Take a kiss from me thy man; now the song begins:\n  \"All is made afresh for us, and the brave heart wins.\"\n\n  IV.\n\n  When the darker days come, and no sun will shine,\n  Thou shalt dry my tears, lass, and I'll dry thine.\n  It's we two, it's we two, while the world's away,\n  Sitting by the golden sheaves on our wedding-day.\n\n\n\n\nCHAPTER XII. THEY RUN AWAY FROM OLD MOTHER FATE.\n\n  A land that living warmth disowns,\n    It meets my wondering ken;\n  A land where all the men are stones,\n    Or all the stones are men.\n\n\nBefore the apple-woman had finished, Jack and Mopsa saw the Queen\ncoming in great state, followed by thousands of the one-foot-one\nfairies, and leading by a ribbon round its neck a beautiful brown doe.\nA great many pretty fawns were walking among the fairies.\n\n\"Here's the deputation,\" said the apple-woman; but as the Guinea-fowl\nrose like a cloud at the approach of the Queen, and the fairies and\nfawns pressed forward, there was a good deal of noise and confusion,\nduring which Mopsa stepped up close to Jack, and whispered in his ear,\n\"Remember, Jack, whatever you can do you may do.\"\n\nThen the brown doe laid down at Mopsa's feet, and the Queen began:--\n\n\"Jack and Mopsa, I love you both. I had a message last night from my\nold mother, and I told you what it was.\"\n\n\"Yes, Queen,\" said Mopsa, \"you did.\"\n\n\"And now,\" continued the Queen, \"she has sent this beautiful brown doe\nfrom the country beyond the lake, where they are in the greatest\ndistress for a queen, to offer Mopsa the crown; and, Jack, it is fated\nthat Mopsa is to reign there, so you had better say no more about\nit.\"\n\n\"I don't want to be a queen,\" said Mopsa, pouting; \"I want to play\nwith Jack.\"\n\n\"You are a queen already,\" answered the real Queen; \"at least, you\nwill be in a few days. You are so much grown, even since the morning,\nthat you come up nearly to Jack's shoulder. In four days you will be\nas tall as I am; and it is quite impossible that any one of fairy\nbirth should be as tall as a queen in her own country.\"\n\n\"But I don't see what stags and does can want with a queen,\" said\nJack.\n\n\"They were obliged to turn into deer,\" said the Queen, \"when they\ncrossed their own border; but they are fairies when they are at home,\nand they want Mopsa, because they are always obliged to have a queen\nof alien birth.\"\n\n\"If I go,\" said Mopsa, \"shall Jack go too?\"\n\n\"Oh, no,\" answered the Queen; \"Jack and the apple-woman are my\nsubjects.\"\n\n\"Apple-woman,\" said Jack, \"tell us what you think; shall Mopsa go to\nthis country?\"\n\n\"Why, child,\" said the apple-woman, \"go away from here she must; but\nshe need not go off with the deer, I suppose, unless she likes. They\nlook gentle and harmless; but it is very hard to get at the truth in\nthis country, and I've heard queer stories about them.\"\n\n\"Have you?\" said the Queen. \"Well, you can repeat them if you like;\nbut remember that the poor brown doe cannot contradict them.\"\n\nSo the apple-woman said, \"I have heard, but I don't know how true it\nis, that in that country they shut up their queen in a great castle,\nand cover her with a veil, and never let the sun shine on her; for if\nby chance the least little sunbeam should light on her she would turn\ninto a doe directly, and all the nation would turn with her, and stay\nso.\"\n\n\"I don't want to be shut up in a castle,\" said Mopsa.\n\n\"But is it true?\" asked Jack.\n\n\"Well,\" said the apple-woman, \"as I told you before, I cannot make out\nwhether it's true or not, for all these stags and fawns look very\nmild, gentle creatures.\"\n\n\"I won't go,\" said Mopsa; \"I would rather run away.\"\n\nAll this time the Queen with the brown doe had been gently pressing\nwith the crowd nearer and nearer to the brink of the river, so that\nnow Jack and Mopsa, who stood facing them, were quite close to the\nboat; and while they argued and tried to make Mopsa come away, Jack\nsuddenly whispered to her to spring into the boat, which she did, and\nhe after her, and at the same time he cried out,--\n\n\"Now, boat, if you are my boat, set off as fast as you can, and let\nnothing of fairy birth get on board of you.\"\n\nNo sooner did he begin to speak than the boat swung itself away from\nthe edge, and almost in a moment it was in the very middle of the\nriver, and beginning to float gently down with the stream.\n\n[THEY RUN AWAY FROM OLD MOTHER FATE.\n\n\"The boat swung itself away from the edge, and almost in a moment it was\nin the very middle of the river.\"--PAGE 162.]\n\nNow, as I have told you before, that river runs up the country instead\nof down to the sea, so Jack and Mopsa floated still farther up into\nFairyland; and they saw the Queen, and the apple-woman, and all the\ncrowd of fawns and fairies walking along the bank of the river,\nkeeping exactly to the same pace that the boat went; and this went on\nfor hours and hours, so that there seemed to be no chance that Jack\nand Mopsa could land; and they heard no voices at all, nor any sound\nbut the baying of the old hound, who could not swim out to them,\nbecause Jack had forbidden the boat to take anything of fairy birth on\nboard of her.\n\nLuckily the bottom of the boat was full of those delicious flowers\nthat had dropped into it at breakfast-time, so there was plenty of\nnice food for Jack and Mopsa; and Jack noticed, when he looked at her\ntowards evening, that she was now nearly as tall as himself, and that\nher lovely brown hair floated down to her ankles.\n\n\"Jack,\" she said, before it grew dusk, \"will you give me your little\npurse that has the silver fourpence in it?\"\n\nNow Mopsa had often played with this purse. It was lined with a nice\npiece of pale green silk, and when Jack gave it to her she pulled the\nsilk out, and shook it, and patted it, and stretched it, just as the\nQueen had done, and it came into a most lovely cloak, which she tied\nround her neck. Then she twisted up her long hair into a coil, and\nfastened it round her head, and called to the fire-flies which were\nbeginning to glitter on the trees to come, and they came and alighted\nin a row upon the coil, and turned into diamonds directly. So now\nMopsa had got a crown and a robe, and she was so beautiful that Jack\nthought he should never be tired of looking at her; but it was nearly\ndark now, and he was so sleepy and tired that he could not keep his\neyes open, though he tried very hard, and he began to blink, and then\nhe began to nod, and at last he fell fast asleep, and did not awake\ntill the morning.\n\nThen he sat up in the boat, and looked about him. A wonderful country,\nindeed!--no trees, no grass, no houses, nothing but red stones and red\nsand,--and Mopsa was gone. Jack jumped on shore, for the boat had\nstopped, and was close to the brink of the river. He looked about for\nsome time, and at last, in the shadow of a pale brown rock, he found\nher; and oh! delightful surprise, the apple-woman was there too. She\nwas saying, \"O my bones! Dearie, dearie me, how they do ache!\" That\nwas not surprising, for she had been out all night. She had walked\nbeside the river with the Queen and her tribe till they came to a\nlittle tinkling stream, which divides their country from the sandy\nland, and there they were obliged to stop; they could not cross it.\nBut the apple-woman sprang over, and, though the Queen told her she\nmust come back again in twenty-four hours, she did not appear to be\ndispleased. Now the Guinea-hens, when they had come to listen, the day\nbefore, to the apple-woman's song, had brought each of them a grain of\nmaize in her beak, and had thrown it into her apron; so when she got\nup she carried it with her gathered up there, and now she had been\nbaking some delicious little cakes on a fire of dry sticks that the\nriver had drifted down, and Mopsa had taken a honeycomb from the rock,\nso that they all had a very nice breakfast. And the apple-woman gave\nthem a great deal of good advice, and told them if they wished to\nremain in Fairyland, and not be caught by the brown doe and her\nfollowers, they must cross over the purple mountains. \"For on the\nother side of those peaks,\" she said, \"I have heard that fairies live\nwho have the best of characters for being kind and just. I am sure\nthey would never shut up a poor queen in a castle.\n\n\"But the best thing you could do, dear,\" she said to Mopsa, \"would be\nto let Jack call the bird, and make her carry you back to his own\ncountry.\"\n\n\"The Queen is not at all kind,\" said Jack; \"I have been very kind to\nher, and she should have let Mopsa stay.\"\n\n\"No, Jack, she could not,\" said Mopsa; \"but I wish I had not grown so\nfast, and I don't like to go to your country. I would rather run\naway.\"\n\n\"But who is to tell us where to run?\" asked Jack.\n\n\"Oh,\" said Mopsa, \"some of these people.\"\n\n\"I don't see anybody,\" said Jack, looking about him.\n\nMopsa pointed to a group of stones, and then to another group, and\nas Jack looked he saw that in shape they were something like\npeople,--stone people. One stone was a little like an old man with\na mantle over him, and he was sitting on the ground with his knees up\nnearly to his chin. Another was like a woman with a hood on, and\nshe seemed to be leaning her chin on her hand. Close to these stood\nsomething very much like a cradle in shape; and beyond were stones\nthat resembled a flock of sheep lying down on the bare sand, with\nsomething that reminded Jack of the figure of a man lying asleep\nnear them, with his face to the ground.\n\nThat was a very curious country; all the stones reminded you of people\nor of animals, and the shadows that they cast were much more like than\nthe stones themselves. There were blocks with things that you might\nhave mistaken for stone ropes twisted round them; but, looking at the\nshadows, you could see distinctly that they were trees, and that what\ncoiled round were snakes. Then there was a rocky prominence, at one\nside of which was something like a sitting figure, but its shadow,\nlying on the ground, was that of a girl with a distaff. Jack was very\nmuch surprised at all this; Mopsa was not. She did not see, she said,\nthat one thing was more wonderful than another. All the fairy lands\nwere wonderful, but the men-and-women world was far more so. She and\nJack went about among the stones all day, and as the sun got low both\nthe shadows and the blocks themselves became more and more like\npeople, and if you went close you could now see features, very sweet,\nquiet features, but the eyes were all shut.\n\nBy this time the apple-woman began to feel very sad. She knew she\nshould soon have to leave Jack and Mopsa, and she said to Mopsa, as\nthey finished their evening meal, \"I wish you would ask the\ninhabitants a few questions, dear, before I go, for I want to know\nwhether they can put you in the way how to cross the purple\nmountains.\"\n\nJack said nothing, for he thought he would see what Mopsa was going to\ndo; so when she got up and went towards the shape that was like a\ncradle he followed, and the apple-woman too. Mopsa went to the figure\nthat sat by the cradle. It was a stone yet, but when Mopsa laid her\nlittle warm hand on its bosom it smiled.\n\n\"Dear,\" said Mopsa, \"I wish you would wake.\"\n\nA curious little sound was now heard, but the figure did not move, and\nthe apple-woman lifted Mopsa on to the lap of the statue; then she put\nher arms round its neck, and spoke to it again very distinctly: \"Dear!\nwhy don't you wake? You had better wake now; the baby's crying.\"\n\nJack now observed that the sound he had heard was something like the\ncrying of a baby. He also heard the figure answering Mopsa. It said,\n\"I am only a stone!\"\n\n\"Then,\" said Mopsa, \"I am not a queen yet. I cannot wake her. Take me\ndown.\"\n\n\"I am not warm,\" said the figure; and that was quite true, and yet she\nwas not a stone now which reminded one of a woman, but a woman that\nreminded one of a stone.\n\nAll the west was very red with the sunset, and the river was red too,\nand Jack distinctly saw some of the coils of rope glide down from the\ntrees and slip into the water; next he saw the stones that had looked\nlike sheep raise up their heads in the twilight, and then lift\nthemselves and shake their woolly sides. At that instant the large\nwhite moon heaved up her pale face between two dark blue hills, and\nupon this the statue put out its feet and gently rocked the cradle.\n\nThen it spoke again to Mopsa: \"What was it that you wished me to tell\nyou?\"\n\n\"How to find the way over those purple mountains,\" said Mopsa.\n\n\"You must set off in an hour, then,\" said the woman; and she had\nhardly anything of the stone about her now. \"You can easily find it by\nnight without any guide, but nothing can ever take you to it by\nday.\"\n\n\"But we would rather stay a few days in this curious country,\" said\nJack; \"let us wait at least till to-morrow night.\"\n\nThe statue at this moment rubbed her hands together, as if they still\nfelt cold and stiff. \"You are quite welcome to stay,\" she observed;\n\"but you had better not.\"\n\n\"Why not?\" persisted Jack.\n\n\"Father,\" said the woman, rising and shaking the figure next to her by\nthe sleeve, \"Wake up!\" What had looked like an old man was a real old\nman now, and he got up and began to gather sticks to make a fire, and\nto pick up the little brown stones which had been scattered about all\nday, but which now were berries of coffee; the larger ones, which you\nmight find here and there, were rasped rolls. Then the woman answered\nJack, \"Why not? Why, because it's full moon to-night at midnight, and\nthe moment the moon is past the full your Queen, whose country you\nhave just left, will be able to cross over the little stream, and she\nwill want to take you and that other mortal back. She can do it, of\ncourse, if she pleases; and we can afford you no protection, for by\nthat time we shall be stones again. We are only people two hours out\nof the twenty-four.\"\n\n\"That is very hard,\" observed Jack.\n\n\"No,\" said the woman, in a tone of indifference; \"it comes to the same\nthing, as we live twelve times as long as others do.\"\n\nBy this time the shepherd was gently driving his flock down to the\nwater, and round fifty little fires groups of people were sitting\nroasting coffee, while cows were lowing to be milked, and girls with\ndistaffs were coming to them slowly, for no one was in a hurry there.\nThey say in that country that they wish to enjoy their day quietly,\nbecause it is so short.\n\n\"Can you tell us anything of the land beyond the mountains?\" asked\nJack.\n\n\"Yes,\" said the woman. \"Of all fairy lands it is the best; the people\nare the gentlest and kindest.\"\n\n\"Then I had better take Mopsa there than down the river?\" said Jack.\n\n\"You can't take her down the river,\" replied the woman; and Jack\nthought she laughed and was glad of that.\n\n\"Why not?\" asked Jack. \"I have a boat.\"\n\n\"Yes, sir,\" answered the woman; \"but where is it now?\"\n\n\n\n\nCHAPTER XIII. MELON SEEDS.\n\n  _Rosalind._--Well, this is the forest of Arden.\n\n  _Touchstone._--Ay, now am I in Arden: the more fool I;\n  when I was at home I was in a better place; but travellers\n  must be content.\n\n  _As you Like it._\n\n\n\"Where is it now?\" said the stone-woman; and when Jack heard that he\nran down to the river, and looked right and looked left. At last he\nsaw his boat,--a mere speck in the distance, it had floated so far.\n\nHe called it, but it was far beyond the reach of his voice; and Mopsa,\nwho had followed him, said,--\n\n\"It does not signify, Jack, for I feel that no place is the right\nplace for me but that country beyond the purple mountains, and I\nshall never be happy unless we go there.\"\n\nSo they walked back towards the stone-people hand in hand, and the\napple-woman presently joined them. She was crying gently, for she knew\nthat she must soon pass over the little stream, and part with these\nwhom she called her dear children. Jack had often spoken to her that\nday about going home to her own country, but she said it was too late\nto think of that now, and she must end her days in the land of Faery.\n\nThe kind stone-people asked them to come and sit by their little fire;\nand in the dusk the woman whose baby had slept in a stone cradle took\nit up and began to sing to it. She seemed astonished when she heard\nthat the apple-woman had power to go home if she could make up her\nmind to do it; and as she sang she looked at her with wonder and\npity.\n\n  Little babe, while burns the west,\n  Warm thee, warm thee in my breast;\n  While the moon doth shine her best,\n    And the dews distil not.\n\n  All the land so sad, so fair--\n  Sweet its toils are, blest its care.\n  Child, we may not enter there!\n    Some there are that will not.\n\n  Fain would I thy margins know,\n  Land of work, and land of snow;\n  Land of life, whose rivers flow\n    On, and on, and stay not.\n\n  Fain would I thy small limbs fold,\n  While the weary hours are told,\n  Little babe in cradle cold.\n    Some there are that may not.\n\n\"You are not exactly fairies, I suppose?\" said Jack. \"If you were, you\ncould go to our country when you pleased.\"\n\n\"No,\" said the woman; \"we are not exactly fairies; but we shall be\nmore like them when our punishment is over.\"\n\n\"I am sorry you are punished,\" answered Jack, \"for you seem very nice,\nkind people.\"\n\n\"We were not always kind,\" answered the woman; \"and perhaps we are\nonly kind now because we have no time, and no chance of being\notherwise. I'm sure I don't know about that. We were powerful once,\nand we did a cruel deed. I must not tell you what it was. We were told\nthat our hearts were all as cold as stones,--and I suppose they\nwere,--and we were doomed to be stones all our lives, excepting for\nthe two hours of twilight. There was no one to sow the crops, or water\nthe grass, so it all failed, and the trees died, and our houses fell,\nand our possessions were stolen from us.\"\n\n\"It is a very sad thing,\" observed the apple-woman; and then she said\nthat she must go, for she had a long way to walk before she should\nreach the little brook that led to the country of her own queen; so\nshe kissed the two children, Jack and Mopsa, and they begged her again\nto think better of it, and return to her own land. But she said No;\nshe had no heart for work now, and could not bear either cold or\npoverty.\n\nThen the woman who was hugging her little baby, and keeping it cosy\nand warm, began to tell Jack and Mopsa that it was time they should\nbegin to run away to the country over the purple mountains, or else\nthe Queen would overtake them and be very angry with them; so, with\nmany promises that they would mind her directions, they set off hand\nin hand to run; but before they left her they could see plainly that\nshe was beginning to turn again into stone. However, she had given\nthem a slice of melon with the seeds in it. It had been growing on the\nedge of the river, and was stone in the day-time, like everything\nelse. \"When you are tired,\" she said, \"eat the seeds, and they will\nenable you to go running on. You can put the slice into this little\nred pot, which has string handles to it, and you can hang it on your\narm. While you have it with you it will not turn to stone, but if you\nlay it down it will, and then it will be useless.\"\n\nSo, as I said before, Jack and Mopsa set off hand in hand to run; and\nas they ran all the things and people gradually and softly settled\nthemselves to turn into stone again. Their cloaks and gowns left off\nfluttering, and hung stiffly; and then they left off their\noccupations, and sat down, or laid down themselves; and the sheep and\ncattle turned stiff and stone-like too, so that in a very little while\nall that country was nothing but red stones and red sand, just as it\nhad been in the morning.\n\nPresently the full moon, which had been hiding behind a cloud, came\nout, and they saw their shadows, which fell straight before them; so\nthey ran on hand in hand very merrily till the half-moon came up, and\nthe shadows she made them cast fell sideways. This was rather awkward,\nbecause as long as only the full moon gave them shadows, they had but\nto follow them, in order to go straight towards the purple mountains.\nNow they were not always sure which were her shadows: and presently a\ncrescent moon came, and still further confused them; also the sand\nbegan to have tufts of grass in it; and then, when they had gone a\nlittle farther, there were beautiful patches of anemones, and\nhyacinths, and jonquils, and crown imperials, and they stopped to\ngather them; and they got among some trees, and then, as they had\nnothing to guide them but the shadows, and these went all sorts of\nways, they lost a great deal of time, and the trees became of taller\ngrowth; but they still ran on and on till they got into a thick forest\nwhere it was quite dark, and here Mopsa began to cry, for she was\ntired.\n\n\"If I could only begin to be a queen,\" she said to Jack, \"I could go\nwherever I pleased. I am not a fairy, and yet I am not a proper queen.\nOh, what shall I do? I cannot go any farther.\"\n\nSo Jack gave her some of the seeds of the melon, though it was so dark\nthat he could scarcely find the way to her mouth, and then he took\nsome himself, and they both felt that they were rested, and Jack\ncomforted Mopsa.\n\n\"If you are not a queen yet,\" he said, \"you will be by to-morrow\nmorning; for when our shadows danced on before us yours was so very\nnearly the same height as mine, that I could hardly see any\ndifference.\"\n\nWhen they reached the end of that great forest, and found themselves\nout in all sorts of moonlight, the first thing they did was to\nlaugh,--the shadows looked so odd, sticking out in every direction;\nand the next thing they did was to stand back to back, and put their\nheels together, and touch their heads together, to see by the shadow\nwhich was the taller; and Jack was still the least bit in the world\ntaller than Mopsa; so they knew she was not a queen yet, and they ate\nsome more melon-seeds, and began to climb up the mountain.\n\nThey climbed till the trees of the forest looked no bigger than\ngooseberry bushes, and then they climbed till the whole forest looked\nonly like a patch of moss; and then, when they got a little higher,\nthey saw the wonderful river, a long way off, and the snow glittering\non the peaks overhead; and while they were looking and wondering how\nthey should find a pass, the moons all went down, one after the\nother, and, if Mopsa had not found some glowworms, they would have\nbeen quite in the dark again. However, she took a dozen of them, and\nput them round Jack's ankles, so that when he walked he could see\nwhere he was going; and he found a little sheep-path, and she followed\nhim.\n\nNow they had noticed during the night how many shooting-stars kept\ndarting about from time to time, and at last one shot close by them,\nand fell in the soft moss on before. There it lay shining; and Jack,\nthough he began to feel very tired again, made haste to it, for he\nwanted to see what it was like.\n\nIt was not what you would have supposed. It was soft and round, and\nabout the color of a ripe apricot; it was covered with fur, and in\nfact it was evidently alive, and had curled itself up into a round\nball.\n\n\"The dear little thing!\" said Jack, as he held it in his hand, and\nshowed it to Mopsa; \"how its heart beats. Is it frightened?\"\n\n\"Who are you?\" said Mopsa to the thing. \"What is your name?\"\n\nThe little creature made a sound that seemed like \"Wisp.\"\n\n\"Uncurl yourself, Wisp,\" said Mopsa. \"Jack and I want to look at\nyou.\"\n\nSo Wisp unfolded himself, and showed two little black eyes, and spread\nout two long filmy wings. He was like a most beautiful bat, and the\nlight he shed out illuminated their faces.\n\n\"It is only one of the air fairies,\" said Mopsa. \"Pretty creature! It\nnever did any harm, and would like to do us good if it knew how, for\nit knows that I shall be a queen very soon. Wisp, if you like, you may\ngo and tell your friends and relations that we want to cross over the\nmountains, and if they can they may help us.\"\n\nUpon this Wisp spread out his wings, and shot off again; and Jack's\nfeet were so tired that he sat down, and pulled off one of his shoes,\nfor he thought there was a stone in it. So he set the little red jar\nbeside him, and quite forgot what the stone-woman had said, but went\non shaking his shoe, and buckling it, and admiring the glowworms round\nhis ankle, till Mopsa said, \"Darling Jack, I am so dreadfully tired!\nGive me some more melon-seeds.\" Then he lifted up the jar, and thought\nit felt very heavy; and when he put in his hand, jar, and melon, and\nseeds were all turned to stone together.\n\nThey were both very sorry, and they sat still for a minute or two, for\nthey were much too tired to stir; and then shooting-stars began to\nappear in all directions. The fairy bat had told his friends and\nrelations, and they were coming. One fell at Mopsa's feet, another in\nher lap; more, more, all about, behind, before, and over them. And\nthey spread out long filmy wings, some of them a yard long, till Jack\nand Mopsa seemed to be enclosed in a perfect network of the rays of\nshooting-stars, and they were both a good deal frightened. Fifty or\nsixty shooting-stars, with black eyes that could stare, were enough,\nthey thought, to frighten anybody.\n\n\"If we had anything to sit upon,\" said Mopsa, \"they could carry us\nover the pass.\" She had no sooner spoken than the largest of the bats\nbit off one of his own long wings, and laid it at Mopsa's feet. It did\nnot seem to matter much to him that he had parted with it, for he shot\nout another wing directly, just as a comet shoots out a ray of light\nsometimes, when it approaches the sun.\n\nMopsa thanked the shooting fairy, and, taking the wing, began to\nstretch it, till it was large enough for her and Jack to sit upon.\nThen all the shooting fairies came round it, took its edges in their\nmouths, and began to fly away with it over the mountains. They went\nslowly, for Jack and Mopsa were heavy, and they flew very low, resting\nnow and then; but in the course of time they carried the wing over the\npass, and halfway down the other side. Then the sun came up; and the\nmoment he appeared all their lovely apricot-colored light was gone,\nand they only looked like common bats, such as you can see every\nevening.\n\nThey set down Jack and Mopsa, folded up their long wings, and hung\ndown their heads.\n\nMopsa thanked them, and said they had been useful; but still they\nlooked ashamed, and crept into little corners and crevices of the\nrock, to hide.\n\n\n\n\nCHAPTER XIV. REEDS AND RUSHES.\n\n  'Tis merry, 'tis merry in Fairyland,\n    Where Fairy birds are singing;\n  When the court doth sit by the monarch's side,\n    With bit and bridle ringing.\n\n  WALTER SCOTT.\n\n\nThere were many fruit-trees on that slope of the mountain, and Jack\nand Mopsa, as they came down, gathered some fruit for breakfast, and\ndid not feel very tired, for the long ride on the wing had rested\nthem.\n\nThey could not see the plain, for a slight blue mist hung over it; but\nthe sun was hot already, and as they came down they saw a beautiful\nbed of high reeds, and thought they would sit awhile and rest in it. A\nrill of clear water ran beside the bed, so when they had reached it\nthey sat down, and began to consider what they should do next.\n\n\"Jack,\" said Mopsa, \"did you see anything particular as you came down\nwith the shooting-stars?\"\n\n\"No, I saw nothing so interesting as they were,\" answered Jack. \"I was\nlooking at them and watching how they squeaked to one another, and how\nthey had little hooks in their wings, with which they held the large\nwing that we sat on.\"\n\n\"But I saw something,\" said Mopsa. \"Just as the sun rose I looked\ndown, and in the loveliest garden I ever saw, and all among trees and\nwoods, I saw a most beautiful castle. O, Jack! I am sure that castle\nis the place I am to live in, and now we have nothing to do but to\nfind it. I shall soon be a queen, and there I shall reign.\"\n\n\"Then I shall be king there,\" said Jack; \"shall I?\"\n\n\"Yes, if you can,\" answered Mopsa. \"Of course, whatever you can do\nyou may do. And, Jack, this is a much better fairy country than either\nthe stony land or the other that we first came to, for this castle is\na real place! It will not melt away. There the people can work, they\nknow how to love each other: common fairies cannot do that, I know.\nThey can laugh and cry, and I shall teach them several things that\nthey do not know yet. Oh! do let us make haste and find the castle.\"\n\nSo they arose; but they turned the wrong way, and by mistake walked\nfarther and farther in among the reeds, whose feathery heads puffed\ninto Mopsa's face, and Jack's coat was all covered with the fluffy\nseed.\n\n\"This is very odd,\" said Jack. \"I thought this was only a small bed of\nreeds when we stepped into it; but really we must have walked a mile\nalready.\"\n\nBut they walked on and on, till Mopsa grew quite faint, and her sweet\nface became very pale, for she knew that the beds of reeds were\nspreading faster than they walked, and then they shot up so high that\nit was impossible to see over their heads; so at last Jack and Mopsa\nwere so tired that they sat down, and Mopsa began to cry.\n\nHowever, Jack was the braver of the two this time, and he comforted\nMopsa, and told her that she was nearly a queen, and would never reach\nher castle by sitting still. So she got up and took his hand, and he\nwent on before, parting the reeds and pulling her after him, till all\non a sudden they heard the sweetest sound in the world; it was like a\nbell, and it sounded again and again.\n\nIt was the castle clock, and it was striking twelve at noon.\n\nAs it finished striking they came out at the farther edge of the great\nbed of reeds, and there was the castle straight before them,--a\nbeautiful castle, standing on the slope of a hill. The grass all about\nit was covered with beautiful flowers; two of the taller turrets were\novergrown with ivy, and a flag was flying on a staff; but everything\nwas so silent and lonely that it made one sad to look on. As Jack and\nMopsa drew near they trod as gently as they could, and did not say a\nword.\n\nAll the windows were shut, but there was a great door in the centre of\nthe building, and they went towards it, hand in hand.\n\nWhat a beautiful hall! The great door stood wide open, and they could\nsee what a delightful place this must be to live in: it was paved with\nsquares of blue and white marble, and here and there carpets were\nspread, with chairs and tables upon them. They looked and saw a great\ndome overhead, filled with windows of colored glass, and they cast\ndown blue and golden and rosy reflections.\n\n\"There is my home that I shall live in,\" said Mopsa; and she came\nclose to the door, and they both looked in, till at last she let go of\nJack's hand, and stepped over the threshold.\n\nThe bell in the tower sounded again more sweetly than ever, and the\ninstant Mopsa was inside there came from behind the fluted columns,\nwhich rose up on every side, the brown doe, followed by troops of deer\nand fawns!\n\n\"Mopsa! Mopsa!\" cried Jack, \"come away! come back!\" But Mopsa was too\nmuch astonished to stir, and something seemed to hold Jack from\nfollowing; but he looked and looked, till, as the brown doe advanced,\nthe door of the castle closed,--Mopsa was shut in, and Jack was left\noutside.\n\nSo Mopsa had come straight to the place she thought she had ran away\nfrom.\n\n\"But I am determined to get her away from those creatures,\" thought\nJack; \"she does not want to reign over deer.\" And he began to look\nabout him, hoping to get in. It was of no use: all the windows in that\nfront of the castle were high, and when he tried to go round, he came\nto a high wall with battlements. Against some parts of this wall the\nivy grew, and looked as if it might have grown there for ages; its\nstems were thicker than his waist, and its branches were spread over\nthe surface like network; so by means of them he hoped to climb to the\ntop.\n\nHe immediately began to try. Oh, how high the wall was! First he came\nto several sparrows' nests, and very much frightened the sparrows\nwere; then he reached starlings' nests, and very angry the starlings\nwere; but at last, just under the coping, he came to jackdaws' nests,\nand these birds were very friendly, and pointed out to him the best\nlittle holes for him to put his feet into. At last he reached the top,\nand found to his delight that the wall was three feet thick, and he\ncould walk upon it quite comfortably, and look down into a lovely\ngarden, where all the trees were in blossom, and creepers tossed their\nlong tendrils from tree to tree, covered with puffs of yellow, or\nbells of white, or bunches and knots of blue or rosy bloom.\n\nHe could look down into the beautiful empty rooms of the castle, and\nhe walked cautiously on the wall till he came to the west front, and\nreached a little casement window that had latticed panes. Jack peeped\nin; nobody was there. He took his knife, and cut away a little bit of\nlead to let out the pane, and it fell with such a crash on the\npavement below that he wondered it did not bring the deer over to look\nat what he was about. Nobody came.\n\nHe put in his hand and opened the latchet, and with very little\ntrouble got down into the room. Still nobody was to be seen. He\nthought that the room, years ago, might have been a fairies'\nschool-room, for it was strewn with books, slates, and all sorts of\ncopybooks. A fine soft dust had settled down over everything,--pens,\npapers, and all. Jack opened a copybook: its pages were headed with\nmaxims, just as ours are, which proved that these fairies must have\nbeen superior to such as he had hitherto come among. Jack read some of\nthem:--\n\n  Turn your back on the light, and you'll follow a shadow.\n  The deaf queen Fate has dumb courtiers.\n  If the hound is your foe, don't sleep in his kennel.\n  That that is, is.\n\nAnd so on; but nobody came, and no sound was heard, so he opened the\ndoor, and found himself in a long and most splendid gallery, all hung\nwith pictures, and spread with a most beautiful carpet, which was as\nsoft and white as a piece of wool, and wrought with a beautiful\ndevice. This was the letter M, with a crown and sceptre, and\nunderneath a beautiful little boat, exactly like the one in which he\nhad come up the river. Jack felt sure that this carpet had been made\nfor Mopsa, and he went along the gallery upon it till he reached a\ngrand staircase of oak that was almost black with age, and he stole\ngently down it, for he began to feel rather shy, more especially as he\ncould now see the great hall under the dome, and that it had a\nbeautiful lady in it, and many other people, but no deer at all.\n\nThese fairy people were something like the one-foot-one fairies, but\nmuch larger and more like children; and they had very gentle, happy\nfaces, and seemed to be extremely glad and gay. But seated on a\ncouch, where lovely painted windows threw down all sorts of rainbow\ncolors on her, was a beautiful fairy lady, as large as a woman. She\nhad Mopsa in her arms, and was looking down upon her with eyes full of\nlove, while at her side stood a boy, who was exactly and precisely\nlike Jack himself. He had rather long light hair and gray eyes, and a\nvelvet jacket. That was all Jack could see at first, but as he drew\nnearer the boy turned, and then Jack felt as if he was looking at\nhimself in the glass.\n\nMopsa had been very tired, and now she was fast asleep, with her head\non that lady's shoulder. The boy kept looking at her, and he seemed\nvery happy indeed; so did the lady, and she presently told him to\nbring Jack something to eat.\n\nIt was rather a curious speech that she made to him; it was this:--\n\n\"Jack, bring Jack some breakfast.\"\n\n\"What!\" thought Jack to himself, \"has he got a face like mine, and a\nname like mine too?\"\n\nSo that other Jack went away, and presently came back with a golden\nplate full of nice things to eat.\n\n\"I know you don't like me,\" he said, as he came up to Jack with the\nplate.\n\n\"Not like him?\" repeated the lady; \"and pray what reason have you for\nnot liking my royal nephew?\"\n\n\"O dame!\" exclaimed the boy, and laughed.\n\nThe lady, on hearing this, turned pale, for she perceived that she\nherself had mistaken the one for the other.\n\n\"I see you know how to laugh,\" said the real Jack. \"You are wiser\npeople than those whom I went to first; but the reason I don't like\nyou is, that you are so exactly like me.\"\n\n\"I am not!\" exclaimed the boy. \"Only hear him, dame! You mean, I\nsuppose, that you are so exactly like me. I am sure I don't know what\nyou mean by it.\"\n\n\"Nor I either,\" replied Jack, almost in a passion.\n\n\"It couldn't be helped, of course,\" said the other Jack.\n\n\"Hush! hush!\" said the fairy woman; \"don't wake our dear little Queen.\nWas it you, my royal nephew, who spoke last?\"\n\n\"Yes, dame,\" answered the boy, and again he offered the plate; but\nJack was swelling with indignation, and he gave the plate a push with\nhis elbow, which scattered the fruit and bread on the ground.\n\n\"I won't eat it,\" he said; but when the other Jack went and picked it\nup again, and said, \"Oh, yes, do, old fellow; it's not my fault, you\nknow,\" he began to consider that it was no use being cross in\nFairyland; so he forgave his double, and had just finished his\nbreakfast when Mopsa woke.\n\n\n\n\nCHAPTER XV. THE QUEEN'S WAND.\n\n  One, two, three, four; one, two, three, four;\n    'Tis still one, two, three, four.\n  Mellow and silvery are the tones,\n    But I wish the bells were more.\n\n  SOUTHEY.\n\n\nMopsa woke: she was rather too big to be nursed, for she was the size\nof Jack, and looked like a sweet little girl of ten years, but she did\nnot always behave like one; sometimes she spoke as wisely as a\ngrown-up woman, and sometimes she changed again and seemed like a\nchild.\n\nMopsa lifted up her head and pushed back her long hair: her coronet\nhad fallen off while she was in the bed of reeds; and she said to the\nbeautiful dame,--\n\n\"I am a queen now.\"\n\n\"Yes, my sweet Queen,\" answered the lady, \"I know you are.\"\n\n\"And you promise that you will be kind to me till I grow up,\" said\nMopsa, \"and love me, and teach me how to reign?\"\n\n\"Yes,\" repeated the lady; \"and I will love you too, just as if you\nwere a mortal and I your mother.\"\n\n\"For I am only ten years old yet,\" said Mopsa, \"and the throne is too\nbig for me to sit upon; but I am a queen.\" And then she paused, and\nsaid, \"Is it three o'clock?\"\n\nAs she spoke, the sweet, clear bell of the castle sounded three times,\nand then chimes began to play: they played such a joyous tune that it\nmade everybody sing. The dame sang, the crowd of fairies sang, the\nboy who was Jack's double sang, and Mopsa sang,--only Jack was\nsilent,--and this was the song:--\n\n  The prince shall to the chase again,\n  The dame has got her face again,\n  The king shall have his place again\n    Aneath the fairy dome.\n\n  And all the knights shall woo again,\n  And all the doves shall coo again,\n  And all the dreams come true again,\n    And Jack shall go home.\n\n\"We shall see about that!\" thought Jack to himself. And Mopsa, while\nshe sang those last words, burst into tears, which Jack did not like\nto see; but all the fairies were so very glad, so joyous, and so\ndelighted with her for having come to be their queen, that after a\nwhile she dried her eyes, and said to the wrong boy,--\n\n\"Jack, when I pulled the lining out of your pocket-book there was a\nsilver fourpence in it.\"\n\n\"Yes,\" said the real Jack, \"and here it is.\"\n\n\"Is it real money?\" asked Mopsa. \"Are you sure you brought it with you\nall the way from your own country?\"\n\n\"Yes,\" said Jack, \"quite sure.\"\n\n\"Then, dear Jack,\" answered Mopsa, \"will you give it to me?\"\n\n\"I will,\" said Jack, \"if you will send this boy away.\"\n\n\"How can I?\" answered Mopsa, surprised. \"Don't you know what happened\nwhen the door closed? Has nobody told you?\"\n\n\"I did not see any one after I got into the place,\" said Jack. \"There\nwas no one to tell anything,--not even a fawn, nor the brown doe. I\nhave only seen down here these fairy people, and this boy, and this\nlady.\"\n\n\"The lady is the brown doe,\" answered Mopsa; \"and this boy and the\nfairies were the fawns.\" Jack was so astonished at this that he stared\nat the lady and the boy and the fairies with all his might.\n\n\"The sun came shining in as I stepped inside,\" said Mopsa, \"and a long\nbeam fell down from the fairy dome across my feet. Do you remember\nwhat the apple-woman told us,--how it was reported that the brown doe\nand her nation had a queen whom they shut up, and never let the sun\nshine on her? That was not a kind or true report, and yet it came from\nsomething that really happened.\"\n\n\"Yes, I remember,\" said Jack; \"and if the sun did shine they were all\nto be turned into deer.\"\n\n\"I dare not tell you all that story yet,\" said Mopsa; \"but, Jack, as\nthe brown doe and all the fawns came up to greet me, and passed by\nturns into the sunbeam, they took their own forms, every one of them,\nbecause the spell was broken. They were to remain in the disguise of\ndeer till a queen of alien birth should come to them against her will.\nI am a queen of alien birth, and did not I come against my will?\"\n\n\"Yes, to be sure,\" answered Jack. \"We thought all the time that we\nwere running away.\"\n\n\"If ever you come to Fairyland again,\" observed Mopsa, \"you can save\nyourself the trouble of trying to run away from the old mother.\"\n\n\"I shall not 'come,'\" answered Jack, \"because I shall not go,--not for\na long while, at least. But the boy,--I want to know why this boy\nturned into another ME?\"\n\n\"Because he is the heir, of course,\" answered Mopsa.\n\n\"But I don't see that this is any reason at all,\" said Jack.\n\nMopsa laughed. \"That's because you don't know how to argue,\" she\nreplied. \"Why, the thing is as plain as possible.\"\n\n\"It may be plain to you,\" persisted Jack, \"but it's no reason.\"\n\n\"No reason!\" repeated Mopsa, \"no reason! when I like you the best of\nanything in the world, and when I am come here to be queen? Of course,\nwhen the spell was broken he took exactly your form on that account;\nand very right too.\"\n\n\"But why?\" asked Jack.\n\nMopsa, however, was like other fairies in this respect,--that she knew\nall about Old Mother Fate, but not about causes and reasons. She\nbelieved, as we do in this world, that\n\n  That that is, is;\n\nbut the fairies go further than this; they say:--\n\n  That that is, is; and when it is, that is the reason that it is.\n\nThis sounds like nonsense to us, but it is all right to them.\n\nSo Mopsa, thinking she had explained everything, said again,--\n\n\"And, dear Jack, will you give the silver fourpence to me?\"\n\nJack took it out; and she got down from the dame's knee and took it in\nthe palm of her hand, laying the other palm upon it.\n\n\"It will be very hot,\" observed the dame.\n\n\"But it will not burn me so as really to hurt, if I am a real queen,\"\nsaid Mopsa.\n\nPresently she began to look as if something gave her pain.\n\n\"Oh, it's so hot!\" she said to the other Jack; \"so very hot!\"\n\n\"Never mind, sweet Queen,\" he answered; \"it will not hurt you long.\nRemember my poor uncle and all his knights.\"\n\nMopsa still held the little silver coin; but Jack saw that it hurt\nher, for two bright tears fell from her eyes; and in another moment he\nsaw that it was actually melted, for it fell in glittering drops from\nMopsa's hand to the marble floor, and there it lay as soft as\nquicksilver.\n\n\"Pick it up,\" said Mopsa to the other Jack; and he instantly did so,\nand laid it in her hand again; and she began gently to roll it\nbackwards and forwards between her palms till she had rolled it into a\nvery slender rod, two feet long, and not nearly so thick as a pin; but\nit did not bend, and it shone so brightly that you could hardly look\nat it.\n\nThen she held it out towards the real Jack, and said, \"Give this a\nname.\"\n\n\"I think it is a----\" began the other Jack; but the dame suddenly\nstopped him. \"Silence, sire! Don't you know that what it is first\ncalled that it will be?\"\n\nJack hesitated; he thought if Mopsa was a queen the thing ought to be\na sceptre; but it certainly was not at all like a sceptre.\n\n\"That thing is a wand,\" said he.\n\n\"You are a wand,\" said Mopsa, speaking to the silver stick, which was\nglittering now in a sunbeam almost as if it were a beam of light\nitself. Then she spoke again to Jack:\n\n\"Tell me, Jack, what can I do with a wand?\"\n\nAgain the boy-king began to speak, and the dame stopped him, and again\nJack considered. He had heard a great deal in his own country about\nfairy wands, but he could not remember that the fairies had done\nanything particular with them, so he gave what he thought was true,\nbut what seemed to him a very stupid answer:\n\n\"You can make it point to anything that you please.\"\n\nThe moment he had said this, shouts of ecstasy filled the hall, and\nall the fairies clapped their hands with such hurrahs of delight that\nhe blushed for joy.\n\nThe dame also looked truly glad, and as for the other Jack, he\nactually turned head over heels, just as Jack had often done himself\non his father's lawn.\n\nJack had merely meant that Mopsa could point with the wand to anything\nthat she saw; but he was presently told that what he had meant was\nnothing, and that his words were everything.\n\n\"I can make it point now,\" said Mopsa, \"and it will point aright to\nanything I please, whether I know where the thing is or not.\"\n\nAgain the hall was filled with those cries of joy, and the sweet,\nchild-like fairies congratulated each other with \"The Queen has got a\nwand,--a wand! and she can make it point wherever she pleases!\"\n\nThen Mopsa rose and walked towards the beautiful staircase, the dame\nand all the fairies following. Jack was going too, but the other Jack\nheld him.\n\n\"Where is Mopsa going? and why am I not to follow?\" inquired Jack.\n\n\"They are going to put on her robes, of course,\" answered the other\nJack.\n\n\"I am so tired of always hearing you say 'of course,'\" answered Jack;\n\"and I wonder how it is that you always seem to know what is going to\nbe done without being told. However, I suppose you can't help being\nodd people.\"\n\nThe boy-king did not make a direct answer; he only said, \"I like you\nvery much, though you don't like me.\"\n\n\"Why do you like me?\" asked Jack.\n\nSo he opened his eyes wide with surprise: \"Most boys say Sire to me,\"\nhe observed; \"at least they used to do when there were any boys here.\nHowever, that does not signify. Why, of course I like you, because I\nam so tired of being always a fawn, and you brought Mopsa to break the\nspell. You cannot think how disagreeable it is to have no hands, and\nto be all covered with hair. Now look at my hands; I can move them and\nturn them everywhere, even over my head if I like. Hoofs are good for\nnothing in comparison; and we could not talk.\"\n\n\"Do tell me about it,\" said Jack. \"How did you become fawns?\"\n\n\"I dare not tell you,\" said the boy; \"and listen!--I hear Mopsa.\"\n\nJack looked, and certainly Mopsa was coming, but very strangely, he\nthought. Mopsa, like all other fairies, was afraid to whisper a spell\nwith her eyes open; so a handkerchief was tied across them, and as she\ncame on she felt her way, holding by the banisters with one hand, and\nwith the other, between her finger and thumb, holding out the silver\nwand. She felt with her foot for the edge of the first stair; and Jack\nheard her say, \"I am much older,--ah! so much older, now I have got my\nwand. I can feel sorrow too, and _their_ sorrow weighs down my\nheart.\"\n\nMopsa was dressed superbly in a white satin gown, with a long, long\ntrain of crimson velvet which was glittering with diamonds; it reached\nalmost from one end of the great gallery to the other, and had\nhundreds of fairies to hold it and keep it in its place. But in her\nhair were no jewels, only a little crown made of daisies, and on her\nshoulders her robe was fastened with the little golden image of a\nboat. These things were to show the land she had come from and the\nvessel she had come in.\n\nSo she came slowly, slowly down stairs blindfold, and muttering to her\nwand all the time:\n\n  Though the sun shine brightly,\n  Wand, wand, guide rightly.\n\nSo she felt her way down to the great hall. There the wand turned half\nround in the hall toward the great door, and she and Jack and the\nother Jack came out into the lawn in front with all the followers and\ntrainbearers; only the dame remained behind.\n\nJack noticed now for the first time that, with the one exception of\nthe boy-king, all these fairies were lady-fairies; he also observed\nthat Mopsa, after the manner of fairy queens, though she moved slowly\nand blindfold, was beginning to tell a story. This time it did not\nmake him feel sleepy. It did not begin at the beginning: their stories\nnever do.\n\nThese are the first words he heard, for she spoke softly and very low,\nwhile he walked at her right hand, and the other Jack on her left:\n\n\"And so now I have no wings. But my thoughts can go up (Jovinian and\nRoxaletta could not think). My thoughts are instead of wings; but they\nhave dropped with me now, as a lark among the clods of the valley.\nWand, do you bend? Yes, I am following, wand.\n\n\"And after that the bird said, 'I will come when you call me.' I never\nhave seen her moving overhead; perhaps she is out of sight. Flocks of\nbirds hover over the world, and watch it high up where the air is\nthin. There are zones, but those in the lowest zone are far out of\nsight.\n\n\"I have not been up there. I have no wings.\n\n\"Over the highest of the birds is the place where angels float and\ngather the children's souls as they are set free.\n\n\"And so that woman told me,--(Wand, you bend again, and I will turn at\nyour bending),--that woman told me how it was: for when the new king\nwas born, a black fairy with a smiling face came and sat within the\ndoorway. She had a spindle, and would always spin. She wanted to teach\nthem how to spin, but they did not like her, and they loved to do\nnothing at all. So they turned her out.\n\n\"But after her came a brown fairy, with a grave face, and she sat on\nthe black fairy's stool and gave them much counsel. They liked that\nstill less; so they got spindles and spun, for they said, 'She will go\nnow, and we shall have the black fairy again.' When she did not go\nthey turned her out also, and after her came a white fairy, and sat in\nthe same seat. She did nothing at all, and she said nothing at all;\nbut she had a sorrowful face, and she looked up. So they were\ndispleased. They turned her out also; and she went and sat by the\nedge of the lake with her two sisters.\n\n\"And everything prospered over all the land; till, after shearing-time,\nthe shepherds, because the king was a child, came to his uncle and\nsaid, 'Sir, what shall we do with the old wool, for the new fleeces\nare in the bales, and there is no storehouse to put them in?' So he\nsaid, 'Throw them into the lake.'\n\n\"And while they threw them in, a great flock of finches flew to them,\nand said, 'Give us some of the wool that you do not want; we should be\nglad of it to build our nests with.'\n\n\"They answered, 'Go and gather for yourselves; there is wool on every\nthorn.'\n\n\"Then the black fairy said, 'They shall be forgiven this time, because\nthe birds should pick wool for themselves.'\n\n\"So the finches flew away.\n\n\"Then the harvest was over, and the reapers came and said to the\nchild-king's uncle, 'Sir, what shall we do with the new wheat, for\nthe old is not half eaten yet, and there is no room in the\ngranaries?'\n\n\"He said, 'Throw that into the lake also.'\n\n\"While they were throwing it in, there came a great flight of the wood\nfairies, fairies of passage from over the sea. They were in the form\nof pigeons, and they alighted and prayed them, 'O, cousins! we are\nfaint with our long flight; give us some of that corn which you do not\nwant, that we may peck it and be refreshed.'\n\n\"But they said, 'You may rest on our land, but our corn is our own.\nRest awhile, and go and get food in your own fields.'\n\n\"Then the brown fairy said, 'They may be forgiven this once, but yet\nit is a great unkindness.'\n\n\"And as they were going to pour in the last sackful, there passed a\npoor mortal beggar, who had strayed in from the men and women's world,\nand she said, 'Pray give me some of that wheat, O fairy people! for I\nam hungry. I have lost my way, and there is no money to be earned\nhere. Give me some of that wheat, that I may bake cakes, lest I and my\nbaby should starve.'\n\n\"And they said, 'What is starve? We never heard that word before, and\nwe cannot wait while you explain it to us.'\n\n\"So they poured it all into the lake; and then the white fairy said,\n'This cannot be forgiven them'; and she covered her face with her\nhands and wept. Then the black fairy rose and drove them all before\nher,--the prince, with his chief shepherd and his reapers, his\ncourtiers and his knights; she drove them into the great bed of reeds,\nand no one has ever set eyes on them since. Then the brown fairy went\ninto the palace where the king's aunt sat, with all her ladies and her\nmaids about her, and with the child-king on her knee.\n\n\"It was a very gloomy day.\n\n\"She stood in the middle of the hall, and said, 'Oh, you cold-hearted\nand most unkind! my spell is upon you, and the first ray of sunshine\nshall bring it down. Lose your present forms, and be of a more gentle\nand innocent race, till a queen of alien birth shall come to reign\nover you against her will.'\n\n\"As she spoke they crept into corners, and covered the dame's head\nwith a veil. And all that day it was dark and gloomy, and nothing\nhappened, and all the next day it rained and rained; and they thrust\nthe dame into a dark closet, and kept her there for a whole month, and\nstill not a ray of sunshine came to do them any damage; but the dame\nfaded and faded in the dark, and at last they said, 'She must come\nout, or she will die; and we do not believe the sun will ever shine in\nour country any more.' So they let the poor dame come out; and lo! as\nshe crept slowly forth under the dome, a piercing ray of sunlight\ndarted down upon her head, and in an instant they were all changed\ninto deer, and the child-king too.\n\n\"They are gentle now, and kind; but where is the prince? where are the\nfairy knights and the fairy men?\n\n\"Wand! why do you turn?\"\n\nNow while Mopsa told her story the wand continued to bend, and Mopsa,\nfollowing, was slowly approaching the foot of a great precipice, which\nrose sheer up for more than a hundred feet. The crowd that followed\nlooked dismayed at this: they thought the wand must be wrong; or even\nif it was right, they could not climb a precipice.\n\nBut still Mopsa walked on blindfold, and the wand pointed at the rock\ntill it touched it, and she said, \"Who is stopping me?\"\n\nThey told her, and she called to some of her ladies to untie the\nhandkerchief. Then Mopsa looked at the rock, and so did the two Jacks.\nThere was nothing to be seen but a very tiny hole. The boy-king\nthought it led to a bees' nest, and Jack thought it was a keyhole, for\nhe noticed in the rock a slight crack which took the shape of an\narched door.\n\nMopsa looked earnestly at the hole. \"It may be a keyhole,\" she said,\n\"but there is no key.\"\n\n\n\n\nCHAPTER XVI. FAILURE.\n\n  We are much bound to them that do succeed;\n    But, in a more pathetic sense, are bound\n    To such as fail. They all our loss expound;\n  They comfort us for work that will not speed,\n  And life--itself a failure. Ay, his deed,\n    Sweetest in story, who the dusk profound\n    Of Hades flooded with entrancing sound,\n  Music's own tears, was failure. Doth it read\n  Therefore the worse? Ah, no! so much to dare,\n    He fronts the regnant Darkness on its throne.--\n  So much to do; impetuous even there,\n    He pours out love's disconsolate sweet moan--\n  He wins; but few for that his deed recall:\n  Its power is in the look which costs him all.\n\n\nAt this moment Jack observed that a strange woman was standing among\nthem, and that the trainbearing fairies fell back, as if they were\nafraid of her. As no one spoke, he did, and said, \"Good-morning!\"\n\n\"Good-afternoon!\" she answered, correcting him. \"I am the black fairy.\nWork is a fine thing. Most people in your country can work.\"\n\n\"Yes,\" said Jack.\n\n\"There are two spades,\" continued the fairy woman, \"one for you, and\none for your double.\"\n\nJack took one of the spades,--it was small, and was made of silver;\nbut the other Jack said with scorn,--\n\n\"I shall be a king when I am old enough, and must I dig like a\nclown?\"\n\n\"As you please,\" said the black fairy, and walked away.\n\nThen they all observed that a brown woman was standing there; and she\nstepped up and whispered in the boy-king's ear. As he listened his\nsullen face became good tempered, and at last he said, in a gentle\ntone, \"Jack, I'm quite ready to begin if you are.\"\n\n\"But where are we to dig?\" asked Jack.\n\n\"There,\" said a white fairy, stepping up and setting her foot on the\ngrass just under the little hole. \"Dig down as deep as you can.\"\n\nSo Mopsa and the crowd stood back, and the two boys began to dig; and\ngreatly they enjoyed it, for people can dig so fast in Fairyland.\n\nVery soon the hole was so deep that they had to jump into it, because\nthey could not reach the bottom with their spades. \"This is very jolly\nindeed,\" said Jack, when they had dug so much deeper that they could\nonly see out of the hole by standing on tiptoe.\n\n\"Go on,\" said the white fairy; so they dug till they came to a flat\nstone, and then she said, \"Now you can stamp. Stamp on the stone, and\ndon't be afraid.\" So the two Jacks began to stamp, and in such a\nlittle time that she had only half turned her head round, the flat\nstone gave way, for there was a hollow underneath it, and down went\nthe boys, and utterly disappeared.\n\nThen, while Mopsa and the crowd silently looked on, the white fairy\nlightly pushed the clods of earth towards the hole with the side of\nher foot, and in a very few minutes the hole was filled in, and that\nso completely and so neatly, that when she had spread the turf on it,\nand given it a pat with her foot, you could not have told where it had\nbeen. Mopsa said not a word, for no fairy ever interferes with a\nstronger fairy; but she looked on earnestly, and when the white\nstranger smiled she was satisfied.\n\nThen the white stranger walked away, and Mopsa and the fairies sat\ndown on a bank under some splendid cedar-trees. The beautiful castle\nlooked fairer than ever in the afternoon sunshine; a lovely waterfall\ntumbled with a tinkling noise near at hand, and the bank was covered\nwith beautiful wild flowers.\n\nThey sat for a long while, and no one spoke: what they were thinking\nof is not known, but sweet Mopsa often sighed.\n\nAt last a noise,--a very, very slight noise, as of the footsteps of\npeople running,--was heard inside the rock, and then a little\nquivering was seen in the wand. It quivered more and more as the\nsound increased. At last that which had looked like a door began to\nshake as if some one was pushing it from within. Then a noise was\ndistinctly heard as of a key turning in the hole, and out burst the\ntwo Jacks, shouting for joy, and a whole troop of knights and squires\nand serving-men came rushing wildly forth behind them.\n\nOh, the joy of that meeting! who shall describe it? Fairies by dozens\ncame up to kiss the boy-king's hand, and Jack shook hands with every\none that could reach him. Then Mopsa proceeded to the castle between\nthe two Jacks, and the king's aunt came out to meet them, and welcomed\nher husband with tears of joy; for these fairies could laugh and cry\nwhen they pleased, and they naturally considered this a great proof of\nsuperiority.\n\nAfter this a splendid feast was served under the great dome. The other\nfairy feasts that Jack had seen were nothing to it. The prince and his\ndame sat at one board, but Mopsa sat at the head of the great table,\nwith the two Jacks, one on each side of her.\n\nMopsa was not happy, Jack was sure of that, for she often sighed; and\nhe thought this strange. But he did not ask her any questions, and he,\nwith the boy-king, related their adventures to her: how, when the\nstone gave way, they tumbled in and rolled down a sloping bank till\nthey found themselves at the entrance of a beautiful cave, which was\nall lighted up with torches, and glittering with stars and crystals of\nall the colors in the world. There was a table spread with what looked\nlike a splendid luncheon in this great cave, and chairs were set\nround, but Jack and the boy-king felt no inclination to eat anything,\nthough they were hungry, for a whole nation of ants were creeping up\nthe honey-pots. There were snails walking about over the table-cloth,\nand toads peeping out of some of the dishes.\n\nSo they turned away, and, looking for some other door to lead them\nfarther in, they at last found a very small one,--so small that only\none of them could pass through at a time.\n\nThey did not tell Mopsa all that had occurred on this occasion. It was\nthus:\n\nThe boy-king said, \"I shall go in first, of course, because of my\nrank.\"\n\n\"Very well,\" said Jack, \"I don't mind. I shall say to myself that\nyou've gone in first to find the way for me, because you're my double.\nBesides, now I think of it, our Queen always goes last in a\nprocession; so it's grand to go last. Pass in, Jack.\"\n\n\"No,\" answered the other Jack; \"now you have said that I will not. You\nmay go first.\"\n\nSo they began to quarrel and argue about this, and it is impossible to\nsay how long they would have gone on if they had not begun to hear a\nterrible and mournful sort of moaning and groaning, which frightened\nthem both and instantly made them friends. They took tight hold of one\nanother's hand, and again there came by a loud sighing, and a noise of\nall sorts of lamentation, and it seemed to reach them through the\nlittle door.\n\nEach of the boys would now have been very glad to go back, but neither\nliked to speak. At last Jack thought anything would be less terrible\nthan listening to those dismal moans, so he suddenly dashed through\nthe door, and the other Jack followed.\n\nThere was nothing terrible to be seen. They found themselves in a\nplace like an immensely long stable; but it was nearly dark, and when\ntheir eyes got used to the dimness, they saw that it was strewed with\nquantities of fresh hay, from which curious things like sticks stuck\nup in all directions. What were they?\n\n\"They are dry branches of trees,\" said the boy-king.\n\n\"They are table-legs turned upside down,\" said Jack: but then the\nother Jack suddenly perceived the real nature of the thing, and he\nshouted out, \"No; they are antlers!\"\n\nThe moment he said this the moaning ceased, hundreds of beautiful\nantlered heads were lifted up, and the two boys stood before a\nsplendid herd of stags; but they had had hardly time to be sure of\nthis when the beautiful multitude rose and fled away into the\ndarkness, leaving the two boys to follow as well as they could.\n\nThey were sure they ought to run after the herd, and they ran and ran,\nbut they soon lost sight of it, though they heard far on in front what\nseemed at first like a pattering of deer's feet, but the sound changed\nfrom time to time. It became heavier and louder, and then the\nclattering ceased, and it was evidently the tramping of a great crowd\nof men. At last they heard words, very glad and thankful words; people\nwere crying to one another to make haste, lest the spell should come\nupon them again. Then the two Jacks, still running, came into a grand\nhall, which was quite full of knights and all sorts of fairy men, and\nthere was the boy-king's uncle, but he looked very pale. \"Unlock the\ndoor!\" they cried. \"We shall not be safe till we see our new Queen.\nUnlock the door; we see light coming through the keyhole.\"\n\nThe two Jacks came on to the front, and felt and shook the door. At\nlast the boy-king saw a little golden key glittering on the floor,\njust where the one narrow sunbeam fell that came through the keyhole;\nso he snatched it up. It fitted, and out they all came, as you have\nbeen told.\n\nWhen they had done relating their adventures, the new Queen's health\nwas drunk. And then they drank the health of the boy-king, who stood\nup to return thanks, and, as is the fashion there, he sang a song.\nJack thought it the most ridiculous song he had ever heard; but as\neverybody else looked extremely grave, he tried to be grave too. It\nwas about Cock-Robin and Jenny Wren, how they made a wedding feast,\nand how the wren said she should wear her brown gown, and the old dog\nbrought a bone to the feast.\n\n  \"He had brought them,\" he said, \"some meat on a bone:\n  They were welcome to pick it or leave it alone.\"\n\nThe fairies were very attentive to this song; they seemed, if one may\njudge by their looks, to think it was rather a serious one. Then they\ndrank Jack's health, and afterwards looked at him as if they expected\nhim to sing too; but as he did not begin, he presently heard them\nwhispering, and one asking another, \"Do you think he knows manners?\"\n\nSo he thought he had better try what he could do, and he stood up and\nsang a song that he had often heard his nurse sing in the nursery at\nhome.\n\n  One morning, oh! so early, my belovèd, my belovèd,\n  All the birds were singing blithely, as if never they would cease;\n  'Twas a thrush sang in my garden, \"Hear the story, hear the story!\"\n            And the lark sang, \"Give us glory!\"\n            And the dove said, \"Give us peace!\"\n\n  Then I listened, oh! so early, my belovèd, my belovèd,\n  To that murmur from the woodland of the dove, my dear, the dove;\n  When the nightingale came after, \"Give us fame to sweeten duty!\"\n            When the wren sang, \"Give us beauty!\"\n            She made answer, \"Give us love!\"\n\n  Sweet is spring, and sweet the morning, my belovèd, my belovèd;\n  Now for us doth spring, doth morning, wait upon the year's\n        increase,\n  And my prayer goes up, \"Oh, give us, crowned in youth with marriage\n        glory,\n            Give for all our life's dear story,\n            Give us love, and give us peace!\"\n\n\"A very good song too,\" said the dame, at the other end of the table;\n\"only you made a mistake in the first verse. What the dove really said\nwas, no doubt, 'Give us peas.' All kinds of doves and pigeons are very\nfond of peas.\"\n\n\"It isn't peas, though,\" said Jack. However, the court historian was\nsent for to write down the song, and he came with a quill pen, and\nwrote it down as the dame said it ought to be.\n\nNow all this time Mopsa sat between the two Jacks, and she looked very\nmournful,--she hardly said a word.\n\nWhen the feast was over, and everything had vanished, the musicians\ncame in, for there was to be dancing; but while they were striking\nup, the white fairy stepped in, and, coming up, whispered something\nin Jack's ear; but he could not hear what she said, so she repeated it\nmore slowly, and still he could neither hear nor understand it.\n\nMopsa did not seem to like the white fairy; she leaned her face on her\nhand and sighed; but when she found that Jack could not hear the\nmessage, she said, \"That is well. Cannot you let things alone for this\none day?\" The fairy then spoke to Mopsa, but she would not listen; she\nmade a gesture of dislike and moved away. So then this strange fairy\nturned and went out again, but on the door-step she looked round, and\nbeckoned to Jack to come to her. So he did; and then, as they two\nstood together outside, she made him understand what she had said. It\nwas this:\n\n\"Her name was Jenny, her name was Jenny.\"\n\nWhen Jack understood what she said he felt so sorrowful; he wondered\nwhy she had told him, and he longed to stay in that great place with\nQueen Mopsa,--his own little Mopsa, whom he had carried in his pocket,\nand taken care of, and loved.\n\nHe walked up and down, up and down, outside, and his heart swelled and\nhis eyes filled with tears. The bells had said he was to go home, and\nthe fairy had told him how to go. Mopsa did not need him, she had so\nmany people to take care of her; and then there was that boy, so\nexactly like himself that she would not miss him. Oh, how sorrowful it\nall was! Had he really come up the fairy river, and seen those strange\ncountries, and run away with Mopsa over those dangerous mountains,\nonly to bring her to the very place she wished to fly from, and there\nto leave her, knowing that she wanted him no more, and that she was\nquite content?\n\nNo; Jack felt that he could not do that. \"I will stay,\" he said; \"they\ncannot make me leave her. That would be too unkind.\"\n\nAs he spoke, he drew near to the great yawning door, and looked in.\nThe fairy folk were singing inside; he could hear their pretty\nchirping voices, and see their beautiful faces, but he could not bear\nit, and he turned away.\n\nThe sun began to get low, and all the west was dyed with crimson. Jack\ndried his eyes, and, not liking to go in, took one turn more.\n\n\"I will go in,\" he said; \"there is nothing to prevent me.\" He set his\nfoot on the step of the door, and while he hesitated Mopsa came out to\nmeet him.\n\n\"Jack,\" she said, in a sweet mournful tone of voice. But he could not\nmake any answer; he only looked at her earnestly, because her lovely\neyes were not looking at him, but far away towards the west.\n\n\"He lives there,\" she said, as if speaking to herself. \"He will play\nthere again, in his father's garden.\"\n\nThen she brought her eyes down slowly from the rose-flush in the\ncloud, and looked at him and said, \"Jack.\"\n\n\"Yes,\" said Jack; \"I am here. What is it that you wish to say?\"\n\nShe answered, \"I am come to give you back your kiss.\"\n\nSo she stooped forward as she stood on the step, and kissed him, and\nher tears fell on his cheek.\n\n\"Farewell!\" she said, and she turned and went up the steps and into\nthe great hall; and while Jack gazed at her as she entered, and would\nfain have followed, but could not stir, the great doors closed\ntogether again, and he was left outside.\n\nThen he knew, without having been told, that he should never enter\nthem any more. He stood gazing at the castle; but it was still,--no\nmore fairy music sounded.\n\nHow beautiful it looked in the evening sunshine, and how Jack cried!\n\n[THE QUEEN'S FAREWELL.\n\n\"She stooped forward as she stood on the step, and kissed him.\"--PAGE\n234.]\n\nSuddenly he perceived that reeds were growing up between him and the\ngreat doors: the grass, which had all day grown about the steps, was\ngetting taller; it had long spear-like leaves, it pushed up long pipes\nof green stem, and they whistled.\n\nThey were up to his ankles, they were presently up to his waist; soon\nthey were as high as his head. He drew back that he might see over\nthem; they sprang up faster as he retired, and again he went back. It\nseemed to him that the castle also receded; there was a long reach of\nthese great reeds between it and him, and now they were growing behind\nalso, and on all sides of him. He kept moving back and back: it was of\nno use, they sprang up and grew yet more tall, till very shortly the\nlast glimpse of the fairy castle was hidden from his sorrowful eyes.\n\nThe sun was just touching the tops of the purple mountains when Jack\nlost sight of Mopsa's home; but he remembered how he had penetrated\nthe bed of reeds in the morning, and he hoped to have the same good\nfortune again. So on and on he walked, pressing his way among them as\nwell as he could, till the sun went down behind the mountains, and\nthe rosy sky turned gold color, and the gold began to burn itself\naway, and then all on a sudden he came to the edge of the reed-bed,\nand walked out upon a rising ground.\n\nJack ran up it, looking for the castle. He could not see it, so he\nclimbed a far higher hill; still he could not see it. At last, after a\ntoilsome ascent to the very top of the green mountain, he saw the\ncastle lying so far, so very far off, that its peaks and its\nbattlements were on the edge of the horizon, and the evening mist rose\nwhile he was gazing, so that all its outlines were lost, and very soon\nthey seemed to mingle with the shapes of the hill and the forest, till\nthey had utterly vanished away.\n\nThen he threw himself down on the short grass. The words of the white\nfairy sounded in his ears, \"Her name was Jenny\"; and he burst into\ntears again, and decided to go home.\n\nHe looked up into the rosy sky, and held out his arms, and called,\n\"Jenny! O Jenny! come.\"\n\nIn a minute or two he saw a little black mark overhead, a small speck,\nand it grew larger, and larger, and larger still, as it fell headlong\ndown like a stone. In another instant he saw a red light and a green\nlight, then he heard the winnowing noise of the bird's great wings,\nand she alighted at his feet, and said, \"Here I am.\"\n\n\"I wish to go home,\" said Jack, hanging down his head and speaking in\na low voice, for his heart was heavy because of his failure.\n\n\"That is well,\" answered the bird. She took Jack on her back, and in\nthree minutes they were floating among the clouds.\n\nAs Jack's feet were lifted up from Fairyland he felt a little\nconsoled. He began to have a curious feeling, as if this had all\nhappened a good while ago, and then half the sorrow he had felt faded\ninto wonder, and the feeling still grew upon him that these things had\npassed some great while since, so that he repeated to himself, \"It was\na long time ago.\"\n\nThen he fell asleep, and did not dream at all, nor know anything more\ntill the bird woke him.\n\n\"Wake up now, Jack,\" she said; \"we are at home.\"\n\n\"So soon!\" said Jack, rubbing his eyes. \"But it is evening; I thought\nit would be morning.\"\n\n\"Fairy time is always six hours in advance of your time,\" said the\nbird. \"I see glowworms down in the hedge, and the moon is just\nrising.\"\n\nThey were falling so fast that Jack dared not look; but he saw the\nchurch, and the wood, and his father's house, which seemed to be\nstarting up to meet him. In two seconds more the bird alighted, and he\nstepped down from her back into the deep grass of his father's\nmeadow.\n\n\"Good-by!\" she said; \"make haste and run in, for the dews are\nfalling\"; and before he could ask her one question, or even thank her,\nshe made a wide sweep over the grass, beat her magnificent wings, and\nsoared away.\n\nIt was all very extraordinary, and Jack felt shy and ashamed; but he\nknew he must go home, so he opened the little gate that led into the\ngarden, and stole through the shrubbery, hoping that his footsteps\nwould not be heard.\n\nThen he came out on the lawn, where the flower-beds were, and he\nobserved that the drawing-room window was open, so he came softly\ntowards it and peeped in.\n\nHis father and mother were sitting there. Jack was delighted to see\nthem, but he did not say a word, and he wondered whether they would be\nsurprised at his having stayed away so long. The bird had said that\nthey would not.\n\nHe drew a little nearer. His mother sat with her back to the open\nwindow, but a candle was burning, and she was reading aloud. Jack\nlistened as she read, and knew that this was not in the least like\nanything that he had seen in Fairyland, nor the reading like anything\nthat he had heard, and he began to forget the boy-king, and the\napple-woman, and even his little Mopsa, more and more.\n\nAt last his father noticed him. He did not look at all surprised, but\njust beckoned to him with his finger to come in. So Jack did, and got\nupon his father's knee, where he curled himself up comfortably, laid\nhis head on his father's waistcoat, and wondered what he would think\nif he should be told about the fairies in somebody else's waistcoat\npocket. He thought, besides, what a great thing a man was; he had\nnever seen anything so large in Fairyland, nor so important; so, on\nthe whole, he was glad he had come back, and felt very comfortable.\nThen his mother, turning over the leaf, lifted up her eyes and looked\nat Jack, but not as if she was in the least surprised, or more glad to\nsee him than usual; but she smoothed the leaf with her hand, and began\nagain to read, and this time it was about the Shepherd Lady:--\n\n  I.\n\n  Who pipes upon the long green hill,\n    Where meadow grass is deep?\n  The white lamb bleats but followeth on--\n    Follow the clean white sheep.\n  The dear white lady in yon high tower,\n    She hearkeneth in her sleep.\n\n  All in long grass the piper stands,\n    Goodly and grave is he;\n  Outside the tower, at dawn of day,\n    The notes of his pipe ring free.\n  A thought from his heart doth reach to hers:\n    \"Come down, O lady! to me.\"\n\n  She lifts her head, she dons her gown:\n    Ah! the lady is fair;\n  She ties the girdle on her waist,\n    And binds her flaxen hair,\n  And down she stealeth, down and down,\n    Down the turret stair.\n\n  Behold him! With the flock he wons\n    Along yon grassy lea.\n  \"My shepherd lord, my shepherd love,\n    What wilt thou, then, with me?\n  My heart is gone out of my breast,\n    And followeth on to thee.\"\n\n  II.\n\n  \"The white lambs feed in tender grass:\n    With them and thee to bide,\n  How good it were,\" she saith at noon;\n    \"Albeit the meads are wide.\n  Oh! well is me\" she saith when day\n    Draws on to eventide.\n\n  Hark! hark! the shepherd's voice. Oh, sweet!\n    Her tears drop down like rain.\n  \"Take now this crook, my chosen, my fere\n    And tend the flock full fain;\n  Feed them, O lady, and lose not one,\n    Till I shall come again.\"\n\n  Right soft her speech: \"My will is thine,\n    And my reward thy grace!\"\n  Gone are his footsteps over the hill,\n    Withdrawn his goodly face;\n  The mournful dusk begins to gather,\n    The daylight wanes apace.\n\n  III.\n\n  On sunny slopes, ah! long the lady\n    Feedeth her flock at noon;\n  She leads them down to drink at eve\n    Where the small rivulets croon.\n  All night her locks are wet with dew,\n    Her eyes outwatch the moon.\n\n  Over the hills her voice is heard,\n    She sings when light doth wane:\n  \"My longing heart is full of love.\n    When shall my loss be gain?\n  My shepherd lord, I see him not,\n    But he will come again.\"\n\nWhen she had finished, Jack lifted his face and said, \"Mamma!\" Then\nshe came to him and kissed him, and his father said, \"I think it must\nbe time this man of ours was in bed.\"\n\nSo he looked earnestly at them both, and as they still asked him no\nquestions, he kissed and wished them good-night; and his mother said\nthere were some strawberries on the sideboard in the dining-room, and\nhe might have them for his supper.\n\nSo he ran out into the hall, and was delighted to find all the house\njust as usual, and after he had looked about him he went into his own\nroom, and said his prayers. Then he got into his little white bed, and\ncomfortably fell asleep.\n\nThat's all.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      202,
      230,
      1
    ],
    [
      "chapter.title",
      11553,
      11578,
      2
    ],
    [
      "chapter.title",
      19340,
      19369,
      3
    ],
    [
      "chapter.title",
      35896,
      35940,
      4
    ],
    [
      "chapter.title",
      52229,
      52264,
      5
    ],
    [
      "chapter.title",
      69985,
      70024,
      6
    ],
    [
      "chapter.title",
      79836,
      79862,
      7
    ],
    [
      "chapter.title",
      92979,
      93001,
      8
    ],
    [
      "chapter.title",
      106621,
      106649,
      9
    ],
    [
      "chapter.title",
      117417,
      117453,
      10
    ],
    [
      "chapter.title",
      128563,
      128596,
      11
    ],
    [
      "chapter.title",
      139057,
      139105,
      12
    ],
    [
      "chapter.title",
      153448,
      153474,
      13
    ],
    [
      "chapter.title",
      165017,
      165047,
      14
    ],
    [
      "chapter.title",
      175779,
      175808,
      15
    ],
    [
      "chapter.title",
      193562,
      193583,
      16
    ]
  ]
}