{
  "content": "Prince Prigio\nAndrew Lang\n\nTO CHILDREN.\n\nThe Author of this book is also the Editor of the Blue, Red, Greenland\nYellow Fairy Books. He has always felt rather an impostor, because so\nmany children seem to think that he made up these books out of his\nown head. Now he only picked up a great many old fairy tales, told\nin French, German, Greek, Chinese, Red Indian, Russian, and other\nlanguages, and had them translated and printed, with pictures. He is\nglad that children like them, but he must confess that they should be\ngrateful to old forgotten people, long ago, who first invented these\ntales, and who knew more about fairies than we can hope to do.\n\n_My Own Fairy Book_, which you now have in your hands, was made up\naltogether out of his own head by the Author, of course with the help of\nthe Historical Papers in the kingdom of Pantouflia. About that ancient\nkingdom very little is known. The natives speak German; but the Royal\nFamily, as usual, was of foreign origin. Just as England has had Norman,\nScottish, and, at present, a line of German monarchs, so the kings of\nPantouflia are descended from an old Greek family, the Hypnotidæ, who\ncame to Pantouflia during the Crusades. They wanted, they explained, not\nto be troubled with the Crusades, which they thought very injudicious\nand tiresome. The Crest of the regal house is a Dormouse, dormant,\nproper, on a field vert, and the Motto, when translated out of the\noriginal Greek, means, _Anything for a Quiet Life_.\n\nIt may surprise the young reader that princes like Prigio and Ricardo,\nwhose feet were ever in the stirrup, and whose lances were always in\nrest, should have descended from the family of the Hypnotidæ, who were\nremarkably lazy and peaceful. But these heroes doubtless inherited the\nspirit of their great ancestress, whose story is necessary to be known.\nOn leaving his native realm during the Crusades, in search of some\nsecure asylum, the founder of the Pantouflian monarchy landed in the\nisland of Cyprus, where, during the noon-tide heat, he lay down to\nsleep in a cave. Now in this cave dwelt a dragon of enormous size and\nunamiable character. What was the horror of the exiled prince when he\nwas aroused from slumber by the fiery breath of the dragon, and felt its\nscaly coils about him!\n\n“Oh, hang your practical jokes!” exclaimed the prince, imagining that\nsome of his courtiers were playing a prank on him.\n\n“Do you call _this_ a joke?” asked the dragon, twisting its forked tail\ninto a line with his royal highness’s eye.\n\n“Do take that thing away,” said the prince, “and let a man have his nap\npeacefully.’’\n\n“Kiss me!” cried the dragon, which had already devoured many gallant\nknights for declining to kiss it.\n\n“Give you a kiss,” murmured the prince; “oh, certainly, if that’s all!\n_Anything for a quiet life._”\n\nSo saying, he kissed the dragon, which instantly became a most beautiful\nprincess; for she had lain enchanted as a dragon, by a wicked magician,\ntill somebody should be bold enough to kiss her.\n\n“My love! my hero! my lord! how long I have waited for thee; and now I\nam eternally thine own!”\n\nSo murmured, in the most affectionate accents, the Lady Dragonissa, as\nshe was now called.\n\nThough wedded to a bachelor life, the prince was much too well-bred to\nmake any remonstrance.\n\nThe Lady Dragonissa, a female of extraordinary spirit, energy, and\nambition, took command of him and of his followers, conducted them up\nthe Danube, seized a principality whose lord had gone crusading, set\nher husband on the throne, and became in course of time the mother of a\nlittle prince, who, again, was great, great, great, great-grandfather of\nour Prince Prigio.\n\nFrom this adventurous Lady Dragonissa, Prince Prigio derived his\ncharacter for gallantry. But her husband, it is said, was often heard to\nremark, by a slight change of his family motto:\n\n“_Anything for a Quiet Wife!_”\n\nYou now know as much as the Author does of the early history of\nPantouflia.\n\nAs to the story called _The Gold of Fairnilee_, such adventures were\nextremely common in Scotland long ago, as may be read in many of\nthe works of Sir Walter Scott and of the learned in general. Indeed,\nFairnilee is the very place where the fairy queen appointed to meet her\nlover, Thomas the Rhymer.\n\nWith these explanations, the Author leaves to the judgment of young\nreaders his _Own Fairy Book_.\n\n\n\n\nPRINCE PRIGIO\n\nBy Andrew Lang\n\nAdorned by Gordon Browne, T. Scott, and E. A. Lemann.\n\nIS\n\nDedicated\n\nTO\n\nALMA, THYRA, EDITH, ROSALIND, NORNA, CECILY, AND VIOLET\n\n\n\n\nPREFACE.\n\nIn compiling the following History from the Archives of Pantouflia, the\nEditor has incurred several obligations to the Learned. The Return of\nBenson (chapter xii.) is the fruit of the research of the late Mr. Allen\nQuatermain, while the final _wish_ of Prince Prigio was suggested by the\ninvention or erudition of a Lady.\n\nA study of the _Firedrake_ in South Africa, where he is called the\n_Nanaboulélé_, a difficult word-has been published in French (translated\nfrom the Basuto language) by M. Paul Sébillot, in the _Revue des\nTraditione Populaires_. For the _Rémora_, the Editor is indebted to the\n_Voyage à la Lune_ of M. Cyrano de Bergérac.\n\n\n\n\n\nCHAPTER I. _How the Fairies were not Invited to Court_\n\nONCE upon a time there reigned in Pantouflia a king and a queen. With\nalmost everything else to make them happy, they wanted one thing: they\nhad no children. This vexed the king even more than the queen, who was\nvery clever and learned, and who had hated dolls when she was a child.\nHowever, she too, in spite of all the books she read and all the\npictures she painted, would have been glad enough to be the mother of\na little prince. The king was anxious to consult the fairies, but the\nqueen would not hear of such a thing. She did not believe in fairies:\nshe said that they had never existed; and that she maintained, though\n_The History of the Royal Family_ was full of chapters about nothing\nelse.\n\nWell, at long and at last they had a little boy, who was generally\nregarded as the finest baby that had ever been seen. Even her majesty\nherself remarked that, though she could never believe all the courtiers\ntold her, yet he certainly was a fine child--a very fine child.\n\nNow, the time drew near for the christening party, and the king and\nqueen were sitting at breakfast in their summer parlour talking over\nit. It was a splendid room, hung with portraits of the royal ancestors.\nThere was Cinderella, the grandmother of the reigning monarch, with her\nlittle foot in her glass slipper thrust out before her. There was the\nMarquis de Carabas, who, as everyone knows, was raised to the throne as\nprince consort after his marriage with the daughter of the king of the\nperiod. On the arm of the throne was seated his celebrated cat, wearing\nboots. There, too, was a portrait of a beautiful lady, sound asleep:\nthis was Madame La Belle au Bois-dormant, also an ancestress of the\nroyal family. Many other pictures of celebrated persons were hanging on\nthe walls.\n\n“You have asked all the right people, my dear?” said the king.\n\n“Everyone who should be asked,” answered the queen.\n\n“People are so touchy on these occasions,” said his majesty. “You have\nnot forgotten any of our aunts?”\n\n“No; the old cats!” replied the queen; for the king’s aunts were\nold-fashioned, and did not approve of her, and she knew it. “They are\nvery kind old ladies in their way,” said the king; “and were nice to me\nwhen I was a boy.”\n\nThen he waited a little, and remarked:\n\n“The fairies, of course, you have invited? It has always been usual, in\nour family, on an occasion like this; and I think we have neglected them\na little of late.”\n\n“How _can_ you be so _absurd?_” cried the queen. “How often must I tell\nyou that there are _no_ fairies? And even if there were--but, no matter;\npray let us drop the subject.”\n\n“They are very old friends of our family, my dear, that’s all,” said the\nking timidly. “Often and often they have been godmothers to us. One, in\nparticular, was most kind and most serviceable to Cinderella I., my own\ngrandmother.”\n\n“Your grandmother!” interrupted her majesty. “Fiddle-de-dee! If anyone\nputs such nonsense into the head of my little Prigio----”\n\nBut here the baby was brought in by the nurse, and the queen almost\ndevoured it with kisses. And so the fairies were not invited! It was\nan extraordinary thing, but none of the nobles could come to the\nchristening party when they learned that the fairies had not been asked.\nSome were abroad; several were ill; a few were in prison among the\nSaracens; others were captives in the dens of ogres. The end of it was\nthat the king and queen had to sit down alone, one at each end of a very\nlong table, arrayed with plates and glasses for a hundred guests--for a\nhundred guests who never came!\n\n“Any soup, my dear?” shouted the king, through a speaking-trumpet; when,\nsuddenly, the air was filled with a sound like the rustling of the wings\nof birds.\n\n_Flitter, flitter, flutter_, went the noise; and when the queen looked\nup, lo and behold! on every seat was a lovely fairy, dressed in green,\neach with a _most interesting-looking parcel_ in her hand. Don’t you\nlike opening parcels? The king did, and he was most friendly and polite\nto the fairies. But the queen, though she saw them distinctly, took no\nnotice of them. You see, she did not believe in fairies, nor in her own\neyes, when she saw them. So she talked across the fairies to the king,\njust as if they had not been there; but the king behaved as politely as\nif they were _real_--which, of course, they were.\n\nWhen dinner was over, and when the nurse had brought in the baby, all\nthe fairies gave him the most magnificent presents. One offered a purse\nwhich could never be empty; and one a pair of seven-leagued boots; and\nanother a cap of darkness, that nobody might see the prince when he put\nit on; and another a wishing-cap; and another a carpet, on which, when\nhe sat, he was carried wherever he wished to find himself. Another made\nhim beautiful for ever; and another, brave; and another, lucky: but the\nlast fairy of all, a cross old thing, crept up and said, “My child, you\nshall be _too_ clever!”\n\nThis fairy’s gift would have pleased the queen, if she had believed in\nit, more than anything else, because she was so clever herself. But she\ntook no notice at all; and the fairies went each to her own country, and\nnone of them stayed there at the palace, where nobody believed in them,\nexcept the king, a little. But the queen tossed all their nice boots and\ncaps, carpets, purses, swords, and all, away into a dark lumber-room;\nfor, of course, she thought that they were _all nonsense_, and merely\nold rubbish out of books, or pantomime “properties.”\n\n\n\n\n\nCHAPTER II. _Prince Prigio and his family_\n\nWELL, the little prince grew up. I think I’ve told you that his name was\nPrigio--did I not? Well, that _was_ his name.\n\nYou cannot think how clever he was. He argued with his nurse as soon as\nhe could speak, which was very soon. He argued that he did not like to\nbe washed, because the soap got into his eyes. However, when he was told\nall about the _pores of the skin_, and how they could not be healthy\nif he was not washed, he at once ceased to resist, for he was very\nreasonable. He argued with his father that he did not see why there\nshould be kings who were rich, while beggars were poor; and why the\nking--who was a little greedy--should have poached eggs and plum-cake\nat afternoon tea, while many other persons went without dinner. The king\nwas so surprised and hurt at these remarks that he boxed the prince’s\nears, saying, “I ‘ll teach you to be too clever, my lad.” Then he\nremembered the awful curse of the oldest fairy, and was sorry for the\nrudeness of the queen. And when the prince, after having his ears boxed,\nsaid that “force was no argument,” the king went away in a rage.\n\nIndeed, I cannot tell you how the prince was hated by all! He would\ngo down into the kitchen, and show the cook how to make soup. He would\nvisit the poor people’s cottage, and teach them how to make the beds,\nand how to make plum pudding out of turnip-tops, and venison cutlets\nout of rusty bacon. He showed the fencing-master how to fence, and the\nprofessional cricketer how to bowl, and instructed the rat-catcher in\nbreeding terriers. He set sums to the Chancellor of the Exchequer,\nand assured the Astronomer Royal that the sun does not go round the\nearth--which, for my part, I believe it does. The young ladies of the\ncourt disliked dancing with him, in spite of his good looks, because he\nwas always asking, “Have you read this?” and “Have you read that?”--and\nwhen they said they hadn’t, he sneered; and when they said they _had_,\nhe found them out.\n\nHe found out all his tutors and masters in the same horrid way;\ncorrecting the accent of his French teacher, and trying to get his\nGerman tutor not to eat peas with his knife. He also endeavoured to\nteach the queen-dowager, his grandmother, an art with which she had long\nbeen perfectly familiar! In fact, he knew everything better than anybody\nelse; and the worst of it was that he _did_: and he never was in the\nwrong, and he always said, “Didn’t I tell you so?” And, what was more,\nhe _had!_\n\n\nAs time went on, Prince Prigio had two younger brothers, whom everybody\nliked: They were not a bit clever, but jolly. Prince Alphonso, the\nthird son, was round, fat, good-humoured, and as brave as a lion. Prince\nEnrico, the second, was tall, thin, and a “little sad, but _never_\ntoo clever.” Both were in love with two of their own cousins (with the\napproval of their dear parents); and all the world said, “What nice,\nunaffected princes they are!” But Prigio nearly got the country into\nseveral wars by being too clever for the foreign ambassadors. Now, as\nPantouflia was a rich, lazy country, which hated fighting, this was very\nunpleasant, and did not make people love Prince Prigio any better.\n\n\n\n\n\nCHAPTER III. _About the Firedrake._\n\nOF all the people who did not like Prigio, his own dear papa, King\nGrognio, disliked him most. For the king knew he was not clever himself.\nWhen he was in the counting-house, counting out his money, and when he\nhappened to say, “Sixteen shillings and fourteen and twopence are three\npounds, fifteen,” it made him wild to hear Prigio whisper, “One pound,\nten and twopence,”--which, of course, it _is_. And the king was afraid\nthat Prigio would conspire, and get made king himself--which was the\nlast thing Prigio really wanted. He much preferred to idle about, and\nknow everything without seeming to take any trouble.\n\nWell, the king thought and thought. How was he to get Prigio out of the\nway, and make Enrico or Alphonso his successor? He read in books about\nit; and all the books showed that, if a king sent his three sons to do\nanything, it was always the youngest who did it, and got the crown. And\nhe wished he had the chance. Well, it arrived at last.\n\n\nThere was a very hot summer! It began to be hot in March.’ All the\nrivers were dried up. The grass did not grow. The corn did not grow. The\nthermometers exploded with heat. The barometers stood at Set Fair. The\npeople were much distressed, and came and broke the palace win-dows--as\nthey usually do when things go wrong in Pantouflia.\n\nThe king consulted the learned men about the Court, who told him that\nprobably a FIREDRAKE was in the neighbourhood.\n\nNow, the Firedrake is a beast, or bird, about the bigness of an\nelephant. Its body is made of iron, and it is always red-hot. A more\nterrible and cruel beast cannot be imagined; for, if you go near it, you\nare at once broiled by the Firedrake.\n\nBut the king was not ill-pleased: “for,” thought he, “of course my three\nsons must go after the brute, the eldest first; and, as usual, it will\nkill the first two, and be beaten by the youngest. It is a little hard\non Enrico, poor boy; but _anything_ to get rid of that Prigio!”\n\nThen the king went to Prigio, and said that his country was in danger,\nand that he was determined to leave the crown to whichever of them would\nbring him the horns (for it has horns) and tail of the Firedrake.\n\n“It is an awkward brute to tackle,” the king said, “but you are the\noldest, my lad; go where glory waits you! Put on your armour, and be off\nwith you!”\n\n\nThis the king said, hoping that either the Firedrake would roast Prince\nPrigio alive (which he could easily do, as I have said; for he is all\nover as hot as a red-hot poker), or that, if the prince succeeded, at\nleast his country would be freed from the monster.\n\nBut the prince, who was lying on the sofa doing sums in compound\ndivision, for fun, said in the politest way:\n\n“Thanks to the education your majesty has given me, I have learned that\nthe Firedrake, like the siren, the fairy, and so forth, is a fabulous\nanimal which does not exist. But even granting, for the sake of\nargument, that there is a Firedrake, your majesty is well aware that\nthere is no kind of use in sending _me_. It is always the eldest son who\ngoes out first, and comes to grief on these occasions, and it is always\nthe third son that succeeds. Send Alphonso” (this was the youngest\nbrother), “and _he_ will do the trick at once. At least, if he fails, it\nwill be most unusual, and Enrico can try his luck.”\n\nThen he went back to his arithmetic and his slate, and the king had to\nsend for Prince Alphonso and Prince Enrico. They both came in very warm;\nfor they had been whipping tops, and the day was unusually hot.\n\n“Look here,” said the king, “just you two younger ones look at Prigio!\nYou see how hot it is, and how coolly he takes it, and the country\nsuffering; and all on account of a Firedrake, you know, which has\napparently built his nest not far off. Well, I have asked that lout of a\nbrother of yours to kill it, and he says--”\n\n“That he does not believe in Firedrakes,” interrupted Prigio, “The\nweather’s warm enough without going out hunting!”\n\n“Not believe in Firedrakes!” cried Alphonso. “I wonder what you _do_\nbelieve in! Just let me get at the creature!” for he was as brave as\na lion. “Hi! Page, my chain-armour, helmet, lance, and buckler! _A\nMolinda! A Molinda!_” which was his _war-cry_.\n\nThe page ran to get the armour; but it was_ so uncommonly hot_ that he\ndropped it, and put his fingers in his mouth, crying!\n\n“You had better put on flannels, Alphonso, for this kind of work,” said\nPrigio. “And if I were you, I’d take a light garden-engine, full of\nwater, to squirt at the enemy.”\n\n“Happy thought!” said Alphonso. “I will!” And off he went, kissed his\ndear Molinda, bade her keep a lot of dances for him (there was to be\na dance when he had killed the Firedrake), and then he rushed to the\nfield!\n\nBut he never came back any more!\n\nEveryone wept bitterly--everyone but Prince Prigio; for he thought it\nwas a practical joke, and said that Alphonso had taken the opportunity\nto start off on his travels and see the world.\n\n“There is some dreadful mistake, sir,” said Prigio to the king. “You\nknow as well as I do that the youngest son has always succeeded, up to\nnow. But I entertain great hopes of Enrico!”\n\nAnd he grinned; for he fancied it was all _nonsense_, and that there\nwere no Firedrakes.\n\nEnrico was present when Prigio was consoling the king in this unfeeling\nway.\n\n“Enrico, my boy,” said his majesty, “the task awaits you, and the\nhonour. When _you_ come back with the horns and tail of the Fire-drake,\nyou shall be crown prince; and Prigio shall be made an usher at the\nGrammar School--it is all he is fit for.”\n\nEnrico was not quite so confident as Alphonso had been. He insisted on\nmaking his will; and he wrote a poem about the pleasures and advantages\nof dying young. This is part of it:\n\n     The violet is a blossom sweet,\n       That droops before the day is done--\n     Slain by thine overpowering heat, O Sun!\n       And I, like that sweet purple flower,\n     May roast, or boil, or broil, or bake,\n       If burned by thy terrific power, Firedrake!\n\nThis poem comforted Enrico more or less, and he showed it to Prigio. But\nthe prince only laughed, and said that the second line of the last verse\nwas not very good; for violets do not “roast, or boil, or broil, or\nbake.”\n\nEnrico tried to improve it, but could not. So he read it to his cousin,\nLady Kathleena, just as it was; and she cried over it (though I don’t\nthink she understood it); and Enrico cried a little, too.\n\nHowever, next day he started, with a spear, a patent refrigerator, and a\nlot of the bottles people throw at fires to put them out.\n\nBut _he_ never came back again!\n\nAfter shedding torrents of tears, the king summoned Prince Prigio to his\npresence.\n\n“Dastard!” he said. “Poltroon! _Your_ turn, which should have come\nfirst, has arrived at last. _You_ must fetch me the horns and the tail\nof the Fired rake. Probably you will be grilled, thank goodness; but who\nwill give me back Enrico and Alphonso?”\n\n“Indeed, your majesty,” said Prigio, “you must permit me to correct your\npolicy. Your only reason for dispatching your sons in pursuit of this\ndangerous but I believe _fabulous_ animal, was to ascertain which of us\nwould most worthily succeed to your throne, at the date--long may it\nbe deferred!--of your lamented decease. Now, there can be no further\nquestion about the matter. I, unworthy as I am, represent the sole hope\nof the royal family. Therefore to send me after the Firedrake were* both\ndangerous and unnecessary. Dangerous, because, if he treats me as you\nsay he did my brothers--my unhappy brothers,--the throne of Pantouflia\nwill want an heir. But, if I do come back alive--why, I cannot be more\nthe true heir than I am at present; now _can_ I? Ask the Lord Chief\nJustice, if you don’t believe _me_.”\n\n     * Subjunctive mood!   He was a great grammarian!\n\nThese arguments were so clearly and undeniably correct that the king,\nunable to answer them, withdrew into a solitary place where he could\nexpress himself with freedom, and give rein to his passions.\n\n\n\n\n\nCHAPTER IV. _How Prince Prigio was deserted by Everybody_\n\nMEANWHILE, Prince Prigio had to suffer many unpleasant things. Though\nhe was the crown prince (and though his arguments were unanswerable),\neverybody shunned him for a coward. The queen, who did not believe in\nFiredrakes, alone took his side. He was not only avoided by all, but he\nhad most disagreeable scenes with his own cousins, Lady Molinda and Lady\nKathleena. In the garden Lady Molinda met him walking alone, and did not\nbow to him.\n\n“Dear Molly,” said the prince, who liked her, “how have I been so\nunfortunate as to offend you?”\n\n“My name, sir, is Lady Molinda,” she said, very proudly; “and you have\nsent your own brother to his grave!”\n\n\n“Oh, excuse me,” said the prince, “I am certain he has merely gone\noff on his travels. He’ll come back when he’s tired: there _are_ no\nFiredrakes; a French writer says they are ‘purement fabuleux, purely\nfabulous, you know.”\n\n“Prince Alphonso has gone on his travels, and will come back when he is\ntired! And was he then--tired--of _me_?” cried poor Molinda, bursting\ninto tears, and forgetting her dignity.\n\n“Oh! I beg your pardon, I never noticed; I’m sure I am very sorry,”\n cried the prince, who, never having been in love himself, never thought\nof other people. And he tried to take Molinda’s hand, but she snatched\nit from him and ran away through the garden to the palace, leaving\nPrince Prigio to feel foolish, for once, and ashamed.\n\nAs for Lady Kathleena, she swept past him like a queen, without a word.\nSo the prince, for all his cleverness, was not happy.\n\nAfter several days had gone by, the king returned from the solitary\nplace where he had been speaking his mind. He now felt calmer and\nbetter; and so at last he came back to the palace. But on seeing Prince\nPrigio, who was lolling in a hammock, translating Egyptian hieroglyphs\ninto French poetry for his mother, the king broke out afresh, and made\nuse of the most cruel and impolite expressions.\n\nAt last, he gave orders that all the Court should pack up and move to a\ndistant city; and that Prince Prigio should be left alone in the palace\nby himself. For he was quite unendurable, the king said, and he could\nnot trust his own temper when he thought of him. And he grew so fierce,\nthat even the queen was afraid of him now.\n\nThe poor queen cried a good deal; Prigio being her favourite son, on\naccount of his acknowledged ability and talent. But the rest of the\ncourtiers were delighted at leaving Prince Prigio behind. For his part,\nhe, very good-naturedly, showed them the best and shortest road to\nFalkenstein, the city where they were going; and easily proved that\nneither the chief secretary for geography, nor the general of the army,\nknew anything about the matter--which, indeed, they did not.\n\nThe ungrateful courtiers left Prigio with hoots and yells, for they\ndisliked him so much that they forgot he would be king one day. He\ntherefore reminded them of this little fact in future history, which\nmade them feel uncomfortable enough, and then lay down in his hammock\nand went to sleep.\n\nWhen he wakened, the air was cold and the day was beginning to grow\ndark. Prince Prigio thought he would go down and dine at a tavern in the\ntown, for no servants had been left with him. But what was his annoyance\nwhen he found that his boots, his sword, his cap, his cloak--all his\nclothes, in fact, except those he wore,--had been taken away by the\ncourtiers, merely to spite him! His wardrobe had been ransacked, and\neverything that had not been carried off had been cut up, burned, and\ndestroyed. Never was such a spectacle of wicked mischief. It was as if\nhay had been made of everything he possessed. What was worse, he had not\na penny in his pocket to buy new things; and his father had stopped his\nallowance of fifty thousand pounds a month.\n\nCan you imagine anything more cruel and _unjust_ than this conduct? for\nit was not the prince’s fault that he was so clever. The cruel fairy had\nmade him so. But, even if the prince had been born clever (as may have\nhappened to you), was he to be blamed for that? The other people were\njust as much in fault for being born so stupid; but the world, my dear\nchildren, can never be induced to remember this. If you are clever, you\nwill find it best not to let people know it--if you want them to like\nyou.\n\nWell, here was the prince in a pretty plight. Not a pound in his pocket,\nnot a pair of boots to wear, not even a cap to cover his head from the\nrain; nothing but cold meat to eat, and never a servant to answer the\nbell.\n\n\n\n\n\nCHAPTER V. _What Prince Prigio found in the garret._\n\nTHE prince walked from room to room of the palace; but, unless he\nwrapped himself up in a curtain, there was nothing for him to wear when\nhe went out in the rain. At last he climbed up a turret-stair in the\nvery oldest part of the castle, where he had never been before; and\nat the very top was a little round room, a kind of garret. The prince\npushed in the door with some difficulty--not that it was locked, but the\nhandle was rusty, and the wood had swollen with the damp. The room was\nvery dark; only the last grey light of the rainy evening came through\na slit of a window, one of those narrow windows that they used to fire\narrows out of in old times.\n\nBut in the dusk the prince saw a heap of all sorts of things lying on\nthe floor and on the table. There were two caps; he put one on--an old,\ngrey, ugly cap it was, made of felt. There was a pair of boots; and\nhe kicked off his slippers, and got into _them_. They were a good deal\nworn, but fitted as if they had been made for him. On the table was a\npurse with just three gold coins--old ones, too--in it; and this, as\nyou may fancy, the prince was very well pleased to put in his pocket.\nA sword, with a sword-belt, he buckled about his waist; and the rest of\nthe articles, a regular collection of odds and ends, he left just where\nthey were lying. Then he ran downstairs, and walked out of the hall\ndoor.\n\n\n\n\n\nCHAPTER VI. _What Happened to Prince Prigio in Town_\n\nBY this time the prince was very hungry. The town was just three miles\noff; but he had such a royal appetite, that he did not like to waste it\non bad cookery, and the people of the royal town were bad cooks. “I\nwish I were in ‘The Bear,’ at Gluck-stein,” said he to himself; for he\nremembered that there was a very good cook there. But, then, the town\nwas twenty-one leagues away--sixty-three long miles!\n\nNo sooner had the prince said this, and taken just three steps, than he\nfound himself at the door of the “Bear Inn” at Gluckstein!\n\n“This is the most extraordinary dream,” said he to himself; for he was\nfar too clever, of course, to believe in seven-league boots. Yet he had\na pair on at that very moment, and it was they which had carried him in\nthree strides from the palace to Gluckstein!\n\nThe truth is, that the prince, in looking about the palace for clothes,\nhad found his way into that very old lumber-room where the magical gifts\nof the fairies had been thrown by his clever mother, who did not believe\nin them. But this, of course, the prince did not know.\n\nNow you should be told that seven-league boots only take those\nprodigious steps when you say you _want_ to go a long distance.\nOtherwise they would be very inconvenient--when you only want to cross\nthe room, for example. Perhaps this has not been explained to you by\nyour governess?\n\nWell, the prince walked into “The Bear,” and it seemed odd to him that\nnobody took any notice of him. And yet his face was as well known as\nthat of any man in Pantouflia; for everybody had seen it, at least in\npictures. He was so puzzled by not being attended to as usual, that _he\nquite forgot to take off his cap_.\n\n\nHe sat down at a table, however, and shouted “_Kellner!_” at which all\nthe waiters jumped, and looked round in every direction, but nobody came\nto him. At first he thought they were too busy, but presently another\nexplanation occurred to him.\n\n“The king,” said he to himself, “has threatened to execute anybody who\nspeaks to me, or helps me in any way. Well, I don’t mean to starve in\nthe midst of plenty, anyhow; here goes!”\n\nThe prince rose, and went to the table in the midst of the room, where\na huge roast turkey had just been placed. He helped himself to half the\nbreast, some sausages, chestnut stuffing, bread sauce, potatoes, and a\nbottle of red wine--Burgundy. He then went back to a table in a corner,\nwhere he dined very well, nobody taking any notice of him. When he\nhad finished, he sat watching the other people dining, and smoking his\ncigarette. As he was sitting thus, a very tall man, an officer in the\nuniform of the Guards, came in, and, walking straight to the prince’s\ntable, said: “Kellner, clean this table, and bring in the bill of fare.”\n\nWith these words, the officer sat down suddenly in the prince’s lap,\nas if he did not see him at all. He was a heavy man, and the prince,\nenraged at the insult, pushed him away and jumped to his feet. As he\ndid so, _his cap dropped off_. The officer fell on his knees at once,\ncrying:\n\n“Pardon, my prince, pardon! I never saw you!”\n\nThis was more than the prince could be expected to believe.\n\n“Nonsense! Count Frederick von Matterhorn,” he said; “you must be\nintoxicated. Sir! you have insulted your prince and your superior\nofficer. Consider yourself under arrest! You shall be sent to a prison\nto-morrow.”\n\nOn this, the poor officer appealed piteously to everybody in the tavern.\nThey all declared that they had not seen the prince, nor ever had an\nidea that he was doing them the honour of being in the neighbourhood of\ntheir town.\n\nMore and more offended, and convinced that there was a conspiracy to\nannoy and insult him, the prince shouted for the landlord, called for\nhis bill, threw down his three pieces of gold without asking for change,\nand went into the street.\n\n“It is a disgraceful conspiracy,” he said. “The king shall answer for\nthis! I shall write to the newspapers at once!”\n\nHe was not put in a better temper by the way in which people hustled him\nin the street. They ran against him exactly as if they did not see\nhim, and then staggered back in the greatest surprise, looking in every\ndirection for the person they had jostled. In one of these encounters,\nthe prince pushed so hard against a poor old beggar woman that she fell\ndown. As he was usually most kind and polite, he pulled off his cap to\nbeg her pardon, when, behold, the beggar woman gave one dreadful scream,\nand fainted! A crowd was collecting, and the prince, forgetting that he\nhad thrown down all his money in the tavern, pulled out his purse. Then\nhe remembered what he had done, and expected to find it empty; but, lo,\nthere were three pieces of gold in it! Overcome with surprise, he thrust\nthe money into the woman’s hand, and put on his cap again. In a\nmoment the crowd, which had been staring at him, rushed away in every\ndirection, with cries of terror, declaring that there was a magician in\nthe town, and a fellow who could appear and disappear at pleasure!\n\n\nBy this time, you or I, or anyone who was not so extremely clever as\nPrince Prigio, would have understood what was the matter. He had put\non, without knowing it, not only the seven-league boots, but the cap of\ndarkness, and had taken Fortunatus’s purse, which could never be empty,\nhowever often you took all the money out. All those and many other\ndelightful wares the fairies had given him at his christening, and\nthe prince had found them in the dark garret. But the prince was so\nextremely wise, and learned, and scientific, that he did not believe in\nfairies, nor in fairy gifts.\n\n“It is indigestion,” he said to himself: “those sausages were not of\nthe best; and that Burgundy was extremely strong. Things are not as they\nappear.”\n\nHere, as he was arguing with himself, he was nearly run over by a\nsplendid carriage and six, the driver of which never took the slightest\nnotice of him. Annoyed at this, the prince leaped up behind, threw down\nthe two footmen, who made no resistance, and so was carried to the door\nof a magnificent palace. He was determined to challenge the gentleman\nwho was in the carriage; but, noticing that he had a very beautiful\nyoung lady with him, whom he had never seen before, he followed them\ninto the house, not wishing to alarm the girl, and meaning to speak to\nthe gentleman when he found him alone.\n\nA great ball was going on; but, as usual, nobody took any notice of the\nprince. He walked among the guests, being careful not to jostle them,\nand listening to their conversation.\n\nIt was all about himself! Everyone had heard of his disgrace, and\nalmost everyone cried “Serve him right!” They said that the airs he gave\nhimself were quite unendurable--that nothing was more rude than to be\nalways in the right--that cleverness might be carried far too far--that\nit was better even to be born stupid (“Like the rest of you,” thought\nthe prince); and, in fact, nobody had a good word for him.\n\nYes, one had! It was the pretty lady of the carriage. I never could\ntell you how pretty she was. She was tall, with cheeks like white roses\nblushing: she had dark hair, and very large dark-grey eyes, and her face\nwas the kindest in the world! The prince first thought how nice and good\nshe looked, even before he thought how pretty she looked. _She_ stood up\nfor Prince Prigio when her partner would speak ill of him. She had\nnever seen the prince, for she was but newly come to Pantouflia; but she\ndeclared that it was his _misfortune_, not his fault, to be so clever.\n“And, then, think how hard they made him work at school! Besides,” said\nthis kind young lady, “I hear he is extremely handsome, and very brave;\nand he has a good heart, for he was kind, I have heard, to a poor boy,\nand did all his examination papers for him, so that the boy passed first\nin _everything_. And now he is Minister for Education, though he can’t\ndo a line of Greek prose!”\n\nThe prince blushed at this, for he knew his conduct had not been\nhonourable. But he at once fell over head and ears in love with the\nyoung lady, a thing he had never done in his life before, because--he\nsaid--“women were so stupid!” You see he was so clever!\n\nNow, at this very moment--when the prince, all of a sudden, was as\ndeep in love as if he had been the stupidest officer in the room--an\nextraordinary thing happened! Something seemed to give a whirr! in his\nbrain, and in one instant _he knew all about it!_ He believed in fairies\nand fairy gifts, and understood that his cap was the cap of darkness,\nand his shoes the seven-league boots, and his purse the purse of\nFortunatus! He had read about those things in historical books: but now\nhe believed in them.\n\n\n\n\n\nCHAPTER VII. _The Prince Falls in Love_\n\nHE understood all this, and burst out laughing, which nearly frightened\nan old lady near him out of her wits. Ah! how he wished he was only in\nevening dress, that he might dance with the charming young lady. But\nthere he was, dressed just as if he were going out to hunt, if anyone\ncould have seen him. So, even if he took off his cap of darkness, and\nbecame visible, he was no figure for a ball. Once he would not have\ncared, but now he cared very much indeed.\n\nBut the prince was not clever for nothing. He thought for a moment, then\nwent out of the room, and, in three steps of the seven-league boots, was\nat his empty, dark, cold palace again. He struck a light with a flint\nand steel, lit a torch, and ran upstairs to the garret. The flaring\nlight of the torch fell on the pile of “rubbish,” as the queen would\nhave called it, which he turned over with eager hands. Was there--yes,\nthere _was_ another cap! There it lay, a handsome green one with a red\nfeather.\n\nThe prince pulled off the cap of darkness, put on the other, and said:\n\n“_I wish I were dressed in my best suit of white and gold, with the\nroyal Pantouflia diamonds!_”\n\nIn one moment there he was in white and gold, the greatest and most\nmagnificent dandy in the whole world, and the handsomest man!\n\n“How about my boots, I wonder,” said the prince; for his seven-league\nboots were stout riding-boots, not good to dance in, whereas _now_ he\nwas in elegant shoes of silk and gold.\n\nHe threw down the wishing cap, put on the other--the cap of\ndarkness--and made three strides in the direction of Gluckstein. But he\nwas only three steps nearer it than he had been, and the seven-league\nboots were standing beside him on the floor!\n\n“No,” said the prince; “no man can be in two different pairs of boots at\none and the same time! That’s mathematics!”\n\nHe then hunted about in the lumber-room again till he found a small,\nshabby, old Persian carpet, the size of a hearthrug. He went to his own\nroom, took a portmanteau in his hand, sat down on the carpet, and said:\n\n“I wish I were in Gluckstein.”\n\nIn a moment there he found himself; for this was that famous carpet\nwhich Prince Hussein bought long ago, in the market at Bisnagar,\nand which the fairies had brought, with the other presents, to the\nchristening of Prince Prigio.\n\n\nWhen he arrived at the house where the ball was going on, he put\nthe magical carpet in the portmanteau, and left it in the cloakroom,\nreceiving a numbered ticket in exchange. Then he marched in all his\nglory (and, of course, without the cap of darkness) into the room where\nthey were dancing. Everybody made place for him, bowing down to the\nground, and the loyal band struck up _The Prince’s March_:\n\nHeaven bless our Prince Prigio! What is there he doesn’t know? Greek,\nSwiss, German (High and Low), And the names of the mountains in Mexico,\nHeaven bless the prince!\n\nHe used to be very fond of this march, and the words--some people even\nsaid he had made them himself. But now, somehow, he didn’t much like\nit. He went straight to the Duke of Stumpfelbahn, the Hereditary Master\nof the Ceremonies, and asked to be introduced to the beautiful young\nlady. She was the daughter of the new English Ambassador, and her name\nwas Lady Rosalind. But she nearly fainted when she heard who it was that\nwished to dance with her, for she was not at all particularly clever;\nand the prince had such a bad character for snubbing girls, and asking\nthem difficult questions. However, it was impossible to refuse, and so\nshe danced with the prince, and he danced very well. Then they sat out\nin the conservatory, among the flowers, where nobody came near them; and\nthen they danced again, and then the Prince took her down to supper. And\nall the time he never once said, “Have you read _this?_” or “Have you\nread _that?_” or, “What! you never heard of Alexander the Great?”\n or Julius Caesar, or Michael Angelo, or whoever it might be--horrid,\ndifficult questions he used to ask. That was the way he _used_ to go on:\nbut now he only talked to the young lady about _herself_; and she\nquite left off being shy or frightened, and asked him all about his own\ncountry, and about the Firedrake shooting, and said how fond she was of\nhunting herself. And the prince said:\n\n“Oh, if _you_ wish it, you shall have the horns and tail of a Firedrake\nto hang up in your hall, to-morrow evening!”\n\nThen she asked if it was not very dangerous work, Firedrake hunting; and\nhe said it was nothing, when you knew the trick of it: and he asked her\nif she would but give him a rose out of her bouquet; and, in short, he\nmade himself so agreeable and _unaffected_, that she thought him very\nnice indeed.\n\nFor, even a clever person can be nice when he likes--above all, when\nhe is not thinking about himself. And now the prince was thinking of\nnothing in the world but the daughter of the English Ambassador, and\nhow to please her-He got introduced to her father too, and quite won his\nheart; and, at last, he was invited to dine next day at the Embassy.\n\nIn Pantouflia, it is the custom that a ball must not end while one of\nthe royal family goes on dancing. _This_ ball lasted till the light came\nin, and the birds were singing out of doors, and all the mothers present\nwere sound asleep.\n\n\nThen nothing would satisfy the prince, but that they all should go home\nsinging through the streets; in fact, there never had been so merry a\ndance in all Pantouflia. The prince had made a point of dancing with\nalmost every girl there: and he had suddenly become the most beloved\nof the royal family. But everything must end at last; and the prince,\nputting on the cap of darkness and sitting on the famous carpet, flew\nback to his lonely castle.\n\n\n\n\n\nCHAPTER VIII. _The Prince is Puzzled_\n\nPRINCE PRIGIO did not go to bed. It was bright daylight, and he had\npromised to bring the horns and tail of a Firedrake as a present to a\npretty lady. He had said it was easy to do this; but now, as he sat and\nthought over it, he did not feel so victorious.\n\n“First,” he said, “where is the Firedrake?”\n\nHe reflected for a little, and then ran upstairs to the garret.\n\n“It _should_ be here!” he cried, tossing the fairies’ gifts about; “and,\nby George, here it is!”\n\nIndeed, he had found the spyglass of carved ivory which Prince Ali, in\nthe _Arabian Nights_, bought in the bazaar in Schiraz. Now, this glass\nwas made so that, by looking through it, you could see anybody or\nanything you wished, however far away. Prigio’s first idea was to look\nat his lady. “But she does not expect to be looked at,” he thought; “and\nI _won’t!_” On the other hand, he determined to look at the Firedrake;\nfor, of course, he had no delicacy about spying on _him_, the brute.\n\nThe prince clapped the glass to his eye, stared out of window, and\nthere, sure enough, he saw the Firedrake. He was floating about in a\nsea of molten lava, on the top of a volcano. There he was, swimming and\ndiving for pleasure, tossing up the flaming waves, and blowing fountains\nof fire out of his nostrils, like a whale spouting!\n\n\nThe prince did not like the looks of him.\n\n“With all my cap of darkness, and my shoes of swiftness, and my sword of\nsharpness, I never could get near that beast,” he said; “and if I _did_\nstalk him, I could not hurt him. Poor little Alphonso! poor Enrico! what\nplucky fellows they were! I fancied that there was no such thing as a\nFiredrake: he’s not in the Natural History books; and I thought the boys\nwere only making fun, and would be back soon, safe and sound. How horrid\nbeing too clever makes one! And now, what _am_ I to do?”\n\nWhat was he to do, indeed? And what would you have done? Bring the horns\nand tail he must, or perish in the adventure. Otherwise, how could he\nmeet his lady?--why, she would think him a mere braggart.\n\nThe prince sat down, and thought and thought; and the day went on, and\nit was now high noon.\n\nAt last he jumped up and rushed into the library, a room where nobody\never went except himself and the queen. There he turned the books upside\ndown, in his haste, till he found an old one, by a French gentleman,\nMonsieur Cyrano de Bergerac. It was an account of a voyage to the\nmoon, in which there is a great deal of information about matters not\ngenerally known; for few travellers have been to the moon. In that book,\nPrince Prigio fancied he would find something he half remembered, and\nthat would be of use to him. And he _did!_ So you see that cleverness,\nand minding your book, have some advantages, after all. For here the\nprince learned that there is a very rare beast called a Remora, which is\nat least as cold as the Firedrake is hot!\n\n“Now,” thought he, “_if I can only make these two fight_, why the Remora\nmay kill the Firedrake, or take the heat out of him, at least, so that I\nmay have a chance.”\n\nThen he seized the ivory glass, clapped it to his eye, and looked for\nthe Remora. Just the tip of his nose, as white as snow and as smooth as\nice, was sticking out of a chink in a frozen mountain, not far from the\nburning mountain of the Firedrake.\n\n\n“Hooray!” said the prince softly to himself; and he jumped like mad into\nthe winged shoes of swiftness, stuck on the cap of darkness, girdled\nhimself with the sword of sharpness, and put a good slice of bread, with\nsome cold tongue, in a wallet, which he slung on his back. Never you\nfight, if you can help it, except with plenty of food to keep you going\nand in good heart. Then off he flew, and soon he reached the volcano of\nthe Firedrake.\n\n\n\n\n\nCHAPTER IX. _The Prince and the Firedrake_\n\nIT was dreadfully hot, even high up in the air, where the prince hung\ninvisible. Great burning stones were tossed up by the volcano, and\nnearly hit him several times. Moreover, the steam and smoke, and the\nflames which the Firedrake spouted like foam from his nostrils, would\nhave daunted even the bravest man. The sides of the hill, too, were\ncovered with the blackened ashes of his victims, whom he had roasted\nwhen they came out to kill him. The garden-engine of poor little\nAlphonso was lying in the valley, all broken and useless. But the\nFiredrake, as happy as a wild duck on a lonely lock, was rolling and\ndiving in the liquid flame, all red-hot and full of frolic. “Hi!”\n shouted the prince. The Firedrake rose to the surface, his horns as red\nas a red crescent-moon, only bigger, and lashing the fire with his hoofs\nand his blazing tail.\n\n“Who’s there?” he said in a hoarse, angry voice. “Just let me get at\nyou!”\n\n“It’s me,” answered the prince. It was the first time he had forgotten\nhis grammar, but he was terribly excited.\n\n“What do you want?” grunted the beast. “I wish I could see you”; and,\nhorrible to relate, he rose on a pair of wide, flaming wings, and came\nright at the prince, guided by the sound of his voice.\n\nNow, the prince had never heard that Fire-drakes could fly; indeed, he\nhad never believed in them at all, till the night before. For a moment\nhe was numb with terror; then he flew down like a stone to the very\nbottom of the hill and shouted:\n\n“Hi!”\n\n“Well,” grunted the Firedrake, “what’s the matter? Why can’t you give a\ncivil answer to a civil question?”\n\n“Will you go back to your hole and swear, on your honour as a Firedrake,\nto listen quietly?”\n\n“On my sacred word of honour,” said the beast, casually scorching an\neagle that flew by into ashes. The cinders fell, jingling and crackling,\nround the prince in a little shower.\n\nThen the Firedrake dived back, with an awful splash of flame, and the\nmountain roared round him.\n\nThe prince now flew high above him, and cried:\n\n“A message from the Remora. He says you are afraid to fight him.”\n\n“Don’t know him,” grunted the Firedrake.\n\n“He sends you his glove,” said Prince Prigio, “as a challenge to mortal\ncombat, till death do you part.”\n\nThen he dropped his own glove into the fiery lake.\n\n“Does he?” yelled the Firedrake. “Just let me get at him!” and he\nscrambled out, all red-hot as he was.\n\n“I’ll go and tell him you’re coming,” said the prince; and with two\nstrides he was over the frozen mountain of the Remora.\n\n\n\n\n\nCHAPTER X. _The Prince and the Remora_\n\nIf he had been too warm before, the prince was too cold now. The hill of\nthe Remora was one solid mass of frozen steel, and the cold rushed out\nof it like the breath of some icy beast, which indeed it _was_. All\naround were things like marble statues of men in armour: they were the\ndead bodies of the knights, horses and all, who had gone out of old to\nfight the Remora, and who had been frosted up by him. The prince felt\nhis blood stand still, and he grew faint; but he took heart, for there\nwas no time to waste. Yet he could nowhere see the Remora. “Hi!” shouted\nthe prince. Then, from a narrow chink at the bottom of the smooth, black\nhill,--a chink no deeper than that under a door, but a mile wide,--stole\nout a hideous head!\n\nIt was as fiat as the head of a skate-fish, it was deathly pale, and two\nchill-blue eyes, dead-coloured like stones, looked out of it.\n\nThen there came a whisper, like the breath of the bitter east wind on a\nwintry day:\n\n“Where are you, and how can I come to you?”\n\n“Here I am!” said the prince from the top of the hill.\n\nThen the flat, white head set itself against the edge of the chink from\nwhich it had peeped, and slowly, like the movement of a sheet of ice, it\nslipped upwards and curled upwards, and up, and up! There seemed no end\nto it at all; and it moved horribly, without feet, holding on by its own\nfrost to the slippery side of the frozen hill. Now all the lower part of\nthe black hill was covered with the horrid white thing coiled about\nit in smooth, flat shiny coils; and still the head was higher than the\nrest; and still the icy cold came nearer and nearer, like Death.\n\nThe prince almost fainted: everything seemed to swim; and in one moment\nmore he would have fallen stiff on the mountain-top, and the white head\nwould have crawled over him, and the cold coils would have slipped over\nhim and turned him to stone. And still the thing slipped up, from the\nchink under the mountain.\n\nBut the prince made a great effort; he moved, and in two steps he was\nfar away, down in the valley where it was not so very cold.\n\n“Hi!” he shouted, as soon as his tongue could move within his chattering\nteeth.\n\nThere came a clear, hissing answer, like frozen words dropping round\nhim:\n\n“Wait till I come down. What do you want?”\n\nThen the white folds began to slide, like melting ice, from the black\nhill.\n\nPrince Prigio felt the air getting warmer behind him, and colder in\nfront of him.\n\nHe looked round, and there were the trees beginning to blacken in the\nheat, and the grass looking like a sea of fire along the plains; for the\nFiredrake was coming!\n\nThe prince just took time to shout, “The Firedrake is going to pay you a\nvisit!” and then he soared to the top of a neighbouring hill, and looked\non at what followed.\n\n\n\n\n\nCHAPTER XI. _The Battle_\n\nIT was an awful sight to behold! When the Remora heard the name of the\nFiredrake, his hated enemy, he slipped with wonderful speed from the\ncleft of the mountain into the valley. On and on and on he poured over\nrock and tree, as if a frozen river could slide downhill; on and on,\ntill there were miles of him stretching along the valley--miles of the\nsmooth-ribbed, icy creature, crawling and slipping forwards. The green\ntrees dropped their leaves as he advanced; the birds fell down dead\nfrom the sky, slain by his frosty breath! But, fast as the Remora stole\nforward, the Firedrake came quicker yet, flying and clashing his fiery\nwings. At last they were within striking distance; and the Firedrake,\nstooping from the air, dashed with his burning horns and flaming feet\nslap into the body of the Remora.\n\nThen there rose a steam so dreadful, such a white yet fiery vapour of\nheat, that no one who had not the prince’s magic glass could have seen\nwhat happened. With horrible grunts and roars the Firedrake tried to\nburn his way right through the flat body of the Remora, and to chase him\nto his cleft in the rock. But the Remora, hissing terribly, and visibly\nmelting away in places, yet held his ground; and the prince could see\nhis cold white folds climbing slowly up the hoofs of the Firedrake--up\nand up, till they reached his knees, and the great burning beast roared\nlike a hundred bulls with the pain. Then up the Firedrake leaped, and\nhovering on his fiery wings, he lighted in the midst of the Remora’s\nback, and dashed into it with his horns. But the flat, cruel head\nwrithed backwards, and, slowly bending over on itself, the wounded\nRemora slid greedily to fasten again on the limbs of the Firedrake.\n\nMeanwhile, the prince, safe on his hill, was lunching on the loaf and\nthe cold tongue he had brought with him.\n\n“Go it, Remora! Go it, Firedrake! you’re gaining. Give it him, Remora!”\n he shouted in the wildest excitement.\n\nNobody had ever seen such a battle; he had it all to himself, and he\nnever enjoyed anything more. He hated the Remora so much, that he almost\nwished the Firedrake could beat it; for the Firedrake was the more\nnatural beast of the pair. Still, he was alarmed when he saw that\nthe vast flat body of the Remora was now slowly coiling backwards,\nbackwards, into the cleft below the hill; while a thick wet mist showed\nhow cruelly it had suffered. But the Firedrake, too, was in an unhappy\nway; for his legs were now cold and black, his horns were black also,\nthough his body, especially near the heart, glowed still like red-hot\niron.\n\n“Go it, Remora!” cried the prince: “his legs are giving way; he’s groggy\non his pins! One more effort, and he won’t be able to move!”\n\nEncouraged by this advice, the white, slippery Remora streamed out of\nhis cavern again, more and more of him uncoiling, as if the mountain\nwere quite full of him. He had lost strength, no doubt: for the steam\nand mist went up from him in clouds, and the hissing of his angry voice\ngrew fainter; but so did the roars of the Firedrake. Presently they\nsounded more like groans; and at last the Remora slipped up his legs\nabove the knees, and fastened on his very heart of fire. Then the\nFiredrake stood groaning like a black bull, knee-deep in snow; and still\nthe Remora climbed and climbed.\n\n“Go it now, Firedrake!” shouted the prince; for he knew that if the\nRemora won, it would be too cold for him to draw near the place, and cut\noff the Firedrake’s head and tail.\n\n“Go it, Drake! he’s slackening!” cried the prince again; and the brave\nFiredrake made one last furious effort, and rising on his wings, dropped\njust on the spine of his enemy.\n\nThe wounded Remora curled back his head again on himself, and again\ncrawled, steaming terribly, towards his enemy. But the struggle was\ntoo much for the gallant Remora. The flat, cruel head moved slower; the\nsteam from his thousand wounds grew fiercer; and he gently breathed his\nlast just as the Firedrake, too, fell over and lay exhausted. With\none final roar, like the breath of a thousand furnaces, the Firedrake\nexpired.\n\n\nThe prince, watching from the hill-top, could scarcely believe that\nthese two _awful scourges of Nature_, which had so long devastated his\ncountry, were actually dead. But when he had looked on for half-an-hour,\nand only a river ran where the Remora had been, while the body of the\nFiredrake lay stark and cold, he hurried to the spot.\n\nDrawing the sword of sharpness, he hacked off, at two blows, the iron\nhead and the tail of the Firedrake. They were a weary weight to carry;\nbut in a few strides of the shoes of swiftness he was at his castle,\nwhere he threw down his burden, and nearly fainted with excitement and\nfatigue.\n\nBut the castle clock struck half-past seven; dinner was at eight, and\nthe poor prince crawled on hands and knees to the garret. Here he put\non the wishing-cap; wished for a pint of champagne, a hot bath, and his\nbest black velvet and diamond suit. In a moment these were provided; he\nbathed, dressed, drank a glass of wine, packed up the head and tail of\nthe Firedrake; sat down on the flying carpet, and knocked at the door of\nthe English Ambassador as the clocks were striking eight’ in Gluckstein.\n\n_Punctuality is the politeness of princes_; and a prince _is_ polite\nwhen he is in love!\n\nThe prince was received at the door by a stout porter and led into the\nhall, where _several_ butlers met him, and he laid the mortal remains of\nthe Firedrake under the cover of the flying carpet.\n\nThen he was led upstairs, and he made his bow to the pretty lady, who,\nof course, made him a magnificent courtesy. She seemed prettier and\nkinder than ever. The prince was so happy, that he never noticed how\nsomething went wrong about the dinner. The ambassador looked about, and\nseemed to miss someone, and spoke in a low voice to one of the servants,\nwho answered also in a low voice, and what he said seemed to displease\nthe ambassador. But the prince was so busy in talking to his lady, and\nin eating his dinner too, that he never observed anything unusual. He\nhad _never_ been at such a pleasant dinner!\n\n\n\n\n\nCHAPTER XII. _A Terrible Misfortune_\n\nWHEN the ladies left, and the prince and the other gentlemen were alone,\nthe ambassador appeared more gloomy than ever. At last he took the\nprince into a corner, on pretence of showing him a rare statue. “Does\nyour royal highness not know,” he asked, “that you are in considerable\ndanger?” “Still?” said the prince, thinking of the Firedrake.\n\nThe ambassador did not know what he meant, for _he_ had never heard\nof the fight, but he answered gravely: “Never more than now.” Then he\nshowed the prince two proclamations, which had been posted all about\nthe town. Here is the first:\n\n     TO  ALL  LOYAL  SUBJECTS.\n\n     Whereas,\n\n     Our eldest son, Prince Prigio, hath of late been guilty of\n     several high crimes and misdemeanours.\n\n     First: By abandoning the post of danger against the\n     Firedrake, whereby our beloved sons, Prince Alphonso and\n     Prince Enrico, have perished, and been overdone by that\n     monster.\n\n     Secondly: By attending an unseemly revel in the town of\n     Gluckstein, where he brawled in the streets.\n\n     Thirdly: By trying to seduce away the hearts of our loyal\n     subjects in that city, and to blow up a party against our\n     crown and our peace.\n\n\n     This is to give warning,\n\n     That whoever consorts with, comforts, aids, or abets the\n     said Prince Prigio, is thereby a partner in his treason; and\n     That a reward of Five Thousand Purses will be given to\n     whomsoever brings the said prince, alive, to our Castle of\n     Falkenstein.\n\n     Grognio R.\n\n\nAnd here is the second proclamation:\n\n     Reward. The firedrake. _Whereas_,\n\n     Our dominions have lately been devastated by a Firedrake\n     (the _Salamander Furiosus_ of Buffon);\n\n     _This is to advise all_,\n\n     That whosoever brings the horns and tail of the said\n     Firedrake to our Castle of Falkenstein, shall receive Five\n     Thousand Purses, the position of Crown Prince, with the\n     usual perquisites, and the hand of the king’s niece, the\n     Lady Molinda.\n\n     Grognio R.\n\n\n“H’m,” said the prince; “I did not think his majesty wrote so well;”\n and he would have _liked_ to say, “Don’t you think we might join the\nladies?”\n\n“But, sir,” said the ambassador, “the streets are lined with soldiers;\nand I know not how you have escaped them. _Here_, under my roof, you\nare safe for the moment; but a prolonged stay--excuse my\ninhospitality--could not but strain the harmonious relations which\nprevail between the Government of Pantouflia and that which I have the\nhonour to represent.”\n\n“We don’t want to fight; and no more, I think, do you,” said the prince,\nsmiling.\n\n“Then how does your royal highness mean to treat the proclamations?”\n\n“Why, by winning these ten thousand purses. I can tell you £1,000,000\nis worth having,” said the prince. “I ‘ll deliver up the said prince,\nalive, at Falkenstein this very night; also the horns and tail of the\nsaid Firedrake. But I don’t want to marry my Cousin Molly.”\n\n“May I remind your royal highness that Falkenstein is three hundred\nmiles away? Moreover, my head butler, Benson, disappeared from the house\nbefore dinner, and I fear he went to warn Captain Kopzoffski that you\nare _here!_”\n\n“That is nothing,” said the prince; “but, my dear Lord Kelso, may I\nnot have the pleasure of presenting Lady Rosalind with a little gift, a\nPhilippine which I lost to her last night, merely the head and tail of a\nFiredrake which I stalked this morning?”\n\nThe ambassador was so astonished that he ran straight upstairs,\nforgetting his manners, and crying:\n\n“Linda! Linda! come down at once; here’s a surprise for you!”\n\nLady Rosalind came sweeping down, with a smile on her kind face. _She_\nguessed what it was, though the prince had said nothing about it at\ndinner.\n\n“Lead the way, your royal highness!” cried the ambassador; and the\nprince offering Lady Rosalind his arm, went out into the hall, where he\nsaw neither his carpet nor the horns and tail of the Firedrake!\n\nHe turned quite pale, and said:\n\n“Will you kindly ask the servants where the little Persian prayer-rug\nand the parcel which I brought with me have been placed?”\n\nLord Kelso rang the bell, and in came all the servants, with William,\nthe under-butler, at their head.\n\n“William,” said his lordship, “where have you put his royal highness’s\nparcel and his carpet?”\n\n“Please, your lordship,” said William, “we think Benson have took them\naway with him.”\n\n“And where is Benson?”\n\n“We don’t know, your lordship. We think he have been come for!”\n\n“Come for--by whom?”\n\nWilliam stammered, and seemed at a loss for a reply.\n\n“Quick! answer! what do you know about it?”\n\nWilliam said at last, rather as if he were making a speech:\n\n“Your royaliness, and my lords and ladies, it was like this. His\nroyaliness comed in with a rug over his arm, and summat under it. And\nhe lays it down on that there seat, and Thomas shows him into the\ndroring-room. Then Benson says: ‘Dinner’ll be ready in five minutes; how\ntired I do feel! ‘Then he takes the libbuty of sitting hisself down\non his royaliness’s rug, and he says, asking your pardon, ‘I ‘ve\nhad about enough of service here. I ‘m about tired, and I thinks of\nbettering myself. I wish I was at the king’s court, and butler.’\n\n\nBut before the words was out of his mouth, off he flies like a shot\nthrough the open door, and his royaliness’s parcel with him. I run to\nthe door, and there he was, flying right hover the town, in a northerly\ndirection. And that’s all I know; for I would not tell a lie, not if it\nwas hever so. And me, and Thomas--as didn’t see it,--and cook, we thinks\nas how Benson was come for. And cook says as she don’t wonder at it,\nneither; for a grumblinger, more ill-conditioneder--”\n\n“Thank you, William,” said Lord Kelso; “that will do; you can go, for\nthe present.”\n\n\n\n\n\nCHAPTER XIII. _Surprises_\n\nTHE prince said nothing, the ambassador said nothing, Lady Rosalind said\nnever a word till they were in the drawing-room. It was a lovely warm\nevening, and the French windows were wide open on the balcony, which\nlooked over the town and away north to the hills. Below them flowed the\nclear, green water of the Gluckthal And still nobody said a word. At\nlast the prince spoke: “This is a very strange story, Lord Kelso!”\n\n“Very, sir!” said the ambassador. “But true,” added the prince; “at\nleast, there is no reason in the nature of things why it shouldn’t be\ntrue.”\n\n“I can hardly believe, sir, that the conduct of Benson, whom I always\nfound a most respectable man, deserved--”\n\n“That he should be ‘come for,’” said the prince. “Oh, no; it was a mere\naccident, and might have happened to any of us who chanced to sit down\non my carpet.”\n\nAnd then the prince told them, shortly, all about it: how the carpet\nwas one of a number of fairy properties, which had been given him at\nhis christening; and how so long a time had gone by before he discovered\nthem; and how, probably, the carpet had carried the butler where he had\nsaid he wanted to go--namely, to the king’s Court at Falkenstein.\n\n“It would not matter so much,” added the prince, “only I had relied on\nmaking my peace with his majesty, my father, by aid of those horns and\nthat tail. He was set on getting them; and if the Lady Rosalind had\nnot expressed a wish for them, they would to-day have been in his\npossession.”\n\n“Oh, sir, you honour us too highly,” murmured Lady Rosalind; and the\nprince blushed and said:\n\n“Not at all! Impossible!”\n\nThen, of course, the ambassador became quite certain that his daughter\nwas admired by the crown prince, who was on bad terms with the king\nof the country; and a more uncomfortable position for an\nambassador--however, they are used to them.\n\n“What on earth am I to do with the young man?” he thought. “He can’t\nstay here for ever; and without his carpet he can’t get away, for the\nsoldiers have orders to seize him as soon as he appears in the street.\nAnd in the meantime Benson will be pretending that _he_ killed the\nFiredrake--for he must have got to Falkenstein by now,--and they will be\nfor marrying him to the king’s niece, and making my butler crown prince\nto the kingdom of Pantouflia! It is dreadful!”\n\nNow all this time the prince was on the balcony, telling Lady Rosalind\nall about how he got the Firedrake done for, in the most modest way;\nfor, as he said: “I didn’t kill him: and it is really the Remora, poor\nfellow, who should marry Molly; but he ‘s dead.”\n\nAt this very moment there was a _whizz_ in the air; something shot past\nthem, and, through the open window, the king, the queen, Benson, and the\nmortal remains of the Firedrake were shot into the ambassador’s drawing\nroom!\n\n\n\n\n\n\nCHAPTER XIV. _The King Explains._\n\nTHE first who recovered his voice and presence of mind was Benson.\n\n“Did your lordship ring for coffee?” he asked, quietly; and when he was\ntold “Yes,” he bowed and withdrew, with majestic composure. When he had\ngone, the prince threw himself at the king’s feet, crying:\n\n“Pardon, pardon, my liege!” “Don’t speak to me, sir!” answered the\nking, very angrily; and the poor prince threw himself at the feet of the\nqueen.\n\nBut she took no notice of him whatever, no more than if he had been a\nfairy; and the prince heard her murmur, as she pinched her royal arms:\n\n“I shall waken presently; this is nothing out of the way for a dream.\nDr. Rumpfino ascribes it to imperfect nutrition.”\n\nAll this time, the Lady Rosalind, as pale as a marble statue, was\nleaning against the side of the open window. The prince thought he could\ndo nothing wiser than go and comfort her, so he induced her to sit down\non a chair in the balcony,--for he felt that he was not wanted in the\ndrawing-room;--and soon they were talking happily about the stars, which\nhad begun to appear in the summer night.\n\nMeanwhile, the ambassador had induced the king to take a seat; but there\nwas no use in talking to the queen.\n\n“It would be a miracle,” she said to herself, “and miracles do not\nhappen; therefore this has not happened. Presently, I shall wake up in\nmy own bed at Falkenstein.”\n\nNow, Benson, William, and Thomas brought in the coffee, but the queen\ntook no notice. When they went away, the rest of the company slipped off\nquietly, and the king was left alone with the ambassador; for the queen\ncould hardly be said to count.\n\n“You want to know all about it, I suppose?” said his majesty in a sulky\nvoice. “Well, you have a right to it, and I shall tell you. We were just\nsitting down to dinner at Falkenstein, rather late,--hours get later\nevery year, I think--when I heard a row in the premises, and the captain\nof the guard, Colonel McDougal, came and told us that a man had arrived\nwith the horns and tail of the Firedrake, and was claiming the reward.\nHer majesty and I rose and went into the outer court, where we\nfound, sitting on that carpet with a glass of beer in his hand, a\nrespectable-looking upper servant, whom I recognised as your butler. He\ninformed us that he had just killed the beast, and showed us the horns\nand tail, sure enough; there they are! The tail is like the iron\nhandle of a pump, but the horns are genuine. A pair were thrown up by\na volcano, in my great-grandfather’s time Giglio I.* Excellent coffee\nthis, of yours!”\n\n     * The History of this Prince may be read in a treatise\n     called _The Rose and the Ring_, by M. A. Titmarsh.\n     London, 1855.\n\n\nThe ambassador bowed.\n\n“Well, we asked him _where_ he killed the Firedrake, and he said in a\ngarden near Gluckstein. Then he began to speak about the reward, and the\n‘perkisits,’ as he called them, which it seems he had read about in my\nproclamation. Rather a neat thing; drew it up myself,” added his\nmajesty.\n\n“Very much to the point,” said the ambassador, wondering what the king\nwas coming to.\n\n“Glad you like it,” said the king, much pleased. “Well, where was I? Oh,\nyes; your man said he had killed the creature in a garden, quite near\nGluckstein. I didn’t much like the whole affair: he is an alien, you\nsee; and then there was my niece, Molinda--poor girl, _she_ was certain\nto give trouble. Her heart is buried, if I may say so, with poor\nAlphonso. But the queen is a very remarkable woman--very remarkable--”\n\n“Very!” said the ambassador, with perfect truth.\n\n“‘Caitiff!’ she cries to your butler,” his majesty went on; “‘perjured\nknave, thou liest in thy throat! Gluckstein is a hundred leagues from\nhere, and how say est thou that thou slewest the molester, and earnest\nhither in a few hours’ space?’ This had not occurred to me,--I am a\nplain king, but I at once saw the force of her majesty’s argument.\nYes,’ said I; ‘how did you manage it?’ But he--your man, I mean--was\nnot a bit put out. ‘Why, your majesty,’ says he, ‘I just sat down on\nthat there bit of carpet, wished I was here, and here _I ham_. And I ‘d\nbe glad, having had the trouble,--and my time not being my own,--to see\nthe colour of them perkisits, according to the proclamation.’ On this\nher majesty grew more indignant, if possible. ‘Nonsense!’ she cried; ‘a\nstory out of the ‘Arabian Nights’ is not suited for a modern public, and\nfails to win æsthetic credence.’ These were her very words.”\n\n“Her majesty’s expressions are ever choice and appropriate,” said the\nambassador.\n\n“‘Sit down there, on the carpet, knave,’ she went on; ‘ourself and\nconsort’--meaning _me_--‘will take our places by thy side, and I shall\nwish us in Gluckstein, at thy master’s! When the experiment has failed,\nthy head shall from thy shoulders be shorn!’ So your man merely said,\n‘Very well, mum,--your majesty, I mean,’ and sat down. The queen took her\nplace at the edge of the carpet; I sat between her and the butler, and\nshe said, ‘I wish I were in Gluckstein!’ Then we rose, flew through the\nair at an astonishing pace, and here we are! So I suppose the rest of\nthe butler’s tale is true, which I regret; but a king’s word is sacred,\nand he shall take the place of that sneak, Prigio. But as we left home\nbefore dinner, and _yours_ is over, may I request your lordship to\nbelieve that I should be delighted to take something cold?”\n\nThe ambassador at once ordered a sumptuous collation, to which the king\ndid full justice; and his majesty was shown to the royal chamber, as he\ncomplained of fatigue. The queen accompanied him, remarking that she\nwas sound asleep, but would waken presently. Neither of them said\n“Good-night” to the prince. Indeed, they did not see him again, for he\nwas on the balcony with Lady Rosalind. They found a great deal to say\nto each other, and at last the prince asked her to be his wife; and she\nsaid that if the king and her father gave their permission--why, then\nshe would! After this she went to bed; and the prince, who had not slept\nat all the night before, felt very sleepy also. But he knew that first\nhe had something that must be done. So he went into the drawing-room,\ntook his carpet, and wished to be--now where do you suppose? Beside the\ndead body of the Firedrake! There he was in a moment; and dreadful\nthe body looked, lying stark and cold in the white moonshine. Then the\nprince cut off its four hoofs, put them in his wallet, and with these\nhe flew back in a second, and met the ambassador just as he came from\nushering the king to bed. Then the prince was shown his own room, where\nhe locked up the hoofs, the carpet, the cap of darkness, and his other\nthings in an iron box; and so he went to bed and dreamed of his Lady\nRosalind.\n\n\n\n\n\nCHAPTER XV. _The King’s Cheque_\n\nWHEN they all awakened next morning, their first ideas were confused.\nIt is often confusing to wake in a strange bed, much more so when you\nhave flown through the air, like the king, the queen, and Benson the\nbutler. For her part, the queen was the most perplexed of all; for she\ndid undeniably wake, and yet she was not at home, where she had expected\nto be. However, she was a determined woman, and stood to it that nothing\nunusual was occurring. The butler made up his mind to claim the crown\nprinceship and the hand of the Lady Molinda; because, as he justly\nremarked to William, here was such a chance to better himself as might\nnot soon come in his way again. As for the king, he was only anxious\nto get back to Falkenstein, and have the whole business settled in a\nconstitutional manner. The ambassador was not sorry to get rid of the\nroyal party; and it was proposed that they should all sit down on the\nflying carpet, and wish themselves at home again. But the queen would\nnot hear of it: she said it was childish and impossible; so the carriage\nwas got ready for her, and she started without saying a word of good-bye\nto anyone. The king, Benson, and the prince were not so particular, and\nthey simply flew back to Falkenstein in the usual way, arriving there at\n11.35--a week before her majesty.\n\nThe king at once held a Court; the horns and tail of the monster were\nexhibited amidst general interest, and Benson and the prince were\ninvited to state their claims.\n\nBenson’s evidence was taken first. He declined to say exactly where\nor how he killed the Firedrake. There might be more of them left, he\nremarked,--young ones, that would take a lot of killing,--and he refused\nto part with his secret. Only he claimed the reward, which was offered,\nif you remember, _not_ to the man who killed the beast, but to him wha\nbrought its horns and tail. This was allowed by the lawyers present\nto be very sound law; and Benson was cheered by the courtiers, who\ndecidedly preferred him to Prigio, and who, besides, thought he was\ngoing to be crown prince. As for Lady Molinda, she was torn by the most\npainful feelings; for, much as she hated Prigio, she could not bear the\nidea of marrying Benson. Yet one or the other choice seemed certain.\n\nUnhappy lady! Perhaps no girl was ever more strangely beset by\nmisfortune!\n\nPrince Prigio was now called on to speak.\n\nHe admitted that the reward was offered for bringing the horns and tail,\nnot for killing the monster. But were the king’s _intentions_ to go for\nnothing? When a subject only _meant_ well, of course he had to suffer;\nbut when a king said one thing, was he not to be supposed to have meant\nanother? Any fellow with a waggon could _bring_ the horns and tail; the\ndifficult thing was to kill the monster. If Benson’s claim was allowed,\nthe royal prerogative of saying one thing and meaning something else was\nin danger.\n\nOn hearing this argument, the king so far forgot himself as to cry,\n“Bravo, well said!” and to clap his hands, whereon all the courtiers\nshouted and threw up their hats.\n\nThe prince then said that whoever had killed the monster could, of\ncourse, tell where to find him, and could bring his hoofs. He was\nready to do this himself. Was Mr. Benson equally ready? On this being\ninterpreted to him--for he did not speak Pantouflian--Benson grew pale\nwith horror, but fell back on the proclamation. He had brought the horns\nand tail, and so he must have the perquisites, and the Lady Molinda!\n\nThe king’s mind was so much confused by this time, that he determined to\nleave it to the Lady Molinda herself.\n\n“Which of them will you have, my dear?” he asked, in a kind voice.\n\nBut poor Molinda merely cried. Then his majesty was almost _driven_ to\nsay that he would give the reward to whoever produced the hoofs by that\nday week. But no sooner had he said this than the prince brought them\nout of his wallet, and displayed them in open Court. This ended the\ncase; and Benson, after being entertained with sherry and sandwiches\nin the steward’s room, was sent back to his master, And I regret to\nsay that his temper was not at all improved by his failure to better\nhimself. On the contrary, he was unusually cross and disagreeable\nfor several days; but we must, perhaps, make some allowance for his\ndisappointment.\n\nBut if Benson was irritated, and suffered from the remarks of his\nfellow-servants, I do not think we can envy Prince Prigio. Here he was,\nrestored to his position indeed, but by no means to _the royal favour_.\nFor the king disliked him as much as ever, and was as angry as ever\nabout the deaths of Enrico and Alphonso. Nay, he was even _more_ angry;\nand, perhaps, not without reason. He called up Prigio before the whole\nCourt, and thereon the courtiers cheered like anything, but the king\ncried:\n\n“Silence! McDougal, drag the first man that shouts to the serpent-house\nin the zoological gardens, and lock him up with the rattlesnakes!”\n\nAfter that the courtiers were very quiet.\n\n“Prince,” said the king, as Prigio bowed before the throne, “you are\nrestored to your position, because I cannot break my promise. But your\nbase and malevolent nature is even more conspicuously manifest in your\nselfish success than in your previous dastardly contempt of duty. Why,\nconfound you!” cried the king, dropping the high style in which he had\nbeen speaking, and becoming the _father_, not the monarch,--“why, if you\n_could_ kill the Firedrake, did you let your poor little brothers go and\nbe b--b--b--broiled? Eh! what do you say, you sneak? ‘You didn’t believe\nthere _were_ any Firedrakes?’ That just comes of your eternal conceit\nand arrogance! If you were clever enough to kill the creature--and I\nadmit that--you were clever enough to know that what everybody said must\nbe true. ‘You have not generally found it so?’ Well, you _have_ this\ntime, and let it be a lesson to you; not that there is much comfort\nin that, for it is not likely you will ever have such another\nchance”--exactly the idea that had occurred to Benson.\n\nHere the king wept, among the tears of the lord chief justice, the\npoet laureate (who had been awfully frightened when he heard of the\nrattlesnakes), the maids of honour, the chaplain royal, and everyone\nbut Colonel McDougal, a Scottish soldier of fortune, who maintained a\nmilitary reserve.\n\nWhen his majesty had recovered, he said to Prigio (who had not been\ncrying, he was too much absorbed):\n\n“A king’s word is his bond. Bring me a pen, somebody, and my\ncheque-book.”\n\nThe royal cheque-book, bound in red morocco, was brought in by eight\npages, with ink and a pen. His majesty then filled up and signed the\nfollowing satisfactory document--(Ah! my children, how I wish Mr.\nArrowsmith would do as much for _me_!):\n\n\n“There!” said his majesty, crossing his cheque and throwing sand over\nit, for blotting-paper had not yet been invented; “there, take _that_,\nand be off with you!”\n\nPrince Prigio was respectfully but rapidly obeying his royal command,\nfor he thought he had better cash the royal cheque as soon as possible,\nwhen his majesty yelled:\n\n“Hi! here! come back! I forgot something; you’ve got to marry Molinda!”\n\n\n\n\n\nCHAPTER XVI. _A Melancholy Chapter_\n\nTHE prince had gone some way, when the king called after him. How he\nwished he had the seven-league boots on, or that he had the cap of\ndarkness in his pocket! If he had been so lucky, he would now have got\nback to Gluckstein, and crossed the border with Lady Rosalind. A million\nof money may not seem much, but a pair of young people who really love\neach other could live happily on less than the cheque he had in his\npocket. However, the king shouted very loud, as he always did when he\nmeant to be obeyed, and the prince sauntered slowly back again.\n\n“Prigio!” said his majesty, “where were you off to? Don’t you remember\nthat this is your wedding-day? My proclamation offered, not only the\nmoney (which you have), but the hand of the Lady Molinda, which the\nCourt chaplain will presently make your own. I congratulate you, sir;\nMolinda is a dear girl.”\n\n“I have the highest affection and esteem for my cousin, sir,” said the\nprince, “but:--”\n\n“I’ll never marry him!” cried poor Molinda, kneeling at the throne,\nwhere her streaming eyes and hair made a pretty and touching picture.\n“Never! I despise him!”\n\n\n“I was about to say, sir,” the prince went on, “that I cannot possibly\nhave the pleasure of wedding my cousin.”\n\n“The family gibbet, I presume, is in good working order?” asked the king\nof the family executioner, a tall gaunt man in black and scarlet, who\nwas only employed in the case of members of the blood royal.\n\n“Never better, sire,” said the man, bowing with more courtliness than\nhis profession indicated.\n\n“Very well,” said the king; “Prince Prigio, you have your choice.\n_There_ is the gallows, _here_ is Lady Molinda. My duty is painful, but\nclear. A king’s word cannot be broken. Molly, or the gibbet!”\n\nThe prince bowed respectfully to Lady Molinda:\n\n“Madam, my cousin,” said he, “your clemency will excuse my answer, and\nyou will not misinterpret the apparent discourtesy of my conduct. I am\ncompelled, most unwillingly, to slight your charms, and to select the\nExtreme Rigour of the Law. Executioner, lead on! Do your duty; for\nme, _Prigio est prêt_;”--for this was his motto, and meant that he was\nready.\n\n\nPoor Lady Molinda could not but be hurt by the prince’s preference for\ndeath over marriage to her, little as she liked him.\n\n“Is life, then, so worthless? and is Molinda so terrible a person\nthat you prefer _those_ arms,” and she pointed to the gibbet, “to\n_these?_”--here she held out her own, which were very white, round and\npretty; for Molinda was a good-hearted girl, she could not bear to see\nPrigio put to death; and then, perhaps, she reflected that there are\nworse positions than the queenship of Pantouflia. For Alphonso was\ngone--crying would not bring him back.\n\n“Ah, Madam!” said the prince, “you are forgiving--”\n\n“For _you_ are brave!” said Molinda, feeling: quite a respect for him.\n\n“But neither your heart nor mine is ours to give. Since mine was\nanother’s, I understand too well the feeling of _yours!_ Do not let us\nbuy life at the price of happiness and honour.”\n\nThen, turning to the king the prince said:\n\n“Sir, is there no way but by death or marriage? You say you cannot keep\nhalf only of your promise; and that, if I accept the reward, I must also\nunite myself with my unwilling cousin. Cannot the whole proclamation\nbe annulled, and will you consider the bargain void if I tear up this\nflimsy scroll?”\n\nAnd here the prince fluttered the cheque for £1,000,000 in the air.\n\nFor a moment the king was tempted; but then he said to himself:\n\n“Never mind, it’s only an extra penny on the income-tax.” Then, “Keep\nyour dross,” he shouted, meaning the million; “but let _me_ keep my\npromise. To chapel at once, or--” and he pointed to the executioner.\n“The word of a king of Pantouflia is sacred.”\n\n“And so is that of a crown prince,” answered Prigio; “and _mine_ is\npledged to a lady.”\n\n“She shall be a mourning bride,” cried the king savagely, “unless”--here\nhe paused for a moment--“unless you bring me back Alphohso and Enrico,\nsafe and well!”\n\nThe prince thought for the space of a flash of lightning.\n\n“I accept the alternative,” he said, “if your majesty will grant me my\nconditions.”\n\n“Name them!” said the king.\n\n“Let me be transported to Gluckstein, left there unguarded, and if, in\nthree days, I do not return with my brothers safe and well, your majesty\nshall be spared a cruel duty. Prigio of Pantouflia will perish by his\nown hand.”\n\nThe king, whose mind did not work very quickly, took some minutes to\nthink over it. Then he saw that by granting the prince’s conditions,\nhe would either recover his dear sons, or, at least, get rid of Prigio,\nwithout the unpleasantness of having him executed. For, though some\nkings have put their eldest sons to death, and most have wished to do\nso, they have never been better loved by the people for their Roman\nvirtue.\n\n“Honour bright?” said the king at last.\n\n“Honour bright!” answered the prince, and for the first time in many\nmonths, the royal father and son shook hands.\n\n“For you, madam,” said Prigio in a stately way to Lady Molinda, “in less\nthan a week I trust we shall be taking our vows at the same altar, and\nthat the close of the ceremony which finds us cousins will leave us\nbrother and sister.”\n\nPoor Molinda merely stared; for she could not imagine what he meant. In\na moment he was gone; and having taken, by the king’s permission, the\nflying carpet, he was back at the ambassador’s house in Gluckstein.\n\n\n\n\n\nCHAPTER XVII. _The Black Cat and the brethren_\n\nWHO was glad to see the prince, if it was not Lady Rosalind? The white\nroses of her cheeks turned to red roses in a moment, and then back to\nwhite again, they were so alarmed at the change. So the two went into\nthe gardens together, and talked about a number of things; but at last\nthe prince told her that, before three days were over, all would be\nwell, or all would be over with him. For either he would have brought\nhis brothers back, sound and well, to Falkenstein, or he would not\nsurvive his dishonour.\n\n“It is no more than right,” he said; “for had I gone first, neither of\nthem would have been sent to meet the monster after I had fallen. And I\n_should_ have fallen, dear Rosalind, if I had faced the Firedrake before\nI knew _you._”\n\nThen when she asked him why, and what good she had done him, he told\nher all the story; and how, before he fell in love with her, he didn’t\nbelieve in fairies, or Firedrakes, or caps of darkness, or anything nice\nand impossible, but only in horrid useless facts, and chemistry, and\ngeology, and arithmetic, and mathematics, and even political economy.\nAnd the Firedrake would have made a mouthful of him, then.\n\nSo she was delighted when she heard this, almost as much delighted as\nshe was afraid that he might fail in the most difficult adventure.\nFor it was one thing to egg on a Remora to kill a Firedrake, and quite\nanother to find the princes if they were alive, and restore them if they\nwere dead!\n\nBut the prince said he had his plan, and he stayed that night at the\nambassador’s. Next morning he rose very early, before anyone else was\nup, that he might not have to say “Good-bye” to Lady Rosalind. Then he\nflew in a moment to the old lonely castle, where nobody went for fear of\nghosts, ever since the Court retired to Falkenstein.\n\nHow still it was, how deserted; not a sign of life, and yet the prince\nwas looking everywhere _for some living thing_. He hunted the castle\nthrough in vain, and then went out to the stable-yard; but all the dogs,\nof course, had been taken away, and the farmers had offered homes to the\npoultry. At last, stretched at full length in a sunny place, the prince\nfound a very old, half-blind, miserable cat. The poor creature was lean,\nand its fur had fallen off in patches; it could no longer catch birds,\nnor even mice, and there was nobody to give it milk. But cats do\nnot look far into the future; and this old black cat--Frank was his\nname--had got a breakfast somehow, and was happy in the sun. The prince\nstood and looked at him pityingly, and he thought that even a sick old\ncat was, in some ways, happier than most men.\n\n\n“Well,” said the prince at last, “he could not live long anyway, and it\nmust be done. He will feel nothing.”\n\nThen he drew the sword of sharpness, and with one turn of his wrist cut\nthe cat’s head clean off.\n\nIt did not at once change into a beautiful young lady, as perhaps you\nexpect; no, that was improbable, and, as the prince was in love already,\nwould have been vastly inconvenient. The dead cat lay there, like any\ncommon cat.\n\nThen the prince built up a heap of straw, with wood on it; and there he\nlaid poor puss, and set fire to the pile. Very soon there was nothing of\nold black Frank left but ashes!\n\nThen the prince ran upstairs to the fairy cupboard, his heart beating\nloudly with excitement, The sun was shining through the arrow-shot\nwindow; all the yellow motes were dancing in its rays. The light fell\non the strange heaps of fairy things--talismans and spells. The prince\nhunted about here and there, and at last he discovered six ancient\nwater-vessels of black leather, each with a silver plate on it, and on\nthe plate letters engraved. This was what was written on the plates:\n\n_AQVA. DE. FONTE. LEONVM._*\n\n     * Water from the Fountain of Lions.\n\n“Thank heaven!” said the prince. “I thought they were sure to have\nbrought it!”\n\nThen he took one of the old black-leather bottles, and ran downstairs\nagain to the place where he had burned the body of the poor old sick\ncat.\n\n\nHe opened the bottle, and poured a few drops of the water on the ashes\nand the dying embers.\n\nUp there sprang a tall, white flame of fire, waving like a tongue of\nlight; and forth from the heap jumped the most beautiful, strong, funny,\nblack cat that ever was seen!\n\nIt was Frank as he had been in the vigour of his youth; and he knew the\nprince at once, and rubbed himself against him and purred.\n\nThe prince lifted up Frank and kissed his nose for joy; and a bright\ntear rolled down on Frank’s face, and made him rub his nose with his paw\nin the most comical manner.\n\nThen the prince set him down, and he ran round and round after his tail;\nand, lastly, cocked his tail up, and marched proudly after the prince\ninto the castle.\n\n“Oh, Frank!” said Prince Prigio, “no cat since the time of Puss in Boots\nwas ever so well taken care of as you shall be. For if the fairy water\nfrom the Fountain of Lions can bring _you_ back to life--why, there is a\nchance for Alphonso and Enrico!”\n\nThen Prigio bustled about, got ready some cold luncheon from the\nstore-room, took all his fairy things that he was likely to need, sat\ndown with them on the flying carpet, and wished himself at the mountain\nof the Firedrake.\n\n“I have the king now,” he said; “for if I can’t find the ashes of my\nbrothers, by Jove! I’ll!--”\n\nDo you know what he meant to do, if he could not find his brothers? Let\nevery child-guess.\n\nOff he flew; and there he was in a second, just beside poor Alphonso’s\ngarden-engine. Then Prigio, seeing a little heap of grey ashes beside\nthe engine, watered them with the fairy water; and up jumped Alphonso,\nas jolly as ever, his sword in his hand.\n\n“Hullo, Prigio!” cried he; “are you come after the monster too? I’ve\nbeen asleep, and I had a kind of dream that he beat me. But the pair of\nus will tackle him. How is Molinda?”\n\n“Prettier than ever,” said Prigio; “but anxious about you. However,\nthe Firedrake’s dead and done for; so never mind him. But I left Enrico\nsomewhere about. Just you sit down and wait a minute, till I fetch him.”\n\nThe prince said this, because he did not wish Alphonso to know that\nhe and Enrico had not had quite the best of it in the affair with the\nmonster.\n\n“All right, old fellow,” says Alphonso; “but have you any luncheon with\nyou? Never was so hungry in my life!”\n\nPrince Prigio had thought of this, and he brought out some cold sausage\n(to which Alphonso was partial) and some bread, with which the younger\nprince expressed himself satisfied. Then Prigio went up the hill some\nway, first warning Alphonso _not_ to sit on his carpet for fear of\n_accidents_ like that which happened to Benson. In a hollow of the hill,\nsure enough there was the sword of Enrico, the diamonds of the hilt\ngleaming in the sun. And there was a little heap of grey ashes.\n\nThe prince poured a few drops of the water from the Fountain of Lions on\nthem, and up, of course, jumped Enrico, just as Alphonso had done.\n\n“Sleepy old chap you are, Enrico,” said the prince; “but come on,\nAlphonso will have finished the grub unless we look smart.”\n\nSo back they came, in time to get their share of what was going; and\nthey drank the Remora’s very good health, when Prigio told them about\nthe fight. But neither of them ever knew that they had been dead\nand done for; because Prigio invented a story that the mountain was\nenchanted, and that, as long as the Firedrake lived, everyone who came\nthere fell asleep. He did tell them about the flying carpet, however,\nwhich of course did not much surprise them, because they had read all\nabout it in the _Arabian Nights_ and other historical works.\n\n“And now I ‘ll show you fun!” said Prigio; and he asked them both to\ntake their seats on the carpet, and wished to be in the valley of the\nRemora.\n\nThere they were in a moment, among the old knights whom, if you\nremember, the Remora had frozen into stone. There was quite a troop of\nthem, in all sorts of armour--Greek and Roman, and Knight Templars like\nFront’ de Bouf and Brian du Bois Gilbert--all the brave warriors that\nhad tried to fight the Remora since the world began.\n\nThen Prigio gave each of his brothers some of the water in their caps,\nand told them to go round pouring a drop or two on each frozen knight.\nAnd as they did it, lo and behold! each knight came alive, with his\nhorse, and lifted his sword and shoute:\n\n“Long live Prince Prigio!” in Greek, Latin, Egyptian, French, German,\nand Spanish,--all of which the prince perfectly understood, and spoke\nlike a native.\n\nSo he marshalled them in order, and sent them off to ride to Falkenstein\nand cry:\n\n“Prince Prigio is coming!”\n\n\nOff they went, the horses’ hoofs clattering, banners flying, sunshine\nglittering on the spear-points. Off they rode to Falkenstein; and when\nthe king saw them come galloping in, I can tell you he had no more\nnotion of hanging Prigio.\n\n\n\n\n\nCHAPTER XVIII. _The Very Last_\n\nTHE princes returned to Gluckstein on the carpet, and went to the best\ninn, where they dined together and slept. Next morning they, and the\nambassador, who had been told all the story, and Lady Rosalind, floated\ncomfortably on the carpet, back to Falkenstein, where the king wept like\nanything on the shoulders of Alphonso and Enrico. They could not make\nout why he cried so, nor why Lady Molinda and Lady Kathleena cried; but\nsoon they were all laughing and happy again. But then--would you believe\nhe could be so mean?--he refused to keep his royal promise, and restore\nPrigio to his crown-princeship! Kings are like that.\n\nBut Prigio, very quietly asking for the head of the Firedrake, said he’d\npour the magic water on _that_, and bring the Firedrake back to\nlife again, unless his majesty behaved rightly. This threat properly\nfrightened King Grognio, and he apologised. Then the king shook hands\nwith Prigio in public, and thanked him, and said he was proud of him. As\nto Lady Rosalind, the old gentleman quite fell in love with her, and he\nsent at once to the Chaplain Royal to get into his surplice, and marry\nall the young people off at once, without waiting for wedding-cakes, and\nmilliners, and all the rest of it.\n\n\nNow, just as they were forming a procession to march into church, who\nshould appear but the queen! Her majesty had been travelling by post all\nthe time, and, luckily, had heard of none of the doings since Prigio,\nBenson, and the king left Gluckstein. I say _luckily_ because if she had\nheard of them, she would not have believed a word of them. But when she\nsaw Alphonso and Enrico, she was much pleased, and said:\n\n“Naughty boys! Where have you been hiding? The king had some absurd\nstory about your having been killed by a fabulous monster. Bah! don’t\ntell _me_. I always said you would come back after a little trip--didn’t\nI, Prigio?”\n\n“Certainly, madam,” said Prigio; “and I said so, too. Didn’t I say\nso?” And all the courtiers cried: “Yes, you did;” but some added, to\nthemselves, “He _always_ says, ‘Didn’t I say so?’”\n\nThen the queen was introduced to Lady Rosalind, and she said it was\n“rather a short engagement, but she supposed young people understood\ntheir own affairs best.” And they do! So the three pairs were married,\nwith the utmost rejoicings; and her majesty never, her whole life long,\ncould be got to believe that anything unusual had occurred.\n\nThe honeymoon of Prince Prigio and the Crown Princess Rosalind was\npassed at the castle, where the prince had been deserted by the Court.\nBut now it was delightfully fitted up; and Master Frank marched about\nthe house with his tail in the air, as if the place belonged to him.\n\nNow, on the second day of their honeymoon, the prince and princess were\nsitting in the garden together, and the prince said, “Are you _quite_\nhappy, my dear?” and Rosalind said, “Yes; _quite_.”\n\nBut the prince did not like the tone of her voice, and he said:\n\n“No, there’s something; do tell me what it is.”\n\n“Well,” said Rosalind, putting her head on his shoulder, and speaking\nvery low, “I want everybody to love you as much as I do. No, not quite\nso very much,--but I want them to like you. Now they _can’t_, because\nthey are afraid of you; for you are so awfully clever. Now, couldn’t you\ntake the wishing cap, and wish to be no cleverer than other people? Then\neverybody would like you!”\n\nThe prince thought a minute, then he said:\n\n“Your will is law, my dear; anything to please you. Just wait a minute!”\n\nThen he ran upstairs, for the last time, to the fairy garret, and he put\non the wishing cap.\n\n“No,” thought he to himself, “I won’t wish _that_. Every man has one\nsecret from his wife, and this shall be mine.”\n\nThen he said aloud: “I wish to SEEM no CLEVERER THAN OTHER PEOPLE.”\n\nThen he ran downstairs again, and the princess noticed a great\ndifference in him (though, of course, there was really none at all), and\nso did everyone. For the prince remained as clever as ever he had been;\nbut, as nobody observed it, he became the most popular prince, and\nfinally the best-beloved king who had ever sat on the throne of\nPantouflia.\n\nBut occasionally Rosalind would say, “I do believe, my dear, that you\nare really as clever as ever!”\n\nAnd he _was!_\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      4518,
      4526,
      1
    ],
    [
      "chapter.title",
      5178,
      5232,
      2
    ],
    [
      "chapter.title",
      10715,
      10757,
      3
    ],
    [
      "chapter.title",
      13914,
      13949,
      4
    ],
    [
      "chapter.title",
      21934,
      21991,
      5
    ],
    [
      "chapter.title",
      26492,
      26544,
      6
    ],
    [
      "chapter.title",
      27918,
      27970,
      7
    ],
    [
      "chapter.title",
      36630,
      36669,
      8
    ],
    [
      "chapter.title",
      42373,
      42410,
      9
    ],
    [
      "chapter.title",
      46151,
      46193,
      10
    ],
    [
      "chapter.title",
      48708,
      48746,
      11
    ],
    [
      "chapter.title",
      51515,
      51539,
      12
    ],
    [
      "chapter.title",
      57652,
      57688,
      13
    ],
    [
      "chapter.title",
      63465,
      63490,
      14
    ],
    [
      "chapter.title",
      66294,
      66327,
      15
    ],
    [
      "chapter.title",
      73044,
      73075,
      16
    ],
    [
      "chapter.title",
      80213,
      80248,
      17
    ],
    [
      "chapter.title",
      85682,
      85728,
      18
    ],
    [
      "chapter.title",
      94578,
      94608,
      19
    ]
  ]
}