{
  "content": "The Rival Crusoes\nAgnes Strickland\n\nBOOK 1.\n\n\"George! Harry!--lazy fellows that you are!--Why are you not in\nattendance?\" said Lord Robert Summers in an angry tone, throwing the\nrein of his pony to his grooms, and rushing up the great staircase with\nhis handkerchief held close to his face.\n\n\"What is the matter with our young lord to-day?\" said Harry; \"he seems\nin a marvellous ill mood.\"\n\n\"I suppose he has had another brush with Philip Harley to-day: did not\nyou see the blood on his handkerchief?\" said the other.\n\n\"That Philip is a saucy young rascal,\" replied Harry; \"but he will get\nhimself into a scrape before long. Lord Robert will be even with him, I\nwill answer; for he never takes an offence without returning\ntwenty-fold.\"\n\n\"They never meet now without a battle,\" returned the groom. \"Lord Robert\nhas been so used to domineer over men twice his age, on board ship, that\nhe is more unbearable than any young man of rank I ever served. I wonder\nwho is to put up with all his tempers? If his elder brother, my young\nlord, were half so hasty with his hands, or so flippant with his tongue,\nI would leave his service to-morrow: however, he wont be with us\nlong--that's my comfort. It was but the other day I was airing the dogs,\nand trod, by accident, on his favourite Neptune's toe. The plaguy beast\nset up a yell. In an instant, I had a cuff of the head from the young\ntyrant, and was called a careless rascal and scoundrel, while he had\nbreath to heap such epithets on me. I am glad the lad has given him a\ndressing, and wish it had been twice as much; it might have done him\ngood.\"\n\nWith this wish, George led off the pony. The fact was, Lord Robert had\ncaught Philip Harley trespassing, according to custom, in the Park, and\nhad tried to horsewhip him out of the grounds, but had fairly got the\nworst of it. Lord Robert, though a stout and courageous youth, was\npulled off his horse by the desperate young rustic, and in the fray\nreceived several contusions on the face. Philip did not part without\nsome tokens of his enemy's vengeance; but he certainly remained victor\nin the contest. Lord Robert was glad to regain his pony and make a hasty\nretreat, much mortified, and in a very evil temper.\n\nWhen he had reached his apartment, he washed the blood from his face,\nand composed the swelling of his haughty spirit; and after smoothing his\nruffled plumes, he descended into the dining-room and joined the family\nparty. His mother made some inquiry respecting the bruises on his face;\nbut he turned it off with an evasive answer, as the effect of a fall he\nhad met with in the Park. No farther notice was taken, except a slight\nsarcasm on the proverbial bad horsemanship of sailors.\n\nAt the dessert, the Marquis, his father, handed him a letter. \"It is\nfrom your uncle, Sir Henry. See, Robert, what a charming surprise he has\nprepared for you! He spoils you, boy! I think you would not be so\npetulant and imperious, if every wish of that wayward heart were not\ngratified by his fond affection.\"\n\nLord Robert was so eager to read the letter from his beloved uncle, that\nhe scarcely heard this reproof, which, gentle as it was, at any other\ntime would have clouded his handsome brow with frowns.\n\nCaptain Sir Henry Stanley wrote to his brother-in-law, that he should\nsail in the Diomede, from Portsmouth, in less than a month; when he\nshould expect his noble boy, his brave Robert, again to accompany him to\nvictory. \"I think it long till we are afloat,\" continued he; \"and so, I\ndare say, does my dear nephew. However, that the time may not appear so\nvery tedious, I have sent him a little pleasure-brig, the most complete\nthat could be procured: he can sail and manoeuvre it on your lake; not\nthat I approve of freshwater sailing, but it is better than dancing\nafter horses and dogs, and such landsmen's amusements.\"\n\nLord Robert then heard that this fairy frigate had been safely landed\nthat day at a sea-port town, some little distance from his father's\ndomains. A waggon and team of horses had been despatched to bring it\nhome; and a servant soon afterwards entered to say that it had arrived,\nand was carefully placed by the side of the lake, ready for launching,\nwhich ceremony Lord Robert, full of impatient joy, sprang off to\nsuperintend.\n\nIt sometimes happens that time and tide will not wait obsequiously even\non the children of prosperity. These stubborn powers will sometimes fret\nand chafe the proud and great, and, frequently, are so unpolite as to\nruffle a rose-leaf on their couch of pleasure; but, as if the young lord\nhad suffered mortification enough in the morning, his cup of delight was\nfull in the evening. The pleasure was scarcely promised before it was\nrealized. The gay glittering frigate dashed bravely into the lake: she\nbounded and danced on the waves, with as much spirit as the youthful\nnoble could wish. The bottle of claret was flung with great effect; and\nshe received her name amidst the applauses of the peasantry of the\nneighbouring village, who, as a great favour, were permitted to behold\nthis sight at an awful distance.\n\nLord Robert sank to rest that night, anticipating the charming sail he\nshould take in the morning.\n\nThe eyes of the young lord were open before sunrise; but whilst his\nvalet was hastily dressing him, what was his indignation, on casting his\neyes towards the lake, to see his fairy frigate, his beautiful Ariel,\nspreading her white sails to the breeze, and gliding on the lake as\ngallantly as if her noble master were commanding her? Who could be the\nperson that had dared to unmoor her? Down flew Lord Robert, half\nundressed; and the servants were summoned; but none of the household had\nbeen guilty of such a piece of audacity. At last, a thought struck him,\nthat it could be no other than that contemner of all legal authority,\nPhilip Harley. Lord Robert was soon by the border of the lake; and there\nhe saw his young enemy reclined in the gilded pleasure-boat, sailing at\nhis ease, and coasting near enough for Lord Robert to behold the look of\ncalm defiance with which he surveyed his anger: and he continued to\nmanage the Ariel with as much coolness as if her lawful owner had not\nbeen viewing her manoeuvres with the greatest indignation. Lord Robert\nwas still more provoked, when he recollected that he had no means of\nreaching the offender, to expel him from the boat.\n\n\"Is there anything like a boat on the estate,\" exclaimed Lord Robert,\n\"that I may pursue that insolent young Harley, and take my property from\nhim?\"\n\n\"No, my Lord,\" said Edwards, the old gardener; \"there is nothing of the\nkind on any of the pieces of water within a mile or two of the hall.\nYour Lordship may remember that when you were very young, and took such\na fancy to everything relating to ships and sailing, my Lady had all the\nboats destroyed, for fear you should endanger your life by venturing on\nthe water.\"\n\n\"And have they never been replaced?\" asked Lord Robert.\n\n\"No, my Lord: there were two boats and a fishing-punt staved in by her\nLadyship's order,\" replied Edwards. \"You may recollect that your\nLordship got into sad disgrace, the next day, by embarking on the lake\nin a large washing-tub.\"\n\nLord Robert could not help laughing. \"On my honour, Edwards,\" said he,\n\"I could find it in my heart to embark in a washing-tub at present, if I\nthought it of any use.\"\n\n\"I think, my Lord,\" said his valet, \"Captain Bently has a small boat on\nthe river, about a mile from the Park.\"\n\n\"Run, carry my compliments to Captain Bently, and ask him to lend it to\nme for an hour.\"\n\nTwo or three messengers started with obedient speed to fulfil the wishes\nof their master: but the land conveyance of a boat is a work of time;\nand, long before their return, Philip, tired, as we may suppose, of his\namusement, steered the boat to the most distant part of the lake (which\nhappened to be nearest his own home), and jumped on shore, behind some\nbushes, which jutted out and concealed his landing. He had walked\nquietly through the Park, and arrived at the village, before Lord Robert\nperceived, by the irregular drifting of the little vessel, that she was\ndeserted, and the culprit had escaped his vengeance.\n\nLord Robert was literally glowing with rage, when he met his father in\nthe breakfast-room. For some reason best known to himself, he had\nhitherto concealed from the Marquis his encounters with Philip Harley;\nbut, in the moment of indignation, everything blazed forth; and, in all\nthe exaggeration of anger, he informed his father of every outrage\nPhilip had been guilty of towards him; adding, that the reason of their\nfirst disagreement was, his interrupting Philip in the act of poaching.\n\nThe Marquis was a good and humane man; but the representations of Lord\nRobert highly incensed him. That a young ruffian, exercising the lawless\npursuits of a poacher, should take every opportunity of insulting and\nthwarting his son, and even of brutally assaulting him in his own park,\nwas too much to be endured, and called for the severest punishment.\nCertainly, of all the species of theft (and it is _theft_), poaching is\nconsidered with the least mercy by noblemen and gentlemen of landed\nproperty. Perhaps the Marquis may be reckoned severe, but this was an\naggravated case.\n\nIt was then in the middle of the American war, and a press-gang paid\npretty frequent visits to the neighbouring sea-port town. His Lordship,\ntherefore, informed them that he wished to remove a noxious person from\nthe vicinity, and they took their measures accordingly.\n\nPhilip was partial to the sea: he was clever in the management of a\nboat, and was in the habit of taking trips, now and then, with some\nseafaring friends. He was preparing for one of these excursions, when\nthe press-gang caught him near the harbour, dressed in a blue jacket and\ntrousers; and the unfortunate youth was immediately dragged from his\nnative place, without even being suffered to bid farewell to his\nparents; and it was with the greatest difficulty that he obtained leave\nto inform them of what had befallen him. Indeed, the first news they\nheard of him was, that he was on board a tender, and destined to sail in\nthe first fleet that left England.\n\nPhilip Harley has hitherto appeared in no very respectable light. That\nhe was a desperate trespasser and depredator is the most favourable\nopinion that can be formed of him; yet there were people in the\nneighbourhood, who, having known Philip from his infancy, ventured to\nthink that he had met with harsh treatment, and that his heart, once so\ngood and upright, must have undergone an extraordinary change, or that\nhe had received great provocation, to be guilty of such daring outrages.\n\nThere is an excellent saying, which, though old and trite, it is\nsometimes necessary to bear in mind: namely, \"That one story is good\ntill another is told.\"--There was, in truth, some little excuse for\nPhilip's conduct; though he certainly deserved blame, and even\npunishment, for giving up every proper pursuit and feeling to the\ngratification of resentment.\n\nBefore Lord Robert's return from his long voyage, Philip Harley was\nconsidered as gentle in disposition, as he was manly and high-spirited.\nAt this time, he was just sixteen, and had begun to make himself useful\nin his father's business, which was that of a carpenter.\n\nHis father was rather independent in his circumstances; and his whole\nfamily consisted of two children--this Philip, and a lovely little blind\ngirl, called Kate. This unhappy sister (if a creature in the practice of\nthe most angelic patience can be called _unhappy_) was the darling of\nPhilip's heart. Every spare minute he devoted to amusing and caressing\nthis child, who was many years younger than himself; and she returned\nhis love with the most grateful affection. The cottage where they lived\nfronted the west, and could be seen from the London road; and blind Kate\nused to take her evening seat on the threshold, waiting to hear the\nstep of this beloved brother on his return from work; with her fair face\nand glittering curls turned to the setting sun--with a divine expression\nof hope and peace on her innocent countenance, that attracted the\nadmiration of every passenger.\n\nPhilip had a very large spaniel, one of the handsomest of that beautiful\nspecies. This creature he had reared from a puppy, and taught to be\nobedient to his sister; and in his absence Rover was her only source of\namusement; but he was, indeed, a most faithful and attached attendant,\nserving both for a guard and guide.\n\nSometimes Kate would walk on the road before the cottage, with her fair\nhands grasping Rover's silky coat, who would restrain his natural\nvivacity to guide the darkling steps of his little mistress. At other\ntimes, when the sun shone warm and bright, and the grass was soft and\nthick, Kate was as full of frolic and play as Rover himself, and would\ngambol with him a whole spring-day on the lawn in front of the cottage;\nbut as the evening approached, Kate and Rover took their station at the\ncottage-door, and greeted the return of Philip with the utmost joy. Both\nwere most dear to Philip: he tenderly loved his suffering sister; and\nhe loved the faithful dog for her sake. It is not surprising, therefore,\nthat Philip was almost broken-hearted when Kate fell sick, and after a\nfew days expired. True, she was removed to a better place. Philip knew\nthat she was taken in mercy, as her lot in this world was one of\npeculiar hardship; but he could not bear to lose her; and he and Rover\nmoped in the most cheerless manner for many days after the funeral.\n\nIt was some little time before this that Lord Robert returned to the\nhall, after several years' absence. He had promised himself much\npleasure from the autumnal field-sports; but in this amusement, as in\nevery other occupation, he was too apt to suffer trifles to ruffle his\ntemper, and make him violent and unreasonable.\n\nOne gloomy October evening, Lord Robert was returning with his gun and\ndogs through the park, attended by a gamekeeper. He had pursued his\namusement that day with very little success: everything had gone wrong;\nthe dogs had pointed badly, and his new fowling-piece, that had cost him\ntwenty guineas only the week before, had hung fire several times, at\nthe very moment when the game sprang before him the finest mark\npossible. In short, he had suffered disappointment enough to vex the\nheart of the most patient person in the world, who had never in his life\nfelt what real affliction was. At this unlucky minute, it was Philip\nHarley's ill fortune to cross the park by a public footway that led\nthrough the grounds. It was the first day Philip had resumed his work\nsince the death of his sister; and he was walking in a melancholy way,\ncarrying his basket of tools, with his eyes fixed on the ground,\nattending very little to what was passing around him, and Rover was\ntrudging by his side, when, unluckily, just as Lord Robert came up to\nhim, a hare darted out of some bushes, and Rover scampered after it.\n\n\"That is the way all the game is poached off the estate!\" exclaimed Lord\nRobert in a fit of passion; and, yielding to the influence of temper, he\nlevelled his gun at the dog. The piece, that had so many times missed\nfire that day, now rang sharp and true: the faithful creature was\nmortally wounded; he crawled feebly to his master's feet, and expired.\nPhilip hung over his poor dog, while he saw him die, with anguish that\ngave a painful sensation to Lord Robert; yet still, under the dominion\nof temper, he said to his servant--\n\n\"What a fool the fellow makes of himself about a dog!\"\n\nPhilip lifted the body of his poor favourite from the ground, and taking\nit in his arms, rushed by the young lord, giving him a look of contempt\nand indignation as he passed.\n\n\"It is the dog that used to lead about his blind sister,\" said the\nhumane gamekeeper. \"She is just dead.\"\n\nLord Robert then remembered meeting Kate and the dog when he first came\nhome: he had patted her curly head and admired her beauty.\n\n\"Was it blind Kate's dog?\" said Lord Robert. \"Had I known that, he might\nhave destroyed every head of game on the estate before I would have shot\nhim.\"\n\nPerhaps, had Philip heard this half acknowledgment of error, much evil\nmight have been prevented. The next time he met the young noble, it was\nwith the most bitter feelings. He considered that Lord Robert had\nwantonly murdered the innocent companion of his sister; and all the\ngrief he felt for her loss was turned into rage. Contemptuous words\nsucceeded angry looks: and these ere not to be borne by Lord Robert's\nuntamed spirit; though he felt greatly displeased with himself, and\nwould have given half his fortune to have recalled the past, yet he\nwould not bear Philip's reproaches. A very little provoked him to strike\nhim, and a desperate encounter ensued. This was followed by many others;\nfor Philip neglected all his better pursuits to gratify his revenge; he\nlay in wait to attack Lord Robert, and took every opportunity of defying\nhim; till the most ferocious hatred took place between the two youths,\nwhich led to the consequences we have already seen. In one instance,\nhowever, Philip was wrongfully accused, as he never had stained his\nhands with dishonest practices. Lord Robert well knew that the dog's\naccidentally chasing the hare was perfectly involuntary on the part of\nPhilip, who was scarcely conscious of it before the poor animal was put\nto death.\n\nThis incident had given Lord Robert Summers great mental pain: he was as\nangry with himself as with Philip Harley; he could not bear to think of\nhis conduct in this affair--he could not bear to recall any circumstance\nrelating to it; and only the _name_ of Philip Harley gave him the\ngreatest uneasiness. Yet he was not conscious that the whole of this\nuneasiness sprang from giving the reins one moment to ungovernable\ntemper; for it was neither Philip nor his dog that had offended or\nirritated him; but accidental circumstances had put him in a very ill\nhumour, and he vented his temper on the first beings that crossed his\npath, and, by that means, he was induced to commit an act of cruelty and\noppression really foreign to his own disposition, and which outraged the\nbest feelings of a fellow-creature, already under the pressure of acute\naffliction. If young people will look into their own hearts, they will\nfind that there is no frailty belonging to our erring nature so\ndeceptive as _temper_. Strange as it may appear, it often happens that\nmany individuals, when they express anger, generally wreak it on the\nlast person who would have thought of exciting it. Some unfortunate\nservant, or still more unhappy dependant, is made the victim of ill\nhumour; which is not only in itself as blind and erring as it is unjust,\nbut also brings with it the additional pain of self-reproach. Yet the\nheart is not always bad that gives way to its evil dominion; but it is\nfor want of self-examination--of saying, \"I find myself mentally uneasy,\nperhaps from accidental events, or even from indisposition of body; why\nthen should I make myself odious to this person, who is in my power, and\nmust endure my ill treatment, when a little patience and forbearance\nwill remove the cloud that rests on my mind, and my spirit will rise\nbright and unclouded, rejoicing in the consciousness of having overcome\none of the most painful infirmities of human nature?\" This\nself-confession (if it may be so called) will bring mental health, and\nrectify the most irritable disposition.\n\nNever did a month seem so long, as the time appeared to Lord Robert\nSummers while he remained on shore. He parted from his noble relatives\nwith the less regret as he longed to be at sea, to lose in active\nemployment the memory of these errors and mortifying reflections.\n\nThis young nobleman had passed his examination as lieutenant with the\ngreatest credit; and in a severe engagement between his uncle's ship and\na French man-of-war of superior force (which ended in the capture of the\nFrenchman), Lord Robert Summers behaved with such distinguished valour,\nthat he was considered, both for intrepidity and nautical skill, a most\npromising young officer; yet, on account of his youth, being but just\nsixteen, he did not expect his commission for some time to come. In this\nidea, however, he was agreeably deceived; for, before the Diomede put to\nsea, he received his commission as lieutenant. Lord Robert was greatly\nattached to his profession; and this early promotion, which he was\nconscious was less the effect of interest than desert, seemed to him the\nfirst fruits of a brilliant career of naval honours.\n\nHe was received with transport by Sir Henry Stanley; who, himself an\nornament to the British navy, foresaw, in the early valour of this\nbeloved nephew, the glory of a Vernon or a Rodney. The Diomede had\nreceived sailing orders; Lord Robert, in high spirits, and joyful\nexpectation of future triumphs, was in one of his happiest humours, when\na boat from a tender came alongside the Diomede, with a supply of\npressed men to recruit the ship's company.\n\n\"Summers, are you ill?\" asked a young officer, with whom Lord Robert was\ngaily conversing; when a sudden alteration became observable in his\nvoice and manner, and his cheek was overspread with a deadly paleness.\nLord Robert did not hear him, being wholly occupied in watching the\nprogress of a young sailor up the ship's side.\n\nLieutenant Cary repeated the question, but received no answer; and,\nsupposing that Lord Robert was troubled with one of his occasional fits\nof patrician haughtiness, and being to the full as high-spirited as\nhimself, left him to his contemplations. These were of no pleasant\nnature; for though emaciated, ragged, and dirty, and in many respects\ndifferent from the handsome youth he had lately seen, the young sailor\n(who by this time stood on the deck of the Diomede) was Philip Harley!\nHe now felt that his dislike and abhorrence had arisen to a more\nintolerable degree than ever; he fretted at the perverse accident that\nhad thrown this hated object in his way, and actually proceeded some\npaces to request his uncle to remove Philip Harley from the ship; but\nthen he recollected that he should most likely be forced to enter into\nparticulars that he detested to recall, besides giving his enemy reason\nto suppose that the presence or absence of so abject a creature could\nbe of the least consequence to him.\n\n\"No,\" said he to himself, \"let him remain; he will, in the discipline of\na man-of-war, be cured perhaps of his audacity, and learn submission to\nproper authority.\" This was the result of Lord Robert's debate with\nhimself. At first, he had been a little touched by Philip's pale and\naltered countenance; but, on a second glance, he found his enemy had\nrecognised him, and returned his glance with a look so full of reproach\nand contempt, that Lord Robert vowed within himself that his haughty\nspirit should be broken.\n\nAlas, for Philip! he needed no worse enemy than himself. Instead of a\nmanly resignation to what he knew was unavoidable, and a determination\nto perform his duties so well as to gain respect from the crew--instead\nof pursuing this course, which would have partly defeated the hatred of\nhis enemy,--he continued so sullen and contrary, that no means, whether\ngood or bad, could bring him out of his fits of obstinacy. There needed\nno interference of Lord Robert's to bring on him the most severe and\ncruel punishments. But no bodily pain could subdue Philip; disgrace and\nsuffering only rendered him furious and desperate; and he was considered\nmutinous and ungovernable to such a degree, that he passed the first\nthree months of a seafaring life in a succession of confinement and\npunishment.\n\nHad young Harley, instead of such headstrong conduct, exerted his real\nabilities as a seaman, applied himself to his profession, and shown his\nofficers and commanders, that, though a mere youth, he could hand, reef,\nand steer, as well as the most experienced seaman,--and this, added to\nthe sober and moral conduct natural to him, with an education and\nmanners far above his station in life, joined to a stout and active\nbody, and undaunted courage;--these qualifications would have created\nrespect in every one, and in no one more than his just and upright\ncommander; and his persecutor must have exposed his motives before he\ncould have injured him: _now_ he was fully in his power, and Lord Robert\nvowed that he should most submissively implore his pardon for all his\ntransgressions, before he should find any mercy.\n\n\"I can't tell what to make of that lad,\" said Lieutenant Cary to Lord\nRobert, as the boatswain was untying Harley from a gun, where he had\nborne, with Spartan firmness, the infliction of a cruel punishment,\nwhich his wilful disobedience had brought on him: \"he neither drinks nor\nswears, nor associates with the more dissolute part of the crew: but we\nhave more trouble with him than with the most abandoned reprobate. Yet\nhe seems to me to be meant for better things.\"\n\nCary said this as a sort of encouragement to the unfortunate youth,\nwhose manly endurance of extreme suffering had touched his heart.\n\n\"Oh!\" returned Lord Robert, with a contemptuous laugh, \"mutiny and\ndisobedience are nothing new to this fellow; his conduct at sea only\nmatches his behaviour on land--he was always what you now see him!\"\n\n\"'Tis false! _You_ have made me what I am,\" said Philip, with a\nwithering look.\n\n\"False!\" exclaimed Lord Robert, striking Philip as he spoke.\n\n\"Yes, oppressor, false!\" repeated Philip, returning the blow.\n\nCary, from a principle of humanity, tried to stay his arm; but Philip\nwas too quick for him. \"Madman!\" said he, in a tone of regret, \"you have\nforfeited your life!\"\n\n\"Then let him take it if he will! Thank God, it will be the last injury\nhe can do me!\" said Philip, resigning his hands with composure to the\nfetters with which he was immediately bound.\n\nHarley was considered on board ship so desperate a mutineer, that it was\njudged necessary to chain him down to the deck, lest, in his fits of\nrage, as he seemed so careless of his own life, he should set fire to\nthe vessel, and destroy himself and the ship's company together. Here,\nthen, exposed to the sun by day and the dews by night, with less liberty\nthan the savage beast, the wretched youth awaited the certain fate to\nwhich, on their arrival in the first port, the laws of war would doom\nhim, for striking an officer on duty.\n\nAt this period, the ship and her convoy were approaching the coast of\nBrazil; they had hitherto enjoyed a prosperous voyage, with fair winds\nand weather, and a healthy passage. The Diomede was destined to convoy a\nfleet of merchant-ships bound for the Portuguese settlement of Rio de\nJaneiro. Before they neared the Brazilian shore, they descried a sail,\nwhich proved to be a French man-of-war, of nearly equal strength with\ntheir own. Scarcely had the Diomede recognised her for an enemy, before\nanother sail appeared, which was soon known to be her consort. These\nships had been stationed to intercept our richly-freighted merchantmen.\nThe defenceless merchant-ships dispersed in every direction, leaving the\nvaliant Diomede to bear the thunders of the unequal combat. This\nengagement was a fortunate circumstance for the unhappy Harley. I\nbelieve it is a usual thing for seamen under confinement for mutiny to\nbe released before an engagement: however this may be, Philip was set at\nliberty, by the orders of the Captain.\n\nLieutenant Cary was the officer appointed to set him free. \"Harley,\"\nsaid he, \"you have shown a bold spirit in a bad cause; let us now see\nwhat you can do for your country. It will be my duty to head the\nboarding-party. Let me see you near me!\"\n\n\"You _shall_ see me near you!\" said young Harley, grasping the cutlass\nwhich Cary put into his hand: \"I would do much for you! You are the only\nman who has felt for me as a fellow-creature since I was torn from my\nhome.\"\n\nBy this time the decks were cleared; and, everything being prepared for\naction on both sides, the Frenchmen approached pretty close. During the\nawful pause, while this unequal force bore down upon them, perhaps even\nsome of the boldest hearts felt a chill of anxiety; for they were not\nfighting now for wealth or conquest, but for life, liberty, and the\nhonour of their flag,--that flag which they had borne in triumph round\nhalf the world, and which had never yet been lowered to a foe. True, the\nodds against them were tremendous; but they were British seamen, and\nwould not doubt the result. Yet there was the heart of one amongst them\nthat throbbed high with desperate ardour for the combat, with the hope\nof redeeming disgrace, and showing that he was worthy a better fate than\nthe death of a felon.\n\nThe engagement was long and sanguinary; but British valour at length\nprevailed, and the French ships were forced to sheer off in a shattered\ncondition, leaving the Diomede little better than a wreck on the mid\nocean. The retreat of the enemy was, however, a glorious and hard-earned\ntriumph; and the brave officers and crew of the Diomede were conscious\nof having performed their duty, and protected the charge committed to\ntheir care by their country.\n\nAfter matters were a little set to rights on deck, and the officers had\nassembled round their gallant Captain, to congratulate him on the\nretreat of the enemy, Sir Henry Stanley ordered the young mutineer to be\nbrought before him. Philip made his appearance, pale and bleeding, but\nwith a determined countenance.\n\n\"Young man,\" said Sir Henry, \"you have done your duty to-day. I have to\nthank you for twice saving the life of my friend, Lieutenant Cary: he\nspeaks highly of your conduct in boarding. Your offences are\nforgiven--you may return to your duty; and, I hope, from this day, your\nconduct will be as remarkable for obedience, as it has before been the\nreverse.\"\n\nPhilip raised his eyes to his commander's face, and reading there an\nexpression of manly pity and candour, he was so completely softened by\nconduct which he little expected from Lord Robert's uncle, that he said,\nwith tears, he had acted wrong, and would spend his best blood, or even\nhis life, if required, to amend his fault.\n\n\"Then,\" said Sir Henry, \"ask pardon of Lord Robert Summers for the\noutrage you have committed, and all will be well, if you persevere in\nyour good resolutions.\"\n\n\"I will ask _your_ pardon, Sir Henry, on my knees, for having rebelled\nagainst so good and gracious a commander, and for having struck one of\n_your_ officers; but I cannot ask forgiveness of Lord Robert Summers,\nsince he was the first to injure me, long before I saw this ship.\"\n\nLord Robert, who stood by his uncle's side, gave him a disdainful look;\nPhilip's eyes answered scorn with scorn.\n\n\"No conditions, sir!\" said his captain; \"they don't become you. But pray\nhow has my nephew injured you?\"\n\n\"Lord Robert can inform you,\" said Philip.\n\n\"I perceive,\" said Sir Henry, \"there has been some misunderstanding\nbetween you and my nephew, before you came on board the Diomede; but\nthis is no excuse for your uniformly rebellious conduct. Had you done\nyour duty as a British sailor, you would have met with encouragement and\nmild treatment. My nephew, dear as he is to me, could not have\ninfluenced me to commit an act of injustice against any individual of my\nship's company. Go, and get your hurts examined; and let me have reason\nto praise your future conduct.\"\n\nPhilip bowed to his commander with gratitude and respect, and retired.\n\nIt is certain that \"misfortunes never come alone.\" Scarcely had the\nconvoy re-assembled, and the Diomede repaired some of the injuries she\nhad sustained in the action, when a furious gale sprang up, and\nthreatened the most mischievous consequences to the ship, in her\nshattered condition.\n\nTowards midnight, the ship sprang so much water, that all hands were\nobliged to spell the pumps. About two in the morning, the wind lulled,\nand they flattered themselves that the gale was breaking. Soon after,\nthere was much thunder and lightning, with rain; when it began to blow\nstrong in gusts of wind, which obliged them to haul up the main-sail,\nthe ship being then under bare poles. This was scarcely done, when a\ngust of wind, exceeding everything of the kind they had ever any\nconception of, laid the ship on her beam-ends. The water forsook the\nhold and appeared between the decks, so as to fill the men's hammocks\nto leeward; the ship lay motionless, and to all appearance irrecoverably\noverset. The water increasing fast, the captain gave directions to cut\naway the main and mizen masts,[1] hoping, when the ship righted, to wear\nher. The mizen-mast went first, without the smallest effect on the ship.\nThe main-mast followed; and they had the mortification to see the\nforemast and bow-sprit follow also. The ship, upon this, immediately\nrighted, but with great violence; and the motion was so quick, that it\nwas difficult for the people to work the pumps.\n\n[Footnote 1: Cutting away the mast is nobly described by poor Falconer.\n\n    \"'Haste, with your weapons cut the shrouds and stay,\n      And hew at once the mizen-mast away!'\n      He said: the attentive sailors on each side,\n      At his command the trembling cords divide.\n      Fast by the fated pine bold Rodmond stands,\n      Th' impatient axe hung gleaming in his hands:\n      Brandish'd on high, it fell with dreadful sound:\n      The tall mast groaning, felt the deadly wound.\"\n\n_Shipwreck._]\n\nEvery moveable was destroyed, either by the shot thrown loose from the\nlockers, or from the wreck of the deck. The masts had not been over the\nside ten minutes, before the tiller broke short in the rudder-head; and\nbefore the checks could be placed, the rudder itself was gone. Thus they\nwere as much disastered as possible, lying at the mercy of the wind.\nThese circumstances appeared sufficiently alarming; but upon opening the\nafter-hold, to get up some rum for the people, they found their\ncondition much more so in reality.\n\nIt will be necessary to mention, that the ship's hold was enclosed by a\nbulk-head at the after-part of the well.[2] Here were all the dry\nprovisions, and the ship's rum, stowed upon ten chaldrons of coal,\nwhich, unfortunately, had been started in this part of the ship, and by\nthem the pumps were continually choked. At this time it was observed\nthat the water had not a passage to the well; all the rum (twenty-six\npuncheons), all the provisions in casks, were stove; having floated with\nviolence from side to side, until there was not a whole cask remaining:\neven the staves, that were found upon clearing the hold, were most of\nthem broken in two or three pieces. In the fore-hold they had the\nprospect of perishing. Should the ship swim, they had no water but what\nremained in the ground tier; and over this all the wet provisions in\nbarrels were floating, with so much motion, that no man could go into\nthe hold without the risk of his life. There was nothing left, but to\ntry baling with buckets at the fore-hatchway and fish-room; and twelve\nlarge canvas buckets were immediately employed in each. On opening the\nfish-room, they were so fortunate as to discover that two puncheons of\nrum had escaped. They were immediately got up, and served out in drams;\nand had it not been for this relief, and some lime-juice, the people\nwould have dropped.\n\n[Footnote 2: The well is an apartment in a ship's hold, serving to\nenclose the pumps. It is sounded by dropping a measured iron rod down\ninto it by a long line; hence the increase or diminution of the leaks is\neasily discovered.\n\n    \"They sound the well, and, terrible to hear,\n     Five feet immersed along the line appear;\n     At either pump they ply the clanking brake,\n     And turn by turn the ungrateful office take.\"\n\nFALCONER'S _Shipwreck_.]\n\nThey soon found their account in baling: a spare pump had been put down\nthe fore-hatchway, and a pump shifted to the fish-room; but the motion\nof the ship had washed the coals so small, that they had reached every\npart of the ship, and these pumps were soon choked. However, the water\nby noon had considerably diminished by working the buckets; but there\nappeared no prospect of saving the ship, if the gale continued. The\nlabour was too great to hold out without water, yet the people worked\nwithout a murmur, and, indeed, with cheerfulness. But their sufferings\nfor want of water were very great, and many of them could not be\nrestrained from drinking salt water. They fired many guns of distress,\nin hopes some of the merchant-ships might approach and give them some\nsupply; but on the beginning of the storm they had run before the wind,\nand made some port on the coast of Brazil,--an example which the Diomede\nwould have been glad to follow before the hurricane began, but her\ncrippled state from the engagement rendered this impossible.\n\nTowards morning, some of the most resolute of the seamen, rendered\ndesperate by thirst, went down into the hold, and found a whole\nwater-cask, which they contrived to heave up, and it afforded a\nseasonable relief.\n\nAll the officers and boys, who were not of the profession of seamen, had\nbeen employed that night in thrumming a sail, which was passed under\nthe ship's bottom with good effect. The spars were raised for the\nforemast; the weather looked promising, and they had the prospect of a\nfine day;--it proved so; and they were determined to make use of it,\nwith every possible exertion. The captain divided the ship's company,\nwith the officers attending them, into parties, to raise the jury\nforemast, to heave overboard the lower deck guns,[3] to clear the wrecks\nof the fore and after holds, to prepare a machine for steering the ship,\nand to work the pumps. By night, as the leak was stopped, the after-hold\nwas quite clear, ten chaldrons of coals having been baled out since the\ncommencement of the gale.\n\n[Footnote 3:\n\n    \"While on the quivering deck, from van to rear,\n     Broad surges roll in terrible career,\n     Rodmond, Arion, and a chosen crew,\n     This office in the face of death pursue.\n     The wheel'd artillery o'er the deck to guide,\n     Rodmond descending, claim'd the weather side.\n     Fearless of heart, the chief his orders gave,\n     Fronting the rude attacks of every wave.\n     Meantime Arion traversing the waist,             }\n     The cordage of the leeward guns embraced,        }\n     And pointed crows beneath the metal placed.      }\n     Watching the roll, their forelocks they withdrew,\n     And from their beds the reeling cannon threw.\n     Then from the windward battlements unbound,\n     Rodmond's associates wheel'd the artillery round;\n     Then, hurl'd from sounding hinges o'er the side,\n     Thundering they plunge into the flashing tide.\"\n\nFALCONER'S _Shipwreck_.]\n\nThe standards of the cockpit, an immense quantity of staves and wood,\nand part of the lining of the ship, were thrown overboard, that, if the\nwater should appear again in the hold, they might have no impediment in\nbaling.\n\nThe Diomede, in this condition, exhibited a scene seldom witnessed,--a\nline-of-battle ship without masts or rudder, a mere shell in the midst\nof the ocean. The casks of all sorts, floating from side to side, were\nstove, and the magazines and store-rooms of every kind washed down.\n\nBy nightfall the foremast was secured, and the machine for steering\nfixed; so that, if the moderate weather continued, they were in hopes of\nsteering the ship, the following day, for the coast of Brazil--the\nviolence of the wind having driven them far out of their course.\n\nDuring this time of peril and hardship, Sir Henry Stanley could not help\nobserving with satisfaction the altered conduct of young Harley, who was\nso active, enterprising, and courageous, that no difficulty could\novercome him, and no hardship make him complain. He seemed to think the\nbenign looks of Sir Henry Stanley, ever bent with peculiar complacency\non those who performed their duties with manly firmness, were a reward\nfor the most painful exertions. All the officers, indeed, noticed the\naltered conduct of the young mutineer: no traces remained of his former\nrebellion, except that of his returning the haughty glances of Lord\nRobert Summers with equal fierceness, when they chanced to meet in the\nperformance of their arduous duties. But nothing could induce him to\nreturn the taunts this young officer sometimes bestowed on him with\ndisrespectful language. Depending on the justice of his captain, he bore\nall in unmoved silence; indeed, his Lordship (who considered Philip as\ntoo much his inferior to give him the opportunity of joining in a\nwarfare of words) never condescended to address any provoking speeches\n_to_ him, but always _at_ him. One would have thought that such\nfrightful circumstances would have tamed the haughtiest minds; but they\nboth required still severer trials to wring the black spot from their\nhearts.\n\nThe ship, in this perilous state, was in the middle of the great\nAtlantic, nearly under the equinoctial line, with the water-casks beat\nto pieces, and most of the provisions spoiled; so that if, by especial\nprovidence, the ship should swim, so as to reach a port on the Brazilian\ncoast, the crew would suffer the most cruel hardships from\nthirst--painful at all times, but intolerable in these burning\nlatitudes. In this dilemma, some of the people descried land; and they\nhoped it was one of those small islands on which the Portuguese have\nlittle settlements to supply their ships, which trade to Africa, with\nwater and needful refreshments. This island, like those of St. Helena\nand Ascension, appeared rocky and volcanic; but there were good hopes\nthat springs of water might be discovered on it, if any of the crew\ncould be found enterprising enough to effect a landing, with such a sea,\nand on such a coast; for, though the gale had lulled, the breakers were\nfuriously high on the shore.\n\nLord Robert Summers, daring and ardent, and much preferring danger to\nthe lingering agonies of thirst, volunteered to command a boat, if any\nof the crew would venture themselves under his guidance. Three of the\nmost experienced seamen offered to man the boat; but five hands were\nindispensable. His Lordship said that he himself would steer the boat,\nif one more seaman would venture. Philip Harley volunteered his\nassistance. \"Any one but him!\" muttered Lord Robert between his shut\nteeth, incensed that Philip should show that his courage was equal to\nhis own: however, as his services were offered for the public good, he\nthought proper, although very unwillingly and ungraciously, to accept\nthem, and the boat was lowered. Sir Henry Stanley bade adieu to his\ngallant nephew with pain; but he did not attempt to withhold him, dear\nas he was, from the benefit he was proposing to render the ship's\ncompany. When the boat got among the breakers, the prospect of landing\nappeared so hazardous, that one of the oldest of the seamen, who rowed\nthe boat, proposed returning to the ship. Lord Robert, considering\nhimself accountable for the lives of the men under his care, would not\ninsist on their continuing their efforts, but said:\n\n\"My brave fellows! If the attempt seem to you hopeless, I will not urge\nyou to continue it; but if my single life only were at stake I would\nwillingly risk it to obtain a supply of water for our famishing\ncompanions.\"\n\nThe sailors then determined to persevere, their recent sufferings from\nthirst being fresh in their minds. At length, by a desperate effort,\nthey gained the shore, and landed their water-casks. They soon found a\npure spring, which gushed from a rocky hill at some little distance from\nthe shore: there was a large wooden cross erected on an eminence, at the\nspring head; but they found no Portuguese guard at the spring, which is\nusual in a settlement in those latitudes; so they presumed the island\nwas uninhabited. The land seemed barren, rocky, and desolate; but, after\nsome research, they found, in a sheltered valley, a few fine lime and\ncocoa-nut trees, which had evidently been planted by some beneficent\nnavigator. Gathering cocoa-nuts is no very easy operation, as they\nadhere in close bunches to the crown of the tree by tough ligaments; but\nas young Harley had brought his axe and saw to cut wood for firing, he\nclimbed the trees, while his comrades were filling the water-casks, and\nexpeditiously obtained a good number, both of limes and cocoa-nuts,\nwhich he considered would be an acceptable refreshment to his exhausted\ncompanions on board the Diomede.\n\nWhile they were thus employed, Lord Robert hailed them from the beach,\nwhere he remained to watch the boat.\n\n\"Come, my lads!\" said he, \"the gale freshens every minute; let us get\nafloat, or we shall scarcely reach the ship before nightfall.\"\n\nThe sailors hurried the water-casks and store of fruit into the boat,\nand launched her among the breakers. With infinite toil, they got out of\nthe surf with safety, as the wind now blew off the shore; but the\nfurious gusts came every moment with increasing strength; and, at last,\na surge rose with such overwhelming violence, that, in spite of all\ntheir efforts, the boat upset, and her unhappy crew were engulfed in the\nroaring waters. Their fate was beheld from the ship; but no aid could be\ngiven, as the renewed hurricane had rendered her state more deplorable\nthan ever: she was driven before the wind, and soon lost sight of this\nfatal island.\n\nSome of the boat's crew struggled a little time with the waves; but\nthree of them were old men, and had been exhausted by the fatigues they\nhad lately undergone. These speedily sank; but Lord Robert, being young\nand robust, strove hard for life, and at length gained the shore, almost\nexhausted by his contentions with the surfy breakers. When he had a\nlittle recovered his breath, he climbed the hill on which the cross was\nerected, and gazed towards the ship, which he saw driving before the\nwind, surrounded by foaming billows, and with every appearance of\nspeedily sharing the fate he had so lately escaped. Wholly occupied in\nthe thoughts of the revered friend that ship contained, he forgot his\nown desolate state, till the last appearance of the ship vanished, and\nhe found himself alone.\n\nOppressed with sad thoughts, he turned himself from the contemplation of\nthe wrathful ocean, now blackening with the sudden night of the torrid\nzone, and after a little search, found a low arch in the rock, which was\nthe entrance to a natural hollow in its side. Into this place he crept,\nto shelter himself from the inclemency of the storm, which increased\nwith tenfold fury after sunset.\n\nIn this situation he passed the night which succeeded this dismal day.\nIt was a night of peculiar horror--tempestuous, dark, and rainy; and\nLord Robert, though in a state of complete exhaustion, found that, in\nhis late struggle with the breakers, he had received so many bruises,\nthat to sleep was impossible. At intervals, as the lightning gleamed on\nthe stormy expanse of waters before him, he thought how many of his\nbrave companions, in all probability, slept beneath its roaring waves;\nand at that moment, instead of returning thanks to Heaven for his own\npreservation, he felt inclined to envy his comrades. To be entirely shut\nout from all intercourse with his fellow-creatures, never again to hear\nthe sound of a human voice, and to be condemned, in the very bloom of\nyouth, to pine away existence in that desolate place, far from every\nfriend, appeared a doom so dreadful, that he was insensibly led to\nreflect for what crime so heavy a punishment could have befallen him.\n\nConscience, which sometimes sleeps, but never dies, did not fail, in\nthis awful hour, to recall to his memory the cruelty and injustice of\nhis conduct to Philip Harley: and when he reflected that, to gratify his\nimperious disposition and implacable spirit of revenge, the poor lad had\nbeen dragged from his peaceful home, his honest employment, and his\naffectionate parents, to endure a series of hardships and perils, and\nthat he had finally suffered an untimely death,--this thought gave him\nso keen a pang of remorse, that, as if he expected from change of place\nto escape from memory, he started from his rocky pillow, and, as the day\nwas now beginning to dawn, proceeded to the beach, to ascertain whether\nany of his friends from the ship had been so fortunate as to gain the\nshore; for, he remembered, his uncle had given orders to have the\npinnace and yawl in readiness, in case the ship's situation should\nbecome desperate, that an attempt might be made to preserve the lives of\npart of the crew.\n\nFor some time, he pursued his melancholy walk, interrupted only by the\ndismal sight of pieces of wreck, which the impetuous waves from time to\ntime dashed at his feet. The sea now running in high tide on the shore,\ninspired him with the hope of seeing the pinnace and boats, or rafts\nfrom the wreck; and that some, at least, of the ship's company might be\nso fortunate as to reach the island with life. The sun, rising brightly\nover the stormy ocean, discovered something struggling with the waves at\nno great distance. Lord Robert felt the most agonizing sensations at the\nidea that it was out of his power to render any assistance. All he could\ndo was to wave his handkerchief, from the little rocky promontory on\nwhich he stood, and to shout with all his strength, to encourage him in\nhis efforts. At that moment, a tremendous wave engulfed the object of\nhis solicitude,--it sank, and his heart sank with it;--again it rose and\nneared the shore;--but its efforts grew fainter and fainter;--and Lord\nRobert, fearing that its strength would fail, though so near the shore,\nregardless of his own safety, dashed through the breakers to render his\nassistance, cheering as he did so. At the sound of his voice, the poor\ncreature appeared to recover his strength, and, struggling through the\nbreakers, sprang towards him with a joyful cry.\n\n\"Ah, my poor Neptune! Is it you?\" exclaimed Lord Robert, with mingled\nanguish and pleasure, as he threw his arms round the faithful animal,\nand gave vent to his feelings with a burst of tears. \"Yes!\" said he, as\nhe threw himself on the beach in bitter sorrow, \"the Diomede must indeed\nhave foundered, or my kind, my benevolent uncle, would never have\ncommitted this old memorial of his lost nephew to the mercy of the\nwaves, for the sake of lightening the vessel, or saving the morsel of\nfood he would have consumed.\" But again remembering the chance that some\nof the crew might be saved by the pinnace, and condemning the indulgence\nof his grief, he rose, and, dripping as he was, pursued his search,\nattended by his faithful Neptune, who bounded round him with joyful\naffection. In the course of his walk, he found some limes and cocoa-nuts\nscattered on the beach; and, yielding to the painful thirst that\nconsumed him, he raised one of the limes to his parched lips, when he\nrecollected that they were some of the fruit young Harley had gathered,\nand was carrying to the ship at the time the boat was upset, and the\nunfortunate youth had been buried in the waves. This thought recalled\nthe bitter reflections he had with difficulty succeeded in banishing\nfrom his mind; and when he remembered that, though he had not been the\nimmediate, he had certainly been the ultimate cause of his death, he\nsickened at the thought, and casting the untasted fruit from him, he\nsaid, \"No; I cannot eat these!\" Proceeding on his walk, he gained the\nspot where he had landed with his unfortunate companions the day\nbefore. He sighed deeply as he passed it; and, doubling a projection of\nrock, he discovered the pinnace, floating bottom upwards close in shore.\nAt that sight, the most agonizing in the world to the heart of a sailor,\nhe turned away, and wept almost to suffocation. For some moments, he\ncontinued to give way to the grief which oppressed him, till roused from\nthe indulgence of his feelings by a loud and joyful bark from Neptune,\nand, uncovering his eyes, he perceived a young sailor, whose face was\nturned from him, gazing on the pinnace, apparently in as melancholy a\nmood as himself. This doubtless was the only one of her unfortunate crew\nwho had escaped the violence of the waves; and Lord Robert, losing all\ndistinction of rank in the fellowship of misfortune, sprang towards him\nwith open arms, exclaiming, in a voice broken by emotion--\"What cheer,\nmy lad?\" At the sound of his voice, the young man turned slowly round,\nand discovered a face pale with contending feelings--it was Philip\nHarley! For a moment, the two enemies surveyed each other in silence;\neach wondering at the other's preservation; each somewhat softened by\nthe traces of sorrow and suffering in the countenance of the\nother,--but, alas! each mutually yielding to the same stubborn and\nhaughty temper which had so long been the spring of all that was evil in\ntheir separate characters, they surveyed each other with a look of\ndefiance, and walked gloomily away in opposite directions.\n\nLord Robert certainly did feel his heart relieved of half the painful\nemotions which had, for the last ten hours, oppressed it almost to\nbursting; and as he retraced his steps almost instinctively to his\ncheerless chamber in the rock, where he had spent that dreadful night,\nhe exclaimed, \"Thank God, he lives! I am not then his murderer! It is\ntrue, that entire solitude would have been much more agreeable to me,\nthan the idea of breathing the same air with him, and being constantly\nexposed to the chance of meeting him; but that is more than compensated\nby the knowledge that he lives, and is, indeed, no worse off than\nmyself.\"\n\nThus did Lord Robert compose his troubled thoughts, and lull to sleep\nthose better feelings which almost prompted him, at the first sight of\nyoung Harley, to make such advances towards amity, as would have been\npleasing in the sight of God, and even in that of his enemy, whose\nheart, naturally kind and good, had been greatly softened by the awful\ncircumstances under which their last interview had taken place. Besides,\nhe had been an unseen spectator of Lord Robert's manly but acute sorrow,\nwhen he beheld, in the deplorable situation of the pinnace, a\nconfirmation of his worst fears respecting the fate of his uncle and\nfriends. He, too, had been weeping; for he reverenced Sir Henry Stanley,\nand loved Lieutenant Cary; and he was disposed to behold even Lord\nRobert with complacency, for their sakes; for he knew he was very dear\nto them both; and when he saw the agony with which Lord Robert staggered\nforward, on reaching the spot which commanded this melancholy sight, and\nheard his repeated sobs, he felt his hatred towards him so much\ndiminished, that he was forced to recollect all the injuries he had\nreceived from this young officer, before he could sufficiently repel the\ninclination he felt to speak to him in the voice of kindness and\ncomfort. Lord Robert had hitherto appeared to him haughty, rude, and\nunfeeling; and Philip knew not that this spoiled child of prosperity\npossessed at times much sensibility, strong affections, and feelings,\nwhich, had they been properly directed, would have been conducive to the\nhappiness of all around him; instead of which, his unchecked passions\nproduced danger and inconvenience to all who, even unintentionally,\nirritated them, and misery to their unhappy possessor, far beyond what\nhe had ever inflicted on others.\n\nBut Philip was in many respects too like his adversary in character; and\nhe never took the trouble of asking his own heart, if he were not\nsometimes to blame, as well as his high-born enemy. If Lord Robert was\nhaughty, Philip was insolent; if one was hasty in giving a provocation,\nthe other was still more so in retaliating. Had Philip for one moment\nremembered that most divine maxim of holy writ, \"A soft answer turneth\naway wrath,\" and had he been sufficiently of a Christian disposition to\npractise it in _one_ instance only, Lord Robert would have been\nappeased; and what mischief might have been spared, what suffering\navoided, on one side! and what painful remorse on the other! When Philip\nbeheld Lord Robert's tears, his first emotion was surprise; and he said\nto himself, \"Can he weep? _he_ that is so hard-hearted and proud!\" and\nthen the thought occurred to him, \"Perhaps his heart is not so very hard\nas I have reason to believe?\" Philip was not uncandid; and he remembered\nthen, that he had often thrown himself in Lord Robert's way, and\ncommitted many outrages, on purpose to provoke him. For the first time\nin his life, he put himself in his Lordship's place, and asked his own\nheart, whether he were sure, under such circumstances, that he should\nhave acted better? But Philip was not yet sufficiently acquainted with\nthe faults of his own character, to see that he had been almost equally\nblameable; and though, perhaps, he would not have refused to forgive, he\nhad no idea that _he too_ required to be forgiven, if not by his erring\nfellow-creature, at least by his heavenly Father. Had _this_ occurred to\nhim, he would not have renewed their suspended enmity, by being the\nfirst to assume a look of defiance, while Lord Robert was undecided what\ncourse to pursue: but the favourable moment was unfortunately lost; for\nLord Robert returned the glance with equal disdain, and they were as\nmuch at variance as before.\n\nLord Robert had returned to the cleft in the rock, and thrown himself at\nfull length, lost in unpleasant and bitter reflections for some hours,\nbefore the cravings of hunger reminded him that it was necessary to make\nsome exertion for the preservation of that life which Heaven had spared;\nbut perhaps he would, in his gloomy frame of mind, have disregarded his\nown wants, and remained obstinate in his self-neglect, had not the mute\nappeals of his faithful Neptune roused him from inertion. Neptune was a\nfine water-dog, a present from his elder brother at parting; and Lord\nRobert, who had long desired to possess this animal, treated him with\nthe most unbounded affection; and always suffered him to share every\nmeal with him, and even divided with him his share of food and water\nduring their late dreadful privations; and Neptune, who had not tasted\nfood for many hours, continued to put his paws on his master's knees,\nand to survey him with a wishful look, till Lord Robert rose, and left\nthe cave in search of something to satisfy his cravings. Amongst his\nother troubles, he had little fear of perishing by famine; for he knew,\nby the latitude he was in, that he should most likely find turtle, or\nturtles' eggs, on the beach. In fact, while he was listlessly pacing the\nshore, thinking of anything rather than the object of his search,\nNeptune, who was not quite so uninterested, pounced on something in a\nhole in the sand, which proved to be a fine turtle. His master soon\nkilled it, and satisfied the hunger of his humble friend with part of\nthe flesh; and then, in a more leisurely manner, set about collecting\npieces of wreck to make a fire; but, alas! he was wholly unpractised in\nthe sleight of striking a few sparks to kindle a flame. It is true, he\nknew how they were to be procured, and soon found a flint proper for the\npurpose: but in striking it with the back of his knife, he only rubbed\nthe skin off his hands, and bruised his knuckles, without producing the\ndesired effect; or, if he did elicit a few sparks, they died away for\nwant of proper kindling. This put him in a passion, and he redoubled his\nviolence till he broke the flint into a thousand pieces; and sat down in\na very ill humour, looking at his pile of wood and his raw turtle with\nmuch discontent. At last he recollected, that if he could not cook his\nturtle, he could quench his thirst at the clear spring they had\ndiscovered on their first landing: this he soon found, and was much\nrefreshed by a draught from it. At a small distance, within view of the\nspring, he saw the little grove of limes and cocoas in the valley; there\nhe beheld, with some little envy, a bright blazing fire, near which\nPhilip was employed cooking his supper. He hastily avoided the spot, and\nreturned to the beach, where he found in the sand some turtles' eggs,\nwhich he could eat raw, and with them satisfied the calls of hunger. He\nthen lay down on his flinty couch, with Neptune for a pillow; and, being\ncompletely exhausted by fatigue, notwithstanding his distress and\ndiscontent, sank into a profound sleep.\n\nThe next morning saw him still perplexed with those minor difficulties.\nFor though he could bear, with heroic self-denial, the hardships\nincidental to his profession, and had not taken a morsel more food, or a\ndrop more water, in their late distress on board ship, than any other of\nthe suffering crew, and had even shared his scanty morsel with his\nfamishing dog, this he _could_ do, for he felt there was something noble\nand refined in such conduct; but he felt sadly irritated at being thrown\non his own resources in the little common everyday necessaries of life.\nFrom his infancy, he had been surrounded by servants, who were\naccustomed to perform for him the most minute services, so that at\nseventeen his Lordship (though a valiant officer, and perfect in his\nprofessional duties,) was ignorant of many things very necessary for\nevery one to know; and if he was acquainted with the methods resorted to\nin many situations, he was at least very awkward in his attempts of\nputting them into practice. However, on this occasion, making use of his\nown good sense, after a little calm reflection, he collected from the\nsides of the rock some dry grey moss, and, drawing some rays from the\nsun in the focus of a little perspective glass he had in his pocket, he\nsoon set his pile of wood in a blaze, and cooked sufficient turtle to\nfeed him for a day or two.\n\nHe had scarcely completed this employment, when the sun, which had for\ndays been shaded by tempestuous clouds, broke forth with its usual\nsplendour; and there was promise of a continuance of that sultry weather\nso seldom interrupted in these latitudes. Lord Robert, when he felt the\nsun beat on his uncovered temples, fled for shelter to his cave, which\nhe found nearly of the same temperature as an oven half heated. Panting\nfor breath, he remembered the grove, of which Philip had taken\npossession, and bent his steps towards it; but he found that this spot\nof verdure did not consist of more than a rood of land; and he did not\nchoose to be so near young Harley as the farthest extremity of its\nshelter. So he remained on the burning beach, or under the shade of some\narid rock, during the day, determining to make a tour of the island in\nthe cool of the evening, and hoping to fix his residence in some shady\nvale similar to Philip's territories. But how can his disappointment be\nexpressed, when, after a most fatiguing walk, all the good he gained was\na knowledge of the extent of his prison? He had in vain searched for a\ngrove; barren rocks and burning sands alone met his sight: at last, he\nclimbed a conical hill, which towered above the other rocks, and which,\nfrom his geological knowledge, he was certain contained the exhausted\ncrater of a volcano. Here he had a view of every nook of the island,\nwhich was of the extent of about five miles, and presented a prospect of\none pile of horrid rocks heaped on another, without one spot of\nfertility, except Philip's little cluster of trees, whose bright verdure\nformed a refreshing contrast to the burning rocks, which seemed yet to\nglow with the intense heat that had been poured on them through the\nday. As he fixed his eyes wistfully on this favoured spot, and saw the\nsmoke of Philip's evening fire curling above the trees, he exclaimed,\n\"Yes; I must, though most reluctantly, share this only habitable place\nwith him; for such a day as the last I cannot endure again. Doubtless,\nthis grove was planted by some benevolent navigator (such as I have\noften read of) on the soil formed by the accidental residence of\nsea-birds; and the grass and trees[4] have gradually spread over a small\nextent of land. Surely, as it was meant for universal benefit, I have a\nright to a share of it.\" So saying, he descended the hill, and after a\ntoilsome walk arrived at the grove after nightfall, where he enjoyed the\nluxury of stretching his aching limbs on the soft grass, under the\nfragrant shade of a lime-tree, and slept soundly till after sunrise. He\nawoke in the morning with the cheerful sound of a human voice singing,\nand on opening his eyes, saw Philip Harley, a few paces from him, busy\nat work. He was astonished to see the progress his enemy had made in\nforming himself a habitation; for he had got very forward in the\nframe-work of a neat hut, and was now boarding it in with planks, which\nhe had collected on the beach, singing as he knocked in every nail. This\nhut was situated among the thickest cluster of trees, directly under a\nfine young vine, the only one in the island; and as Philip roofed his\nhut, he carefully trained the rich branches all over the dwelling,\ntaking care not to injure the purpling fruit, which was nearly ripe;\nthus giving his hut, as soon as it was finished, the charming appearance\nof a bower.\n\n[Footnote 4: The progress of vegetation is very curious in those\nislands, which are supposed by geologists to be thrown up from the\nbottom of the sea by volcanoes, or formed by the unceasing labours of\nthe coral animalculi. These generally present at first a rocky surface,\nbarren and arid. By degrees, a little soil is deposited by sea-fowl and\nbirds of passage; on this at first grow the seeds of some of those\nminute plants, which are literally carried on the wings of the wind from\ncountries that appear too far distant for any such conveyance. These\nplants flourish, fade, and are renewed by the seasons, until from their\ndecayed parts is formed that fine vegetable mould which overspreads the\nmore fertile surface of the earth. When this process is begun, if the\nland receives from the hand of some benevolent discoverer a few seeds of\ntrees or plants to which the climate is congenial, the work of\nfertilization is rapidly accelerated; grass grows luxuriantly under the\nshade of the trees: verdure increases, and creeps farther and farther,\ntill from one little spot, an oasis in the midst of a desert, the whole\nisland becomes fruitful.]\n\nOvercome by the heat of the climate, Lord Robert lay for a day or two\nwholly inactive, stretched beneath his lime-tree, amusing himself with\nplaying with Neptune, or when he thought he was unperceived, watching\nthe progress of his enemy's work, but not condescending to address one\nword to him; who, on his part, preserved the same sullen silence. Lord\nRobert could not help wondering how Harley came by the saw and hatchet\nwhich he handled with so much adroitness; but he would not condescend to\nask him. The fact was, that when Philip and the sailors were called away\nfrom gathering the cocoas, Philip, in his hurry had left the saw and\nhatchet at the foot of the tree; and there he found them when he\nregained the land. Possessed of these treasures, he made himself a\nhammer of a hollow stone; and, drawing nails out of the wreck, he set to\nwork, and soon completed his hut. But when he proceeded to make a stool\nand table, Lord Robert was moved to some exertion; for he thought, that\nif he could make himself something of the kind to place under his\nlime-tree, he should not regret the hut his adversary seemed so proud\nof; and he was determined to try to construct some such articles of\ncomfort and convenience. He accordingly went to the beach, and soon\ncollected timber, from which he selected pieces with which he meant to\ntry to form a table and three-legged stool. He would willingly have\nworked on the beach, out of the impertinent ken of his enemy: but the\nintolerable heat soon drove him back to the delicious shade of the\ngrove, where a perpetual breeze seemed to play amongst the leaves; and\nthither he reluctantly proceeded, carrying the wood, and followed by\nNeptune. Sorry I am to record, that when Philip saw his haughty enemy\nappear thus laden, he paused in his work with a malicious curiosity to\nsee how Lord Robert would acquit himself in his new employment. The\nfirst thing he did was to tear a bough or two off a tree, meaning to cut\nthree truncheons to form the legs of his stool. It was lignum vit wood,\nextremely hard; and Lord Robert eyed Philip's saw, which just then would\nhave been of great service to him, but he disdained to ask the loan of\nit. So he seated himself on the turf, and began to cut the legs with his\npocket-knife (his only tool) with great difficulty; then he chose from\nthe fragments of wreck a small piece of square wood, and marked with\nhis pencil the holes he designed to make; he then walked, in a very\nstately manner, to Philip's fire, and taking from thence three hot\ncoals, he laid them on his pencilled marks, and kept renewing them till\nthe wood was nearly burnt through; then he scraped through the burnt\nwood, till he had got three holes; into these he knocked his truncheons\nwith a great stone, and placed his stool on the ground to admire his own\ningenuity; but he had knocked one leg more and another less, so that\ntheir lengths were unequal, and down the stool fell. Philip, who had\nseen this defect all the time, was highly diverted at his\ndisappointment, when the stool fell, particularly when he saw how it\nirritated Lord Robert's impatient temper. At last, overcoming his\ninclination to laugh, he said: \"You must shorten the middle leg of your\nstool, or it will never stand;\" at the same time pushing his rule and\nsaw towards his Lordship, who rejected them with great disdain,\nsaying--\"Do you think that I can condescend to learn the low mechanic\nart of a _carpenter_?\" And he laid a most contemptuous stress on the\nword _carpenter_.\n\nPhilip coloured with indignation, as he replied, \"Perhaps your\n_Lordship_ will in a little time see which is of most service in this\nplace, _your_ title, or _my_ useful knowledge.\"\n\nLord Robert haughtily flung back the rule and saw, and began to shorten\nthe leg with his knife. This was a work of time and difficulty: the wood\nwas hard, and the knife unfit for the purpose, and, worse than all, Lord\nRobert was very awkward in his mechanical attempts; but he was unusually\nso in this, for he was in a pet, and he saw that Philip watched him and\nenjoyed his unskilful manoeuvres. This had the effect of enraging and\nconfusing him; and, in his anger, the knife slipped and cut his knuckles\nacross. He glanced at Philip, and saw him smile. This greatly provoked\nhim, and he darted towards his enemy a furious look; but Philip\ncontinued to survey his operations with a calm but sarcastic regard. The\nnext thing Lord Robert did was to set his knife so fast in the wood that\nhe could not move it. Philip smiled again; and Lord Robert, out of all\npatience, used so violent an effort to get it free, that the blade\nsnapped in the middle, and, starting up in a passion, he dashed the\nstool violently against the ground. Philip laughed aloud.\n\n\"Insolent plebeian!\" exclaimed Lord Robert; \"do you presume to insult\nme?\"\n\n\"Lord Robert Summers,\" replied Philip, \"I would advise you to remember,\nthat you are neither in your father's park, nor on the deck of the\nDiomede, where your imperious temper might be feared and indulged: but\nhere we are equals; and any outrage, either of words or actions, shall\nmeet with instant chastisement. I would therefore advise your Lordship\nto be more guarded in your language, for it may be followed by\nconsequences which you may not approve!\"\n\n\"Villain!\" retorted Lord Robert, \"do you forget that I am your\ncommanding officer?\"\n\n\"No!\" returned Philip, becoming greatly agitated as certain\nrecollections crossed his mind; \"no:--you have put it out of my power\never to forget that you were once enabled to gratify your ungenerous\nmalice to the utmost stretch of your power. Basely and cruelly did you\ntrample on me, when you knew that to resist the authority you abused was\nimpossible. I _was_ your victim, but am so no longer! And,\" continued\nhe, advancing very close to Lord Robert, \"beware how you provoke me to\ntake such signal vengeance for all the injuries you have inflicted on\nme, as shall teach your proud heart to rue the hour that ever you made\nPhilip Harley the companion of your voyage!\"\n\nThere was an expression so terrible in Philip's eyes as he spoke these\nwords, that Lord Robert, stout-hearted as he was, (and there never was a\nbraver officer,) changed colour; but in a moment recovering his intrepid\nspirit and haughty bearing, he flashed back a look of defiance, and\nassumed a posture of defence.\n\n\"It is unnecessary,\" said Philip; \"I am not going to attack you. You\nhave in many contests proved the strength of this arm: that it always\nwas superior to yours, I scarcely need remind you. That your late\ninjuries have not unnerved it, you may well believe; but, as long as you\nobserve a temperate line of conduct, and discontinue addressing me by\nopprobrious names, you need not fear its force.\"\n\n\"Fear!\" repeated Lord Robert indignantly: \"I fear God; and have no other\nfear! Dost thou imagine that I fear aught like thee?\"\n\n\"Perhaps not,\" replied Philip; \"but I would advise you not to provoke me\nunnecessarily.\"\n\nSo saying, he retired within his hut, leaving Lord Robert speechless\nwith contending emotions. He was indeed much ruffled by the short but\nfierce altercation which had passed between himself and young Harley;\nand the more so, when he reflected that Philip's bodily strength was\nsuperior to his own, and that his high rank would be of no avail to him\nin this desolate place, as Philip had very unceremoniously told him: and\nas his own conscience whispered that he had formerly offered him the\nmost dreadful provocation, he could scarcely be astonished if Philip,\nnow that he was the more powerful, should meditate retaliation, and\ntake, as he threatened, unbounded vengeance for all that he had suffered\non board the Diomede and elsewhere.\n\nHe was reluctant to abandon this sheltered and beautiful spot; but he\npreferred returning to his dreary cleft in the rock, to residing in the\nvalley, where Philip had erected his dwelling; considering the heat and\nbarrenness of the rest of the island as far less evils than the company\nof Philip, whose very sight, after the threats he had used, was most\nintolerable to him: and Lord Robert felt that he could not bend his\nhaughty spirit to practise the civility and moderation which Philip had\nrecommended, lest this behaviour should be construed into fear of his\nsuperior force. On the other hand, he reflected that if he persisted in\nhis natural imperiousness, so far as to provoke Philip to a personal\ncontest with him, the languor incidental to the climate had so much\nenervated him, that, to maintain a combat with such an adversary as\nyoung Harley had often proved himself to be, with the slightest prospect\nof success, was impossible, and would only expose him to insult and\ncontempt, and perhaps even to more disgraceful treatment, from his\njustly incensed enemy. To avoid such consequences, he judged it most\nsuitable to his dignity to retire; and, whistling to Neptune to follow\nhim, he slowly and sullenly returned to the beach, leaving Philip in\nuninterrupted possession of the Valley of Limes.\n\nThough Philip, still smarting under the remembrance of the many injuries\nhe had received from Lord Robert, had, on the haughty expressions of\ncontempt uttered by that young officer, used threats which were most\nirritating to his proud spirit, he by no means designed to proceed to\npersonal hostilities; for Philip was, in spite of all his faults, too\nreally generous to exert in this instance the advantages his superior\nstrength gave him; and he was far from intending to drive his companion\nin misfortune from the only spot in the island capable of affording him\nany of the comforts of life. In short, he expected that when Lord Robert\nhad vented his displeasure in a solitary walk, he would return to the\nvalley. When Philip's temper cooled, he began to reflect on the luxuries\nLord Robert had been accustomed to from his cradle; he thought how\nseverely his high-born adversary must feel the privations to which he\nwas now exposed; and his heart smote him for having, by his provoking\nridicule, occasioned that ebullition of feeling which had vented itself\nin expressions of wrathful contempt, which he, on his part, (not\nconsidering the provocation was of his own giving,) had been so ready to\nreturn; and that their mutual recriminations had induced him to utter\nmenaces, which had driven his companion in misfortune from an employment\nnecessary even for the preservation of his existence.\n\nOccupied by these thoughts, Philip often paused in his work, and looked\nround to see if Lord Robert had returned to the valley, and listened for\nhis step with anxiety; but he did not come. Night arrived, and Philip\ndid not see him reposing under his favourite lime-tree; and he felt out\nof humour with himself, for being the cause of keeping him away.\n\nFrom some uneasy self-reproaches, he did not taste at night the calm\nrepose which generally follows a day of labour; on the contrary, he felt\nthat evening some of those painful feelings of remorse which had so\noften tortured Lord Robert, but which had never been experienced by\nhimself before; and he now remembered that, though Lord Robert had\nill-treated him, yet there _was_ a difference in their rank, and that it\nwas brutal in him to threaten a high-spirited and elegant young man with\npersonal violence when they were united in the same distress: and that\nLord Robert's contemptuous expressions were caused by his laughter at\nthat which was a serious misfortune to his high-born foe; namely, his\nwant of skill in mechanics, and the mischance of breaking his knife, the\nloss of which was irreparable, and would perhaps deprive him, on some\noccasions, even of the means of procuring food.\n\nPhilip would have repaired to the beach, to see what had become of Lord\nRobert; but he thought it probable that some new cause of offence might\narise between them. However, in the afternoon, he had occasion to visit\nthe beach to search for some pieces of wreck. When he reached the shore,\nhe found there had been a very high tide the preceding night, and many\narticles were scattered on the sand; as staves, pieces of rope, and\nsplinters from the mast. These Philip carefully collected, and placed\nabove high-water mark, lest they should be washed to sea again. In the\ncourse of this important avocation, he approached the cave where Lord\nRobert had again taken up his residence: but he had been too busily\nengaged to think of him, till his eye was attracted by the flash of his\nepaulet in the evening sun; and he saw him, at a little distance,\nbending over some employment, in which he was too much occupied to\nperceive the approach of Philip, who was tempted to draw near enough to\nascertain what it was that so deeply engaged his attention; but he did\nso somewhat cautiously, lest he should again give offence. He soon was\nnear enough to discover that Lord Robert's employment was that of\ndigging a grave in the sand, with a butt-stave, and near him lay the\nbodies of five seamen, which the high tide had washed on shore, close\nto the entrance of Lord Robert's cave. Philip felt a bitter pang as he\ngazed on the lifeless remains of his unfortunate messmates; and seizing\nanother stave, he placed himself opposite to Lord Robert, and began to\nassist in the sad duty; but neither spoke.\n\nOne of the bodies was that of a midshipman, whom Lord Robert had loved;\nand as he now proceeded to place his remains in the narrow bed he had\nscooped for him with so much toil, his tears fell fast on the face of\nthe deceased. When he attempted to raise him from the shingle, to lay\nhim decently in the grave, the effort was too much for him. Philip\nimmediately sprang forwards and assisted him, otherwise the corpse would\nhave fallen from his grasp. He did not reject the aid of his foe; but he\ndid not even glance at him in return. In silence they began their\nmelancholy task; in silence they proceeded in it; and the moon had risen\nhigh and shone with splendour by the time they had dug the last grave,\nwhen unfortunately, as they placed the seaman in the \"house appointed\nfor all living,\" Philip recognised his features: it was the boatswain of\nthe Diomede! A crowd of agonizing feelings passed through Philip's\nbreast, as he recollected that from this man's hand he had received such\ndisgraceful punishment. He first turned pale, and then scarlet; and it\nrecurred to his mind, that this person had only been the passive\ninstrument obeying the orders of others.\n\n\"It was thy malice, tyrant! that added this worst wrong to all the\nrest,\" thought he. True, he did not utter these words: but he regarded\nLord Robert with a look, in which hatred and rage were but too visibly\npainted to escape his Lordship's observation, though he was ignorant of\nthe cause of it; but he thought it shocking of Philip to take the\nopportunity of insulting him at such an awful time, particularly when he\nhad condescended to _permit_ his assistance; and he returned Philip's\nindignant look in so disdainful a manner, that, scarcely conscious that\nhe was the first himself to renew hostilities, Philip took fire, and\nprovokingly reminded his Lordship \"that his haughty looks were useless,\nwhen directed to him; and he advised him to reserve them for those who\ncared for them, if he could find any such in the island.\"\n\n\"To the full as many as will endure your low-bred insolence,\" returned\nLord Robert with equal scorn. \"However, Mr. Harley, if I might\ncondescend to speak to you in the language of entreaty, it would be to\nrequest the favour of your absence. You have taken possession of the\nonly habitable spot in the island, and _I_ have not attempted to deprive\nyou of it; and I think the least you can do, in return for my\nmoderation, is to leave me undisturbed on my barren domain.\"\n\n\"If all my security were the _moderation_ of Lord Robert Summers,\"\nreplied Philip with a contemptuous laugh, \"I should be as soon driven\nfrom my dwelling here as I was forced from the home of my parents: but\nhere I can, by the strength of my own right hand, maintain my rights;\nand whoever attempts to invade them, may chance to repent of his folly.\"\n\nAs Philip uttered this threat, he finished casting the last heap of sand\non the boatswain's grave; on which, apparently exhausted with fatigue,\nLord Robert had seated himself. The sight of these bodies had recalled\nthe fate of his uncle, and he had been lately weeping bitterly; and when\nyoung Harley observed his tearful eyes, and the evident languor and\ndespondency visible in his whole appearance, his conscience again smote\nhim; he remembered what he had so lately suffered from self-reproach;\nand he reflected, that if he so much abused the mere bodily superiority\nhis strength gave him, it was by no means wonderful that when Lord\nRobert possessed so much power, he should exert it when offended.\n\nHe paused, and looked earnestly at Lord Robert. The moon shone brightly\non his face; the flush of resentment had faded from it; and he looked so\nill, and there was such an expression of hopeless dejection in his eyes,\nthat Philip was greatly touched; and he even thought of apologizing to\nhim for what he had lately said, and of entreating him to return with\nhim to the Valley of Limes. While he yet hesitated, Lord Robert looked\nup, and waved his hand impatiently for him to be gone: and Philip,\nfinding that the conquest of his own pride was too great an effort to be\nmade at that time, retired to his home, self-condemned and unhappy.\n\nLord Robert continued sitting on the grave, in a listless attitude,\nleaning his head on his hand, almost unconscious that he was alone. The\nfaintness and languor which had been for some time stealing on him,\nseemed so wholly overpowering, as even to take away the inclination of\nretorting Philip's last innuendo; but now, though the words still rang\nupon his ear, and he fully understood their meaning to comprise\nreproach, insult, and threat, either of which was sufficient to put his\nproud spirit in a flame, yet he was conscious of a growing confusion in\nhis own mind, which seemed to prevent his forming a suitable reply; and,\nfor the first time in his life, he found himself unwilling to continue\nthe war of words. He felt an impatient desire of quiet; and, forgetful\nthat Philip would most likely pay no attention to his mandate, he\nmotioned for him to retire, with no little of his habitual air of\nsuperiority. Philip, however, _did_ obey in this instance. Lord Robert,\nafter some minutes, raised his aching head from his hand, and, looking\nround to see if he were gone, uttered an expression of satisfaction at\nfinding himself alone.\n\nLord Robert's naturally fine constitution had been greatly impaired\nsince his residence in the island, by the pain of mind he had suffered\nfrom the loss of his uncle and friends, the remorse he felt for his\nnumerous errors, joined to his discontent and impatience at being\nplaced in a situation so uncongenial to all his former habits. Besides,\nhe suffered from the hardships which he was forced to endure: sleeping\non the flinty rock, or passing the night on the turf under the\nlime-tree--a most unhealthy practice--for the dews were very heavy, and,\nin common to all hot countries, very noxious to those who were exposed\nto their influence.\n\nHe had lost his hat when the boat was overset; and, trivial as this loss\nmay appear to the natives of a temperate climate, it was attended with\nvery painful consequences to Lord Robert, on whose head the rays of the\nsun fell with unmitigated violence, and occasioned him the most acute\nheadache whenever he was exposed to the noon-day heat. After his retreat\nfrom the Valley of Limes, he had for many hours paced the beach in a\ntumult of rage, with the perpendicular rays of a tropical sun darting on\nhis uncovered head. The night he had passed without sleep; and, early in\nthe morning, he found the remains of the unfortunate seamen. He was ill\nand feverish; and it was only by a strong effort that he so far overcame\nhis painful languor as to attempt the necessary but mournful task of\ngiving them burial.\n\nNotwithstanding the heat of the day, and the toilsome task he was\nengaged in, he experienced repeated fits of shivering; the burning rays\nof the sun pouring on his head, though they occasioned the most acute\npain, failed to impart warmth to his frame. This was accompanied with so\nstrong a disinclination to move, that he several times paused in the\ncourse of digging the first grave; and, yielding to the sickly lassitude\nwhich oppressed him, he retired to his cave; but that commanding a full\nview of the poor seamen, the dreadful sight roused him from his\ninactivity, and again he proceeded in his mournful work. He had scarcely\ncompleted digging one grave with great toil and pain, and was wondering\nhow it would be possible for him, ill as he was, to go through the whole\nbusiness of interment, when Philip appeared and afforded his powerful\naid. This was too valuable to be rejected; and he felt grateful for the\nsilent manner in which he tendered his assistance and worked by his\nside; and he was about to thank him for his services, when, on raising\nhis head for that purpose, he caught the offensive look which has\nalready been mentioned. Lord Robert, lost in his own sad thoughts, did\nnot perceive the _reason_ of this. Had he, indeed, recognised the\nfeatures of the boatswain in the person they were burying, perhaps the\nsame idea might have occurred to him. But, after having interred his\nfriend, he had sedulously averted his eyes from the faces of the dead.\nIgnorant, therefore, of Philip's motives for renewed indignation, he\nreturned his hostile glance, and the second contention ensued.\n\nThe rest of the night Lord Robert passed in a sort of stupor, seated on\nthe boatswain's grave; from which he felt unable to rise through extreme\nexhaustion. The first rays of the sun drove him for shelter to the cave.\nHis thirst was excessive; and he had no means of allaying it, unless he\nproceeded either to the Valley of Limes or the spring of water. The\nremembrance of Philip induced him to prefer the latter; and thither,\nwith some difficulty, he crept rather than walked. Having drank\nprofusely, he filled a large shell for a supply in the cave; for he\nthought it probable he should never be able to perform another journey\nto the stream; and slowly and faintly returned to his comfortless\ndwelling in the rock. The chills of the preceding day had terminated in\nthe burning heat of raging fever; and as he retraced his melancholy\nsteps through the sand, which reflected the intolerable rays of the sun\nto his eyes, and surveyed the barren rocks and frightful basalts of\nwhich the island was composed, he with a bitter sigh recalled the\nverdure of his father's park, and the shades of his native groves which\nbounded that beautiful domain.\n\n\"But these,\" said Lord Robert, \"I shall never see again: I shall perish\non this arid, frightful spot, without a living creature near who cares\nfor me, except my poor Neptune!--And you, my tender mother, who are so\nbenevolently solicitous to provide comforts for the sick poor, what\nwould be your feelings, could you see your unhappy son stretched on this\nburning flint!\" continued he, as entering the rocky chamber, he sank\nexhausted on the floor. He thought his death was near; yet he felt far\nfrom being in a proper frame of mind to die. Like too many of the young\nand thoughtless, if he were not profane, he was careless in matters of\nreligion; in this awful moment, a thousand instances of neglect and\noffence against his Creator occurred to his mind; and he felt that he\nwould have given worlds, had he possessed them, for a few hours of the\ntime he had so often abused.\n\nHe recollected, too, with bitter regret, his pride, imperiousness, and\nimplacability of disposition; of this, his conduct to young Harley was a\nfrightful instance; he vainly wished he could have recalled the _past_,\nbut that was not in his power; and he felt it very doubtful, if for him\na _future_ in this world would be granted. The present was all he could\ncall his own; and it behoved him to make the best use he could of the\nprecious moments that were yet allowed him to make his peace with God.\nBut, alas! the confusion incidental to fever had already attacked his\nbrain; and, though he felt the necessity of penitence and prayer, it was\nno longer in his power to collect his wandering thoughts, so as to raise\na single petition to the Throne of Mercy. He was sensible that he was on\nthe brink of eternity; yet the minutes passed rapidly away, leaving his\nmind in a state between reason and delirium, yet conscious of his\ndanger, and the importance of that time which was ebbing from him for\never.\n\nHis bodily sufferings, too, were dreadful. Burning with fever, he had no\nmeans of quenching his thirst--he had long since drained the last drop\nfrom the shell, and could not replenish it; for the next morning saw him\nraving in delirium, or sunk in long and death-like fits of stupor, from\nwhich his faithful Neptune strove in vain to arouse him by his caresses.\n\nPhilip, in the mean time, had returned to his comfortable hut in the\nValley of Limes, and laid himself down to rest; but the image of Lord\nRobert, pale and languid as he had seen him seated on the boatswain's\ngrave after their last altercation, pursued him when awake, and haunted\nhis slumbers when he closed his eyes in sleep. In the morning, Philip\nsedulously pursued his useful employments, to divert these painful\nthoughts. He had discovered on the other side of the island some grass,\nthe only natural production of the place, growing in long, dry, silky\ntufts out of the clefts of the rocks. He had cut several bundles of this\ngrass, and braided it into a soft, thick mat; this mat he had fixed on a\nframe-work which he had made, and formed it into a most comfortable\ncouch, rolling one end of the mat over for a pillow. He was so\ncompletely occupied and pleased with this employment, that he did not\nthink of Lord Robert, till, on stretching his limbs upon this excellent\nbed, he remembered how differently his unfortunate enemy would sleep\nthat night. He recollected that he had seen nothing of him in the Valley\nof Limes that day; and when he recalled the reproaches and threats he\nhad used the day before, and reflected on Lord Robert's high spirit, he\nthought it probable that he would endure every suffering, rather than\nimprove his condition by procuring anything from that spot. Of Neptune,\nPhilip had seen nothing since the preceding day, when he had once\nvisited the valley, and begged for a share of his dinner; for Lord\nRobert had peevishly chidden the dog for his importunities; indeed, he\nhad nothing to give him, being too ill to go in search of food. Philip,\nwho was very fond of Neptune, and had been accustomed to caress him when\nLord Robert was out of sight, had fed him, and expected to see him\nagain, but he did not come; and Philip thought it likely that Lord\nRobert was very ill; and he again bitterly regretted having used such\nexpressions as had driven him from the valley.\n\nThe next day, Philip again visited the beach, where he had never been\nbefore in the meridian heat of the day, and when he experienced the\nblinding effects of the sunbeams, which soon occasioned him to feel,\nthough in a lesser degree, one of those headaches that had continually\ntortured his more delicate rival, he wondered where Lord Robert could\nfind shelter from the intense heat. Actuated by more humane motives than\nmere curiosity, he continued to pace the beach, determining not to\nreturn till he had seen Lord Robert. For some time he pursued his\nsolitary walk, without discovering the object of his research. The sight\nof the seamen's graves redoubled his pain of mind. When he remembered\nthe hopeless dejection visible in Lord Robert's face, so different from\nhis usual animated expression of countenance, and combined it with the\nillness so apparent in his whole person, the thought crossed his mind,\nthat he might have expired without a human creature near him. Philip\nshuddered as this dreadful idea presented itself. He was busy with\nself-accusing thoughts, when he paused before Lord Robert's cave,\nwishing, yet unwilling, to enter, when Neptune sprang from the interior\npart of it, and bounding round him, looked up wistfully in his face,\nand returned, as if to invite him to follow. This Philip could not\nprevail on himself to do. After waiting a few minutes, Neptune came\nagain; and, laying hold of his jacket with his teeth, endeavoured to\ndraw him into the cave--looking at him in such an imploring manner, that\nPhilip could no longer resist his entreaties, not withstanding the\nreluctance he felt at intruding himself into Lord Robert's presence.\n\nOn entering the cave he beheld the unfortunate young nobleman stretched\non the flinty floor in a stupor, so nearly resembling death, that Philip\nstarted back in horror; and so much had the violence of the disorder\nchanged the appearance of his once beautiful countenance, that his\ndearest friends would scarcely have recognised his convulsed and livid\nfeatures. On a second glance, Philip discovered that he still breathed,\nbut was unconscious of his approach. His heavy eyes, half closed and\nfixed, had lost their expression of spirit and intelligence; his lips\nappeared parched and burning; and his light brown ringlets hung in\ndisordered profusion, tangled and neglected, over his forehead.\n\nAt this heart-rending sight, Philip, forgetful of the enmity that had\nsubsisted between him and the unhappy sufferer, turned away, and wept\nbitterly. It was with feelings of the most bitter compunction he\nrecalled the altercation that had passed over the boatswain's\ngrave--particularly when he experienced the stifling closeness of the\ncave, where he felt a difficulty in respiring; and reflected, that his\nmenaces had had the effect of driving Lord Robert from the only\ntemperate spot on the island.\n\nPhilip could form some idea of his Lordship's sufferings, from the\nrecollection of an autumnal fever which had attacked him in his\nchildhood, and nearly brought him to the brink of the grave; he\nremembered how much he had suffered from thirst, and the relief he had\nfelt from some ices which the Marchioness, Lord Robert's mother, had\nbrought him in her carriage. That noble lady had supplied him with the\nmost delicate fruits from the hothouse; and his mother believed that\nthese ices and fruits, which he took with so much avidity, had saved his\nlife.\n\n\"And yet,\" said Philip, \"wretch that I am! I see her darling son,\nthrough the criminal indulgence of my resentful feelings towards him,\nreduced to a state so deplorable, that, if his fond mother could behold\nhim, the sight would kill her.\"\n\nHere Philip was interrupted by Lord Robert's trying to articulate\nsomething; but so very faint was the attempt, that it was not till he\nhad knelt down by his side, and raised his head on his arm, that he\ncould catch his imperfect accents, or distinguish what he intended to\nexpress. Alas! it was but one word--\"_Water!_\" and that repeated\nincessantly, in tones of agony, which Philip, some years after that\nmelancholy period, declared that night and day he strove in vain to\nforget: and at that moment, when he beheld the parched and blackening\nlips from which those sounds proceeded, they pierced his heart with an\nanguish no tongue can describe. Fortunately he had a lime in his pocket,\nwith the juice of which he moistened the sufferer's mouth. Some minutes\nelapsed before this appeared to have the least effect; but at length his\nLordship became conscious of the relief, and swallowed with avidity the\ncooling fluid; and, opening his languid eyes, he turned them on Philip\nwith an expression of gratitude which overpaid him for his exertions. It\nwas evident, however, that he took him for some other person; for,\nextending his arms towards him, he called him \"Augustus! his beloved\nbrother!\" and besought him in the most pathetic manner, \"to remove him\nfrom that horrid place, and to let him have a better bed than the hard\none on which he lay, which he assured him had sadly bruised his body.\"\n\n\"Alas! poor sufferer!\" said Philip, \"if you knew to whom you were\naddressing these tender names and moving petitions for assistance, your\nproud spirit would make you reject my aid with scorn, and you would\nperish rather than accept it.\"\n\n\"However,\" continued he, \"though I fear my help comes too late, yet you\nshall at least die in a more comfortable place than this dreary cave.\"\n\nSo saying, with some exertion of his strength, he raised the sufferer,\nwho had again relapsed into a state of insensibility, from the ground;\nand, taking him in his arms, he proceeded to carry him to the Valley of\nLimes.\n\nThe touch of his dry and burning hand gave a sensation of pain to\nPhilip, when it came in contact with his own, and his head dropped in\npowerless languor on his shoulder. Philip rested by the spring of water,\nand bathed Lord Robert's face and hands in the cool element: this seemed\nto revive him a little, and he drank eagerly from a shell of water which\nPhilip held to his burning lips. Had it not been for this refreshment,\nthe sufferer must have expired from thirst and exhaustion before they\narrived at the valley. As it was, he appeared to endure so much pain\nfrom his exposure to the heat of the sun, that Philip uttered an\nexpression of thankfulness when he reached the shelter of the hut, and\nlaid his helpless burden on the couch of matting within it. But Lord\nRobert had swooned from weakness and fatigue, and lay for many hours\nwithout motion or sensation.\n\nPhilip now busied himself in procuring a large supply both of water and\nlimes; and, mixing the juice of the limes in water, continually bathed\nthe sufferer's hands and temples with this refreshing liquid, watching\nanxiously for returning life. The next day Lord Robert opened his eyes,\nand expressed his surprise and pleasure at finding his condition so much\nimproved. But his reason was lost in delirium; he talked incessantly;\nand, addressing Philip by the name of his brother, bestowed on him the\nmost endearing expressions of affection and described to him the\nparticulars of his illness, and all his dreadful privations, in a manner\npathetically minute.\n\nPhilip, deeply interested, and forgetting that he spoke under the\ninfluence of delirium, anxiously exclaimed, \"Why did you not return to\nthe Valley of Limes?\"--\"Because,\" replied his Lordship, wholly\nunconscious to whom he spoke, \"I was ill and alone, and totally unable\nto cope with that insolent Harley, who menaced me with his superior\nstrength.\"\n\nPhilip started at hearing his name so mentioned; and Lord Robert\ncontinued at intervals to speak on this subject, sometimes passionately\nblaming himself; and at other times, with all the inconsistency of\ndelirium, bitterly complaining of Philip.\n\nPhilip was greatly surprised and agitated, when, after much unconnected\nwandering, Lord Robert said: \"You, Augustus, always blamed me about that\nPhilip Harley, and said you knew him to be an estimable youth, and that\nhe had been hardly used through a prejudice I had against him; but what\nwould you have thought, Augustus, had you seen him clench his hand and\nthreaten your unhappy brother with personal ill-treatment, when he was\ntoo ill to defend himself from his violence?\"\n\nPhilip blushed deeply when he heard this; for he remembered using this\ngesture in the vehemence of his last wrathful address to Lord Robert;\nand now that he found how ill he had been at that time, he felt doubly\nashamed of having suffered himself to be so transported by passion.\n\nFrom these self-reproaches he was again roused by Lord Robert's\nspeaking; but he had wandered to a different subject, and evidently\nimagined himself at his own home, for he demanded \"ices, peaches, and\nstrawberries,\" in a tone of feverish impatience; and Philip was at a\nloss how to satisfy these cravings; but when at last Lord Robert\nmentioned \"grapes,\" Philip remembered those that were ripening on the\nroof of the hut, and hastened to see if any were fit to eat; though his\npatient, in a tone of displeasure, called him to return and send a\nservant to execute his orders, for he did not choose to be left alone.\nThis was, however, unavoidable; and in a moment he returned with a rich\ncluster, perfectly ripe. Lord Robert eagerly seized them, with an\nexclamation of joy; but he was reduced to such a state of weakness, that\nhe was unable to convey them to his mouth; and resigning the cluster to\nPhilip, begged him to feed him. Philip obeyed, and attended to all his\nwhims with the greatest patience. At length, exhausted by the volubility\nof delirium, he sank again into a death-like stupor, in which he lay,\nwithout sense or motion, the whole of the night, and till the next day\nwas far advanced.\n\nPhilip, who had continued to bathe his hands and face at intervals,\nperceived by the painful motion of his lips that he wanted something to\ndrink. Philip raised his head, and supported it on his bosom, while he\nheld to his lips a shell full of the juice of limes and grapes. Lord\nRobert drank this delicious beverage eagerly; then opening his eyes,\nwhich Philip thought would never again have unclosed, he looked up in\nhis face, as if to thank him for the relief; and Philip saw by the\nexpression of wonder and astonishment in those eyes, so lately fixed and\nrayless, that he knew him, and was no longer under the influence of\ndelirium. A deep crimson mounted to his pallid cheek, as he\nsaid--\"Harley, I don't deserve this kindness at _your_ hands:\" and with\na deep sigh he again relapsed into insensibility. The sound of his\nvoice, and the manner in which he pronounced this short sentence,\nthrilled to Philip's heart; and he hung over him with a tender interest,\nwatching the progress of his disorder with the most intense anxiety.\nPhilip had been little accustomed to witness illness: he had scarcely\never watched by a sick-bed, with the exception of the illness of his\nsister, who had died; but death had laid so gentle a hand on her, that\nher decease rather resembled the withering of a flower than the passage\nof a mortal to the grave: far different from the terrific advances of a\nraging tropical fever, which brought Lord Robert, through stages of\nexquisite suffering, nearly to the eve of dissolution.\n\nThe sight of these sufferings had extinguished the last spark of\nanimosity in Philip's bosom; and it was with feelings nearly allied to\nthose with which he contemplated the death-bed of that beloved sister,\nthat he awaited the termination of Lord Robert's disorder. That it would\nbe fatal he doubted not, for he watched in vain for a second interval\nof reason; but day after day passed, without the slightest intermission\nof suffering; but the fever seemed rather to increase in violence, and\nhis Lordship's wanderings from reason assumed a more gloomy character,\nin which the most unbounded expressions of self-reproach had a principal\nshare. No longer petulant and impatient, he appeared sunk in the deepest\ndespondency; and this turn in the disease alarmed Philip more than his\nmost extravagant fits of raving. It was truly awful to see a\nfellow-creature, and, alas! a very erring one, on the brink of eternity,\nwithout a ray of reason being granted him to prepare to meet his great\naccount. It then occurred to Philip, that many of the faults of which\nthe unhappy sufferer accused himself, had been occasioned by his own\npertinacity in throwing himself in his way, and provoking him to violent\nconduct; by that means setting his fiery temper in a blaze, and causing\nhis evil passions to be ever uppermost, till they prompted him to commit\nthose injuries for which he now suffered the most bitter remorse.\n\n\"Had I avoided him half as carefully as I sought him,\" exclaimed Philip,\n\"he would soon have forgotten an individual so much beneath his own\nrank. I am accountable for many of his errors. True, he abused his power\non board the Diomede; but how have I behaved since our residence on this\nisland?\"\n\nPhilip pursued these self-accusing reflections as he was kneeling by\nLord Robert's side, and fanning him with the wing of a sea-fowl, which\nNeptune had brought him the day before. The weather had been intensely\nhot, and attended with thunder and lightning; but as the day declined,\nsome heavy rain descended, which had the effect of cooling the burning\nearth. This salutary change produced an alteration in Lord Robert, who\nopening his eyes, gazed round him in indescribable astonishment. At last\nhe said, \"Where am I? How came I here?\"\n\n\"Be composed, my Lord,\" said Philip, much agitated; for he had long\ndreaded the moment when Lord Robert would ask this question, and he had\nmeditated to address such words to him as would soothe his proud\nfeelings; but he found that he could not speak; he only regarded his\nLordship with a troubled countenance, dropping the feathers with which,\ntill now, he had continued to fan him.\n\n\"Harley,\" said Lord Robert, the flush of fever fading to a deadly\npaleness as he spoke, \"I now comprehend my situation; cease to oppress\nme with this unmerited kindness!\" Then speaking in a less collected\nmanner: \"No! it must not be! I have injured you too deeply! Go, leave\nthe oppressor to die alone; I saw _you_ suffering, and did not pity you;\nand it is not fit for the merciless to receive mercy!\"\n\nHe turned away his face, and covered it with his emaciated hands; but\nPhilip knew, by the convulsive heaving of his bosom, that he was\nweeping. Philip, from a feeling of delicacy, withdrew to a little\ndistance, to avoid the intrusive appearance of watching Lord Robert's\nemotions; and he feared to increase his agitation, or offend his proud\nspirit, by even offering a word of comfort. Yet his caution was\nunnecessary, for the tears Lord Robert shed were not those of humbled\npride, but they were those of a broken and contrite spirit; they were\nsuch tears as would occasion joy in Heaven, for they were those of true\npenitence; and Lord Robert was not ashamed of indulging in them, neither\ndid he seek to conceal their traces from Philip, when he turned his eyes\ntowards him, and motioned him to approach.\n\n\"Harley,\" said he, \"can you forgive me?\"\n\n\"Ah, my Lord,\" said Philip, \"I have to the full as much reason to ask\nyour forgiveness. We have both erred, from the indulgence of an\nimplacable temper; and if you repent of your offences as much as I have\ndone of my trespasses against you, we may both be, in future, more\nacceptable in the eyes of our Heavenly Father, to whom 'hatred, malice,\nand all uncharitableness,' are most offensive.\"\n\n\"Harley,\" said his Lordship, \"you are too generous! How could I so\ncruelly persecute one capable of such noble conduct!\"\n\n\"Cease to accuse yourself, my Lord; you are too ill to continue this\nagitating conversation,\" said Philip, observing Lord Robert look very\npale.\n\n\"No,\" returned Lord Robert; \"I feel my thoughts begin to grow confused!\nThis may be the last interval of reason vouchsafed me; and I would\nwillingly make use of it to assure you that I die at peace with you, and\nblessing you; and may your last hours be sweetened by the remembrance of\nyour generous conduct to your enemy! When I am no more, save a lock of\nmy hair, and give it to my mother when you return to England, which you\nwill soon have an opportunity of doing. Tell her, if I wished to live,\nit was to see her again, and to confess to my father that I had been\nguilty of prejudicing him against you, Harley, by misrepresenting the\nreason of our first quarrel, which was the cause of your being pressed.\nTell me, sincerely, can you forgive me for that, Harley?\"\n\n\"I can--I do!\" replied Philip, approaching close to the couch; \"and, in\nproof that your Lordship exchanges forgiveness with me, give me your\nhand.\" Lord Robert threw himself into his arms, and Philip felt his\ntears wet his bosom. Yet at that moment each felt happier than he had\ndone for months before. But Philip became painfully anxious for the\ninvalid, the violence of whose emotions brought on a fresh access of\nfever. He began again to talk wildly, and Philip strove in vain to\nrepress his ravings, till at length he sank into a death-like stupor,\nscarcely giving any symptom of animation.\n\nPhilip now entertained the greatest apprehensions for his Lordship's\nlife, and was himself surprised at the pain he felt at the idea of\nlosing him. He had evinced such full and noble contrition for his\nerrors, that Philip, forgetting all his injuries, wondered how he had\never borne a hatred so bitter against him. That hatred had, indeed,\nchanged gradually into an affection so warm, that he was ready to impute\nto his own faulty temper the blame of all that had passed. \"And, oh!\"\nsaid he, as he hung over the couch where Lord Robert lay, apparently\nunconscious of his presence, \"who could think that I, who now watch so\nanxiously every change of his pallid countenance, could once have taken\ndelight in provoking him to fight with me, and then took a savage\npleasure in aiming my blows at his face, and disfiguring his fine\nfeatures with the marks of my violence? Ruffian that I was!\"\n\nHere a gentle pressure from the hand he held in his, convinced him that\nLord Robert was sensible, and had heard this soliloquy. Philip started\nand coloured at this idea; and Lord Robert said in a faint voice:--\n\n\"If you, my dear Harley, so severely accuse yourself for what was a just\nretaliation for my unfeeling arrogance, what must be my feelings of\nself-condemnation for my conduct on board the Diomede, on which I cannot\nthink without agony?\"\n\n\"Never think of it again, my Lord,\" said Philip, to whom the appellation\nof \"dear Harley\" had given a sensation of the greatest pleasure; \"let me\nbeg you never again to agitate yourself by a painful remembrance of what\nis past: I would endure much to see you well and happy.\"\n\nAfter some time, Philip succeeded in soothing his patient into some\ndegree of composure; and at length he had the satisfaction of seeing him\nsink into a profound sleep. Then, being worn out with anxious watching\nand fatigue, he threw himself on the ground, and enjoyed a calm and\nrefreshing slumber. When he awoke, it was about sunrise; and seeing Lord\nRobert still asleep, he went out to get a supply of fruit and turtle. On\nhis return, he found Lord Robert awake and evidently better; for he was\nreturning the caresses of Neptune, who certainly had deserved his\nfondness, for he had been almost as watchful and abstinent, and as\nattentive to his master's sufferings, as Philip himself. The patient\nextended his hand towards Philip as he entered, who hastened to him and\ninquired tenderly, \"how long he had been awake, and how he found\nhimself?\"\n\n\"Long enough to miss you, and well enough to thank you for your\nunwearied kindness,\" said Lord Robert, with a melancholy smile. Philip\nrespectfully took the hand that was extended towards him; and, after\nexpressing his pleasure at seeing him so much recovered, began to busy\nhimself in procuring him all the comforts in his power. Lord Robert, for\nthe first time since his illness, was able to raise himself to wash his\nhands and face in some water which Philip brought him in a turtle-shell.\nAfter this grateful refreshment, he attempted with his pocket-comb to\ndisentangle his ruffled and matted hair; but his hands trembled so much\nfrom weakness, that he sank exhausted on the couch. Philip took the comb\nfrom his hands, and with great care and patience succeeded in smoothing\nand reducing to their natural order these refractory ringlets. Lord\nRobert repeatedly bade him give himself no farther trouble, but take his\nknife and cut them off as well as he could. But Philip did not like to\nspoil the fine hair which Lord Robert had once been proud of; and had\nthe Marchioness herself presided at this operation, it could not have\nbeen more tenderly performed than by the hands of this young sailor;\nand his patient appeared to derive great benefit from this attention to\nhis personal comforts, though reduced to a state of infantine weakness.\n\nLord Robert now rapidly improved in health, and was soon enabled, with\nthe assistance of Philip's arm, to walk in the Valley of Limes in the\ncool of the morning. Notwithstanding this improvement, however, Philip\ncontinued to attend on him with the most assiduous care; and even when\nhe was in a state of convalescence, still performed for him all those\nlittle offices which he knew Lord Robert had been accustomed to have\ndone for him by his attendants, though his Lordship did not wish to\nconsider himself entitled to such services in his present situation.\n\nOne morning, Philip arose much earlier than usual. On his return from\nthe beach with a load of wreck, he was much surprised, not only to see\nLord Robert up and dressed, but employing himself in preparing the\nbreakfast. Philip threw down his load and ran to him, exclaiming, \"Why,\nmy Lord, did you rise till I was ready to assist you to dress? And,\nabove all, why do you fatigue yourself by an employment so little\nsuitable to your rank?\"\n\n\"Hush! hush! my dear Harley,\" returned Lord Robert, laying his hand\nplayfully on Philip's lips. \"Not a word about my useless rank now!\nRemember _we are equals here_!\"\n\n\"Alas! my Lord,\" said Philip dejectedly, \"I perceive you have not wholly\nforgiven me, or you would not repeat my impertinence.\"\n\n\"Which had much _truth_ in it, though I took it so ill at the time,\"\nsaid Lord Robert, laughing. \"However, Harley, without wishing to refer\nto unpleasant occurrences, or designing to wound your feelings, (which I\nshould be a most ungrateful, cold-hearted fellow, were I to do,) I must\ntell you, that I cannot consent to be attended on with the same\ndeference as if I were his Britannic Majesty in retirement,--at least,\nwhile I have done nothing to merit such distinction.\"\n\n\"Ah! my Lord,\" said Philip, \"if you knew the pleasure which the\nperformance of these little services affords me, you would not wish to\ndeprive me of it: and, indeed, nothing but your absolute prohibition\nshall prevent me from continuing them.\"\n\n\"You are a noble-minded fellow, Harley; but it is not for me to talk of\nprohibiting or commanding _here_, where I am your superior in\nnothing----\"\n\n\"Again, my Lord!\" said Philip, turning away.\n\n\"Where,\" answered his Lordship, \"I am your inferior in everything, and\nam so much in love with your just way of thinking, and noble\nindependence, that I would willingly imitate both; and, my dear Philip,\nyou must not take it ill, if I refuse to live by your labours while I\nhave hands of my own. Tell me, Harley, will you accept such an awkward\nfellow as I have proved myself to be, for your pupil?\"\n\n\"I cannot refuse you anything,\" said Philip; \"but while you are so\ndebilitated from your long illness, you neither must nor shall do\nanything to fatigue yourself.\"\n\nSo saying, he proceeded to serve up the turtle which Lord Robert had\nstewed for breakfast; reproaching him, as he did so, for demeaning\nhimself by performing the office of a cook.\n\nLord Robert, laughing, told him that it encouraged him not a little in\nhis design of becoming useful, to observe that his last attempt of that\nkind had succeeded so much better than his first. \"But,\" continued he,\n\"perseverance overcomes all difficulties; and before long, I may become\nas good a carpenter as I have this morning proved myself a cook.\"\n\nPhilip shook his head, and looked grave.\n\n\"So you doubt my abilities,\" continued Lord Robert, who would not\nunderstand him; \"now that is mortifying, Harley! But I forgive you,\nconsidering that the circumstance of the three-legged stool could not\nhave impressed you with a very favourable opinion of my genius in such\nmatters.\"\n\n\"Let me entreat your Lordship never to allude to my conduct in that\naffair again,\" said Philip.\n\n\"Now, on the contrary,\" returned Lord Robert gaily, \"I have serious\nthoughts of fetching the aforesaid stool from under the tree where I so\npetulantly flung it; and of soliciting you to lend me that rule and saw,\nwhich I so rudely refused when you would have permitted me to make use\nof them to correct my blunders; which was very generous on your part,\nconsidering how awkwardly I handled my only tool, and how easily I might\nhave injured yours.\"\n\nPhilip was astonished at the ease and frankness with which Lord Robert\nspoke of these circumstances, but again implored him not to allude to\nthe past.\n\n\"Had you told me anything but the _truth_,\" replied Lord Robert,\n\"perhaps I might be excused if I repeated your remarks with displeasure.\nBut the lesson was too salutary to be forgotten. In common with many of\nhigh birth, I have been too much accustomed to the language of flattery,\ninstead of that of truth and justice; till, forgetting the relative\nobligations of society, and never checking the defects of my temper, I\nwas led to commit outrages on every one who did not yield a blind\nsubmission to my whims. You, Harley, have opened my eyes to my faults;\nand it will, in future, be my constant study to correct them, convinced,\nas I now am, of the folly of trusting to rank and riches alone for\ninfluence and consideration among my fellow-creatures.\"\n\nThe day after this conversation, Lord Robert was well enough to\naccompany Philip to the beach, to seek for turtles' eggs. In this search\nthey wandered to a different part of the island, and Lord Robert\ndiscovered, at a little distance, something dark and large heaving\namong the surf; he called Philip's attention to it, who soon got it on\nshore; and they found it to be a chest belonging to some of the\nunfortunate crew of the Diomede: it was heavy, but Philip soon carried\nit to the hut.\n\n\"What do you think it contains?\" said Lord Robert, as Philip was forcing\nthe lid.\n\n\"Tools, I hope,\" said Philip; \"for the chest is weighty.\" And as he\nspoke, he used so powerful an effort that the lid gave way to his force.\n\n\"Not tools, but books!\" exclaimed Lord Robert, highly delighted at the\nsight which presented itself on Philip's removing the lid. Philip,\nhowever, was disappointed.\n\n\"Tools would have been of unspeakable service,\" said he, almost vexed at\nthe joy Lord Robert expressed at the sight of the books.\n\n\"But these will be of infinitely more service,\" replied Lord Robert,\ntaking one of the books and turning to the title-page; but his lip\nquivered as he read the name there written, which was \"Lucius Cary.\"\n\n\"Alas! poor Cary!\" said he, in an altered tone of voice; \"was it _your_\nchest that we thought ourselves so fortunate in finding, and that we\nopened with such glee?\"\n\nPhilip, deeply affected, softly closed the lid: for they both were in\ntoo melancholy a mood to continue to examine the contents of the chest;\nnor was it till several days had passed that they assumed firmness\nenough to open it again.\n\nThey found in this chest a complete set of mathematical instruments, and\na small but valuable selection of books, fitting for the library of a\nyoung officer; comprising the choicest works on navigation, astronomy,\nand geometry; and two or three volumes of poetry and history. Some of\nthese were wetted by the sea-water, but Lord Robert carefully spread\nthem to dry. They also found a few changes of linen, an undress jacket\nor two; and Lord Robert drew forth with much grief, from a corner of the\nchest, Cary's flute.\n\n\"This,\" said he, \"should I ever be permitted to revisit my native\ncountry, I will carry to England, and keep as long as I live, in memory\nof our deceased friend.\"\n\nThough they were in sad want of linen and clothes, Lord Robert felt a\npang of regret when he saw Philip busy in removing his epaulet to Cary's\nhalf-uniform jacket, and laying out for his use some of his shirts and\ncravats, which, however, were of the greatest use to him, and highly\nbeneficial to his health.\n\nSoon after this, the rainy season set in, which is usual to these\nlatitudes; and now they found a source of delight and advantage in the\nbooks which had been so opportunely thrown in their way. Lord Robert was\nan accomplished young man; he had received a most superior education;\nand was not only perfect in all acquirements befitting his rank, but had\nmade a considerable progress in those sciences which are necessary to be\nknown in order to obtain perfection in naval duties.[5]\n\n[Footnote 5: The sciences requisite to form a complete seaman are\nbeautifully described by Falconer:--\n\n    \"Him Science taught by mystic lore to trace\n     The planets wheeling in eternal race;\n     To mark the ship in floating balance held,\n     By earth attracted, and by seas repelled;\n     Or point her devious track through climes unknown,\n     That leads to every shore, and every zone.--\n     He saw the moon through heaven's blue concave glide,\n     And into motion charm the expanding tide;\n     While earth impetuous round her axle rolls,\n     Exalts her watery zone, and sinks the poles.\n     Light and attraction from their genial source,\n     He saw still wandering with diminish'd force;\n     While on the margin of declining day\n     Night's shadowy cone reluctant melts away.\"\n\nTo add to this,\n\n    \"That never seaman more serenely brave\n    Led Britain's conquering squadrons o'er the wave.\"\n\n    _The Shipwreck._\n\nPerhaps it will be considered that Falconer's beautiful poem is too\ngenerally known to give these extracts the charm of novelty; yet surely\nevery one who is acquainted with the talents and fate of Falconer, will\nfeel almost a tender emotion when his writings are alluded to, from a\ncombination of circumstances. His poem is very interesting, his\ncharacter and fate are still more so, and his memory is thrice hallowed\nand will be immortalized by the beautiful allusion to his Shipwreck in\nthe \"Pleasures of Hope.\"]\n\nThis knowledge he was desirous of imparting to young Harley, who, at\nLord Roberts earnest request, became his pupil in geometry and nautical\nastronomy, and improved rapidly under his tuition.\n\nThis was to Philip the happiest period of his life: he had received from\nhis father a good plain education, which he had improved by reading the\nbest books he could procure; but now he found the acquirement of higher\nbranches of knowledge still more delightful; and the life he led was so\ncalm and peaceful, and Lord Robert's society and manners were so\ncharming, that he tasted on this island pleasure such as he had never\nbefore experienced. It is not to be wondered at, therefore, that the\nevent which Lord Robert anticipated with much joy, should give him pain\nwhenever he thought of it; namely, the arrival of some vessel from the\ncoast of Africa, on its way to Brazil, which would take them from the\nisland.\n\nThe affection which he had formed for his high-born companion was now\nfar stronger than ever his animosity had been; and certainly Lord Robert\nhad, since his illness, conducted himself in a manner deserving even the\nunbounded attachment which his lowly but warm-hearted friend testified\ntowards him. No longer proud and irritable, his behaviour was gentle,\nmild, and considerate; his manners, always elegant and polished,\npossessed a charm altogether irresistible; and his conversation, pure,\nrefined, and chiefly directed to intellectual subjects, was so\ndelightful, that Philip thought his society would unfit him for any\nother.\n\nAs Philip had passed the greater part of his life in seclusion from\nthose of his own age and station, his manners and mind were free from\nthe taint which impure and corrupt society often gives; and when he was\nby chance thrown in contact with his equals, he shrunk with horror from\nvice and coarseness; and preferred, in his leisure hours, to nurse and\namuse his suffering sister, or to pore over Baker's Chronicle, Drayton's\nPolyolbion, or Sir Walter Raleigh's History of the World, (which ancient\ntreasures his father possessed,) to the most enlivening games of quoits\nor foot-ball.\n\nThe taste he had formed for mental pursuits since he had been on the\nisland, brought with it a painful consciousness of the difference\nbetween Lord Robert's rank and his own; and he thought it very\nimprobable, that so elegant and accomplished a young man could ever\ncondescend to form a friendship with him, though he might retain a\ngrateful sense of the assistance which he had subsequently rendered him.\n\nPhilip had made a pretty latticed porch to the hut, and trained the vine\nover it, that Lord Robert might enjoy the cool of the evening, without\nbeing exposed to the noxious effect of the dews. Here then, after\nspending the day in study or useful employment, they passed the evening,\nconversing together, or examining the starry heavens, and noting\nconstellations, which appear very different from those of Europe.\nSometimes, Lord Robert would play on Cary's flute; but though it was\nenchanting to listen to this music in the stillness of a moonlight\nevening, when all the fire-flies in the island were collected in this\nonly spot of verdure, and were blazing round them, and everything above\nand around accorded so well with these sweet sounds, yet it was\nforbidden pleasure; for playing on the flute was injurious to Lord\nRobert's health; and Philip, though he loved music, and this music most\nof all, would often take the flute almost by force from the hands of his\nnoble friend, who, being a fine performer, and much attached to music,\nnever knew how to resign it in prudent time.\n\nThe happiness Philip now enjoyed was only interrupted by the pain he\nfelt, whenever the probability was mentioned of their leaving the\nisland. Lord Robert expected that, when certain winds set in, some\nvessel or other would touch at the island for water or turtle; and\nPhilip guessed, that when they were taken from their present abode, this\ndelightful intercourse would cease, and Lord Robert would be for ever\nseparated from him by the forms of society. This made him feel almost\npettish when he found that, when these winds commenced, Lord Robert\nleft him for hours, and passed his time leaning against the cross on the\nhill, making observations through his perspective-glass; while Philip\nremained in the valley, employing himself for their mutual benefit. But\nthough he felt almost angry with Lord Robert for depriving him so much\nof his company, yet he never presumed to remonstrate with him on this or\nany other subject; and when he saw him approach the valley on his\nreturn, he would forget all his repinings, and hasten to meet him, and\noffer his arm for his support, if he seemed faint or fatigued. It is not\nsurprising that Lord Robert returned this tender affection with the\nutmost regard. He now felt the gratifying conviction, that it was not to\nthe superiority of his rank and power, but to his virtues, his\nacquirements, and charming manners, that he owed his influence over the\nheart of one on whom his situation in life had made no impression, and\nwho had denied him the slightest respect till he had proved himself\ndeserving of it; and he could not help remarking, that he had never,\nwhen in the height of his pride and power, received half the real\ndeference, or marks of delicate attention, which had been shown him\nsince his residence on the island, by his only companion and former\nenemy, Philip Harley.\n\nOne afternoon, as Philip was employing himself in the valley, and had\nbegun to wonder at the long absence of his noble companion, Lord Robert\nrushed into the hut, and, with an animation of manner Philip had not\nobserved in him for a long time, said: \"Joy! joy! my dear Harley! I have\njust seen a sail, and have hastened home to bring you the delightful\nnews.\"\n\n\"Is that all?\" said Philip in a melancholy tone.\n\n\"No, not all,\" replied Lord Robert: \"for I climbed to the top of the\ncross, and hoisted my handkerchief as a signal of distress. And the lads\nare now making the island! And we shall see Old England again, my boy!\"\n\nBut Philip Harley did not seem to participate in his delight; for he\nlooked grave and thoughtful.\n\n\"How now!\" said Lord Robert; \"what are these dismal looks for? Shall you\nbe sorry to see your home again? Or does the name of England recall to\nyour remembrance some of my former exploits? Or do you think, if I\nfound myself on board ship once more, I should feel the temptation of\nauthority, and play the tyrant again?\"\n\n\"No,\" replied Philip, sighing; \"you do me great injustice if you suppose\nthat I can for a moment form such an opinion of your Lordship.\"\n\n\"My Lordship, too! Very formal, Mr. Harley!--But, Philip, my dear\nfellow, tell me, what is the matter with you?\"\n\nPhilip did not speak.\n\n\"Nay, then, Harley,\" said Lord Robert, taking both his hands, \"I shall\nsoon begin to think that you are willing to consider our present amity\nonly in the light of a truce, occasioned by the breaking out of a\npestilence; and that you are anxious to recommence hostilities as soon\nas an opportunity offers. But tell me, without more ado, are you\noffended with me?\"\n\n\"Your Lordship is very gay this afternoon,\" said Philip gravely. \"But I\nhope I have seen my own errors in too strong a light, and am too well\nconvinced of my own insignificance, ever to take offence at anything\ndone by a person of _your_ rank and consequence.\"\n\nLord Robert now appeared much wounded, and asked him seriously, what\nwas the reason of this strange behaviour; and Philip, who could not bear\nthe idea of giving him pain, replied--\n\n\"How can I share in your joy at the prospect of leaving the island, when\nthat event will separate us for ever?\"\n\n\"How so?\" said Lord Robert, laughing. \"To be sure, you don't mean to\nremain here playing Robinson Crusoe or the Hermit Quarl, by yourself?\"\n\n\"No,\" said Philip sorrowfully, \"that is not my intention; though,\nperhaps, the wisest thing I could do. But the forms of society, you well\nknow, will as effectually separate us, as if I were to remain here.\"\n\nLord Robert's eyes brightened with more than usual animation, as he\nexclaimed--\n\n\"Is that all?--Am I, then, so dear to you, Harley?\"\n\nThe tears glistened in Philip's eyes; and Lord Robert pressing his hand,\ncried, \"Courage, man! We shall find a way to satisfy the most precise on\nthe article of etiquette?\"\n\nSo saying, he hastened to the beach; where he had the satisfaction of\nseeing the boat rowing rapidly towards the shore.\n\nThey found that the vessel was a Portuguese merchant ship; and from the\nknowledge Lord Robert possessed of Spanish, he had no difficulty in\nmaking himself understood by the mariners, who agreed to take him to the\nport of Rio de Janeiro, to which place they were bound; for they only\nlanded to obtain a fresh supply of water.\n\nAs our adventurers were now to leave the island in a few hours, Philip\nbade a mournful adieu to the hut, where he had passed so many happy\nhours, and conveyed their little property to the beach; while Lord\nRobert amused himself by engraving the following inscription on the\ncross.\n\n\"On the 3rd of June, 17--, Lieutenant Lord Robert Summers, and Philip\nHarley, of his Britannic Majesty's ship of war the Diomede, were by the\nespecial mercy of God preserved from the fury of the waves, and\npermitted to land safely on this island; where, after enduring many\nhardships, they became reconciled to their situation, and passed six\nmonths in a state of great happiness, and were at last removed by the\nBrazilian ship St. Sebastian.\"\n\nTheir voyage from the island (to which Lord Robert gave the name of the\nisle of Probation) was short and prosperous; and in less time than they\ncould have expected, they entered the harbour of Rio de Janeiro. Here\nthey began to feel some of the difficulties of their situation. Lord\nRobert had a few pieces of gold about him; but when they made the coast\nof Brazil, the Portuguese master did not fail to make such a demand on\nthe young Englishman, as reduced his whole stock to half a moidore and a\nfew pieces of silver; and these the sailors, on some pretence or other,\ncontrived to extort from him; for being of a generous temper, and always\naccustomed to have money at command, his Lordship knew not how to refuse\nit, even when the prospect of want appeared before him. Philip thought\nhim imprudent, and asked how he proposed reaching England?\n\n\"Oh,\" returned he, in a careless, light-hearted manner, \"we are both\nable seamen; and, at the worst, we can work our passage in the first\nPortuguese vessel that sails for Lisbon: and then, you know, my lad, we\nare within a stone's throw of Old England.\"\n\n\"You work your passage to Europe!\" said Philip, regarding him with a\nlook of astonishment. \"Does your Lordship mean to degrade your rank and\ntalents by taking the berth of a common seaman?\"\n\n\"Once, perhaps, I might have been alarmed at such an idea,\" said Lord\nRobert; \"but since my residence on the Island of Probation, I have\nlearnt the useful lesson, that nothing is really disgraceful but vice;\nand that no useful employment can degrade a man, let his rank be what it\nmay, if there is an actual necessity for his taking it upon him. Of\ncourse, I, Lord Robert Summers, who have the honour to hold the rank of\nLieutenant in his Majesty's navy, would not, willingly take upon myself\nthe post of a common sailor in the Portuguese service: but will not that\nbe less disgraceful than applying to some convent here for relief, and\nliving lazily on their charity till some English ship of war arrives,\nwhose officers, even if they disbelieve my noble birth, may, by\ncross-questioning me, contrive to recognise my rank on the navy-list?\"\n\n\"But surely it was thoughtless of your Lordship to give away your last\nshilling to those imposing fellows, when you have no means of procuring\nnecessaries in a foreign land; and, you know, your health is still\ndelicate.\"\n\nLord Robert, laughing, still defended his extravagance, pretending that\nit was not for the honour of the British navy for a young officer who\nwore an epaulet and the remains of a white lapel, to appear shabby to\nthe crew of a foreign vessel, or behave as if a handful of silver was of\nthe least consequence to him.\n\n\"But,\" continued he, \"I never felt the want of money enough to know the\nvalue of it. Perhaps, as there is no infliction of Providence sent in\nvain, I may, in the privations which I shall most likely suffer in the\nBrazils, be cured of my bad habit of thoughtless extravagance; and if I\ncan contrive to leave one of my follies at every port we touch at in our\nreturn, I may chance to arrive at home a very perfect character.\"\n\nIn the afternoon, the vessel approached the town; and Lord Robert's\nattention was attracted by the appearance of a fine ship lying in the\nKing's dock: slapping Philip's shoulder, he exclaimed--\n\n\"Look at that vessel, Harley! I protest, if her rigging were not\nevidently Portuguese, I should declare it was our old friend the\nDiomede! But, alas! that brave bark foundered in the heavy gale which we\nescaped.\"\n\nPhilip did not perceive the resemblance, and tried in vain to restrain\nthe impatient tone of authority in which Lord Robert ordered the\nPortuguese sailors to lower a boat, and row him and his friend alongside\nthe ship of war, which lay in the wet dock. \"If these fellows knew the\nstate of your Lordship's purse, they would not move their oars quite so\nnimbly,\" said Philip, when they were in the boat; \"neither would they\npay such regard to your impatient gestures to quicken their motions; and\nyou might chance to get thrown into the sea, in return for your\nvociferating, in Spanish, that they are the laziest dogs you ever met\nwith.\"\n\n\"But, Philip, how came you, who are not quite so familiar in the Spanish\nterms of abuse as I am, to guess what I was saying to them?\"\n\n\"Truly, my Lord,\" said Philip, \"I guessed, by your tone and manner, that\nyou were not addressing the most polite expressions to them: and it\nwould perhaps be prudent to remember, that you are not _their_\ncommanding officer; therefore, they are not obliged to put up with any\nincivility.\"\n\n\"True, Philip; I certainly have no right to abuse them; and I perceive I\nhave already violated one of my good resolutions, by giving way to my\nusual intemperance of tongue, on a very slight occasion. Tell me,\nHarley, were you not astonished, after all I had determined on that\nsubject, to see me swaggering and ordering about me, in the boat, quite\nin my old way?\"\n\n\"No, my Lord,\" said Philip drily; \"for I have always heard that good\nresolutions are much easier made than adhered to.\"\n\n\"Well, well! my dear Harley, I must exert all my strength of mind to\nadhere to mine, though I own this is but a bad beginning.\"\n\nAs he spoke, they approached near enough to the vessel to distinguish\nher build by the naked eye.\n\n\"It is a British ship of the line, though Portuguese rigged!\" exclaimed\nLord Robert, starting up in the boat.\n\n\"It is the Diomede itself!\" said Philip, dropping Lord Robert's\nperspective-glass into the water, through which he had been examining\nthe figure-head.\n\nThe sight of this vessel brought a thousand agonizing remembrances to\nPhilip's mind; and he sank on one of the benches, almost annoyed by the\nardent Lord Robert; who, as they dashed up the river, besought the\nrowers in the most moving Spanish he could command, to redouble their\nspeed. He laughed and wept by turns; till the men, shrugging their\nshoulders, protested by all their saints that the young officer was the\nmaddest Englishman they ever had the honour of rowing.\n\n\"Oh, my beloved uncle! My heroic commander! Shall I see you again?\"\nexclaimed Lord Robert, as the sailors rested on their oars under the\nstern of the vessel: and, in another moment, he stood on the deck of the\nDiomede, to the inexpressible astonishment of her officers and crew.\n\nThe bustle on deck brought Sir Henry Stanley to the scene of action; as\nhe advanced, he was struck by the exclamations of--\n\n\"Can it be?--Is it possible?\" On his nearer approach, he could scarcely\ncredit the evidence of his own eyes, when he beheld his lost nephew;\naltered, it is true, from the hardships he had undergone; for he looked\npale and thin, and rather consumptive, and was grown considerably\ntaller. He was leaning on the arm of Philip Harley, his former enemy,\nwho now seemed to regard him with the greatest affection. Sir Henry,\nlike the rest of the officers and crew, was inclined to doubt the\nreality of what he saw; when his impetuous nephew, catching a glimpse of\nhis majestic figure, broke through the group that surrounded him, and,\nthrowing himself into his arms, buried his head in his bosom, and sobbed\naloud. Sir Henry, who fondly loved this young man, and had mourned his\nloss as for that of an only son, now felt himself overpowered by his joy\nat so unexpectedly beholding him.\n\n\"Look up, my dear boy!\" he said, at length recovering his firmness.\n\"Look up, and let me once more behold that beloved face, which I never\nthought to have seen again.\"\n\nLord Robert raised his head, and smiled through his tears on his uncle;\nbut again, yielding to the joy of seeing that dear friend alive, he\nconcealed his face on Sir Henry's shoulder, and wept passionately. Sir\nHenry was at last distressed by his agitation, and forced himself to\nchide him for giving way to such an excessive indulgence of his\nfeelings.\n\n\"Compose yourself, my dear boy!\" said he; \"or you will give these\ngentlemen reason to suspect that it is one of your sisters, who has\ntaken it into her head to assume the appearance of my brave young\nlieutenant.\"\n\nLord Robert was ashamed of giving way to his emotions so publicly; till,\nhaving in some degree collected himself, he looked in his uncle's face,\nand was pleased to find that his eyes were full of tears,\nnotwithstanding the reproof he had just administered to him.\n\n\"And now,\" said Sir Henry, \"I hope that you will consider how powerfully\nthe curiosity of all present is excited, to learn by what means you have\nbeen enabled to appear among us alive and well, when we thought we saw\nyou perish before our eyes, without being able to render you any\nassistance, and after we had deeply deplored your loss.\"\n\nLord Robert stepped back to the spot where he had left Philip, and\ntaking him by the arm, led him to his uncle.\n\n\"For this interview,\" said he, \"under the especial providence of God,\nyou must thank my kind preserver, the brave and noble-minded Harley.\"\n\nSir Henry graciously presented his hand to Philip, who respectfully\npressed it to his lips in silence.\n\n\"Ah, my dear uncle,\" said Lord Robert, in reply to Sir Henry's\ncommendations and grateful expressions to Philip for his care of his\nnephew, \"you know not half his merit yet; nor are you aware,\" said he,\nlowering his voice, \"of half my unworthiness.\"\n\n\"Aware of your unworthiness! No, my dear boy--that is what I hope I\nshall never be,\" said Sir Henry.\n\n\"I fear,\" said Lord Robert, \"you will have reason to blush for your\nnephew soon; for I must summon courage to relate to you a story which\nwill, I fear, deprive me of your affection and esteem for ever.\"\n\n\"I shall be sorry to hear anything that is likely to have such effects,\"\nsaid Sir Henry, gravely: and when he looked from him to Philip Harley,\nand observed his visible agitation, and remembered the bitter hatred\nthat once subsisted between them, he was convinced that Lord Robert had\nsomething to communicate respecting his conduct to the young mutineer,\nnot much to his own credit.\n\nLord Robert was roused from his meditation by the importunities of the\nboatmen who had rowed him to the ship; and it was quite with the air of\nhis former gay liberality that he flung into their boat a handful of\nmoney he had obtained from his uncle for that purpose.\n\nThe appearance of Lieutenant Cary on deck occasioned a great surprise\nto the young friends.\n\nHe was absent on shore when they arrived; and they were the more\ndelighted at finding him alive, from the grief they had felt at his\nsupposed loss. Lord Robert told him the manner in which they had found\nthe chest containing his books, flute, and other property.\n\n\"Ah! my poor books!\" said Cary: \"the chest was weighty; and, in the\nextremity to which we were reduced, after you left the ship, we threw it\noverboard, in common with everything else that was likely to lighten the\nship.\"\n\n\"And pray, how came my poor Neptune overboard? Did you commit him to the\nmercy of the waves in order to lighten the ship?\" said Lord Robert,\npatting the faithful creature as he spoke.\n\n\"What became of Neptune we never knew,\" said Cary; \"but we supposed that\nhe went away with the pinnace; for in the height of our distress, when\nall on board expected the Diomede to founder every minute, the\nboatswain, with one midshipman, and two or three sailors, contrived to\nlower the pinnace and steal away, selfishly leaving their commander and\nmessmates to endure the worst; and, most likely, Neptune, being uneasy\nat missing his master, jumped into the boat and went with them.\"\n\n\"They met with a fitting reward for their cowardly desertion,\" said Lord\nRobert; \"for Neptune was the only creature that reached the island with\nlife: some of the bodies we found and buried. But how came the ship to\nreach the shore of Brazil?\"\n\n\"By the mercy of Heaven, we met some Brazilian proas, which took us on\nboard, and the Diomede in tow; and, having favourable winds and a smooth\nsea, we contrived to get the hulk into the King's dock at Rio de\nJaneiro; where, being a fine new ship, she was found worth repairing and\nrefitting; and here we have been ever since, the Portuguese workmen\nbeing very slow in their operations.\"[6]\n\n[Footnote 6: Commodore Byron found some repairs necessary at Rio de\nJaneiro.--\"We had six Portuguese caulkers to assist our carpenters, who\nwere paid at the rate of 6s. per diem; though it is certain an English\ncaulker could do as much in one day as they did in three; but, though\nslow and inactive, they perform their work very effectually.\"\n\nBYRON'S _Voyage_.]\n\nIt was not till late that day that Lord Robert summoned courage enough\nto disclose to his uncle the whole particulars of his conduct towards\nyoung Harley. It was not without reason that he dreaded the manner in\nwhich Sir Henry would receive this explanation; for he was a man of the\npurest honour himself, and was likely to consider with some severity the\nmisrepresentation his nephew had made to his father, which occasioned\nPhilip's being removed from his home.\n\nLord Robert, when a child, had been treated with ruinous indulgence by\nhis fond parents, by whom his most extravagant whims were considered as\na law to which the whole establishment must submit. Sir Henry Stanley\nwas the only person who had ever attempted the arduous but necessary\ntask of controlling Lord Robert; although, with the self-delusion not\nuncommon in such cases, his noble parents did not scruple to attribute\ntheir son's violent temper and petulant conduct when on shore, to his\nuncle's indulgence. But if there was a man in the world whom Lord Robert\nfeared, it was Sir Henry; yet, at the same time, he was so unerringly\njust and judicious, that his nephew loved him with the most ardent\naffection, and was used to consider the displeasure of his uncle as the\nmost serious misfortune that could befal him: and such was the good\neffect this salutary awe had on him, when on board ship, that Sir Henry\nwas not a little proud of his officer-like conduct, never having had\noccasion to frown on him for any breach of duty or immorality. Lord\nRobert knew the high place he held in his uncle's opinion, and the idea\nof forfeiting his esteem was dreadful. True, he was not actually under\nthe necessity of making a confession so mortifying. Sir Henry need never\nknow the misrepresentation he had made to his father:--a single word to\nthat fond parent would not only prevail on him to bury the whole in\noblivion, but induce him to devise excuses to cover his faults and\nreconcile him to himself. From Harley, he knew, he need feel no fear of\nits being divulged;--that generous friend would, he was assured, take\nthe whole blame of what had passed on himself to screen him from\nreproach.\n\nLord Robert was at first strangely tempted to take these measures, and\nconceal the worst part of his conduct from his revered commander; but\nhis better principles obtained the victory in the struggle, and,\nin a private conference with his uncle, he revealed every\ncircumstance,--beginning with his shooting Philip's dog, and relating\nall that had happened between them till their reconciliation and\nfriendship on the Isle of Probation. And so severely did he blame\nhimself that Sir Henry, moved by his candour, would not increase his\nmental sufferings by any reprimands.\n\nLord Robert was in earnest conference with his uncle that evening and\nthe next morning; during which time Philip had resumed his duties on\nboard: but he was restless and unhappy; for he felt his separation from\nLord Robert had now commenced, and he conceived he should never more\nenjoy the pleasure of his society. In this frame of mind, he looked back\nwith the most painful regret to their residence on the island, and the\ndelightful hours he had spent with his noble friend in the acquirement\nof knowledge. In the midst of these repinings, he received a summons to\nLord Robert's cabin. He did not find any one there; but was told by his\nconductor to wait till his Lordship returned from dining with his uncle.\nAt last, Philip heard a quick and well-known step at the door; and Lord\nRobert rushed in with more than his usual impetuosity, and, seizing\nPhilip by the hand, he exclaimed:\n\n\"Joy, my dear Harley! My noble uncle has forgiven me! For I have\nconfessed everything that has passed between us; and so highly does he\napprove of your generous conduct towards me, that he has granted my\nearnest request of placing you on the quarter-deck of the Diomede, where\nyou are now privileged to appear with the other midshipmen.\"--So saying,\nhe beckoned to his servant who followed him, carrying a full-dress\nmidshipman's uniform. He superintended himself the pleasing task of\narraying his friend in this dress; and buckled on the dirk with his own\nhands, which was the same he had himself worn when a midshipman. When\nall was complete, he surveyed Philip from head to foot with great\nsatisfaction; and assured him that the dress became him as well as if he\nhad been born a gentleman; and, with much animation, expressed his\nconviction that he would, after serving his due time as a naval cadet,\narrive at the dignity of an epaulet, and fill in progression the highest\nsituations in the navy, to which, he was convinced, he would prove an\nhonour.\n\nThe change was so sudden, that it almost took from Philip the power of\nexpressing his joy. Lord Robert could not help smiling to find that he\nhad, for once, overcome that firmness for which Philip generally was\ndistinguished. His agitation was painful in the extreme; but when he did\nat length speak, it was with a vehemence of gratitude, which showed Lord\nRobert the dominion he now possessed over the once stubborn and haughty\nmind of Philip Harley. \"It is not,\" said he, wringing Lord Robert's hand\nas he spoke, \"because I am proud and ambitious, and you have raised me\nfrom my lowly rank, and given me an opportunity of distinguishing\nmyself--this is, indeed, much,--but it is not that which makes my heart\noverflow with joy: it is the consciousness that I shall now sometimes be\nsuffered to be near you, and that my humble situation will not deprive\nme of your friendship.\"\n\n\"Now, my dear friend,\" said Lord Robert, \"I must leave you, though\nagainst my wishes: as the barge is waiting to convey my uncle on shore,\nto spend two days with the Governor, and it is his pleasure that I shall\nattend him. You will, in the mean time, find sufficient amusement, I\ndoubt not, among your brother officers.\" As he said this, he gaily\nwithdrew. Harley pursued his retreating figure with his eyes, as he\nfollowed Sir Henry Stanley and Lieutenant Cary into the splendid\nstate-barge, which the Portuguese Governor had sent to convey them on\nshore. As the sun shone brightly on the gilded vessel, and her silken\nstreamers fluttered in the breeze, it recalled to his mind the\nremembrance of the Ariel; and he recollected with shame his lawless\nexploit of sailing in that fairy frigate, in defiance of her owner, and\nin his very sight.\n\n\"Well might Lord Robert have been enraged at my repeated trespasses!\"\nthought he: and, as he looked down on his new uniform, and considered\nhow engagingly and delicately his noble friend had behaved in presenting\nit to him, he wondered how he could ever have appeared so overbearing\nand arrogant. Yet Philip was deceived when, in the warmth of his\naffection, he thought it must have been his own prejudices that made\nLord Robert appear to him at one time so cruel and tyrannical. It was\nfrom the trials experienced in adversity, that he had learned to correct\nhis faults and follies: yet it is but justice to Lord Robert to say,\nthat he never would have committed such outrages, had not Philip studied\nmodes of insult and provocation sufficient to have irritated a much\ncalmer spirit, and which finally drew upon Philip severe punishment, and\non Lord Robert proportionable remorse and suffering.\n\nWhen Philip presented himself on the quarter-deck, he had the\nmortification to perceive a general coldness and disapprobation among\nthe officers, very painful to one of his quick feelings and high spirit;\nand he attributed this contempt to his low birth. Perhaps many of them\nwere not without prejudice on that subject; but, in addition to this,\nhis former mutinous conduct had not failed to make a very ill impression\non the minds of these gentlemen; and this conduct they now appeared to\nremember, so far as to render the time of Lord Robert's absence very\nuncomfortable, and to deprive Philip of most of the pleasure his new\nrank had given him. When Lord Robert returned, he found his friend, whom\nhe expected to have seen full of joy and spirits, walking by himself in\na very melancholy mood. To his anxious inquiries respecting the reason\nof his dejection, he replied, by relating the various slights which he\nhad experienced since his departure.\n\n\"I went on deck with a heart full of goodwill to every one,\" added he;\n\"and expecting to find every one there noble, generous, and refined,\nlike yourself. But see how they have treated me!\"\n\n\"For which, my young friend, you have no one to blame but yourself,\"\nobserved Lieutenant Cary, who had returned with Lord Robert, and\nlistened to Philip with some interest. Philip looked at him with\nsurprise, but he continued:\n\n\"You perhaps forget, but they doubtless remember, that at the time you\nthought proper to act the part of a mutineer, among the other\naccomplishments of that character, you had a most provoking tongue; and\nthere is not one of these gentlemen but has had a specimen of your\nsarcastic repartees, addressed to them, while in the lawful exercise of\nthe authority with which their country has intrusted them. And they now\nthink fit to show how much they disapprove of your former conduct when\non board the Diomede, and that they do not think one worthy to command\nwho formerly would not obey.\"\n\nPhilip blushed deeply as he assented to the justice of these\nobservations; but Lord Robert, who was highly incensed at the conduct of\nthe officers, exclaimed, with no little of his usual impetuosity,\n\"Nonsense! Cary; they must have seen that I only was to blame for his\nbehaviour then.\"\n\n\"Perhaps, as far as related to the blow which he struck, you were,\"\nreplied Cary; \"and during your residence at the island, to which you\nhave given so _appropriate_ a name, it appears he completely satisfied\nyou for all his offences, and forgave you for yours. But, remember, the\nother officers who had given him no reasonable cause of offence, are not\nobliged to look over all the saucy speeches he addressed to them,\nbecause a reconciliation has taken place between you.\"\n\n\"But when they know all his noble conduct to me, they must and shall\ntreat him with respect!\" replied Lord Robert; and, drawing Philip's arm\nthrough his, he advanced towards the group of officers, who had\nwithdrawn to a different part of the deck, and were discussing the\nmatter among themselves.\n\n\"Gentlemen,\" said he, \"give me leave to present to you my friend, Mr.\nHarley; for whose former faults I own myself more than answerable. He\nis sensible that you all have had cause to be offended with him at\ndifferent times; but he trusts that you will have reason in future to\nforget the rashness of the pressed man in the merits of the midshipman;\nto which rank our noble captain, in reward of his valour in the last\nengagement, has thought proper to promote him. I say nothing of his\nadmirable conduct to myself; though, I trust, that, with all my faults,\nhis having been the means of saving my life will be a recommendation to\nmy brother officers; and I should hope that his lowly birth will not be\nremembered to his prejudice by officers of the British navy, whose boast\nit is that some of its proudest ornaments[7] have risen from before the\nmast.\"\n\n[Footnote 7: Sir Cloudesly Shovel, Admiral Hopson, Admiral Campbell, Sir\nSamuel Cornish, and many other gallant gentlemen, rose from the lowest\nranks.]\n\nA murmur of applause followed this speech, which was seconded by\nLieutenant Cary's presenting his hand to young Harley; and his example\nwas followed by all the gentlemen present, who, with the frankness of\nBritish officers, offered him successively their congratulations on his\npromotion.\n\n\"Spoken like yourselves, my gallant friends!\" exclaimed Lord Robert,\nwarmly shaking hands with his brother officers; \"it shall never be said\nby our enemies, that valour and merit were slighted in the British navy,\nunless recommended by the adventitious advantages of rank or riches in\ntheir possessor.\"\n\nLord Robert knew the way to the hearts of his brave friends. To their\ngood feelings he did not appeal in vain; and Philip never again had\nreason to complain of the least slight or disregard from any officer on\nboard the Diomede; and never till that hour had Lord Robert tasted how\ntruly delightful is the possession of power, when the influence which\nmore or less it holds in society is applied to a noble purpose; and\nPhilip Harley, by his steady attention to his duty, and his officer-like\nand gallant conduct in his new rank, speedily erased from the minds of\nthese gentlemen his former mutinous and violent behaviour, and obtained\nthe highest praise from his just and discriminating commander. How proud\nwas Philip--how happy Lord Robert, whenever Sir Henry Stanley expressed\nhis approbation at this conduct! There never was a friendship more warm\nor sincere than that which now subsisted between the two former\nenemies, who used often to relate their mutual sufferings, as a warning\nof the folly of answering a provocation, or retaliating an injury.\n\nBefore they sailed from Rio de Janeiro, Sir Henry Stanley generously\npresented Philip with every equipment necessary for his appearance as a\ngentleman; and, during the voyage home, he was the friend, companion,\nand pupil of Lord Robert, who delighted to impart to him every\naccomplishment and took the greatest pleasure in witnessing the\ndevelopment of his naturally fine talents.\n\nWhen the Diomede approached the shores of England, Philip again began to\nbe fearful lest the high rank of Lord Robert should separate them; but\nhe was agreeably surprised, when, on their landing, Lord Robert insisted\non his taking a place in the equipage that conveyed him to Lancashire;\nand, though he permitted Philip to visit first the lowly home of his\nsorrowing parents, yet he and his noble father came for him the next\nday, and invited him to the Hall, where he shared in all the unbounded\naffection and caresses which the Marquis and Marchioness bestowed on\ntheir noble son.\n\nOn the first arrival of the Diomede at Rio de Janeiro, Sir Henry\nStanley, supposing he had seen his nephew and Philip Harley perish,\nwrote to England an account of the dreadful loss, which was received\nboth in the cottage and at the Hall with the deepest affliction. Since\nthat time, no communication had been received; but as the Diomede was\nnearly ready to sail when the young friends arrived from the island,\nthey themselves brought the first intelligence to England of their\nsafety and welfare. They found each family in deep mourning, and plunged\nin acute sorrow, which was changed into extravagant joy at their\nunexpected arrival. The Marquis had become acquainted with most of the\ncircumstances that occasioned the enmity between his son and Philip\nHarley, and had suffered much remorse, reproaching himself continually\nfor having torn the only surviving child from his parents to meet an\nuntimely death. From his natural goodness of heart, he greeted Philip's\nsafe return as that of another son, particularly when he found he was\nindebted to him for the delight of seeing Lord Robert once again.\n\nThe unlimited indulgence which the young friends met with at home might\nhave been attended with bad effects, had they remained long exposed to\nits influence. But, in less than a month, they were again summoned to\nresume their duties on board the Diomede, where Sir Henry had hoisted\nhis flag on his promotion to the rank of Admiral.\n\nBoth the friends were possessed of those high talents which, when\ncombined with valour, seldom fail of obtaining great distinction; and so\nnobly did they acquit themselves in their naval duties, that after many\nyears had witnessed their career of glory, and they had attained the\nheight of their profession, England never saw two braver admirals than\nLord Robert Summers and the Mutineer.\n\n\n\n\nARTHUR RIDLEY;\n\nOR, A\n\nVOYAGE TO NORWAY.\n\n\nAmong the springs and mosses of Alston Moor, near the source of the\nSouth Tyne, are several little grass farms, on which are bred sheep and\nblack cattle by the industrious farmers of Cumberland and\nNorthumberland. In a most retired spot between the two counties, dwelt\nold farmer Ridley and his grandson Arthur. The farmer was one of those\nsmall landholders, who are called _statesmen_ in the dialect of the\nnorthern counties; he had lost his wife, but she had left him two sons.\nWalter Ridley, the elder, was the father of Arthur, and captain of a\nmerchant ship, that traded to the Baltic, from the port of Newcastle. He\nhad married a tradesman's daughter from that place, who died when little\nArthur was but two years old; and Walter, who knew not what to do with\nso young a child, begged his father to take the boy, and bring him up at\nthe farm, till he was old enough to go to sea. About four years after,\nHugh Ridley, the farmer's younger son, was killed in the command of a\nprivateer, while he was endeavouring to take a French merchant ship. It\nwas greatly against the wishes of old Mr. Ridley that both his sons\nfollowed so dangerous a profession: one of them, at least, he hoped\nwould have remained at home to assist in cultivating the peaceful little\nfarm which had descended from father to son for three centuries; but\nboth the sons made light of the wishes of their father; and Hugh\nactually disobeyed his express commands, when he became captain of the\nprivateer; a mode of life agreeing well enough with his rude rough\nhabits, but which the good farmer abhorred and detested, justly\nconsidering such an occupation to be but one degree better than the\npursuits of a pirate. This act of disobedience was soon punished; for\nHugh Ridley fell in the first engagement, leaving a young widow and a\nlittle girl quite destitute. His death filled his father's heart with\nsorrow, and he lost no time in fetching his widowed daughter-in-law and\nher little Phoebe from Newcastle, and bringing them to his own quiet\nhome, to the great joy of young Arthur, who promised to love aunt Rachel\nand cousin Phoebe better than his best pet lamb. Indeed, he said that\nlittle Phoebe was much prettier than his finest cosset; besides, she\ncould answer all his questions, and ask him a thousand in return. They\npassed their happy summers together, keeping the sheep and cows on\nAlston Moor; in the winter, their good grandfather taught them to read\nthe Bible; and in the long evenings, Phoebe spun by her mother's side,\nwhile Arthur learned to write and keep accounts. Arthur seldom saw his\nfather, who only came to the farm for a few hours, when he was on shore,\nand then only laughed at his quiet habits and peaceful temper, slapped\nhim rudely on the back, and asked him whether he were not ashamed of\nremaining lounging on shore like a coward and a milksop.\n\nBut Arthur was no coward. True, his very fair complexion and placid\nfeatures gave him that gentle look which might well deceive careless\nobservers into the belief that any insult might be offered to him with\nimpunity; but there was a quiet, determined firmness in his\ncharacter,--a spirit which silently says, on the appearance of any\ndifficulty, \"I will overcome it.\" On such minds success is a sure\nattendant: they follow the toilsome path which leads to glory and\ndistinction with unwearied and steady steps, and often leave those of\nbold demeanour and boasting tongues at a hopeless distance.\n\nMr. Ridley's house was a very long way from the other farms; so when\nArthur and Phoebe drove their cattle to any distance from home, on the\nmoor, to seek fresh pasture, they were considered as strangers and\nintruders, by the boys who kept the flocks of the neighbouring farmers.\nThough somewhat older than Phoebe, Arthur was scarcely so tall as the\nblooming girl; and she looked better able to be his protector, than to\nreceive assistance from him; but Phoebe knew well to whom to fly in\nany danger, as her cousin would beat off the most ferocious dog, or the\nbiggest boy that strove to molest her. The farmers' sons in the\nneighbourhood, when once they had tried the force of Arthur's well-knit\nlittle arm, and felt the effects of his cool, determined courage, soon\nretracted the mean opinion they had formed of his prowess; and left off\ntheir favourite amusements of pelting his whitest lambs with mud, and\nrunning after Phoebe, to pull the long flaxen ringlets which floated\nfrom under her bonnet.\n\nAt fourteen, Arthur Ridley thought himself the happiest boy in the\nworld; for his grandfather had a gold medal presented to him at an\nagricultural meeting in the county, as a prize for showing there six\nfiner and fatter lambs than any one else could produce. Mr. Ridley told\nevery one that it was by the care and attention of his grandson, that\nhis flock throve so well; and the nobleman who held the meeting patted\nArthur's head, and told him he would be an honour to Cumberland, and\nhoped that he should see him at the next sheep-shearing. Oh! how Arthur\nloved the dear little lambs that had obtained for him such an honour!\nAnd, all the way home, he secretly resolved never to be anything but a\nfarmer.\n\nWe may suppose that Arthur anticipated the next June with great delight:\nbut, alas! the succeeding summer, though it bloomed fairer than ever,\nbrought no joy in its course to him; for it was in that lovely season\nthat his young heart was to know the first taste of sorrow.\n\nThe spring set in cold and stormy, and it was a very bad lambing-time\nfor the ewes. Farmer Ridley was more anxious for their well-doing than\nusual, and, in taking care of some of the early new-fallen lambs, he\ncaught a bad cold, attended with ague, which hung on him through the two\nsucceeding months; and before May came with all her flowers, even the\ninexperienced eyes of his grandchildren read, in his sunken temples and\nhollow cheeks, that the mortal foe within would soon rob them of their\nvenerable protector. Arthur's father had passed the winter in Hamburgh,\nand was now expected home every day. Mr. Ridley wished much to behold\nhis son once more in this world; and he seemed to linger from hour to\nhour, in the hope of seeing him again; till, about eventide, on the 2nd\nof May, his last minutes drew to a close. \"Arthur,\" he said, in a faint\nvoice. Arthur started from the place where he was leaning his head\nagainst the casement, and approached the bed.\n\n\"Arthur,\" he said, \"your father is away; but tell him from me to take\ncare of your aunt Rachel and your cousin Phoebe: I have little to\nleave them; for the farm is entailed on my eldest son, and must descend\nto you. Tell him that my dying request is, that he will never suffer\nthem to want a home. They will find, in my oaken box, eighty guineas in\na yellow canvas bag, and my will, which directs the money to be divided\nbetween them. And now, Arthur, my dear boy, you have ever been a dutiful\nchild to me; be the same to your father, whatever his commands may be,\nand make it your rule to do your duty in that state of life unto which\nit may please God to call you.\"\n\nThe rising sun beamed on the bed of death; the venerable Mr. Ridley was\nno more! And his sorrowing family were not to be consoled. The next\nSunday, they followed his remains to the grave. It was in vain that the\nfirst day of early summer smiled on them, and that between every solemn\nresponse of the burial service the blackbird sang loud and joyously;\ntheir hearts no longer leaped to the sound once so full of delight.\n\n\"Oh, Arthur,\" said Phoebe, as her tears fell on her black sleeve, \"we\nshall never see May-flowers again without mourning!\"\n\nThree melancholy days passed on, before Arthur could resume his former\nemployments; but on the evening of the fourth, after he had folded his\nsheep, he returned home, expecting to see aunt Rachel busy in preparing\nthe milk-porridge for their supper, and Phoebe watering the flowers,\nor gathering salad in the garden. Phoebe was not there. He lifted the\nlatch of the door; his cousin was laying the cloth, and aunt Rachel was\nroasting a fowl for supper. In the chimney-corner, and in his\ngrandfather's high-backed chair, sat his father. Walter Ridley's stern\nfeatures were softened by an expression of grief; he looked more kindly\non his son than he had ever done before; and Arthur thought that when\ntime had whitened his thick black hair, and dimmed the fire of his dark\neyes, he would resemble in person his lamented grandfather.\n\nCaptain Ridley was very kind to his sister-in-law and niece; and when\nArthur told him the last request of his father, he patted Phoebe's\ncurly head, and said:\n\n\"Never fear, pretty one, I'll take care of you and your mother; you\nshall never want for a shilling, whilst Wat Ridley has one, if it's only\nfor the sake of poor brother Hugh. Your uncle Hugh was a brave fellow,\nArthur! I wish I could see some of his manly spirit in you, boy!--So,\nsister Rachel, you shall live in the farm, and look after the kine and\nsheep, and live as comfortably as you can. If you have a shiner or two\nover and above at the end of the year for me, it's all very well; and if\nyou have not, I shan't complain; so don't starve your little one here.\nAnd when Arthur and I come back, after roving the salt waters for five\nor six years, mayhap we may stay at home for good; that is, if Phoebe\nshould like the lad for a husband, and he should fancy her.\"\n\nRachel thanked her brother-in-law for his kindness towards her and her\nchild; but Arthur, though much pleased with his father's intentions in\nrespect to his cousin, did not like what he said about the sea.\n\n\"Are you determined that I shall be a sailor?\" he asked, in a\ndisconsolate voice.\n\n\"Hark'e, boy,\" said Captain Ridley; \"I am determined to make a man of\nyou. So don't let's have any puling and muling, but pluck up a good\nheart: and if you be a coward, don't show it. I have bought a good tight\nship at Hamburgh, and have laid out all my earnings for these twenty\nyears, that I may be owner of the vessel I sail in; she is freighted\nwith a valuable cargo, and will soon sail for Norway; and you are to\nhave a berth in her: so say no more, for I have made up my mind on the\nmatter.\"\n\nArthur submitted in silence; for he well remembered the last words of\nhis grandfather, and made up his mind to obey his father, let his will\nbe what it would; besides, he was very grateful for the kindness shown\nto his aunt and cousin. \"I shall leave them in the bosom of our peaceful\nhome,\" thought he; \"so I must not displease my father, for he must have\na good heart to be so kind to them.\"\n\nIn two days, Captain Ridley declared his intention of being off, as he\ncalled it. In vain Rachel and Phoebe pleaded for time to make Arthur\nsome new shirts, and pack up different things that he would want during\na sea-voyage.\n\n\"No, no,\" said Captain Ridley; \"the boy has been made too much of a pet\nand cosset already. I shall fit him out with check-shirts and blue\njackets at Newcastle. I'll make a brave fellow of him, I warrant you.\nThere's been too many parsons and farmers among the Ridleys. Nobody\nwould believe they came of the same bold fellows who used to ride the\nborder some three hundred years ago. Who ever heard of a boy making a\nbrave, manly character, who spent his time lounging at the tails of two\nor three kine or sheep? So, Arthur, my boy, your aunt and cousin will\nfind you quite a different sort of a lad when you come home from your\nfirst voyage.\"\n\nThe next morning Arthur bade adieu, with a heavy heart, to the home he\nloved so much; and kissed his good aunt and the weeping Phoebe, with\ntears in his eyes; but he durst not cry, for fear of bringing on himself\nthe rough taunts of his father. Captain Ridley had been to the village\nchurch-yard that morning, to visit the new-made grave of his father; he\nthere remembered that he had not always been the most dutiful of sons to\nhim who now slept beneath the green turf; and he felt half inclined to\nfulfil what he knew was his departed father's wish, and suffer Arthur to\nremain at home and look after the farm: but then he thought again, that\nwhen he grew old, and left off going to sea, and came to live at home,\nthere would be no one to talk to him of seafaring matters: so he\nhardened his heart against the tears and entreaties of Phoebe and her\nmother, and took Arthur to Newcastle, where his ship, the Aurora, lay in\nharbour, ready to sail.\n\nArthur found this new mode of life even more disagreeable than he had\nimagined; however, he made a resolution to go through all that was\nrequired of him with uncomplaining patience, and to shrink from none of\nthe hardships of his situation. Neither his father nor any of the crew\nwere disposed to lighten his difficulties; all were on the watch to jeer\nat the mistakes of the young landsman; not but they were a little\nsurprised to see him go through the first seasoning of a seafaring life\nwith so much spirit. The sailors, naturally generous and frank, in a\nlittle time began to look on him with more favourable eyes, particularly\nan old friend of his father's, who sailed in the Aurora as mate.\n\n\"Well, Captain,\" said he one day, as he saw Arthur aloft, and going\nthrough his duties with great adroitness, \"what do you think of our\nyoung seaman now? To my mind, he will turn out as brave a fellow as ever\nstepped between stem and stern.\"\n\n\"He is better than might be expected from his breeding,\" returned\nCaptain Ridley: \"but I doubt he will turn out a sad chicken-hearted\nthing in time of danger.\"\n\n\"We shall see,\" said the mate: \"but if young Arthur don't show more\nspirit than many of those who talk big and bluster, never believe a word\nthat old Jack Travers says to you again.\"\n\n\"Well, well, old shipmate, I wish it may be as you say; but, I own, I\nhave not such good hopes of him.\"\n\nArthur soon found a good friend in Jack Travers, who was determined that\nhe should not disgrace his predictions. During their voyage to Norway,\nhe taught Arthur to keep the log-book, to take the sun's meridian\naltitude, to navigate the ship, and to perform the duties of a complete\nseaman.\n\nTravers had spent the chief part of his life at sea, and had seen and\nsuffered much. He had twice lost his all by shipwreck, and had once been\ntaken prisoner by the French; he had of course seen a great deal of the\nworld, and had made many intelligent observations on the countries where\nfortune had thrown him; and was intimately acquainted with the customs\nand manners of the people whose shores they were now approaching.\n\nOne summer night, when Arthur and Travers were on the watch together,\nTravers began to tell him of all he had suffered by storm and wreck, in\nthe course of a long and disastrous life. \"The last ship I sailed in,\"\nsaid he, \"the unfortunate Ddalus, was wrecked on one of the small\nislands that stud the coast of Norway, off Drontheim. Now, there was no\nvery good understanding between the English and the subjects of the King\nof Denmark, because of the battle of Copenhagen, the carnage of which\nwas so great as to occasion general mourning and sorrow throughout\nDenmark and Norway. However, the brave Norwegians did not look upon us\nin the light of enemies, but as suffering and shipwrecked men, and\ntreated us most kindly during the time we remained with them; which was\nmore than three of their winter months. A merchant of Drontheim gave me\na berth in a ship of his, that was bound to Hamburgh; and there I met\nwith your father, Arthur, who never was yet the man to see an old\nshipmate in distress without giving a helping hand. He offered to put me\nas mate in the Aurora, which he had just purchased. So here I am; but\nwhether my bad fortune will pursue me still, I know not.\"\n\n\"I hope not,\" said Arthur; \"for it is hard, at your time of life, to be\nwithout the means of obtaining those comforts you will soon greatly\nneed: but did you not spend your time very miserably, to pass so many\nmonths in a strange country, the language of which was unknown to you?\"\n\n\"As for that,\" returned Travers, \"thank God! I am not given to be very\nmiserable anywhere. A seaman, who knows his duty, bears cheerfully\nwhatever hap Heaven may send him. But in fact, I never passed any time\npleasanter than I did in Norway. We were quartered on the farmers and\npilots who inhabited the coast where we were thrown. The good people,\ninstead of murmuring at the burden of our maintenance, came down with\ntheir sledges, and contended whose home should afford shelter to the\nshipwrecked strangers. I was not willing to eat the bread of idleness,\nso I lent a helping hand to whatever work was going forward. As to\nlanguage, I found the inhabitants of the sea-coast very familiar with\nthe English tongue; and I knew a little German, by reason of trading to\nHamburgh; so, between the two, we made out very well. The coast of\nNorway is tremendous to the sailor at the fall of the year, when the\nequinoctial winds begin to blow; as you will judge when I tell you the\nobservations I have made during my acquaintance with it. The coast\nextending upwards of three hundred leagues, is beset with a multitude of\nsmall islands, affording habitations to fishermen and pilots, and\npasture to a few cattle. They form an infinite number of narrow\nchannels, and a natural barrier of rocks, which render Norway\ninaccessible to the naval power of its enemies. Attempts of this kind\nare the more dangerous, as the shore is generally bold, steep, and\nimpending; so that, close to the rocks, the depth of the sea amounts to\none hundred, two hundred, and even three hundred fathoms. You may easily\njudge of the fate of the unfortunate ship that is hurled by tempests\nagainst any of these frightful rocks: if she breaks, she instantly\nfills, and must go down into a dreadful depth of water; and it is only\nby the most signal mercy that any of the crew is ever saved. The perils\nof the North Sea are also increased by sudden streams, sunk rocks,\nviolent currents, and dreadful whirlpools. The most remarkable vortex on\nthe coast is called Moskoestrom, from the small island Moskoe,\nbelonging to the district Lofoden. In time of flood, the stream runs up\nbetween Lofoden and Moskoe, with the most boisterous rapidity; but in\nits ebb to the sea it roars like a hundred cataracts, so as to be heard\nat the distance of many leagues. On the surface are many vortices; and\nif in one of those any ship be absorbed, it is whirled down to the\nbottom, and dashed in pieces against the rocks.\n\n\"When its fury has been heightened by a storm, no vessel ought to\nventure within a league of it. Whales are frequently absorbed within the\nvortex, and howl and bellow hideously during their fruitless endeavours\nto free themselves. A bear, in attempting to swim from Lofoden to\nMoskoe, was once hurried to this whirlpool, from which he struggled in\nvain for deliverance, roaring so loud as to be heard on shore; but,\nnotwithstanding all his efforts, he was borne down and destroyed. Large\ntrees, being drawn into the current, are sucked down, and rise again all\nshattered to splinters. There are three vortices of the same kind near\nthe islands of Ferroe.\"\n\nBefore the vessel reached Christiania, the short northern summer had\ncommenced in all its beauty. Arthur had expected to see an icy, desolate\ncoast; he could not think that fair sunny days would smile so far\nnorthwards; and when the Aurora entered the bay of Christiana, he could\nscarcely believe it was the port to which they were bound.\n\nBefore them lay the town of Christiana, situated at the extremity of an\nextensive and fertile valley, forming a semicircular bend along the\nshore of the beautiful bay. The grounds, laid out in rich enclosures,\ngradually sloped to the sea. Behind, before, and around appeared the\ninland mountains of Norway, covered with dark forests of pines and fir,\nthe inexhaustible riches of the North. The most distant summits were\ncapped with perpetual snows. From the glow of the atmosphere, the warmth\nof the weather, the variety of the productions, and the mild beauties of\nthe adjacent scenery, it was hardly possible to believe that they were\nnearly under the sixtieth degree of latitude.[8]\n\n[Footnote 8: Cox's Travels.]\n\n\"Is it possible?\" said Arthur, as he stood on deck by the side of\nTravers; \"can this blooming land be one of the coldest and most barren\nregions of the North?\"\n\n\"Ah,\" said Travers; \"but you see it in the midst of its short, lovely\nsummer; its aspect would be bleak and horrid, were you to visit it\nduring the nine winter months. Were you to hear the roaring of the winds\namong the mountains, the fall of great heaps of snow, and oftentimes of\nhuge masses of stone and rocks from their heights--sometimes choking up\nthe course of rivers, and overwhelming the cottages of the peasants--you\nwould then hardly believe that the return of the sun could produce so\nmuch beauty as you now see before you.\"\n\n\"I have heard,\" said Arthur, \"that, farther to the North, the sun never\nsets in the height of summer, nor rises in the depth of winter.\"\n\n\"I have been at Tronsen,\"[9] said Travers, \"near the northern extremity\nof this country, where the sun is continually in view at midsummer; I\nhave seen it circulate day and night round the North Pole, contracting\nits orbit, and then gradually enlarging it, until it leaves the horizon.\nIn the depth of the winter, therefore, it is for some weeks invisible:\nand all the light perceived at noon is a faint glimmering, for about one\nhour and a half, which proceeds from the sun's rays being reflected from\nthe highest mountains. But the inhabitants have other lights, by which\nthey follow their work in the open air. The sky being very clear, the\nmoonshine is remarkably bright: they are likewise much assisted by the\nNorthern Lights,[10] which are very frequent in these parts of Europe.\"\n\n[Footnote 9: Encyclopdia Britannica.]\n\n[Footnote 10: Otherwise called Aurora Borealis.]\n\n\"My grandfather showed me the Northern Lights once, in Cumberland,\" said\nArthur; \"and told me they signified that something very dreadful would\nsoon happen to the country; for they were never seen but when famine, or\nplagues or rebellions were about to come to pass. What do you think\nabout it, Travers? are such bad things very common in Norway?\"\n\n\"Not that ever I heard,\" returned Travers. \"Indeed, the poor people\nwould be in a desperate way, if they were to have plagues and battles\nevery time they saw the Northern Lights. Why, Arthur, they see them as\noften as we see the stars in England; and I have read, on a Sunday\nnight, the psalm for the day out of my prayer-book, as plain in the open\nair, at ten o'clock, as ever I did by a candle. But that's the way with\nyou landsmen: you sit at home and scare yourselves, and shake your wise\nheads, and prophesy evil, if a little glimmer reaches you of what is as\ncommon as the air you breathe in other countries.\"\n\nArthur did not greatly approve of hearing the opinion of his venerated\ngrandfather treated with so much contempt: yet he plainly saw the folly\nof converting into an omen of ill a harmless and beautiful meteor; which\nis a blessing, as common as it is useful, in a country a few degrees\nfarther to the north.\n\nCaptain Ridley soon became very busy in disposing of his cargo, and\nbuying the different commodities that Norway produces, to reload his\nvessel with. He bought copper, and iron forged into bars, (the iron of\nSweden and Norway is esteemed very good--much better than any England\nproduces;) marble he used for ballasting the ship; he likewise bought\ngoat-skins, and seal-skins, and some very valuable furs of the fox and\nmarten, of which he expected to make a great deal of money in England.\nAnother article of commerce, which is sold to great advantage in\nEngland, Captain Ridley made part of his cargo, viz. eider-down\nfeathers.[11] He gave his son leave to purchase what pleased him most,\nto take home as presents for his aunt and cousin. Arthur accordingly\nbought a handsome fur cloak for aunt Rachel, and some curious baskets\nmade of birch-bark, and beautifully wrought with coloured quills, for\nPhoebe. They passed about two months in Norway: by the expiration of\nwhich time Captain Ridley had completed his lading, and got everything\nready for returning to England.\n\n[Footnote 11: The mollissima, or eider-duck, is double the size of the\ncommon duck. The feathers, which are soft and valuable, fall off during\nincubation. The male is white above, but black below and behind; the\nfemale is greenish. This species is found in the Western Isles of\nScotland, but in greater numbers in Norway, Iceland, and Greenland; from\nwhence vast quantities of the down, known by the name of _eider_, or\n_edder_, (which these birds furnish,) is annually imported. Its warm,\nlight, and elastic qualities, make it highly esteemed as stuffings for\ncoverlets and down beds. This down is produced from the breast of the\nbirds, in the breeding season. The eider-duck lays its eggs among the\nstones or plants near the shore, and prepares a soft bed for them by\nplucking the down from its own breast; the natives watch the\nopportunity, and take away both eggs and nest. The duck lays again, and\nrepeats the plucking of its breast. If she is robbed after that, she\nwill still lay; but the drakes must supply the down, as her stock is now\nexhausted: but, if her eggs are taken from her a fourth time, she wholly\ndeserts the place. The number of eggs in each nest are from three to\nfive, warmly bedded in down; they are of a pale olive colour, and very\nlarge, glossy, and smooth. The ducks now and then, however, lay as many\nas eight, for sixteen have been found in one nest, with two females\nsitting on them, who agree remarkably well together. They take their\nyoung on their backs to sea; then dive to shake them off, and teach them\nto shift for themselves. They live on shell-fish, for which they dive to\ngreat depths. The males are five years old before they come to their\nfull colours. It is said they live to a great age, and grow quite\ngrey.]\n\nArthur's heart bounded with joy as the sails were set for England; and\nhe now looked forward with sensations of pleasure towards the\ncontinuance of the life which his father had chosen for him. He had\ngained experience and knowledge, and felt happy that he had obeyed his\nparent, however distasteful his commands were at first. Captain Ridley\nwas very proud of his ship; her clever sailing and tight figure were the\nperpetual theme of his discourse and admiration: he was, besides, in\nexcellent spirits on another account; for he felt confident that he had\nlaid out his money to great advantage in the cargo, and expected a clear\nprofit of several hundreds.\n\nThey ran before a favourable gale for some days, till, one clear lovely\nmorning, as Captain Ridley was standing on deck talking over his\nexpected gains with Arthur, Travers called from the main-top, \"Look\nabaft, Captain; for I think we are chased?\" Ridley flew to his cabin,\nand returning with his telescope, plainly saw a ship bearing down before\nthe wind, in full pursuit of them. All hands instantly went to work, to\nraise every bit of canvas the Aurora could carry; and as she was a\nswift-sailing vessel, they had hopes that she would keep ahead of the\nenemy until night came on, when she might elude the pursuit under the\nshades of darkness. But, alas! the same gale which bore the Aurora so\nbravely along, brought her lightly-laden pursuer more swiftly after her.\nAt length, after a hard chase, and a day of the most agonizing suspense\nto our poor countrymen, about sunset their fate seemed decided, when the\nadverse ship bore down upon them within hail, and fired a gun to bring\nthem to. The crew of the Aurora still ventured to hope that, after all,\nshe might be a neutral ship; but the experienced eye of Travers had from\nthe first noted all her bearings, and felt convinced that she was a\nFrench privateer; which was soon confirmed by her hoisting the\ntri-coloured flag, and preparing to board. To resist was utterly\nuseless, as a single broadside from the armed ship would have soon\nsettled the fray: and Captain Ridley saw his favourite ship the prey of\nthe most lawless and insolent crew that ever manned a privateer!\n\nTo a man of Ridley's violent passions, this stroke was worse than death;\nbut his indignant expressions were only answered by laughter and mockery\nfrom the enemies into whose hands he had fallen, and who added insult\nand ill-usage to the calamities of war. It was at that period of the\nFrench Revolution when the war was carried on between the two nations\nwith a fury scarcely known in modern times, and the animosity of the\nFrench towards our country knew no bounds.\n\nThere could scarcely be a more dreadful situation than that of the crew\nof this defenceless merchant ship, which had fallen into the hands of\nmen whose bad passions were inflamed by national hatred. For many hours,\nthe English expected every moment to be their last. Outrage succeeded\noutrage, and massacre seemed resolved on; but at last, after many blows\nand much reviling, the privateers contented themselves with thrusting\ntheir prisoners, strongly ironed, into the hold. These were horrors of\nwhich poor Arthur had never even dreamed; yet, in the terrors of that\ndreadful night, there was a satisfaction to his well-regulated mind in\nthe consciousness that he was near his suffering parent, and could\noffer all the consolation that can be received from the affection of a\ndutiful child. And, truly, Captain Ridley had great need of it.\nNeglected by the ruffians who had conquered them, they were left without\nfood; and, what was infinitely more needful, without water. This, joined\nto want of air, (the hatches being close shut down,) made their\nsituation almost equal to that of the prisoners in the black hole at\nCalcutta.\n\nWalter Ridley had hitherto been a fortunate man in life: where others\nhad met with storms and capture, he had sailed securely and\nprosperously. This he did not fail to attribute to his own wisdom and\nmerit, instead of ascribing it to the protecting hand of a bountiful\nProvidence; therefore, when this reverse of fortune came, he received it\nwith transports of rage, instead of patience and resignation. The\nviolence of his emotions, and the confinement and ill usage he\nunderwent, had such an effect on his frame, that, long before the\nmorning, he was attacked by a dangerous illness. Poor Arthur sat by him,\nholding his burning hands, and offering his bosom as a pillow to his\naching head; nor could the wild and frantic exclamations, uttered in the\ndelirium of fever, affright the affectionate boy from the side of his\nsuffering father.\n\nThe next day had nearly passed, before the captors thought fit to take\nany notice of their prisoners; they then resolved to divide the English\ncrew; for as the captain of the French privateer determined to cruise in\nsearch of fresh prey, he did not choose to encumber himself with his\nprize.\n\nSeven of Captain Ridley's crew were carried on board the privateer; and\nhimself, Travers, and Arthur, were left below, with two sailors, in the\nhold. The French captain put his mate and a few seamen on board the\nAurora, just sufficient to navigate her into Dunkirk, and proceeded on\nhis cruise. The situation of the prisoners was now a little improved:\nfor the mate, to whose charge they were committed, took off the fetters\nfrom Captain Ridley and Travers, and allowed them better berths; and\nwhen Arthur, by signs, made him understand how ill his father was, he\ngave him some wine, and suffered him to occupy the cabin that had\nformerly been his own. For some days, Arthur thought it impossible for\nhis father to live, as his illness was violent, and he had no medical\nassistance; yet the strength of his constitution was such, that in a\nfew days he passed the crisis of the fever favourably, and got a little\nbetter, though he remained as weak and feeble as an infant. Travers kept\nup his own and Arthur's spirits with the hope that they might fall in\nwith some British cruiser and be retaken; but, however probable such a\ncircumstance was, yet day passed after day, and they still remained\ncaptives, until it was reckoned that another or two would bring them\ninto a French port. Arthur's mild manners and affectionate attention to\nhis sick father induced the French mate to permit him to come when he\npleased on deck; and one morning, after he had watched by his father\ntill he fell asleep, he asked Travers to supply his place while he went\non deck to take a little fresh air. He sat down on a chest, after he had\npaced to and fro in a very melancholy mood, and began to muse\nsorrowfully on the case they were in. \"Here,\" thought he, \"my poor\nfather will be dragged to a French prison, and there he must die; for,\nin his weak state, the hardships he will have to go through will\ncertainly kill him; and, perhaps, I shall never see England, nor my\nhome, nor my cousin Phoebe again! Is there no remedy to be found for\nall this?\"\n\nHe kept lifting up the lid of the chest he sat on, without noticing what\nhe was about, till he pinched his finger pretty sharply, which drew his\nattention to it; and he saw it was a chest of arms belonging to the\nFrenchmen, and filled with sabres and muskets. At the first glance of\nthese weapons, a thought darted through Arthur's brain, which he\ninstantly ran down to communicate with Travers. He mentioned the arms to\nhim, and said: \"What hinders our retaking the ship? Surely it might be\ndone with a little prudence and courage.\"\n\n\"And dare you venture on a scheme so full of peril? Can you look death\nstoutly in the face? For I tell you plainly, if we should fail, death,\nwithout mercy, would be our portion. Think on it, boy, and search your\nown mind; for an undertaking of this kind requires a cool head and an\nundaunted heart!\"\n\n\"I dare,\" said Arthur firmly, laying his hand on his breast; \"I will\nfreely venture my life to regain the ship and our liberty. Think of a\nplan, and I will do my part as far as my strength will go.\"\n\n\"I have thought much of it already,\" answered Travers; \"but your years\nwere so tender, that I mistrusted your prudence, though not your\ncourage. If we attempt it, we must proceed by art, rather than by force.\nWe must take the opportunity of mastering the French, when one part of\nthe crew are asleep and the other off their guard.\"\n\n\"In the night, I suppose?\" said Arthur.\n\n\"Yes,\" said Travers. \"It will be a sanguinary business; but the\nprovocation was theirs. Surely a man may strive even unto death for his\nliberty.\"\n\n\"Ah!\" said Arthur; \"but it is a frightful thing to murder so many\nsleeping men--to send so many to their great account, without a moment's\nwarning. I have thought that it is possible to take them prisoners\nwithout hurting them.\"\n\n\"Well!\" said Travers; \"let us hear your plan. I should be glad of\nanything that would save me the horrid work of despatching sleeping\nmen.\"\n\n\"If I had a large gimblet and a dozen strong nails,\" said Arthur, \"I\nwould engage to secure all the Frenchmen but two, without hurting a hair\nof their heads.\"\n\n\"Yours seems a notable plan!\" said Travers; \"and if it is only the want\nof such tools that stops you, here is a great gimblet that the\nFrenchmen lent me, instead of a corkscrew, and you will find two or\nthree hundred large nails in that cupboard. But tell me how such a\nlittle fellow as you can think of mastering six stout men?\"\n\n\"You know,\" replied Arthur, \"that if a hole were bored in the panels of\nour sleeping berths, and a nail slipped in when they are shut, it would\nbe impossible to slide them back, to open them. I go about the ship\nwithout being suspected, and could take the opportunity, when the men\nare all on deck, of boring a hole, and fitting a strong nail in each\nberth, ready to be put in when I choose; and when the Frenchmen are all\nsafe asleep in their berths, I may put in the nails, and they will be as\nsafe as if they were caught in so many traps.\"\n\n\"It is an ingenious scheme,\" said Travers; \"and I allow that it has\nevery prospect of success. To-night, therefore, we will make the\nattempt; for every hour brings us nearer to Dunkirk. But hark'e, Arthur;\ndon't let your father know our plan till it has either succeeded or\nfailed; for he is so impatient, and still so weak, that the suspense\nwould probably kill him.\"\n\n\"It will be much the best,\" said Arthur; \"but I must go, for the\nFrenchmen are all on deck,--so now or never.\"\n\nSo saying, he left the cabin. Hour passed after hour, and Travers saw no\nmore of him. Captain Ridley awoke; and Travers gave him some gruel,\nwhich he had boiled for his dinner. The sick man found great fault with\nit, and inquired very peevishly for Arthur. Travers made him some vague\nanswer, and Captain Ridley complained much of his absence, assured\nTravers that he was the worst nurse in the world, and that it was a\nshame for that boy to leave him, and at last grumbled himself to sleep\nagain.\n\nTravers now began to be exceedingly alarmed; thinking that Arthur had\nbeen taken in the attempt, and perhaps murdered. He looked at the sun,\n(for his captors had spared him the trouble of keeping a watch,) and\nthought it might be about four o'clock, when Arthur appeared at the\ncabin-door, and with a pale cheek, but a look of determined courage,\nbeckoned Travers, without uttering a word. He left the cabin, and\nfollowed Arthur with a noiseless step. While they were ascending the\ncompanion-ladder, Arthur turned round, and said in a low voice: \"Every\nman in the ship is secured excepting two; one of whom is at the helm,\nand the other in the shrouds: master them, and the ship is ours!\"\n\nThere was no time for questions; or Travers would have asked how all\nthis came to pass: but Arthur hurried him on deck; and, going to the\narm-chest, gave Travers a sabre, and armed himself with a musket.\nTravers stepped to the steerage, and took the helmsman unawares; who\nuttered a cry of astonishment at seeing a man standing near him in a\nthreatening attitude, with a drawn sabre in his hand, and began, with a\nloud voice, to implore for mercy. This supplication reached the ears of\nhis companion in the shrouds, who, putting a stop to the Marseillaise\nHymn, with which he was entertaining himself, began to descend with\ngreat expedition. But Arthur stopped his progress by levelling his\nmusket at him; and by his menaces made him understand, that if he did\nnot remain where he was, he would receive the whole contents in his\nbody. Now the French sailor did not know, nor did Arthur at the time\nremember, that there was no charge in the musket. However, it had the\neffect of intimidating the man, who made signs that he would obey, and\nsupplicated with his hands for his life.\n\nTravers and Arthur had proceeded thus far with success; but they were at\nthis moment in a most awkward predicament, for each held his man in\ncheck, yet it was necessary to do something more. The steersman was a\nstrong muscular fellow, and notwithstanding that, had at first been\nfrightened by the suddenness of the occurrence; yet Arthur saw, by the\nexpression of watchfulness that lurked in the turn of his eye, that he\nonly waited till Travers was off his guard, to spring upon him.\n\nThere was a coil of strong rope, which lay about twelve paces from\nArthur on the deck; of this he longed to make himself master: but he was\nafraid of taking his attention from his prisoner above; for he knew how\nsoon a sailor could swing himself from rope to rope, and stand on deck\nin a moment. At last he lost all patience, and determined to trust to\nthe man's fears: so with one spring he seized the cord and gave it to\nTravers, and resumed his guard with the musket, whilst Travers pinioned\nhis prisoner, and bound him so strongly that escape was impossible. They\nthen beckoned the man above to descend, and soon bound him safely.\n\"Now,\" said Arthur, \"you must take the helm, my friend; whilst I go\nbelow, and set at liberty our two shipmates, who are confined between\ndecks.\"\n\nHe soon returned with the two English sailors, who could scarcely\nbelieve that they were at liberty, and the ship in their possession.\nTravers's first care was to shift the sails and alter their course. They\nthen went down to tell Captain Ridley what had happened. As soon as they\ncame below, they heard a most violent uproar among the Frenchmen, who\nwere shouting and calling, and accusing each other of shutting up the\nberths. Travers thought it quite necessary to dispose of them, for fear,\nwhen they grew desperate, they should split the panels. He therefore\ncalled down the stoutest of his men, opened the berths, one by one, and\nput the irons they had formerly occupied, on their astonished prisoners;\nwho by many gestures and exclamations, expressed their surprise at such\na proceeding.\n\nThey then took them to the hold; and, after securely confining them,\nthey went to Captain Ridley.\n\nWhen Arthur came into the cabin, his father was sitting up in his berth,\nwith a very discontented air; and, after making a sour face or two,\nbegan to complain of being neglected. He told Arthur that he could have\nsat up a few hours, if he had been there to dress and assist him. \"I\nhave just been wakened,\" said he, \"by those detestable Frenchmen making\nthe most hateful noise I ever heard: I thought they were certainly\nmurdering you all.\"\n\n\"Come, come, Walter!\" said Travers; \"don't look so sulky at the most\nnoble boy that ever a father was blessed with: but take Arthur in your\narms, and thank him for the recovery of your ship and of your liberty.\"\n\n\"What!\" said Captain Ridley; \"have we met with one of our cruisers? And\nare we retaken? Well, Travers, if you are in your right wits, and know\nwhat you are talking of, this is the news that will presently make me\nwell again.\"\n\n\"Did I say that we had fallen in with any of our ships?\" answered\nTravers. \"But I tell you now, in plain English, that by the prudence and\ncourage of your brave boy, your ship is your own again: we are all\nfree; the Frenchmen are in irons; and we have tacked about for Old\nEngland, instead of being carried into Dunkirk.\"\n\n\"And _Arthur_, you say, has done all this; but how?--You are not given\nto tell lies, Jack Travers,--and yet I can hardly believe it.\"\n\n\"I don't wonder that you can't,\" returned Travers, \"for I can scarcely\ntrust my own senses that it is so. But this is the short of the matter:\nArthur, this morning, contrived a scheme for fastening the Frenchmen in\ntheir berths when they were asleep. He went away to prepare matters for\nit. The attempt was not to have been made till night. But, to my\nsurprise, he came to me, an hour ago, and told me he had all our enemies\nsecure, except two. Those we easily managed; and, after getting the\nassistance of our two men, we as easily mastered the others. How Arthur\ncontrived to execute his plan so soon, he can best tell you, for I have\nnot yet heard.\"\n\nBut Arthur could not just then speak. He had thrown himself into his\nfather's extended arms, and given ease to the fulness of his heart in a\nburst of tears. It was some moments before he raised his head from his\nfather's bosom, who thanked and blessed him, and declared that were\neverything in the world taken from him and his gallant boy spared, he\nshould still consider himself the happiest and richest of men.\n\nWhen Arthur had recovered from the agitation that had deprived him of\nhis voice, Travers again pressed him to tell by what means he had\nsecured the Frenchmen.\n\n\"You know,\" said Arthur, \"I left you with the intention of fitting the\nnails into the panels. I got safely into the cabin, where they slept,\nand soon bored all the holes; but when I came to fit in my nails, I\nfound they might be pushed out with a violent shake; and, you know, they\ncould not be knocked in tight without a great noise. For some minutes I\nthought our scheme was at an end; but at last I remembered there was a\npaper of large screws in the locker. These I soon found, and made holes\nin the top and bottom of each panel, and then greased the screws; so\nthat I could put them all in with a screw-driver without the least\nnoise. I likewise greased the slides of the panels, that they might slip\neasily. Well, while I was at work, I recollected that the Frenchmen were\nin the habit of sleeping for an hour or two in the middle of the day,\nleaving only two men on deck. This, therefore, appeared the best time\nfor the execution of our plan; for it was likely we might blunder in the\ndark, and they were off their guard and in such security in the middle\nof the day, that I was determined to try. About three o'clock, they all\ncame down and tumbled into their berths. I waited more than half an\nhour, and then stole into the cabin, hoping they were asleep. Some of\nthe panels were open; my hands trembled as I closed them; but\nfortunately I made no noise. After I had put in the screws, I tried\nevery panel, and found that all were well secured. I then went to you:\nand, by the blessing of Heaven, everything has thus far gone\nprosperously!\"\n\n\"And all we have now to do,\" said Travers, \"is to keep what we have\ngained; that, Arthur, is not the least part of the work: but there shall\nbe no exertion wanting on my part to bring the good ship safe into an\nEnglish port.\"\n\nTravers faithfully kept his word: for he paced the deck of the Aurora,\nwith pistols in his hands, almost night and day; and when he was\ncompelled to take a little rest, Arthur kept watch with equal vigilance.\nTwo desperate attempts were made by the French crew to regain their\nliberty: the last time, Captain Ridley (who was now able to walk about\nand come on deck) was greatly inclined to send a volley of musket-balls\namong them; but Arthur and Travers both implored him to shed no blood,\nif it were possible to avoid it. After a few days of incessant toil and\nanxiety, a favourable gale carried them into the Thames; and, a few\nhours after their arrival at Sheerness, they had the pleasure of seeing\nthe privateer which had captured them brought in as a prize, at the\nstern of a British frigate. She had been taken whilst cruising in the\nChannel: and thus the whole of the crew of the Aurora were delivered\nfrom their anticipated sufferings in a French prison. Captain Ridley\nlost no time in disposing of the Aurora and her cargo. He said he would\ntempt the sea no longer, but remain peacefully in the quiet home he was\nso fortunate as to possess. \"And, Travers, my friend,\" said he, \"I need\nhardly tell you, that whilst I have a guinea, you shall share it; and\nwhilst I have a home, it shall shelter you.\" Half of the money which the\ncargo produced, Captain Ridley settled on Travers: he rewarded the two\nmen who had assisted in bringing home the Aurora, and made a present to\nall his sailors who had been retaken in the privateer.\n\nDuring their stay in London, their story was the news of the day; and\nmuch admiration was excited by the conduct of Travers and Arthur; and\nCaptain Ridley was given to understand, from high authority, that if his\nson chose to enter the navy, he should be peculiarly marked for\npromotion.\n\nWalter Ridley no longer wished to control his son. He respected his\ncourage and high principles; and left it to his choice, whether he would\nreturn and cultivate the farm, or accept the offer that had been made\nhim.\n\n\"Father,\" said Arthur, \"I am very young, and have a life before me that\nI am now convinced may be more usefully employed than in a state of\ninactive ease. I will serve my country with alacrity; and I pray God I\nmay be able to do something for her service.\"\n\nI will not stay to describe their arrival at Alston Moor, nor the joyful\nmeeting between Arthur and his aunt and cousin. Many years have rolled\non since Arthur went through his service as midshipman, and passed as\nlieutenant with the greatest credit: he is now a gallant and\ndistinguished officer,--the pride of his father, the delight of his old\nfriend Travers, an honour to his country, and the husband of his pretty\ncousin Phoebe.\n\nThe picture I have drawn is not exaggerated. Arthur is no creature of my\nimagination; it was drawn from life, and may be realized by any youth\nwho takes for his rule of life the maxim of our Church: \"Do thy duty in\nthat state of life unto which it shall please God to call thee.\"\n\n       *       *       *       *       *\n\nThis tale is founded on facts: and the recapture of the ship,\nextraordinary as it may seem, is a simple relation of occurrences that\nreally happened, in the beginning of the American war, when the Lark\nmerchant-ship was taken by a French privateer, and retaken by her\ncaptain, having no English on board, but a boy, and an English merchant,\none of the Society of Friends. This gentleman refused to stain his hands\nwith blood: but assisted in this peaceable recapture with great firmness\nand resolution. The underwriters presented the captain with 100, as a\nsmall reward for his intrepidity.\n\n\n\n\nTHE FISHERMAN'S COTTAGE.\n\n\nNearly a century and a half ago, there lived, in a little cottage on the\neastern coast, an aged widow and her two grandsons. Although neither\ncarpenter nor bricklayer was employed in the construction of this\ncottage, it was as neat a fisherman's cabin as any in that part of\nEngland. James Mayhew, the widow's son, had ingeniously built it on the\nsea-beach, under the cliffs. It was formed of pebbles and sea-stones;\nand he had, with great toil and labour, carried down earth from the\ncliffs, and made a nice little kitchen-garden, which formed a pleasing\ncontrast with the barren sands that surrounded the cottage; and this,\nwith a shed for a cow, (which got her living on the common belonging to\nthe adjacent town,) made a very comfortable little dwelling place. It\nwas poor James's summer work; and at Michaelmas he brought to live in it\nhis widowed mother, old Amy Mayhew, and his wife, who had formerly been\na tidy dairy-maid, and to whom he had been married just a twelvemonth.\nNow James was very clever and industrious; he could turn his hand to any\nsort of work; he would labour for the farmers at harvest and seed-time,\nand pursued the trade of a fisherman the rest of the year. He made one\nharvest on the land, and two more from the sea; for he used to go out in\na boat and catch herrings and mackerel at those seasons when they abound\nso plentifully on our coasts. James was an excellent son and husband,\nand would, no doubt, have been as good a father. His wife had just\npresented him with two twin little boys, when James was forced to leave\nher, to go to sea for the herring-fishery; and, sad it is to tell what\nfollowed! though such events are too common on these coasts. From the\ncottage window, his boat was seen to founder; and the wife never beheld\nher husband, nor the mother her son, until the tide threw up his corpse\nwithin a few yards of his own door. His poor wife, in her weak state,\nwas unable to bear so severe a shock, and sank into a state of\nstupefaction, which was soon succeeded by death. The neighbouring\ntownsmen contributed a sum to bury the poor young people: and many, who\nwere standing by at the funeral, and saw the sorrow of the aged Amy, and\nthought of the hard trial which had befallen her, said it would have\nbeen a mercy if the orphan little twins had been buried in the same\ngrave with their unfortunate parents! But Amy did not think so. \"God\nbless the poor babes!\" she said; \"they are all that is left me of my\ngood dutiful James: I will do my best to bring them up; and, if my life\nbe spared so long, I may see them prove a blessing and a comfort to me;\nand, perhaps, they may lay my head in the same grave with my poor son!\"\n\nAmy did, indeed, strive to do her best to rear her poor little\ngrandsons. She was often seen with a baby on each arm coming into the\ntown to fetch the cow off the common; and then the good-hearted sailors,\nwho had known her son, would give her a white loaf for the babes, or a\npiece of meat or cheese for herself. With these helps, and with the milk\nfrom the cow and the vegetables from the garden, she contrived to get\nthrough that trying year. \"Before the winter comes again,\" she said to a\nfriendly old pilot who had called to see her, \"my little boys will run\nalone; and when these aged arms are relieved from their heavy burden, I\nshall be able to work hard for their living.\"\n\nAmy was firm in her resolution: and, by her good nursing, the little\norphans throve and grew nicely,--so that by the end of the next summer\nthey could run about, holding by each other, to assist their steps. They\nwere very good and quiet, and fond of each other, and gave much less\ntrouble than could have been expected.\n\nAmy was now able to earn a little money by netting; and by the time the\nchildren were three years old, James and Michael learned to fill her\nnetting needles with the twine she made the herring-nets of; and the\nlittle creatures would stand by her the whole day, each watching until\nhis turn came to fill granny's needle. When they grew a little older,\nthey used to pick up stones on the beach, which were wanted in the town\nfor building. They carried them up the cliffs by little baskets-full at\na time, and laid them in a heap, and then the bricklayers gave for them\na halfpenny a bushel. And when the cold snowy winter nights came, they\nlearned to net, and helped their grandmother a great deal. By the time\nthey were twelve years old, the boys nearly earned their living. James\ngot something every week, by fetching his neighbours' cows off the\ncommon: he was always up by five in the summer, and before light in the\nwinter, that he might not be too late. He soon got work at the Hall\nfarm, in the next parish; and though it was a long way to walk, night\nand morning, he was always there in time, and contrived to do some work\nfor his grandmother in the hours he had for his meals. James took\ndelight in the quiet employments of the country; he greatly preferred\nthe husbandman's life to the unsettled condition of the fisherman or\nsailor. Michael, on the contrary, loved the sea, and always tried, in\ngetting his daily bread, to remain, if possible, by the beach, as it was\nhis most ardent desire to be a sailor. It may be supposed this wish gave\npain to his poor grandmother, who never heard him express it without\nthinking of the death of his father. To divert him from his inclination,\nshe did her best to teach him to read; but, though both he and his\nbrother were very apt, and could soon read a chapter in the Bible, yet,\neven in that holy book, Michael contrived to find something to flatter\nhis passion for ships and sailors. By the time the boys had attained the\nage of fourteen, James had learned so much of the duties of husbandry,\nthat his employer, as a reward for his diligence and industry, promised\nto hire him for the following year at man's wages. Poor Michael was much\nhurt that his brother would now be able to maintain his grandmother, and\ngive her those comforts that her age required, whilst he could merely\nfish on the beach with lines for whiting or cod, or pick up stones for\nthe bricklayers; and that he could do when he was but seven years old.\nHe was so ashamed of his inferiority, that he made a resolution of going\nto labourer's work with his brother, and was determined to give up his\nfavourite wish, to please his good grandmother; but an accident which\nhappened that winter altered his intention.\n\nThe day had closed-in some time, on the Christmas eve; and, though the\nmoon showed a bright light, yet the wind had risen as the night came on,\nand soon blew a furious easterly gale directly on to this dangerous\ncoast. Amy had swept her cottage clean, and looked out some time for her\ngrandsons, when James trudged in with a billet of wood on his shoulder,\nwhich he threw on the hearth. \"I have staid later than usual, granny,\"\nhe said, \"to look after the horses of some gentry, who have just arrived\nat the Hall to spend the Christmas holidays; but the good 'Squire has\nsent you this nice piece of beef for your dinner to-morrow, and this\nwood to warm your poor limbs this bitter weather.\"\n\n\"May heaven bless both you and your good master!\" said the grateful Amy:\n\"and may both he and his ever have good cheer and warm fires, when the\ncold and hard weather comes on! But, James, have you seen your brother?\"\n\nAt that minute, Michael opened the door: he brought with him some fine\nwhiting on the lid of an old basket. \"I have been lucky to-day,\ngrandmother,\" said he; \"I have caught as many fish along-shore as I sold\nin the town for seven groats. Here is the money; let it be put in the\nearthen pot, with the rest that is to buy you a red cloak this cold\nweather.\"\n\n\"Thank you, my dear Michael,\" said Amy: \"how good and dutiful you both\nare! The time was, when I thought that the Almighty had dealt hardly in\ntaking from the lone widow her only son,--but he has restored me that\nblessing in a twofold degree; and if I could but see you take to quiet\nfarming-work like James--\"\n\n\"Well,\" said Michael, \"I will do my best to like it: though, I am\nafraid, I shall never get over my wish to be a sailor. But look at these\nfine fish! I might have sold them in town; but, I thought, as it was\nChristmas-tide, that you should have them for supper.\"\n\nAmy now began to bestir herself to dress the supper. She soon raised a\ncheerful blaze; but just as she was putting on the fish, the loud report\nof a gun at sea made her start and drop them. It seemed so close to the\ncottage, that the concussion made everything rattle and ring around.\n\n\"Heaven help them!\" said Amy; \"it is some poor distressed ship's crew at\nsea, firing guns for help this stormy night. Oh, Michael! this is what\nyou wish for! This is the life you love so much! Can you say you wish to\nbe a sailor now?\"\n\n\"I wish,\" answered Michael, \"I had been sailor enough to go off in the\npilot-boat I saw trying to put off just now as I came under the cliffs.\nThere's a brave ship--a king's ship, I believe,--has been in distress\nall the evening; and they want a pilot to go to her, for they fear she\nwill be driven by the gale right on to the bar;--but the wind and waves\nrun so contrary, that though they have been trying for this hour, they\ncannot get the boat off. Hark! there is another gun! She has certainly\nstruck! Oh that I could help them!\"\n\nMichael now started up, and sprang to the door; but Amy ran after him,\nand held him back. \"Oh, stay, my dear boy,\" she cried; \"don't go off to\nsea! Don't let me see another child perish before these old eyes!\"\n\n\"No,\" said Michael, turning round, \"I will not disobey you; besides, I\nhave not experience enough to be of any great use. Our brave pilots\nwould help them, if help were possible.\"\n\n\"See, brother!\" said James, \"there lies the ship; she is beating on the\nBarnet-reef, sure enough; and yet the moon shines bright through the\nstorm.\"\n\n\"Yes,\" said Michael; \"and could they have got a pilot that knew the\ncoast, they might have been saved. Look! they are putting out boats.\nSee! There are two!\"\n\n\"Where? where?\" asked James: \"the white flashing billows dazzle my eyes.\nI can see but one little black speck dancing among the waves.\"\n\n\"Oh, yes!\" said Amy, \"even I can see two; but they will never reach the\nshore. See, there goes down one of them!\"\n\n\"No, no! I hope not,\" said James; \"it is only hidden for a moment\nbetween the high waves.\"\n\n\"I tell you it is gone,\" said Amy. \"Alas! I know that shocking sight\ntoo well?--Don't I _know_ what it is to see a boat swallowed by the sea?\nCome in, boys, or I shall think I see your father again washed on shore\nat my feet.\"\n\n\"Go you in,\" said Michael; \"but I will stay and see if indeed some one\nbe thrown on shore; for we may give timely help.\"\n\nAs he spoke, he plainly discovered some one struggling with the waves at\na little distance. The brothers hastened to the spot just as the man was\nthrown with violence on the sands by the huge breakers; they seized and\ndragged him out of the reach of the waves, and Amy ran out of the\ncottage to help them.\n\n\"Is he dead?\" said she, fearfully.\n\n\"I am afraid,\" said Michael, \"that the waves, in throwing him ashore,\nhave beaten the breath out of him; but he was alive just now, for I saw\nhim struggle with the breakers.\"\n\nThey carried the poor man into the cottage, and tried every means in\ntheir power to revive him; but Amy had nothing better than a little\nelder wine to give him. This she hastened to warm; and James ran to the\ntown to borrow or buy a little brandy, and to get medical assistance. He\nsoon procured the liquor; but the doctor was so busy attending other\nsufferers who had been washed ashore, that he could not leave them.\nJames thought it best to return quickly with the spirits; and he had the\npleasure to see the person they had saved sitting in the chimney-corner;\nand after he had taken the brandy which James had brought, he seemed\nconsiderably revived.\n\nIt was not till he was out of danger that the kind cottagers remarked\nthat the dress and appearance of their guest were far above those of a\ncommon seaman. Amy had put him on some dry clothes, which were more\ncomfortable (though very coarse) than his dripping garments; and on\nholding up the latter to dry, an elegant watch fell from one of the\npockets. This she hung up before the fireplace; and soon afterwards the\nweary stranger retired to rest, the brothers having cheerfully given up\ntheir bed, and slept that night on a heap of old nets and sea-weed in\nthe cow-shed.\n\nEarly in the morning, the doctor came to visit the shipwrecked stranger,\nand brought with him one of the sailors, who had got safe to land in the\nother boat. As soon as they entered the cottage, the seaman cast his\neyes on the uniform that hung at the fire, and eagerly asked if the\nowner of it were alive. He was informed that he was alive, and likely to\ndo well; but that he was then asleep.\n\n\"Then the storm has spared one of the bravest captains in his Majesty's\nfleet,\" said the sailor.\n\n\"What! is he a sea-captain?\" asked Michael.\n\n\"Yes,\" answered the sailor: \"our brave Captain Lucas.\"\n\nA voice from the inner room now called, \"Is that you, Tom?\"\n\n\"Yes, your Honour,\" said the sailor, who immediately recognised the\nvoice of Captain Lucas, his commander. Captain Lucas called the sailor\nto him, and asked, with much anxiety, how many of the ship's company\nwere lost? \"Only ten,\" said he; \"the long-boat came safe ashore; and\nseveral of those in the boat with you were picked up by the good\ntown's-people. We thought all night that you were lost: it would have\nbeen a bitter loss to us, Captain; for you are, indeed, the sailor's\nfriend. It was a dreadful sight for us to see your boat go down; but\nyour Honour knows that we all begged you to go in the long-boat, for we\nsaid the other could not live in such a sea.\"\n\n\"Well, Tom,\" said the Captain, \"mine was but a single life; most of you\nwere fathers and husbands. I am thankful that so many have been spared;\nand, as for myself, I could not have fallen into better hands. Mind and\nget a good Christmas dinner, you and your messmates, to cheer your poor\nhearts; I'll be at the expense: thank God! I have enough to spare a few\ncomforts for my brave sailors, after all their sufferings.\"\n\nTom, having made a sailor's acknowledgment, hastened to the town to tell\nhis messmates the joyful news, that their noble captain was saved.\n\nCaptain Lucas was so much bruised, that the doctor told him he must keep\nin bed for a day or two, and take the medicine which he would send him;\nbut the captain seemed averse to physic, and thought that Amy's\ntreacle-possets did him more good. He refused to be removed from the\ncottage, saying that he could not find better quarters anywhere. Michael\nattended him with the greatest care, and his sailors came daily to see\nhim.\n\nMichael was delighted with the frankness and noble bearing of the\nCaptain, and with the affection his men bore him: and Captain Lucas was\nas much pleased with the honest and warm-hearted Michael. \"You are the\nbrave fellow,\" he said to him one day, \"that pulled me ashore.\"\n\n\"I helped my brother James,\" said Michael.\n\n\"It is not always,\" said the Captain, \"that shipwrecked men fall into\nsuch good hands; but it shall be the better for you, my lad.\"\n\nCaptain Lucas was not a man to keep his bed a long time for a few\nbruises. He was soon able to walk about; and his first care was to see\nthe bodies of the drowned seamen decently buried. He attended their\nfuneral, with all the surviving crew, and showed himself to be as pious\nas he was brave.\n\nThe night before he departed for London, he handsomely rewarded old Amy\nand her grandsons for their kindness to him; and as he put some broad\npieces into Michael's hand, he said, \"My young friend, I thought of\ngiving you and your brother the watch and rings which I had about me\nwhen I was thrown ashore; but I think these pieces will be more\nserviceable: and I give them to you as much for your uncommon honesty as\nthe humanity you have shown to me.\"\n\n\"Ah, Sir!\" said Michael, laying the gold on the table, \"you could do me\na favour, that I should prize more than your little golden clock[12] and\nall the Caroluses[13] in the world.\"\n\n[Footnote 12: Watches were only in general use at court, in the time of\nCharles the Second.]\n\n[Footnote 13: The gold coinage in the reigns of the Stuarts were\ncommonly called Caroluses and Jacobuses.]\n\n\"Ah!\" said the Captain; \"and what is that, my lad?\"\n\n\"To persuade my grandmother to let me go to sea with you.\"\n\n\"Well, my brave boy, I should be glad to have you under my command. What\ndo you say, Amy? You hear your grandson's wish. But, remember, that I\nwill never repay your hospitality so basely, as to take him away without\nyour consent.\"\n\nAmy sighed. \"Well, your Honour, as it is Michael's desire, and as he has\nwished it for a long time, I wont deny him; for I see his heart is\nwholly set on being a sailor. I should have thought that the lives he\nhad just seen lost would have shown him his folly; but, as it is, I\nwould rather he should go to sea with such a noble gentleman as yourself\nthan with any one else.\"\n\nMichael rejoiced that his grandmother had at last given her consent.\n\"While I can have Captain Lucas for a commander, and King Charles for a\nmaster,\" said he, \"I never will serve a Suffolk farmer.\"\n\nThe Captain was pleased with his spirit; but Michael's heart rather\nfailed him, when he bade farewell, the next day, to his good grandmother\nand his twin-brother. \"I know the Captain wont despise me for crying,\"\nhe said to Tom; for \"I saw _him_ weep when the poor sailors were\nburied.\"\n\n\"Ay! ay!\" said Tom, \"he has a tender heart, and he is the better for it,\nand so are you; and considering as how you are but a young one, I think\nyou have borne it very well. Why I sometimes pipe a bit myself when I\nbid good b'ye to my Jane, and mother, and the little ones.\"\n\nCaptain Lucas was soon appointed to another ship; and Michael sent word\nto Amy and James, that he loved the life he had chosen better than ever,\nand that he would not change it for any other.\n\nFor a long time Michael was sadly missed at the cottage. James and Amy\nwould look sorrowfully at one another, and shake their heads when they\nsaw Michael's empty place at dinner, and the vacant corner where he used\nto put his three-legged stool by the chimney-side--and it was war-time.\nEngland was engaged in a severe struggle with the Dutch for naval\npre-eminence in those days; and perhaps she never had to sustain a more\narduous maritime contest; and Michael had many perils to encounter\nbesides the danger of the stormy seas; but then he was very punctual in\nwriting to his relatives--they were sure to have a letter from him at\nevery opportunity; and Michael took a pride in sending home a\nconsiderable portion of his pay. Amy had so often heard that Michael was\nsafe and well, that it was only after hearing of some sharp engagement\nthat her heart ached for him. James was as diligent and industrious as\never, and kept his old place, and pleased his good master. Poor Amy had\nnourishing food and warm clothing, and more comforts in her old age than\nshe had ever expected.\n\nThree years passed quickly away, and James had grown a fine-looking\nyoung man. Old Amy, though healthy and strong for her years, seemed to\nfear that she should not see her dear Michael before she died.\n\nThe war now raged more fiercely than ever between the English and Dutch;\nand it was said that the fleets would soon come to action in the seas\nbetween England and Holland. James and Amy understood very little about\nthis. All their care was to know whether it was likely for Michael's\nship to be in the action: this they could not learn; but they saw a\ngreat fleet nearly opposite at sea, hovering to and fro, and many seamen\nand officers came on shore; but they neither saw nor heard anything of\nMichael; so they hoped he was not in the fleet.\n\nIt was a lovely morning in the latter end of May, and James had been\nsome time at work in his master's fields, when he was suddenly startled\nwith a tremendous noise, louder than any thunder he had ever heard. He\nlooked round about, and up at the heavens; all was blue and serene\nthere, and he could see no traces of a thunder-cloud: still the roar\ncontinued in horrid bursts that seemed to shake the shores and the very\nground he stood on, and it rang and rebounded through the hollow coast\nwith the most frightful din.[14] At last he cast his eyes towards the\nEast, and there he saw, in the bar, white clouds of smoke, mixed with\nflashes of flame. \"The sea-fight has surely begun,\" he said aloud, \"so\nnear in shore! Our cottage will certainly be knocked down with the\nballs.\" This thought induced him to throw down his hoe, and away he ran\ntowards his home, thinking of nothing but his poor grandmother.\n\n[Footnote 14: In an old song, published a few days after Solebay fight,\nthere are the following lines:--\n\n    \"Well might you hear their guns, I guess,\n    From Sizewell Gap to Easton Ness;\n    They fill'd up all the hollow coast,\n    From Walberswick to Dunwich.\"]\n\nHe got safely down the cliffs, though the cannon-balls were coming on\nshore very near him, and in some places they actually shattered large\npieces of earth and stones from the cliffs. James found poor old Amy\nkneeling by the bed in the inner room, hiding her face and half dead\nwith terror. He wanted to take her farther up the country, out of the\nreach of danger; but Amy dared not venture out of the house, and James\ncould not persuade her that the cottage would be no defence in case a\ncannon-ball should strike it. He determined at first to take her in his\narms and carry her away to a place of safety: \"But, who knows,\" thought\nhe, \"but I may drag her into the very danger she dreads so much?\" So he\ndetermined to stay with her at every risk, and they spent the day\nhalf-deafened with the roar of the cannon, expecting every moment that\ntheir little home would be shattered about them.\n\nTowards evening, the firing grew weaker and weaker, and the people who\nwere beholding the fight from the cliffs, shouted that the Duke of York\nhad gained the victory. But before the action was quite over, a boat was\nseen making to the shore; it seemed to bear in the direction of Amy's\ncottage, and actually ran on shore within a few yards of it. The\nsailors leaped out, and, lifting an officer in their arms, bore him\ntowards the cottage; whilst a young sailor walked slowly after, leaning\non an old seaman's arm. James flung open the cottage door, and told them\nto place the officer on the bed. They accordingly laid him down. He\nmoaned faintly with pain. At the sound of his voice, the young sailor\napproached the bed with an unsteady step. Amy gazed wistfully on the\nyoung man, and then on James;--they were exactly alike. \"It is my own\nboy Michael!\" she cried at last.\n\n\"Yes, it is Michael!\" said James, throwing himself on his neck.\n\n\"Ah, my poor grandmother! and my dear James!\" said Michael, \"I have come\nhome to you in a sorrowful hour! My noble Captain is mortally wounded.\"\n\n\"Is this the brave gentleman who took you away, and behaved so kindly to\nus? Alas, how wan he looks!\" said Amy, looking mournfully on the pale\nfeatures of Captain Lucas, as he lay fainting on the lowly bed, where\nthey had placed him.\n\n\"But you look as white and ill as he does, Michael!\"\n\n\"Yes,\" said he faintly, pointing to his side, from which the blood\nslowly trickled; \"I was wounded whilst fighting near him--I return to my\nhome once more; but it is to die. Our Captain's brother took the command\nof the ship after he fell; and when the fight slackened, he sent the\nboat ashore with him, in hopes of getting better assistance. He did not\nknow I was wounded, but he told me to go on shore with my master, and\ntake care of him. Instead of suffering the sailors to take him to the\ntown, I bade them steer direct for the cottage on the beach. He laid his\nnoble head there when he was in distress before; and I resolved that he\nshould not die among strangers.\"\n\nHere Michael's voice faltered with grief and pain; and he was so faint\nthat he would have sunk from his seat, had not James supported him in\nhis arms. A surgeon arrived soon after, and at once pronounced that the\nCaptain's wounds were mortal, and that Michael was in a dangerous state.\nBefore night, Captain Lucas's brother came on shore, and hastened to the\ncottage: Captain Lucas held out his hand when he saw his brother.\n\"William,\" said he, \"is England victorious?\" William Lucas turned from\nhis dying brother, and wept.--\"Oh yes, Charles! The Duke has gained the\nbattle, but it is a dearly-purchased victory.\"\n\n\"Many a one has fallen, William, who will be more missed than I shall\nbe,\" replied the Captain. \"I have but one dear brother to weep my\nloss.--Hear my last request: you know, by my will, you inherit my\nestates;--but give my faithful Michael the gold in my portmanteau, and a\nhundred pounds besides, to be divided between him and his brother: if\nMichael should die, give his share to his grandmother--I fear I have\nrobbed her of one of the props of her age! It is owing to the good\ninhabitants of this cottage that my death has been a glorious one: three\nyears ago they saved my life from the waves on this coast.\"\n\nCaptain Lucas did not live through that night: and Michael only survived\nhim two days. They were buried together, with many a hero who fell in\nthat engagement. Captain William faithfully executed his brother's dying\nrequest. But it was not the riches they obtained that could console Amy\nand James for the loss of their dear Michael;--it was long before they\ncould think, without extreme sorrow, on his untimely death.\n\nJames's good master assisted him with his advice in laying out the\nCaptain's legacy, which amounted to more than five hundred pounds. James\ntook a good farm, and, by his unremitting industry, soon became a rich\nman; and old Amy had the pleasure of seeing her great grandchildren born\nto affluence: yet the beautiful month of May never returned but she\nremembered with sadness the fall of her brave sailor-boy and his noble\ncaptain.\n\nTHE END\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}