{
  "content": "The Rose and the Ring\nWilliam Makepeace Thackeray\n\nPRELUDE.\n\nIt happened that the undersigned spent the last Christmas season in a\nforeign city where there were many English children.\n\nIn that city, if you wanted to give a child’s party, you could not even\nget a magic-lantern or buy Twelfth-Night characters--those funny painted\npictures of the King, the Queen, the Lover, the Lady, the Dandy, the\nCaptain, and so on--with which our young ones are wont to recreate\nthemselves at this festive time.\n\nMy friend Miss Bunch, who was governess of a large family that lived in\nthe Piano Nobile of the house inhabited by myself and my young charges\n(it was the Palazzo Poniatowski at Rome, and Messrs. Spillmann, two\nof the best pastrycooks in Christendom, have their shop on the ground\nfloor): Miss Bunch, I say, begged me to draw a set of Twelfth-Night\ncharacters for the amusement of our young people.\n\nShe is a lady of great fancy and droll imagination, and having looked\nat the characters, she and I composed a history about them, which\nwas recited to the little folks at night, and served as our FIRESIDE\nPANTOMIME.\n\nOur juvenile audience was amused by the adventures of Giglio and Bulbo,\nRosalba and Angelica. I am bound to say the fate of the Hall Porter\ncreated a considerable sensation; and the wrath of Countess Gruffanuff\nwas received with extreme pleasure.\n\nIf these children are pleased, thought I, why should not others be\namused also? In a few days Dr. Birch’s young friends will be expected\nto reassemble at Rodwell Regis, where they will learn everything that\nis useful, and under the eyes of careful ushers continue the business of\ntheir little lives.\n\nBut, in the meanwhile, and for a brief holiday, let us laugh and be as\npleasant as we can. And you elder folk--a little joking, and dancing,\nand fooling will do even you no harm. The author wishes you a merry\nChristmas, and welcomes you to the Fireside Pantomime.\n\nW. M. THACKERAY. December 1854.\n\n\nCHAPTER I. SHOWS HOW THE ROYAL FAMILY SATE DOWN TO BREAKFAST\n\nThis is Valoroso XXIV., King of Paflagonia, seated with his Queen and\nonly child at their royal breakfast-table, and receiving the letter\nwhich announces to His Majesty a proposed visit from Prince Bulbo, heir\nof Padella, reigning King of Crim Tartary. Remark the delight upon the\nmonarch’s royal features. He is so absorbed in the perusal of the King\nof Crim Tartary’s letter, that he allows his eggs to get cold, and\nleaves his august muffins untasted.\n\n‘What! that wicked, brave, delightful Prince Bulbo!’ cries Princess\nAngelica; ‘so handsome, so accomplished, so witty--the conqueror of\nRimbombamento, where he slew ten thousand giants!’\n\n‘Who told you of him, my dear?’ asks His Majesty.\n\n‘A little bird,’ says Angelica.\n\n‘Poor Giglio!’ says mamma, pouring out the tea.\n\n‘Bother Giglio!’ cries Angelica, tossing up her head, which rustled with\na thousand curl-papers.\n\n‘I wish,’ growls the King--‘I wish Giglio was. . .’\n\n‘Was better? Yes, dear, he is better,’ says the Queen. ‘Angelica’s\nlittle maid, Betsinda, told me so when she came to my room this morning\nwith my early tea.’\n\n‘You are always drinking tea,’ said the monarch, with a scowl.\n\n‘It is better than drinking port or brandy and water;’ replies Her\nMajesty.\n\n‘Well, well, my dear, I only said you were fond of drinking tea,’ said\nthe King of Paflagonia, with an effort as if to command his temper.\n‘Angelica! I hope you have plenty of new dresses; your milliners’ bills\nare long enough. My dear Queen, you must see and have some parties. I\nprefer dinners, but of course you will be for balls. Your everlasting\nblue velvet quite tires me: and, my love, I should like you to have a\nnew necklace. Order one. Not more than a hundred or a hundred and fifty\nthousand pounds.’\n\n‘And Giglio, dear?’ says the Queen.\n\n‘GIGLIO MAY GO TO THE--’\n\n‘Oh, sir,’ screams Her Majesty. ‘Your own nephew! our late King’s only\nson.’\n\n‘Giglio may go to the tailor’s, and order the bills to be sent in to\nGlumboso to pay. Confound him! I mean bless his dear heart. He need want\nfor nothing; give him a couple of guineas for pocket-money, my dear;\nand you may as well order yourself bracelets while you are about the\nnecklace, Mrs. V.’\n\nHer Majesty, or MRS. V., as the monarch facetiously called her (for\neven royalty will have its sport, and this august family were very\nmuch attached), embraced her husband, and, twining her arm round her\ndaughter’s waist, they quitted the breakfast-room in order to make all\nthings ready for the princely stranger.\n\nWhen they were gone, the smile that had lighted up the eyes of the\nHUSBAND and FATHER fled--the pride of the KING fled--the MAN was alone.\nHad I the pen of a G. P. R. James, I would describe Valoroso’s torments\nin the choicest language; in which I would also depict his flashing\neye, his distended nostril--his dressing-gown, pocket-handkerchief, and\nboots. But I need not say I have NOT the pen of that novelist; suffice\nit to say, Valoroso was alone.\n\nHe rushed to the cupboard, seizing from the table one of the many\negg-cups with which his princely board was served for the matin meal,\ndrew out a bottle of right Nantz or Cognac, filled and emptied the cup\nseveral times, and laid it down with a hoarse ‘Ha, ha, ha! now Valoroso\nis a man again!’\n\n‘But oh!’ he went on (still sipping, I am sorry to say), ‘ere I was a\nking, I needed not this intoxicating draught; once I detested the hot\nbrandy wine, and quaffed no other fount but nature’s rill. It dashes not\nmore quickly o’er the rocks than I did, as, with blunderbuss in hand,\nI brushed away the early morning dew, and shot the partridge, snipe, or\nantlered deer! Ah! well may England’s dramatist remark, “Uneasy lies\nthe head that wears a crown!” Why did I steal my nephew’s, my young\nGiglio’s--? Steal! said I? no, no, no, not steal, not steal. Let me\nwithdraw that odious expression. I took, and on my manly head I set, the\nroyal crown of Paflagonia; I took, and with my royal arm I wield, the\nsceptral rod of Paflagonia; I took, and in my outstretched hand I hold,\nthe royal orb of Paflagonia! Could a poor boy, a snivelling, drivelling\nboy--was in his nurse’s arms but yesterday, and cried for sugarplums and\npuled for pap--bear up the awful weight of crown, orb, sceptre? gird\non the sword my royal fathers wore, and meet in fight the tough Crimean\nfoe?’\n\nAnd then the monarch went on to argue in his own mind (though we need\nnot say that blank verse is not argument) that what he had got it was\nhis duty to keep, and that, if at one time he had entertained ideas of a\ncertain restitution, which shall be nameless, the prospect by a CERTAIN\nMARRIAGE of uniting two crowns and two nations which had been engaged\nin bloody and expensive wars, as the Paflagonians and the Crimeans had\nbeen, put the idea of Giglio’s restoration to the throne out of the\nquestion: nay, were his own brother, King Savio, alive, he would\ncertainly will the crown from his own son in order to bring about such a\ndesirable union.\n\nThus easily do we deceive ourselves! Thus do we fancy what we wish is\nright! The King took courage, read the papers, finished his muffins\nand eggs, and rang the bell for his Prime Minister. The Queen, after\nthinking whether she should go up and see Giglio, who had been sick,\nthought ‘Not now. Business first; pleasure afterwards. I will go and see\ndear Giglio this afternoon; and now I will drive to the jeweller’s, to\nlook for the necklace and bracelets.’ The Princess went up into her own\nroom, and made Betsinda, her maid, bring out all her dresses; and as for\nGiglio, they forgot him as much as I forget what I had for dinner last\nTuesday twelve-month.\n\n\n\n\nCHAPTER II. HOW KING VALOROSO GOT THE CROWN, AND PRINCE GIGLIO WENT WITHOUT\n\nPaflagonia, ten or twenty thousand years ago, appears to have been one\nof those kingdoms where the laws of succession were not settled; for\nwhen King Savio died, leaving his brother Regent of the kingdom, and\nguardian of Savio’s orphan infant, this unfaithful regent took no sort\nof regard of the late monarch’s will; had himself proclaimed sovereign\nof Paflagonia under the title of King Valoroso XXIV., had a most\nsplendid coronation, and ordered all the nobles of the kingdom to pay\nhim homage. So long as Valoroso gave them plenty of balls at Court,\nplenty of money and lucrative places, the Paflagonian nobility did not\ncare who was king; and as for the people, in those early times, they\nwere equally indifferent. The Prince Giglio, by reason of his tender\nage at his royal father’s death, did not feel the loss of his crown and\nempire. As long as he had plenty of toys and sweetmeats, a holiday\nfive times a week and a horse and gun to go out shooting when he grew\na little older, and, above all, the company of his darling cousin, the\nKing’s only child, poor Giglio was perfectly contented; nor did he\nenvy his uncle the royal robes and sceptre, the great hot uncomfortable\nthrone of state, and the enormous cumbersome crown in which that monarch\nappeared from morning till night. King Valoroso’s portrait has been\nleft to us; and I think you will agree with me that he must have been\nsometimes RATHER TIRED of his velvet, and his diamonds, and his ermine,\nand his grandeur. I shouldn’t like to sit in that stifling robe with\nsuch a thing as that on my head.\n\nNo doubt, the Queen must have been lovely in her youth; for though\nshe grew rather stout in after life, yet her features, as shown in her\nportrait, are certainly PLEASING. If she was fond of flattery, scandal,\ncards, and fine clothes, let us deal gently with her infirmities, which,\nafter all, may be no greater than our own. She was kind to her nephew;\nand if she had any scruples of conscience about her husband’s taking the\nyoung Prince’s crown, consoled herself by thinking that the King, though\na usurper, was a most respectable man, and that at his death Prince\nGiglio would be restored to his throne, and share it with his cousin,\nwhom he loved so fondly.\n\nThe Prime Minister was Glumboso, an old statesman, who most cheerfully\nswore fidelity to King Valoroso, and in whose hands the monarch left\nall the affairs of his kingdom. All Valoroso wanted was plenty of\nmoney, plenty of hunting, plenty of flattery, and as little trouble as\npossible. As long as he had his sport, this monarch cared little how\nhis people paid for it: he engaged in some wars, and of course\nthe Paflagonian newspapers announced that he had gained prodigious\nvictories: he had statues erected to himself in every city of the\nempire; and of course his pictures placed everywhere, and in all the\nprint-shops: he was Valoroso the Magnanimous, Valoroso the Victorious,\nValoroso the Great, and so forth;--for even in these early times\ncourtiers and people knew how to flatter.\n\nThis royal pair had one only child, the Princess Angelica, who, you may\nbe sure, was a paragon in the courtiers’ eyes, in her parents’, and in\nher own. It was said she had the longest hair, the largest eyes, the\nslimmest waist, the smallest foot, and the most lovely complexion of\nany young lady in the Paflagonian dominions. Her accomplishments were\nannounced to be even superior to her beauty; and governesses used to\nshame their idle pupils by telling them what Princess Angelica could do.\nShe could play the most difficult pieces of music at sight. She could\nanswer any one of Mangnall’s Questions. She knew every date in the\nhistory of Paflagonia, and every other country. She knew French,\nEnglish, Italian, German, Spanish, Hebrew, Greek, Latin, Cappadocian,\nSamothracian, Aegean, and Crim Tartar. In a word, she was a most\naccomplished young creature; and her governess and lady-in-waiting was\nthe severe Countess Gruffanuff.\n\n\nWould you not fancy, from this picture, that Gruffanuff must have been a\nperson of highest birth? She looks so haughty that I should have thought\nher a princess at the very least, with a pedigree reaching as far back\nas the Deluge. But this lady was no better born than many other ladies\nwho give themselves airs; and all sensible people laughed at her absurd\npretensions. The fact is, she had been maid-servant to the Queen when\nHer Majesty was only Princess, and her husband had been head footman;\nbut after his death or DISAPPEARANCE, of which you shall hear presently,\nthis Mrs. Gruffanuff, by flattering, toadying, and wheedling her royal\nmistress, became a favourite with the Queen (who was rather a weak\nwoman), and Her Majesty gave her a title, and made her nursery governess\nto the Princess.\n\nAnd now I must tell you about the Princess’s learning and\naccomplishments, for which she had such a wonderful character. Clever\nAngelica certainly was, but as IDLE as POSSIBLE. Play at sight, indeed!\nshe could play one or two pieces, and pretend that she had never seen\nthem before; she could answer half a dozen Mangnall’s Questions; but\nthen you must take care to ask the RIGHT ones. As for her languages,\nshe had masters in plenty, but I doubt whether she knew more than a few\nphrases in each, for all her presence; and as for her embroidery and her\ndrawing, she showed beautiful specimens, it is true, but WHO DID THEM?\n\nThis obliges me to tell the truth, and to do so I must go back ever so\nfar, and tell you about the FAIRY BLACKSTICK.\n\n\n\n\nCHAPTER III. TELLS WHO THE FAIRY BLACKSTICK WAS, AND WHO WERE EVER SO MANY GRAND PERSONAGES BESIDES\n\nBetween the kingdoms of Paflagonia and Crim Tartary, there lived a\nmysterious personage, who was known in those countries as the Fairy\nBlackstick, from the ebony wand or crutch which she carried; on which\nshe rode to the moon sometimes, or upon other excursions of business or\npleasure, and with which she performed her wonders.\n\nWhen she was young, and had been first taught the art of conjuring\nby the necromancer, her father, she was always practicing her skill,\nwhizzing about from one kingdom to another upon her black stick, and\nconferring her fairy favours upon this Prince or that. She had scores of\nroyal godchildren; turned numberless wicked people into beasts, birds,\nmillstones, clocks, pumps, boot jacks, umbrellas, or other absurd\nshapes; and, in a word, was one of the most active and officious of the\nwhole College of fairies.\n\nBut after two or three thousand years of this sport, I suppose\nBlackstick grew tired of it. Or perhaps she thought, ‘What good am I\ndoing by sending this Princess to sleep for a hundred years? by fixing a\nblack pudding on to that booby’s nose? by causing diamonds and pearls to\ndrop from one little girl’s mouth, and vipers and toads from another’s?\nI begin to think I do as much harm as good by my performances. I might\nas well shut my incantations up, and allow things to take their natural\ncourse.\n\n‘There were my two young goddaughters, King Savio’s wife, and Duke\nPadella’s wife, I gave them each a present, which was to render them\ncharming in the eyes of their husbands, and secure the affection of\nthose gentlemen as long as they lived. What good did my Rose and my Ring\ndo these two women? None on earth. From having all their whims indulged\nby their husbands, they became capricious, lazy, ill-humoured, absurdly\nvain, and leered and languished, and fancied themselves irresistibly\nbeautiful, when they were really quite old and hideous, the ridiculous\ncreatures! They used actually to patronise me when I went to pay them\na visit--ME, the Fairy Blackstick, who knows all the wisdom of the\nnecromancers, and could have turned them into baboons, and all their\ndiamonds into strings of onions, by a single wave of my rod!’ So\nshe locked up her books in her cupboard, declined further magical\nperformances, and scarcely used her wand at all except as a cane to walk\nabout with.\n\nSo when Duke Padella’s lady had a little son (the Duke was at that\ntime only one of the principal noblemen in Crim Tartary), Blackstick,\nalthough invited to the christening, would not so much as attend; but\nmerely sent her compliments and a silver papboat for the baby, which was\nreally not worth a couple of guineas. About the same time the Queen\nof Paflagonia presented His Majesty with a son and heir; and guns\nwere fired, the capital illuminated, and no end of feasts ordained to\ncelebrate the young Prince’s birth. It was thought the fairy, who was\nasked to be his godmother, would at least have presented him with an\ninvisible jacket, a flying horse, a Fortunatus’s purse, or some other\nvaluable token of her favour; but instead, Blackstick went up to\nthe cradle of the child Giglio, when everybody was admiring him and\ncomplimenting his royal papa and mamma, and said, ‘My poor child, the\nbest thing I can send you is a little MISFORTUNE’; and this was all\nshe would utter, to the disgust of Giglio’s parents, who died very soon\nafter, when Giglio’s uncle took the throne, as we read in Chapter I.\n\nIn like manner, when CAVOLFIORE, King of Crim Tartary, had a christening\nof his only child, ROSALBA, the Fairy Blackstick, who had been invited,\nwas not more gracious than in Prince Giglio’s case. Whilst everybody was\nexpatiating over the beauty of the darling child, and congratulating\nits parents, the Fairy Blackstick looked very sadly at the baby and its\nmother, and said, ‘My good woman (for the Fairy was very familiar, and\nno more minded a Queen than a washerwoman)--my good woman, these people\nwho are following you will be the first to turn against you; and as for\nthis little lady, the best thing I can wish her is a LITTLE MISFORTUNE.’\nSo she touched Rosalba with her black wand, looked severely at the\ncourtiers, motioned the Queen an adieu with her hand, and sailed slowly\nup into the air out of the window.\n\nWhen she was gone, the Court people, who had been awed and silent in her\npresence, began to speak. ‘What an odious Fairy she is (they said)--a\npretty Fairy, indeed! Why, she went to the King of Paflagonia’s\nchristening, and pretended to do all sorts of things for that family;\nand what has happened--the Prince, her godson, has been turned off his\nthrone by his uncle. Would we allow our sweet Princess to be deprived of\nher rights by any enemy? Never, never, never, never!’\n\nAnd they all shouted in a chorus, ‘Never, never, never, never!’\n\nNow, I should like to know, and how did these fine courtiers show\ntheir fidelity? One of King Cavolfiore’s vassals, the Duke Padella\njust mentioned, rebelled against the King, who went out to chastise\nhis rebellious subject. ‘Any one rebel against our beloved and august\nMonarch!’ cried the courtiers; ‘any one resist HIM? Pooh! He is\ninvincible, irresistible. He will bring home Padella a prisoner, and tie\nhim to a donkey’s tail, and drive him round the town, saying, “This is\nthe way the Great Cavolfiore treats rebels.”’\n\nThe King went forth to vanquish Padella; and the poor Queen, who was a\nvery timid, anxious creature, grew so frightened and ill that I am sorry\nto say she died; leaving injunctions with her ladies to take care of\nthe dear little Rosalba.--Of course they said they would. Of course they\nvowed they would die rather than any harm should happen to the Princess.\nAt first the Crim Tartar Court Journal stated that the King was\nobtaining great victories over the audacious rebel: then it was\nannounced that the troops of the infamous Padella were in flight: then\nit was said that the royal army would soon come up with the enemy, and\nthen--then the news came that King Cavolfiore was vanquished and slain\nby His Majesty, King Padella the First!\n\nAt this news, half the courtiers ran off to pay their duty to the\nconquering chief, and the other half ran away, laying hands on all the\nbest articles in the palace; and poor little Rosalba was left there\nquite alone--quite alone; and she toddled from one room to another,\ncrying, ‘Countess! Duchess!’ (Only she said ‘Tountess, Duttess,’ not\nbeing able to speak plain) ‘bring me my mutton sop; my Royal Highness\nhungy! Tountess! Duttess!’ And she went from the private apartments into\nthe throne-room and nobody was there;--and thence into the ballroom\nand nobody was there;--and thence into the pages’ room and nobody was\nthere;--and she toddled down the great staircase into the hall and\nnobody was there;--and the door was open, and she went into the court,\nand into the garden, and thence into the wilderness, and thence into the\nforest where the wild beasts live, and was never heard of any more!\n\nA piece of her torn mantle and one of her shoes were found in the wood\nin the mouths of two lionesses’ cubs whom KING PADELLA and a royal\nhunting party shot--for he was King now, and reigned over Crim Tartary.\n‘So the poor little Princess is done for,’ said he; ‘well, what’s done\ncan’t be helped. Gentlemen, let us go to luncheon!’ And one of the\ncourtiers took up the shoe and put it in his pocket. And there was an\nend of Rosalba!\n\n\n\n\nCHAPTER IV. HOW BLACKSTICK WAS NOT ASKED TO THE PRINCESS ANGELICA’S CHRISTENING\n\nWhen the Princess Angelica was born, her parents not only did not ask\nthe Fairy Blackstick to the christening party, but gave orders to their\nporter absolutely to refuse her if she called. This porter’s name\nwas Gruffanuff, and he had been selected for the post by their Royal\nHighnesses because he was a very tall fierce man, who could say ‘Not\nat home’ to a tradesman or an unwelcome visitor with a rudeness which\nfrightened most such persons away. He was the husband of that Countess\nwhose picture we have just seen, and as long as they were together they\nquarrelled from morning till night. Now this fellow tried his rudeness\nonce too often, as you shall hear. For the Fairy Blackstick coming to\ncall upon the Prince and Princess, who were actually sitting at the open\ndrawing-room window, Gruffanuff not only denied them, but made the most\nODIOUS VULGAR SIGN as he was going to slam the door in the Fairy’s face!\n‘Git away, hold Blackstick!’ said he. ‘I tell you, Master and Missis\nain’t at home to you;’ and he was, as we have said, GOING to slam the\ndoor.\n\nBut the Fairy, with her wand, prevented the door being shut; and\nGruffanuff came out again in a fury, swearing in the most abominable\nway, and asking the Fairy ‘whether she thought he was a going to stay at\nthat there door hall day?’\n\n‘You ARE going to stay at that door all day and all night, and for many\na long year,’ the Fairy said, very majestically; and Gruffanuff, coming\nout of the door, straddling before it with his great calves, burst out\nlaughing, and cried, ‘Ha, ha, ha! this is a good un! Ha--ah--what’s\nthis? Let me down--O--o--H’m!’ and then he was dumb!\n\nFor, as the Fairy waved her wand over him, he felt himself rising off\nthe ground, and fluttering up against the door, and then, as if a screw\nran into his stomach, he felt a dreadful pain there, and was pinned to\nthe door; and then his arms flew up over his head; and his legs, after\nwrithing about wildly, twisted under his body; and he felt cold,\ncold, growing over him, as if he was turning into metal; and he said,\n‘O--o--H’m!’ and could say no more, because he was dumb.\n\nHe WAS turned into metal! He was, from being BRAZEN, BRASS! He was\nneither more nor less than a knocker! And there he was, nailed to the\ndoor in the blazing summer day, till he burned almost red-hot; and there\nhe was, nailed to the door all the bitter winter nights, till his brass\nnose was dropping with icicles. And the postman came and rapped at him,\nand the vulgarest boy with a letter came and hit him up against the\ndoor. And the King and Queen (Princess and Prince they were then) coming\nhome from a walk that evening, the King said, ‘Hullo, my dear! you have\nhad a new knocker put on the door. Why, it’s rather like our porter in\nthe face! What has become of that boozy vagabond?’ And the house-maid\ncame and scrubbed his nose with sandpaper; and once, when the Princess\nAngelica’s little sister was born, he was tied up in an old kid glove;\nand, another night, some LARKING young men tried to wrench him off, and\nput him to the most excruciating agony with a turn screw. And then\nthe Queen had a fancy to have the colour of the door altered; and the\npainters dabbed him over the mouth and eyes, and nearly choked him, as\nthey painted him pea-green. I warrant he had leisure to repent of having\nbeen rude to the Fairy Blackstick!\n\nAs for his wife, she did not miss him; and as he was always guzzling\nbeer at the public-house, and notoriously quarrelling with his wife, and\nin debt to the tradesmen, it was supposed he had run away from all these\nevils, and emigrated to Australia or America. And when the Prince and\nPrincess chose to become King and Queen, they left their old house, and\nnobody thought of the porter any more.\n\n\n\n\nCHAPTER V. HOW PRINCESS ANGELICA TOOK A LITTLE MAID\n\nOne day, when the Princess Angelica was quite a little girl, she\nwas walking in the garden of the palace, with Mrs. Gruffanuff, the\ngoverness, holding a parasol over her head, to keep her sweet complexion\nfrom the freckles, and Angelica was carrying a bun, to feed the swans\nand ducks in the royal pond.\n\nThey had not reached the duck-pond, when there came toddling up to them\nsuch a funny little girl! She had a great quantity of hair blowing about\nher chubby little cheeks, and looked as if she had not been washed or\ncombed for ever so long. She wore a ragged bit of a cloak, and had only\none shoe on.\n\n‘You little wretch, who let you in here?’ asked Mrs. Gruffanuff.\n\n‘Div me dat bun,’ said the little girl, ‘me vely hungy.’\n\n‘Hungry! what is that?’ asked Princess Angelica, and gave the child the\nbun.\n\n‘Oh, Princess!’ says Mrs. Gruffanuff, ‘how good, how kind, how truly\nangelical you are! See, Your Majesties,’ she said to the King and Queen,\nwho now came up, along with their nephew, Prince Giglio, ‘how kind the\nPrincess is! She met this little dirty wretch in the garden--I can’t\ntell how she came in here, or why the guards did not shoot her dead at\nthe gate!--and the dear darling of a Princess has given her the whole of\nher bun!’\n\n‘I didn’t want it,’ said Angelical\n\n‘But you are a darling little angel all the same,’ says the governess.\n\n‘Yes; I know I am,’ said Angelical ‘Dirty little girl, don’t you think\nI am very pretty?’ Indeed, she had on the finest of little dresses and\nhats; and, as her hair was carefully curled, she really looked very\nwell.\n\n‘Oh, pooty, pooty!’ says the little girl, capering about, laughing, and\ndancing, and munching her bun; and as she ate it she began to sing, ‘Oh,\nwhat fun to have a plum bun! how I wis it never was done!’ At which,\nand her funny accent, Angelica, Giglio, and the King and Queen began to\nlaugh very merrily.\n\n‘I can dance as well as sing,’ says the little girl. ‘I can dance, and I\ncan sing, and I can do all sorts of ting.’ And she ran to a flower-bed,\nand pulling a few polyanthuses, rhododendrons, and other flowers, made\nherself a little wreath, and danced before the King and Queen so drolly\nand prettily, that everybody was delighted.\n\n‘Who was your mother--who were your relations, little girl?’ said the\nQueen.\n\nThe little girl said, ‘Little lion was my brudder; great big lioness my\nmudder; neber heard of any udder.’ And she capered away on her one shoe,\nand everybody was exceedingly diverted.\n\nSo Angelica said to the Queen, ‘Mamma, my parrot flew away yesterday out\nof its cage, and I don’t care any more for any of my toys; and I think\nthis funny little dirty child will amuse me. I will take her home, and\ngive her some of my old frocks.’\n\n‘Oh, the generous darling!’ says Mrs. Gruffanuff.\n\n‘Which I have worn ever so many times, and am quite tired of,’ Angelica\nwent on; ‘and she shall be my little maid. Will you come home with me,\nlittle dirty girl?’\n\nThe child clapped her hands, and said, ‘Go home with you--yes! You pooty\nPrincess!--Have a nice dinner, and wear a new dress!’\n\nAnd they all laughed again, and took home the child to the palace,\nwhere, when she was washed and combed, and had one of the Princess’s\nfrocks given to her, she looked as handsome as Angelica, almost. Not\nthat Angelica ever thought so; for this little lady never imagined\nthat anybody in the world could be as pretty, as good, or as clever as\nherself. In order that the little girl should not become too proud and\nconceited, Mrs. Gruffanuff took her old ragged mantle and one shoe, and\nput them into a glass box, with a card laid upon them, upon which was\nwritten, ‘These were the old clothes in which little BETSINDA was found\nwhen the great goodness and admirable kindness of Her Royal Highness the\nPrincess Angelica received this little outcast.’ And the date was added,\nand the box locked up.\n\nFor a while little Betsinda was a great favourite with the Princess, and\nshe danced, and sang, and made her little rhymes, to amuse her mistress.\nBut then the Princess got a monkey, and afterwards a little dog, and\nafterwards a doll, and did not care for Betsinda any more, who became\nvery melancholy and quiet, and sang no more funny songs, because nobody\ncared to hear her. And then, as she grew older, she was made a little\nlady’s-maid to the Princess; and though she had no wages, she worked\nand mended, and put Angelica’s hair in papers, and was never cross when\nscolded, and was always eager to please her mistress, and was always\nup early and to bed late, and at hand when wanted, and in fact became\na perfect little maid. So the two girls grew up, and, when the Princess\ncame out, Betsinda was never tired of waiting on her; and made her\ndresses better than the best milliner, and was useful in a hundred ways.\nWhilst the Princess was having her masters, Betsinda would sit and watch\nthem; and in this way she picked up a great deal of learn ing; for she\nwas always awake, though her mistress was not, and listened to the wise\nprofessors when Angelica was yawning or thinking of the next ball. And\nwhen the dancing-master came, Betsinda learned along with Angelica;\nand when the music-master came, she watched him, and practiced the\nPrincess’s pieces when Angelica was away at balls and parties; and when\nthe drawing-master came, she took note of all he said and did; and the\nsame with French, Italian, and all other languages--she learned them\nfrom the teacher who came to Angelica. When the Princess was going out\nof an evening she would say, ‘My good Betsinda, you may as well finish\nwhat I have begun.’ ‘Yes, miss,’ Betsinda would say, and sit down very\ncheerful, not to FINISH what Angelica began, but to DO it.\n\nFor instance, the Princess would begin a head of a warrior, let us say,\nand when it was begun it was something like this--\n\nBut when it was done, the warrior was like this--\n\n(only handsomer still if possible), and the Princess put her name to the\ndrawing; and the Court and King and Queen, and above all poor Giglio,\nadmired the picture of all things, and said, ‘Was there ever a genius\nlike Angelica?’ So, I am sorry to say, was it with the Princess’s\nembroidery and other accomplishments; and Angelica actually believed\nthat she did these things herself, and received all the flattery of\nthe Court as if every word of it was true. Thus she began to think that\nthere was no young woman in all the world equal to herself, and that no\nyoung man was good enough for her. As for Betsinda, as she heard none of\nthese praises, she was not puffed up by them, and being a most grateful,\ngood-natured girl, she was only too anxious to do everything which might\ngive her mistress pleasure. Now you begin to perceive that Angelica\nhad faults of her own, and was by no means such a wonder of wonders as\npeople represented Her Royal Highness to be.\n\n\n\n\nCHAPTER VI. HOW PRINCE GIGLIO BEHAVED HIMSELF\n\nAnd now let us speak about Prince Giglio, the nephew of the reigning\nmonarch of Paflagonia. It has already been stated, in page seven, that\nas long as he had a smart coat to wear, a good horse to ride, and money\nin his pocket, or rather to take out of his pocket, for he was very\ngood-natured, my young Prince did not care for the loss of his crown and\nsceptre, being a thoughtless youth, not much inclined to politics or any\nkind of learning. So his tutor had a sinecure. Giglio would not\nlearn classics or mathematics, and the Lord Chancellor of Paflagonia,\nSQUARETOSO, pulled a very long face because the Prince could not be got\nto study the Paflagonian laws and constitution; but, on the other hand,\nthe King’s gamekeepers and huntsmen found the Prince an apt pupil;\nthe dancing-master pronounced that he was a most elegant and assiduous\nscholar; the First Lord of the Billiard Table gave the most flattering\nreports of the Prince’s skill; so did the Groom of the Tennis Court;\nand as for the Captain of the Guard and Fencing Master, the VALIANT and\nVETERAN Count KUTASOFF HEDZOFF, he avowed that since he ran the General\nof Crim Tartary, the dreadful Grumbuskin, through the body, he never had\nencountered so expert a swordsman as Prince Giglio.\n\nI hope you do not imagine that there was any impropriety in the Prince\nand Princess walking together in the palace garden, and because Giglio\nkissed Angelica’s hand in a polite manner. In the first place they are\ncousins; next, the Queen is walking in the garden too (you cannot see\nher, for she happens to be behind that tree), and Her Majesty always\nwished that Angelica and Giglio should marry: so did Giglio: so did\nAngelica sometimes, for she thought her cousin very handsome, brave,\nand good-natured: but then you know she was so clever and knew so many\nthings, and poor Giglio knew nothing, and had no conversation. When they\nlooked at the stars, what did Giglio know of the heavenly bodies? Once,\nwhen on a sweet night in a balcony where they were standing, Angelica\nsaid, ‘There is the Bear.’ ‘Where?’ says Giglio. ‘Don’t be afraid,\nAngelica! if a dozen bears come, I will kill them rather than they shall\nhurt you.’ ‘Oh, you silly creature!’ says she; ‘you are very good, but\nyou are not very wise.’ When they looked at the flowers, Giglio was\nutterly unacquainted with botany, and had never heard of Linnaeus.\nWhen the butterflies passed, Giglio knew nothing about them, being as\nignorant of entomology as I am of algebra. So you see, Angelica, though\nshe liked Giglio pretty well, despised him on account of his ignorance.\nI think she probably valued HER OWN LEARNING rather too much; but to\nthink too well of one’s self is the fault of people of all ages and both\nsexes. Finally, when nobody else was there, Angelica liked her cousin\nwell enough.\n\nKing Valoroso was very delicate in health, and withal so fond of good\ndinners (which were prepared for him by his French cook Marmitonio),\nthat it was supposed he could not live long. Now the idea of anything\nhappening to the King struck the artful Prime Minister and the designing\nold lady-in-waiting with terror. For, thought Glumboso and the Countess,\n‘when Prince Giglio marries his cousin and comes to the throne, what a\npretty position we shall be in, whom he dislikes, and who have always\nbeen unkind to him. We shall lose our places in a trice; Mrs. Gruffanuff\nwill have to give up all the jewels, laces, snuff-boxes, rings, and\nwatches which belonged to the Queen, Giglio’s mother; and Glumboso will\nbe forced to refund two hundred and seventeen thousand millions nine\nhundred and eighty-seven thousand four hundred and thirty-nine pounds,\nthirteen shillings, and sixpence halfpenny, money left to Prince Giglio\nby his poor dear father.’\n\nSo the Lady of Honour and the Prime Minister hated Giglio because they\nhad done him a wrong; and these unprincipled people invented a hundred\ncruel stories about poor Giglio, in order to influence the King, Queen,\nand Princess against him; how he was so ignorant that he could not spell\nthe commonest words, and actually wrote Valoroso Valloroso, and spelt\nAngelica with two l’s; how he drank a great deal too much wine at\ndinner, and was always idling in the stables with the grooms; how he\nowed ever so much money at the pastry-cook’s and the haberdasher’s; how\nhe used to go to sleep at church; how he was fond of playing cards with\nthe pages. So did the Queen like playing cards; so did the King go\nto sleep at church, and eat and drink too much; and, if Giglio owed\na trifle for tarts, who owed him two hundred and seventeen thousand\nmillions nine hundred and eighty-seven thousand four hundred and\nthirty-nine pounds, thirteen shillings, and sixpence halfpenny, I should\nlike to know? Detractors and tale-bearers (in my humble opinion) had\nmuch better look at HOME. All this backbiting and slandering had effect\nupon Princess Angelica, who began to look coldly on her cousin, then to\nlaugh at him and scorn him for being so stupid, then to sneer at him for\nhaving vulgar associates; and at Court balls, dinners, and so forth,\nto treat him so unkindly that poor Giglio became quite ill, took to his\nbed, and sent for the doctor.\n\nHis Majesty King Valoroso, as we have seen, had his own reasons for\ndisliking his nephew; and as for those innocent readers who ask why?--I\nbeg (with the permission of their dear parents) to refer them to\nShakespeare’s pages, where they will read why King John disliked Prince\nArthur. With the Queen, his royal but weak-minded aunt, when Giglio was\nout of sight he was out of mind. While she had her whist and her evening\nparties, she cared for little else.\n\nI dare say TWO VILLAINS, who shall be nameless, wished Doctor Pildrafto,\nthe Court Physician, had killed Giglio right out, but he only bled\nand physicked him so severely that the Prince was kept to his room for\nseveral months, and grew as thin as a post.\n\nWhilst he was lying sick in this way, there came to the Court of\nPaflagonia a famous painter, whose name was Tomaso Lorenzo, and who was\nPainter in Ordinary to the King of Crim Tartary, Paflagonia’s neighbour.\nTomaso Lorenzo painted all the Court, who were delighted with his works;\nfor even Countess Gruffanuff looked young and Glumboso good-humoured\nin his pictures. ‘He flatters very much,’ some people said. ‘Nay!’ says\nPrincess Angelica, ‘I am above flattery, and I think he did not make my\npicture handsome enough. I can’t bear to hear a man of genius unjustly\ncried down, and I hope my dear papa will make Lorenzo a knight of his\nOrder of the Cucumber.’\n\nThe Princess Angelica, although the courtiers vowed Her Royal Highness\ncould draw so BEAUTIFULLY that the idea of her taking lessons was\nabsurd, yet chose to have Lorenzo for a teacher, and it was wonderful,\nAS LONG AS SHE PAINTED IN HIS STUDIO, what beautiful pictures she made!\nSome of the performances were engraved for the Book of Beauty: others\nwere sold for enormous sums at Charity Bazaars. She wrote the\nSIGNATURES under the drawings, no doubt, but I think I know who-did\nthe pictures--this artful painter, who had come with other designs on\nAngelica than merely to teach her to draw.\n\nOne day, Lorenzo showed the Princess a portrait of a young man in\narmour, with fair hair and the loveliest blue eyes, and an expression at\nonce melancholy and interesting.\n\n‘Dear Signor Lorenzo, who is this?’ asked the Princess.\n\n‘I never saw anyone so handsome,’ says Countess Gruffanuff (the old\nhumbug).\n\n‘That,’ said the painter, ‘that, Madam, is the portrait of my august\nyoung master, his Royal Highness Bulbo, Crown Prince of Crim Tartary,\nDuke of Acroceraunia, Marquis of Poluphloisboio, and Knight Grand Cross\nof the Order of the Pumpkin. That is the order of the Pumpkin glittering\non his manly breast, and received by His Royal Highness from his august\nfather, His Majesty King PADELLA I., for his gallantry at the battle\nof Rimbombamento, when he slew with his own princely hand the King\nof Ograria and two hundred and eleven giants of the two hundred and\neighteen who formed the King’s bodyguard. The remainder were destroyed\nby the brave Crim Tartar army after an obstinate combat, in which the\nCrim Tartars suffered severely.’\n\nWhat a Prince! thought Angelica: so brave--so calm-looking--so\nyoung--what a hero!\n\n‘He is as accomplished as he is brave,’ continued the Court Painter.\n‘He knows all languages perfectly: sings deliciously: plays every\ninstrument: composes operas which have been acted a thousand nights\nrunning at the Imperial Theatre of Crim Tartary, and danced in a ballet\nthere before the King and Queen; in which he looked so beautiful, that\nhis cousin, the lovely daughter of the King of Circassia, died for love\nof him.’\n\n‘Why did he not marry the poor Princess?’ asked Angelica, with a sigh.\n\n‘Because they were FIRST COUSINS, Madam, and the clergy forbid these\nunions,’ said the Painter. ‘And, besides, the young Prince had given his\nroyal heart ELSEWHERE.’\n\n‘And to whom?’ asked Her Royal Highness.\n\n‘I am not at liberty to mention the Princess’s name,’ answered the\nPainter.\n\n‘But you may tell me the first letter of it,’ gasped out the Princess.\n\n‘That Your Royal Highness is at liberty to guess,’ said Lorenzo.\n\n‘Does it begin with a Z?’ asked Angelica.\n\nThe Painter said it wasn’t a Z; then she tried a Y; then an X; then a W,\nand went so backwards through almost the whole alphabet.\n\nWhen she came to D, and it wasn’t D, she grew very excited; when she\ncame to C, and it wasn’t C, she was still more nervous; when she came\nto B, AND IT WASN’T B, ‘O dearest Gruffanuff,’ she said, ‘lend me your\nsmelling-bottle!’ and, hiding her head in the Countess’s shoulder, she\nfaintly whispered, ‘Ah, Signor, can it be A?’\n\n‘It was A; and though I may not, by my Royal Master’s orders, tell Your\nRoyal Highness the Princess’s name, whom he fondly, madly, devotedly,\nrapturously loves, I may show you her portrait,’ says this slyboots:\nand leading the Princess up to a gilt frame, he drew a curtain which was\nbefore it.\n\nO goodness! the frame contained A LOOKING-GLASS! and Angelica saw her\nown face!\n\n\n\n\nCHAPTER VII. HOW GIGLIO AND ANGELICA HAD A QUARREL\n\nThe Court Painter of His Majesty the King of Crim Tartary returned to\nthat monarch’s dominions, carrying away a number of sketches which he\nhad made in the Paflagonian capital (you know, of course, my dears, that\nthe name of that capital is Blombodinga); but the most charming of all\nhis pieces was a portrait of the Princess Angelica, which all the Crim\nTartar nobles came to see. With this work the King was so delighted,\nthat he decorated the Painter with his Order of the Pumpkin (sixth\nclass) and the artist became Sir Tomaso Lorenzo, K.P., thenceforth.\n\nKing Valoroso also sent Sir Tomaso his Order of the Cucumber, besides a\nhandsome order for money, for he painted the King, Queen, and principal\nnobility while at Blombodinga, and became all the fashion, to the\nperfect rage of all the artists in Paflagonia, where the King used to\npoint to the portrait of Prince Bulbo, which Sir Tomaso had left behind\nhim, and say ‘Which among you can paint a picture like that?’\n\nIt hung in the royal parlour over the royal sideboard, and Princess\nAngelica could always look at it as she sat making the tea. Each day it\nseemed to grow handsomer and handsomer, and the Princess grew so fond\nof looking at it, that she would often spill the tea over the cloth, at\nwhich her father and mother would wink and wag their heads, and say to\neach other, ‘Aha! we see how things are going.’\n\nIn the meantime poor Giglio lay upstairs very sick in his chamber,\nthough he took all the doctor’s horrible medicines like a good young\nlad; as I hope YOU do, my dears, when you are ill and mamma sends for\nthe medical man. And the only person who visited Giglio (besides his\nfriend the captain of the guard, who was almost always busy or on\nparade), was little Betsinda the housemaid, who used to do his bedroom\nand sitting-room out, bring him his gruel, and warm his bed.\n\nWhen the little housemaid came to him in the morning and evening, Prince\nGiglio used to say, ‘Betsinda, Betsinda, how is the Princess Angelica?’\n\nAnd Betsinda used to answer, ‘The Princess is very well, thank you, my\nLord.’ And Giglio would heave a sigh, and think, if Angelica were sick,\nI am sure _I_ should not be very well.\n\nThen Giglio would say, ‘Betsinda, has the Princess Angelica asked for\nme today?’ And Betsinda would answer, ‘No, my Lord, not today’; or, ‘she\nwas very busy practicing the piano when I saw her’; or, ‘she was writing\ninvitations for an evening party, and did not speak to me’; or make some\nexcuse or other, not strictly consonant with truth: for Betsinda was\nsuch a good-natured creature that she strove to do everything to prevent\nannoyance to Prince Giglio, and even brought him up roast chicken and\njellies from the kitchen (when the Doctor allowed them, and Giglio was\ngetting better), saying, ‘that the Princess had made the jelly, or the\nbread-sauce, with her own hands, on purpose for Giglio.’\n\nWhen Giglio heard this he took heart and began to mend immediately;\nand gobbled up all the jelly, and picked the last bone of the\nchicken--drumsticks, merry-thought, sides’-bones, back, pope’s nose,\nand all--thanking his dear Angelica; and he felt so much better the next\nday, that he dressed and went downstairs, where, whom should he meet\nbut Angelica going into the drawing-room? All the covers were off the\nchairs, the chandeliers taken out of the bags, the damask curtains\nuncovered, the work and things carried away, and the handsomest albums\non the tables. Angelica had her hair in papers: in a word, it was\nevident there was going to be a party.\n\n‘Heavens, Giglio!’ cries Angelica: ‘YOU here in such a dress! What a\nfigure you are!’\n\n‘Yes, dear Angelica, I am come downstairs, and feel so well today,\nthanks to the FOWL and the JELLY.’\n\n‘What do I know about fowls and jellies, that you allude to them in that\nrude way?’ says Angelica.\n\n‘Why, didn’t--didn’t you send them, Angelica dear?’ says Giglio.\n\n‘I send them indeed! Angelica dear! No, Giglio dear,’ says she, mocking\nhim, ‘_I_ was engaged in getting the rooms ready for His Royal Highness\nthe Prince of Crim Tartary, who is coming to pay my papa’s Court a\nvisit.’\n\n‘The--Prince--of--Crim--Tartary!’ Giglio said, aghast.\n\n‘Yes, the Prince of Crim Tartary,’ says Angelica, mocking him. ‘I dare\nsay you never heard of such a country. What DID you ever hear of? You\ndon’t know whether Crim Tartary is on the Red Sea or on the Black Sea, I\ndare say.’\n\n‘Yes, I do, it’s on the Red Sea,’ says Giglio, at which the Princess\nburst out laughing at him, and said, ‘Oh, you ninny! You are so\nignorant, you are really not fit for society! You know nothing but about\nhorses and dogs, and are only fit to dine in a mess-room with my Royal\nfather’s heaviest dragoons. Don’t look so surprised at me, sir: go\nand put your best clothes on to receive the Prince, and let me get the\ndrawing-room ready.’\n\nGiglio said, ‘Oh, Angelica, Angelica, I didn’t think this of you. THIS\nwasn’t your language to me when you gave me this ring, and I gave you\nmine in the garden, and you gave me that k--’\n\nBut what k was we never shall know, for Angelica, in a rage, cried,\n‘Get out, you saucy, rude creature! How dare you to remind me of your\nrudeness? As for your little trumpery twopenny ring, there, sir, there!’\nAnd she flung it out of the window.\n\n‘It was my mother’s marriage-ring,’ cried Giglio.\n\n‘_I_ don’t care whose marriage-ring it was,’ cries Angelica. ‘Marry the\nperson who picks it up if she’s a woman; you shan’t marry ME. And give\nme back MY ring. I’ve no patience with people who boast about the things\nthey give away! _I_ know who’ll give me much finer things than you ever\ngave me. A beggarly ring indeed, not worth five shillings!’\n\nNow Angelica little knew that the ring which Giglio had given her was a\nfairy ring: if a man wore it, it made all the women in love with him;\nif a woman, all the gentlemen. The Queen, Giglio’s mother, quite an\nordinary-looking person, was admired immensely whilst she wore this\nring, and her husband was frantic when she was ill. But when she called\nher little Giglio to her, and put the ring on his finger, King Savio did\nnot seem to care for his wife so much any more, but transferred all his\nlove to little Giglio. So did everybody love him as long as he had the\nring; but when, as quite a child, he gave it to Angelica, people began\nto love and admire HER; and Giglio, as the saying is, played only second\nfiddle.\n\n‘Yes,’ says Angelica, going on in her foolish ungrateful way. ‘_I_\nknow who’ll give me much finer things than your beggarly little pearl\nnonsense.’\n\n‘Very good, miss! You may take back your ring too!’ says Giglio, his\neyes flashing fire at her, and then, as his eyes had been suddenly\nopened, he cried out, ‘Ha! what does this mean? Is THIS the woman I have\nbeen in love with all my life? Have I been such a ninny as to throw away\nmy regard upon you? Why--actually--yes--you are a little crooked!’\n\n‘Oh, you wretch!’ cries Angelica.\n\n‘And, upon my conscience, you--you squint a little.’\n\n‘Eh!’ cries Angelica.\n\n‘And your hair is red--and you are marked with the smallpox--and what?\nyou have three false teeth--and one leg shorter than the other!’\n\n‘You brute, you brute, you!’ Angelica screamed out: and as she seized\nthe ring with one hand, she dealt Giglio one, two, three smacks on the\nface, and would have pulled the hair off his head had he not started\nlaughing, and crying--\n\n‘Oh dear me, Angelica, don’t pull out MY hair, it hurts! You might\nremove a great deal of YOUR OWN, as I perceive, without scissors or\npulling at all. Oh, ho, ho! ha, ha, ha! ho he he!’\n\nAnd he nearly choked himself with laughing, and she with rage; when,\nwith a low bow, and dressed in his Court habit, Count Gambabella,\nthe first lord-in-waiting, entered and said, ‘Royal Highnesses! Their\nMajesties expect you in the Pink Throne-room, where they await the\narrival of the Prince of CRIM TARTARY.’\n\n\n\n\nCHAPTER VIII. HOW GRUFFANUFF PICKED THE FAIRY RING UP, AND PRINCE BULBO CAME TO COURT\n\nPrince Bulbo’s arrival had set all the court in a flutter: everybody was\nordered to put his or her best clothes on: the footmen had their gala\nliveries; the Lord Chancellor his new wig; the Guards their last\nnew tunics; and Countess Gruffanuff, you may be sure, was glad of an\nopportunity of decorating HER old person with her finest things. She was\nwalking through the court of the Palace on her way to wait upon Their\nMajesties, when she espied something glittering on the pavement, and\nbade the boy in buttons who was holding up her train, to go and pick up\nthe article shining yonder. He was an ugly little wretch, in some of the\nlate groom-porter’s old clothes cut down, and much too tight for him;\nand yet, when he had taken up the ring (as it turned out to be), and was\ncarrying it to his mistress, she thought he looked like a little cupid.\nHe gave the ring to her; it was a trumpery little thing enough, but too\nsmall for any of her old knuckles, so she put it into her pocket.\n\n‘Oh, mum!’ says the boy, looking at her ‘how--how beyoutiful you do\nlook, mum, today, mum!’\n\n‘And you, too, Jacky,’ she was going to say; but, looking down\nat him--no, he was no longer good-looking at all--but only the\ncarroty-haired little Jacky of the morning. However, praise is welcome\nfrom the ugliest of men or boys, and Gruffanuff, bidding the boy hold\nup her train, walked on in high good-humour. The guards saluted her\nwith peculiar respect. Captain Hedzoff, in the anteroom, said, ‘My\ndear madam, you look like an angel today.’ And so, bowing and smirking,\nGruffanuff went in and took her place behind her Royal Master and\nMistress, who were in the throne-room, awaiting the Prince of Crim\nTartary. Princess Angelica sat at their feet, and behind the King’s\nchair stood Prince Giglio, looking very savage.\n\nThe Prince of Crim Tartary made his appearance, attended by Baron\nSleibootz, his chamberlain, and followed by a black page carrying the\nmost beautiful crown you ever saw! He was dressed in his travelling\ncostume, and his hair, as you see, was a little in disorder. ‘I have\nridden three hundred miles since breakfast,’ said he, ‘so eager was I to\nbehold the Prin--the Court and august family of Paflagonia, and I could\nnot wait one minute before appearing in Your Majesties’ presences.’\n\nGiglio, from behind the throne, burst out into a roar of contemptuous\nlaughter; but all the Royal party, in fact, were so flurried, that they\ndid not hear this little outbreak. ‘Your R. H. is welcome in any dress,’\nsays the King. ‘Glumboso, a chair for His Royal Highness.’\n\n‘Any dress His Royal Highness wears IS a Court dress,’ says Princess\nAngelica, smiling graciously.\n\n‘Ah! but you should see my other clothes,’ said the Prince. ‘I should\nhave had them on, but that stupid carrier has not brought them. Who’s\nthat laughing?’\n\nIt was Giglio laughing. ‘I was laughing,’ he said, ‘because you said\njust now that you were in such a hurry to see the Princess, that you\ncould not wait to change your dress; and now you say you come in those\nclothes because you have no others.’\n\n‘And who are you?’ says Prince Bulbo, very fiercely.\n\n‘My father was King of this country, and I am his only son, Prince!’\nreplies Giglio, with equal haughtiness.\n\n‘Ha!’ said the King and Glumboso, looking very flurried; but the former,\ncollecting himself, said, ‘Dear Prince Bulbo, I forgot to introduce to\nYour Royal Highness my dear nephew, His Royal Highness Prince Giglio!\nKnow each other! Embrace each other! Giglio, give His Royal Highness\nyour hand!’ and Giglio, giving his hand, squeezed poor Bulbo’s until the\ntears ran out of his eyes. Glumboso now brought a chair for the Royal\nvisitor, and placed it on the platform on which the King, Queen, and\nPrince were seated; but the chair was on the edge of the platform, and\nas Bulbo sat down, it toppled over, and he with it, rolling over and\nover, and bellowing like a bull. Giglio roared still louder at this\ndisaster, but it was with laughter; so did all the Court when Prince\nBulbo got up; for though when he entered the room he appeared not very\nridiculous, as he stood up from his fall for a moment he looked so\nexceedingly plain and foolish, that nobody could help laughing at him.\nWhen he had entered the room, he was observed to carry a rose in his\nhand, which fell out of it as he tumbled.\n\n‘My rose! my rose!’ cried Bulbo; and his chamberlain dashed forwards and\npicked it up, and gave it to the Prince, who put it in his waistcoat.\nThen people wondered why they had laughed; there was nothing\nparticularly ridiculous in him. He was rather short, rather stout,\nrather red-haired, but, in fine, for a Prince, not so bad.\n\nSo they sat and talked, the Royal personages together, the Crim\nTartar officers with those of Paflagonia--Giglio very comfortable with\nGruffanuff behind the throne. He looked at her with such tender eyes,\nthat her heart was all in a flutter. ‘Oh, dear Prince,’ she said, ‘how\ncould you speak so haughtily in presence of Their Majesties? I protest I\nthought I should have fainted.’\n\n‘I should have caught you in my arms,’ said Giglio, looking raptures.\n\n‘Why were you so cruel to Prince Bulbo, dear Prince?’ says Gruff.\n\n\n‘Because I hate him,’ says Gil.\n\n‘You are jealous of him, and still love poor Angelica,’ cries\nGruffanuff, putting her handkerchief to her eyes.\n\n‘I did, but I love her no more!’ Giglio cried. ‘I despise her! Were she\nheiress to twenty thousand thrones, I would despise her and scorn her.\nBut why speak of thrones? I have lost mine. I am too weak to recover\nit--I am alone, and have no friend.’\n\n‘Oh, say not so, dear Prince!’ says Gruffanuff.\n\n‘Besides,’ says he, ‘I am so happy here BEHIND THE THRONE that I would\nnot change my place, no, not for the throne of the world!’\n\n‘What are you two people chattering about there?’ says the Queen, who\nwas rather good-natured, though not overburthened with wisdom. ‘It is\ntime to dress for dinner. Giglio, show Prince Bulbo to his room. Prince,\nif your clothes have not come, we shall be very happy to see you as you\nare.’ But when Prince Bulbo got to his bedroom, his luggage was there\nand unpacked; and the hairdresser coming in, cut and curled him entirely\nto his own satisfaction; and when the dinner-bell rang, the Royal\ncompany had not to wait above five-and-twenty minutes until Bulbo\nappeared, during which time the King, who could not bear to wait, grew\nas sulky as possible. As for Giglio, he never left Madam Gruffanuff all\nthis time, but stood with her in the embrasure of a window, paying her\ncompliments. At length the Groom of the Chambers announced His Royal\nHighness the Prince of Crim Tartary! and the noble company went into the\nroyal dining-room. It was quite a small party; only the King and Queen,\nthe Princess, whom Bulbo took out, the two Princes, Countess Gruffanuff,\nGlumboso the Prime Minister, and Prince Bulbo’s chamberlain. You may be\nsure they had a very good dinner--let every boy or girl think of what he\nor she likes best, and fancy it on the table.*\n\n     *Here a very pretty game may be played by all the children\n     saying what they like best for dinner.\n\nThe Princess talked incessantly all dinner-time to the Prince of Crimea,\nwho ate an immense deal too much, and never took his eyes off his plate,\nexcept when Giglio, who was carving a goose, sent a quantity of stuffing\nand onion sauce into one of them. Giglio only burst out a-laughing\nas the Crimean Prince wiped his shirt-front and face with his scented\npocket-handkerchief. He did not make Prince Bulbo any apology. When the\nPrince looked at him, Giglio would not look that way. When Prince Bulbo\nsaid, ‘Prince Giglio, may I have the honour of taking a glass of wine\nwith you?’ Giglio WOULDN’T answer. All his talk and his eyes were for\nCountess Gruffanuff, who you may be sure was pleased with Giglio’s\nattentions--the vain old creature! When he was not complimenting her,\nhe was making fun of Prince Bulbo, so loud that Gruffanuff was always\ntapping him with her fan, and saying--‘Oh, you satirical Prince! Oh,\nfie, the Prince will hear!’ ‘Well, I don’t mind,’ says Giglio, louder\nstill. The King and Queen luckily did not hear; for Her Majesty was a\nlittle deaf, and the King thought so much about his own dinner, and,\nbesides, made such a dreadful noise, hobgobbling in eating it, that\nhe heard nothing else. After dinner, His Majesty and the Queen went to\nsleep in their arm-chairs.\n\nThis was the time when Giglio began his tricks with Prince Bulbo, plying\nthat young gentleman with port, sherry, madeira, champagne, marsala,\ncherry-brandy, and pale ale, of all of which Master Bulbo drank without\nstint. But in plying his guest, Giglio was obliged to drink himself,\nand, I am sorry to say, took more than was good for him, so that the\nyoung men were very noisy, rude, and foolish when they joined the ladies\nafter dinner; and dearly did they pay for that imprudence, as now, my\ndarlings, you shall hear!\n\nBulbo went and sat by the piano, where Angelica was playing and singing,\nand he sang out of tune, and he upset the coffee when the footman\nbrought it, and he laughed out of place, and talked absurdly, and fell\nasleep and snored horridly. Booh, the nasty pig! But as he lay there\nstretched on the pink satin sofa, Angelica still persisted in thinking\nhim the most beautiful of human beings. No doubt the magic rose which\nBulbo wore caused this infatuation on Angelica’s part; but is she the\nfirst young woman who has thought a silly fellow charming?\n\nGiglio must go and sit by Gruffanuff, whose old face he, too,\nevery moment began to find more lovely. He paid the most outrageous\ncompliments to her:--There never was such a darling--Older than he\nwas?--Fiddle-de-dee! He would marry her--he would have nothing but her!\n\nTo marry the heir to the throne! Here was a chance! The artful hussy\nactually got a sheet of paper, and wrote upon it, ‘This is to give\nnotice that I, Giglio, only son of Savio, King of Paflagonia, hereby\npromise to marry the charming and virtuous Barbara Griselda, Countess\nGruffanuff, and widow of the late Jenkins Gruffanuff, Esq.’\n\n‘What is it you are writing, you charming Gruffy?’ says Giglio, who was\nlolling on the sofa, by the writing-table.\n\n‘Only an order for you to sign, dear Prince, for giving coals and\nblankets to the poor, this cold weather. Look! the King and Queen are\nboth asleep, and your Royal Highness’s order will do.’\n\nSo Giglio, who was very good-natured, as Gruffy well knew, signed the\norder immediately; and, when she had it in her pocket, you may fancy\nwhat airs she gave herself. She was ready to flounce out of the room\nbefore the Queen herself, as now she was the wife of the RIGHTFUL King\nof Paflagonia! She would not speak to Glumboso, whom she thought a\nbrute, for depriving her DEAR HUSBAND of the crown! And when candles\ncame, and she had helped to undress the Queen and Princess, she went\ninto her own room, and actually practiced on a sheet of paper, ‘Griselda\nPaflagonia,’ ‘Barbara Regina,’ ‘Griselda Barbara, Paf. Reg.,’ and I\ndon’t know what signatures besides, against the day when she should be\nQueen, forsooth!\n\n\n\n\nCHAPTER IX. HOW BETSINDA GOT THE WARMING PAN\n\nLittle Betsinda came in to put Gruffanuff’s hair in papers; and the\nCountess was so pleased, that, for a wonder, she complimented Betsinda.\n‘Betsinda!’ she said, ‘you dressed my hair very nicely today; I promised\nyou a little present. Here are five sh--no, here is a pretty little\nring, that I picked--that I have had some time.’ And she gave Betsinda\nthe ring she had picked up in the court. It fitted Betsinda exactly.\n\n‘It’s like the ring the Princess used to wear,’ says the maid.\n\n‘No such thing,’ says Gruffanuff, ‘I have had it this ever so long.\nThere, tuck me up quite comfortable; and now, as it’s a very cold night\n(the snow was beating in at the window), you may go and warm dear Prince\nGiglio’s bed, like a good girl, and then you may unrip my green silk,\nand then you can just do me up a little cap for the morning, and then\nyou can mend that hole in my silk stocking, and then you can go to\nbed, Betsinda. Mind I shall want my cup of tea at five o’clock in the\nmorning.’\n\n‘I suppose I had best warm both the young gentlemen’s beds, Ma’am,’ says\nBetsinda.\n\nGruffanuff, for reply, said, ‘Hau-au-ho!--Grauhawhoo!--Hong-hrho!’ In\nfact, she was snoring sound asleep.\n\nHer room, you know, is next to the King and Queen, and the Princess is\nnext to them. So pretty Betsinda went away for the coals to the kitchen,\nand filled the royal warming-pan.\n\nNow, she was a very kind, merry, civil, pretty girl; but there must\nhave been something very captivating about her this evening, for all\nthe women in the servants’ hall began to scold and abuse her. The\nhousekeeper said she was a pert, stuck-up thing: the upper-housemaid\nasked, how dare she wear such ringlets and ribbons, it was quite\nimproper! The cook (for there was a woman-cook as well as a man-cook)\nsaid to the kitchen-maid that she never could see anything in that\ncreetur: but as for the men, every one of them, Coachman, John, Buttons,\nthe page, and Monsieur, the Prince of Crim Tartary’s valet, started up,\nand said--\n\n     ‘My eyes!’  }\n     ‘O mussey!’ } ‘What a pretty girl Betsinda is!’\n     ‘O jemmany!’ }\n     ‘O ciel!’  }\n\n‘Hands off; none of your impertinence, you vulgar, low people!’ says\nBetsinda, walking off with her pan of coals. She heard the young\ngentlemen playing at billiards as she went upstairs: first to Prince\nGiglio’s bed, which she warmed, and then to Prince Bulbo’s room.\n\nHe came in just as she had done; and as soon as he saw her, ‘O! O! O!\nO! O! O! what a beyou--oo--ootiful creature you are! You angel--you\nperi--you rosebud, let me be thy bulbul--thy Bulbo, too! Fly to the\ndesert, fly with me! I never saw a young gazelle to glad me with its\ndark blue eye that had eyes like shine. Thou nymph of beauty, take, take\nthis young heart. A truer never did itself sustain within a soldier’s\nwaistcoat. Be mine! Be mine! Be Princess of Crim Tartary! My Royal\nfather will approve our union; and, as for that little carroty-haired\nAngelica, I do not care a fig for her any more.’\n\n‘Go away, Your Royal Highness, and go to bed, please,’ said Betsinda,\nwith the warming-pan.\n\nBut Bulbo said, ‘No, never, till thou swearest to be mine, thou lovely,\nblushing chambermaid divine! Here, at thy feet, the Royal Bulbo lies,\nthe trembling captive of Betsinda’s eyes.’\n\nAnd he went on, making himself SO ABSURD AND RIDICULOUS, that Betsinda,\nwho was full of fun, gave him a touch with the warming-pan, which, I\npromise you, made him cry ‘O-o-o-o!’ in a very different manner.\n\nPrince Bulbo made such a noise that Prince Giglio, who heard him from\nthe next room, came in to see what was the matter. As soon as he saw\nwhat was taking place, Giglio, in a fury, rushed on Bulbo, kicked him\nin the rudest manner up to the ceiling, and went on kicking him till his\nhair was quite out of curl.\n\nPoor Betsinda did not know whether to laugh or to cry; the kicking\ncertainly must hurt the Prince, but then he looked so droll! When Giglio\nhad done knocking him up and down to the ground, and whilst he went into\na corner rubbing himself, what do you think Giglio does? He goes down on\nhis own knees to Betsinda, takes her hand, begs her to accept his heart,\nand offers to marry her that moment. Fancy Betsinda’s condition, who had\nbeen in love with the Prince ever since she first saw him in the palace\ngarden, when she was quite a little child.\n\n‘Oh, divine Betsinda!’ says the Prince, ‘how have I lived fifteen years\nin thy company without seeing thy perfections? What woman in all\nEurope, Asia, Africa, and America, nay, in Australia, only it is not\nyet discovered, can presume to be thy equal? Angelica? Pish! Gruffanuff?\nPhoo! The Queen? Ha, ha! Thou art my Queen. Thou art the real Angelica,\nbecause thou art really angelic.’\n\n‘Oh, Prince! I am but a poor chambermaid,’ says Betsinda, looking,\nhowever, very much pleased.\n\n‘Didst thou not tend me in my sickness, when all forsook me?’ continues\nGiglio. ‘Did not thy gentle hand smooth my pillow, and bring me jelly\nand roast chicken?’\n\n‘Yes, dear Prince, I did,’ says Betsinda, ‘and I sewed Your Royal\nHighness’s shirt-buttons on too, if you please, Your Royal Highness,’\ncries this artless maiden.\n\nWhen poor Prince Bulbo, who was now madly in love with Betsinda, heard\nthis declaration, when he saw the unmistakable glances which she flung\nupon Giglio, Bulbo began to cry bitterly, and tore quantities of hair\nout of his head, till it all covered the room like so much tow.\n\nBetsinda had left the warming-pan on the floor while the princes were\ngoing on with their conversation, and as they began now to quarrel and\nbe very fierce with one another, she thought proper to run away.\n\n‘You great big blubbering booby, tearing your hair in the corner there;\nof course you will give me satisfaction for insulting Betsinda. YOU dare\nto kneel down at Princess Giglio’s knees and kiss her hand!’\n\n‘She’s not Princess Giglio!’ roars out Bulbo. ‘She shall be Princess\nBulbo, no other shall be Princess Bulbo.’\n\n‘You are engaged to my cousin!’ bellows out Giglio. ‘I hate your\ncousin,’ says Bulbo.\n\n‘You shall give me satisfaction for insulting her!’ cries Giglio in a\nfury.\n\n‘I’ll have your life.’\n\n‘I’ll run you through.’\n\n‘I’ll cut your throat.’\n\n‘I’ll blow your brains out.’\n\n‘I’ll knock your head off.’\n\n‘I’ll send a friend to you in the morning.’\n\n‘I’ll send a bullet into you in the afternoon.’\n\n‘We’ll meet again,’ says Giglio, shaking his fist in Bulbo’s face; and\nseizing up the warming-pan, he kissed it, because, forsooth, Betsinda\nhad carried it, and rushed downstairs. What should he see on the landing\nbut His Majesty talking to Betsinda, whom he called by all sorts of fond\nnames. His Majesty had heard a row in the building, so he stated, and\nsmelling something burning, had come out to see what the matter was.\n\n‘It’s the young gentlemen smoking, perhaps, sir,’ says Betsinda.\n\n‘Charming chambermaid,’ says the King (like all the rest of them),\n‘never mind the young men! Turn thy eyes on a middle-aged autocrat, who\nhas been considered not ill-looking in his time.’\n\n‘Oh, sir! what will Her Majesty say?’ cries Betsinda.\n\n‘Her Majesty!’ laughs the monarch. ‘Her Majesty be hanged. Am I not\nAutocrat of Paflagonia? Have I not blocks, ropes, axes, hangmen--ha?\nRuns not a river by my palace wall? Have I not sacks to sew up wives\nwithal? Say but the word, that thou wilt be mine own,--your mistress\nstraightway in a sack is sewn, and thou the sharer of my heart and\nthrone.’\n\nWhen Giglio heard these atrocious sentiments, he forgot the respect\nusually paid to Royalty, lifted up the warming-pan, and knocked down the\nKing as flat as a pancake; after which, Master Giglio took to his\nheels and ran away, and Betsinda went off screaming, and the Queen,\nGruffanuff, and the Princess, all came out of their rooms. Fancy their\nfeelings on beholding their husband, father, sovereign, in this posture!\n\n\n\n\nCHAPTER X. HOW KING VALOROSO WAS IN A DREADFUL PASSION\n\nAs soon as the coals began to burn him, the King came to himself\nand stood up. ‘Ho! my captain of the guards!’ His Majesty exclaimed,\nstamping his royal feet with rage. O piteous spectacle! the King’s nose\nwas bent quite crooked by the blow of Prince Giglio! His Majesty ground\nhis teeth with rage. ‘Hedzoff,’ he said, taking a death-warrant out of\nhis dressing-gown pocket, ‘Hedzoff, good Hedzoff, seize upon the Prince.\nThou’lt find him in his chamber two pair up. But now he dared, with\nsacrilegious hand, to strike the sacred night-cap of a king--Hedzoff,\nand floor me with a warming-pan! Away, no more demur, the villain dies!\nSee it be done, or else,--h’m--ha!--h’m! mind shine own eyes!’ and\nfollowed by the ladies, and lifting up the tails of his dressing-gown,\nthe King entered his own apartment.\n\nCaptain Hedzoff was very much affected, having a sincere love for\nGiglio. ‘Poor, poor Giglio!’ he said, the tears rolling over his manly\nface, and dripping down his moustachios; ‘my noble young Prince, is it\nmy hand must lead thee to death?’\n\n‘Lead him to fiddlestick, Hedzoff,’ said a female voice. It was\nGruffanuff, who had come out in her dressing-gown when she heard the\nnoise. ‘The King said you were to hang the Prince. Well, hang the\nPrince.’\n\n‘I don’t understand you,’ says Hedzoff, who was not a very clever man.\n\n‘You Gaby! he didn’t say WHICH Prince,’ says Gruffanuff.\n\n‘No; he didn’t say which, certainly,’ said Hedzoff.\n\n‘Well then, take Bulbo, and hang HIM!’\n\nWhen Captain Hedzoff heard this, he began to dance about for joy.\n‘Obedience is a soldier’s honour,’ says he. ‘Prince Bulbo’s head will do\ncapitally,’ and he went to arrest the Prince the very first thing next\nmorning.\n\nHe knocked at the door. ‘Who’s there?’ says Bulbo. ‘Captain Hedzoff?\nStep in, pray, my good Captain; I’m delighted to see you; I have been\nexpecting you.’\n\n‘Have you?’ says Hedzoff.\n\n‘Sleibootz, my Chamberlain, will act for me,’ says the Prince.\n\n‘I beg Your Royal Highness’s pardon, but you will have to act for\nyourself, and it’s a pity to wake Baron Sleibootz.’\n\nThe Prince Bulbo still seemed to take the matter very coolly. ‘Of\ncourse, Captain,’ says he, ‘you are come about that affair with Prince\nGiglio?’\n\n‘Precisely,’ says Hedzoff, ‘that affair of Prince Giglio.’\n\n‘Is it to be pistols, or swords, Captain?’ asks Bulbo. ‘I’m a pretty\ngood hand with both, and I’ll do for Prince Giglio as sure as my name is\nMy Royal Highness Prince Bulbo.’\n\n‘There’s some mistake, my Lord,’ says the Captain. ‘The business is done\nwith AXES among us.’\n\n‘Axes? That’s sharp work,’ says Bulbo. ‘Call my Chamberlain, he’ll be my\nsecond, and in ten minutes, I flatter myself, you’ll see Master Giglio’s\nhead off his impertinent shoulders. I’m hungry for his blood Hoooo, aw!’\nand he looked as savage as an ogre.\n\n‘I beg your pardon, sir, but by this warrant I am to take you prisoner,\nand hand you over to--to the executioner.’\n\n‘Pooh, pooh, my good man!--Stop, I say,--ho!--hulloa!’ was all that\nthis luckless Prince was enabled to say, for Hedzoff’s guards seizing\nhim, tied a handkerchief over his mouth and face, and carried him to the\nplace of execution.\n\nThe King, who happened to be talking to Glumboso, saw him pass, and\ntook a pinch of snuff and said, ‘So much for Giglio. Now let’s go to\nbreakfast.’\n\nThe Captain of the Guard handed over his prisoner to the Sheriff, with\nthe fatal order,\n\n‘AT SIGHT CUT OFF THE BEARER’S HEAD. ‘VALOROSO XXIV.’\n\n‘It’s a mistake,’ says Bulbo, who did not seem to understand the\nbusiness in the least.\n\n‘Poo--poo--pooh,’ says the Sheriff. ‘Fetch Jack Ketch instantly. Jack\nKetch!’\n\nAnd poor Bulbo was led to the scaffold, where an executioner with a\nblock and a tremendous axe was always ready in case he should be wanted.\n\nBut we must now revert to Giglio and Betsinda.\n\n\n\n\nCHAPTER XI. WHAT GRUFFANUFF DID TO GIGLIO AND BETSINDA\n\nGruffanuff, who had seen what had happened with the King, and knew that\nGiglio must come to grief, got up very early the next morning, and went\nto devise some plans for rescuing her darling husband, as the silly old\nthing insisted on calling him. She found him walking up and down the\ngarden, thinking of a rhyme for Betsinda (TINDER and WINDA were all he\ncould find), and indeed having forgotten all about the past evening,\nexcept that Betsinda was the most lovely of beings.\n\n‘Well, dear Giglio,’ says Gruff.\n\n‘Well, dear Gruffy,’ says Giglio, only HE was quite satirical.\n\n‘I have been thinking, darling, what you must do in this scrape. You\nmust fly the country for a while.’\n\n‘What scrape?--fly the country? Never without her I love, Countess,’\nsays Giglio.\n\n‘No, she will accompany you, dear Prince,’ she says, in her most coaxing\naccents. ‘First, we must get the jewels belonging to our royal parents.\nand those of her and his present Majesty. Here is the key, duck; they\nare all yours, you know, by right, for you are the rightful King of\nPaflagonia, and your wife will be the rightful Queen.’\n\n‘Will she?’ says Giglio.\n\n‘Yes; and having got the jewels, go to Glumboso’s apartment, where,\nunder his bed, you will find sacks containing money to the amount of\nL2I7,000,000,987,439, 13S. 6 1/2d., all belonging to you, for he took\nit out of your royal father’s room on the day of his death. With this we\nwill fly.’\n\n‘WE will fly?’ says Giglio.\n\n‘Yes, you and your bride--your affianced love--your Gruffy!’ says the\nCountess, with a languishing leer.\n\n‘YOU my bride!’ says Giglio. ‘You, you hideous old woman!’\n\n‘Oh, you--you wretch! didn’t you give me this paper promising marriage?’\ncries Gruff.\n\n‘Get away, you old goose! I love Betsinda, and Betsinda only!’ And in a\nfit of terror he ran from her as quickly as he could.\n\n‘He! he! he!’ shrieks out Gruff; ‘a promise is a promise if there are\nlaws in Paflagonia! And as for that monster, that wretch, that fiend,\nthat ugly little vixen--as for that upstart, that ingrate, that beast,\nBetsinda, Master Giglio will have no little difficulty in discovering\nher whereabouts. He may look very long before finding HER, I warrant. He\nlittle knows that Miss Betsinda is--’\n\nIs--what? Now, you shall hear. Poor Betsinda got up at five in winter’s\nmorning to bring her cruel mistress her tea; and instead of finding\nher in a good humour, found Gruffy as cross as two sticks. The Countess\nboxed Betsinda’s ears half a dozen times whilst she was dressing; but\nas poor little Betsinda was used to this kind of treatment, she did not\nfeel any special alarm. ‘And now,’ says she, ‘when Her Majesty rings her\nbell twice, I’ll trouble you, miss, to attend.’\n\nSo when the Queen’s bell rang twice, Betsinda came to Her Majesty and\nmade a pretty little curtsey. The Queen, the Princess, and Gruffanuff\nwere all three in the room. As soon as they saw her they began,\n\n‘You wretch!’ says the Queen.\n\n‘You little vulgar thing!’ says the Princess.\n\n‘You beast!’ says Gruffanuff.\n\n‘Get out of my sight!’ says the Queen.\n\n‘Go away with you, do!’ says the Princess.\n\n‘Quit the premises!’ says Gruffanuff.\n\n‘Alas! and woe is me!’ very lamentable events had occurred to Betsinda\nthat morning, and all in consequence of that fatal warming-pan business\nof the previous night. The King had offered to marry her; of course Her\nMajesty the Queen was jealous: Bulbo had fallen in love with her; of\ncourse Angelica was furious: Giglio was in love with her, and oh, what a\nfury Gruffy was in!\n\n     ‘Take off that {cap   } I gave you,’\n     {petticoat} they said, all\n     {gown   } at once,\n     and began tearing the clothes off poor Betsinda.\n\n     ‘How    (the King?’   } cried the Queen,\n     dare you  {Prince Bulbo?’ } the Princess, and\n     flirt with {Prince Giglio?’ } Countess.\n\n‘Give her the rags she wore when she came into the house, and turn her\nout of it!’ cries the Queen.\n\n‘Mind she does not go with MY shoes on, which I lent her so kindly,’\nsays the Princess; and indeed the Princess’s shoes were a great deal too\nbig for Betsinda.\n\n‘Come with me, you filthy hussy!’ and taking up the Queen’s poker, the\ncruel Gruffanuff drove Betsinda into her room.\n\nThe Countess went to the glass box in which she had kept Betsinda’s old\ncloak and shoe this ever so long, and said, ‘Take those rags, you little\nbeggar creature, and strip off everything belonging to honest people,\nand go about your business’; and she actually tore off the poor little\ndelicate thing’s back almost all her things, and told her to be off out\nof the house.\n\nPoor Betsinda huddled the cloak round her back, on which were\nembroidered the letters PRIN. . . ROSAL. . . and then came a great rent.\n\nAs for the shoe, what was she to do with one poor little tootsey sandal?\nthe string was still to it, so she hung it round her neck.\n\n‘Won’t you give me a pair of shoes to go out in the snow, mum, if you\nplease, mum?’ cried the poor child.\n\n‘No, you wicked beast!’ says Gruffanuff, driving her along with the\npoker--driving her down the cold stairs--driving her through the cold\nhall--flinging her out into the cold street, so that the knocker itself\nshed tears to see her!\n\nBut a kind fairy made the soft snow warm for her little feet, and she\nwrapped herself up in the ermine of her mantle, and was gone!\n\n\n‘And now let us think about breakfast,’ says the greedy Queen.\n\n‘What dress shall I put on, mamma? the pink or the peagreen?’ says\nAngelica. ‘Which do you think the dear Prince will like best?’\n\n‘Mrs. V.!’ sings out the King from his dressing-room, ‘let us have\nsausages for breakfast! Remember we have Prince Bulbo staying with us!’\n\nAnd they all went to get ready.\n\nNine o’clock came, and they were all in the breakfast-room, and no\nPrince Bulbo as yet. The urn was hissing and humming: the muffins were\nsmoking--such a heap of muffins! the eggs were done, there was a pot\nof raspberry jam, and coffee, and a beautiful chicken and tongue on the\nside-table. Marmitonio the cook brought in the sausages. Oh, how nice\nthey smelt!\n\n‘Where is Bulbo?’ said the King. ‘John, where is His Royal Highness?’\nJohn said he had a took hup His Roilighnessesses shaving-water, and\nhis clothes and things, and he wasn’t in his room, which he sposed His\nRoyliness was just stepped trout.\n\n‘Stepped out before breakfast in the snow! Impossible!’ says the King,\nsticking his fork into a sausage. ‘My dear, take one. Angelica, won’t\nyou have a saveloy?’ The Princess took one, being very fond of them; and\nat this moment Glumboso entered with Captain Hedzoff, both looking very\nmuch disturbed.\n\n‘I am afraid Your Majesty--’ cries Glumboso.\n\n‘No business before breakfast, Glum!’ says the King.’ Breakfast first,\nbusiness next. Mrs. V., some more sugar!’\n\n‘Sire, I am afraid if we wait till after breakfast it will be too late,’\nsays Glumboso. ‘He--he--he’ll be hanged at half-past nine.’\n\n‘Don’t talk about hanging and spoil my breakfast, you unkind, vulgar\nman you,’ cries the Princess. ‘John, some mustard. Pray who is to be\nhanged?’\n\n‘Sire, it is the Prince,’ whispers Glumboso to the King.\n\n‘Talk about business after breakfast, I tell you!’ says His Majesty,\nquite sulky.\n\n‘We shall have a war, Sire, depend on it,’ says the Minister. ‘His\nfather, King Padella. . .’\n\n‘His father, King WHO?’ says the King. ‘King Padella is not Giglio’s\nfather. My brother, King Savio, was Giglio’s father.’\n\n‘It’s Prince Bulbo they are hanging, Sire, not Prince Giglio,’ says the\nPrime Minister.\n\n‘You told me to hang the Prince, and I took the ugly one,’ says Hedzoff.\n‘I didn’t, of course, think Your Majesty intended to murder your own\nflesh and blood!’\n\nThe King for all reply flung the plate of sausages at Hedzoff’s head.\nThe Princess cried out ‘Hee-kareekaree!’ and fell down in a fainting\nfit.\n\n‘Turn the cock of the urn upon Her Royal Highness,’ said the King,\nand the boiling water gradually revived her. His Majesty looked at\nhis watch, compared it by the clock in the parlour, and by that of the\nchurch in the square opposite; then he wound it up; then he looked at it\nagain. ‘The great question is,’ says he, ‘am I fast or am I slow? If I’m\nslow, we may as well go on with breakfast. If I’m fast, why, there\nis just the possibility of saving Prince Bulbo. It’s a doosid awkward\nmistake, and upon my word, Hedzoff, I have the greatest mind to have you\nhanged too.’\n\n‘Sire, I did but my duty; a soldier has but his orders. I didn’t expect\nafter forty-seven years of faithful service that my sovereign would\nthink of putting me to a felon’s death!’\n\n‘A hundred thousand plagues upon you! Can’t you see that while you are\ntalking my Bulbo is being hung?’ screamed the Princess.\n\n‘By Jove! she’s always right, that girl, and I’m so absent,’ says the\nKing, looking at his watch again. ‘Ha! there go the drums! What a doosid\nawkward thing though!’\n\n‘Oh, papa, you goose! Write the reprieve, and let me run with it,’ cries\nthe Princess--and she got a sheet of paper, and pen and ink, and laid\nthem before the King.\n\n‘Confound it! where are my spectacles?’ the Monarch exclaimed.\n‘Angelica! go up into my bedroom, look under my pillow, not your\nmamma’s; there you’ll see my keys. Bring them down to me, and--Well,\nwell! what impetuous things these girls are!’ Angelica was gone, and had\nrun up panting to the bedroom, and found the keys, and was back again\nbefore the King had finished a muffin. ‘Now, love,’ says he, ‘you must\ngo all the way back for my desk, in which my spectacles are. If you\nwould but have heard me out. . . Be hanged to her! There she is off\nagain. Angelica! ANGELICA!’ When His Majesty called in his LOUD voice,\nshe knew she must obey, and came back.\n\n‘My dear, when you go out of a room, how often have I told you, SHUT THE\nDOOR. That’s a darling. That’s all.’ At last the keys and the desk and\nthe spectacles were got, and the King mended his pen, and signed his\nname to a reprieve, and Angelica ran with it as swift as the wind.\n‘You’d better stay, my love, and finish the muffins. There’s no use\ngoing. Be sure it’s too late. Hand me over that raspberry jam, please,’\nsaid the Monarch. ‘Bong! Bawong! There goes the half-hour. I knew it\nwas.’\n\nAngelica ran, and ran, and ran, and ran. She ran up Fore Street, and\ndown High Street, and through the Market-place, and down to the left,\nand over the bridge, and up the blind alley, and back again, and round\nby the Castle, and so along by the Haberdasher’s on the right, opposite\nthe lamp-post, and round the square, and she came--she came to the\nEXECUTION PLACE, where she saw Bulbo laying his head on the block!!! The\nexecutioner raised his axe, but at that moment the Princess came panting\nup and cried ‘Reprieve!’ ‘Reprieve!’ screamed the Princess. ‘Reprieve!’\nshouted all the people. Up the scaffold stairs she sprang, with the\nagility of a lighter of lamps; and flinging herself in Bulbo’s arms,\nregardless of all ceremony, she cried out, ‘Oh, my Prince! my lord! my\nlove! my Bulbo! Thine Angelica has been in time to save thy precious\nexistence, sweet rosebud; to prevent thy being nipped in thy young\nbloom! Had aught befallen thee, Angelica too had died, and welcomed\ndeath that joined her to her Bulbo.’\n\n‘H’m! there’s no accounting for tastes,’ said Bulbo, looking so very\nmuch puzzled and uncomfortable that the Princess, in tones of tenderest\nstrain, asked the cause of his disquiet.\n\n‘I tell you what it is, Angelica,’ said he, ‘since I came here\nyesterday, there has been such a row, and disturbance, and quarrelling,\nand fighting, and chopping of heads off, and the deuce to pay, that I am\ninclined to go back to Crim Tartary.’\n\n‘But with me as thy bride, my Bulbo! Though wherever thou art is Crim\nTartary to me, my bold, my beautiful, my Bulbo!’\n\n‘Well, well, I suppose we must be married,’ says Bulbo. ‘Doctor, you\ncame to read the Funeral Service--read the Marriage Service, will you?\nWhat must be, must. That will satisfy Angelica, and then, in the name of\npeace and quietness, do let us go back to breakfast.’\n\nBulbo had carried a rose in his mouth all the time of the dismal\nceremony. It was a fairy rose, and he was told by his mother that he\nought never to part with it. So he had kept it between his teeth, even\nwhen he laid his poor head upon the block, hoping vaguely that some\nchance would turn up in his favour. As he began to speak to Angelica,\nhe forgot about the rose, and of course it dropped out of his mouth.\nThe romantic Princess instantly stooped and seized it. ‘Sweet rose!’ she\nexclaimed, ‘that bloomed upon my Bulbo’s lip, never, never will I part\nfrom thee!’ and she placed it in her bosom. And you know Bulbo COULDN’T\nask her to give the rose back again. And they went to breakfast; and as\nthey walked, it appeared to Bulbo that Angelica became more exquisitely\nlovely every moment.\n\nHe was frantic until they were married; and now, strange to say, it was\nAngelica who didn’t care about him! He knelt down, he kissed her hand,\nhe prayed and begged; he cried with admiration; while she for her part\nsaid she really thought they might wait; it seemed to her he was not\nhandsome any more--no, not at all, quite the reverse; and not clever,\nno, very stupid; and not well bred, like Giglio; no, on the contrary,\ndreadfully vul--\n\nWhat, I cannot say, for King Valoroso roared out ‘POOH, stuff!’ in a\nterrible voice. ‘We will have no more of this shilly-shallying! Call the\nArchbishop, and let the Prince and Princess be married offhand!’\n\nSo, married they were, and I am sure for my part I trust they will be\nhappy.\n\n\n\n\nCHAPTER XII. HOW BETSINDA FLED, AND WHAT BECAME OF HER\n\nBetsinda wandered on and on, till she passed through the town gates, and\nso on the great Crim Tartary road, the very way on which Giglio too\nwas going. ‘Ah!’ thought she, as the diligence passed her, of which the\nconductor was blowing a delightful tune on his horn, ‘how I should like\nto be on that coach!’ But the coach and the jingling horses were very\nsoon gone. She little knew who was in it, though very likely she was\nthinking of him all the time.\n\nThen came an empty cart, returning from market; and the driver being\na kind man, and seeing such a very pretty girl trudging along the road\nwith bare feet, most good-naturedly gave her a seat. He said he lived on\nthe confines of the forest, where his old father was a woodman, and, if\nshe liked, he would take her so far on her road. All roads were the same\nto little Betsinda, so she very thankfully took this one.\n\nAnd the carter put a cloth round her bare feet, and gave her some bread\nand cold bacon, and was very kind to her. For all that she was very cold\nand melancholy. When after travelling on and on, evening came, and all\nthe black pines were bending with snow, and there, at last, was the\ncomfortable light beaming in the woodman’s windows; and so they arrived,\nand went into his cottage. He was an old man, and had a number of\nchildren, who were just at supper, with nice hot bread-and-milk, when\ntheir elder brother arrived with the cart. And they jumped and clapped\ntheir hands; for they were good children; and he had brought them toys\nfrom the town. And when they saw the pretty stranger, they ran to\nher, and brought her to the fire, and rubbed her poor little feet, and\nbrought her bread and milk.\n\n‘Look, father!’ they said to the old woodman, ‘look at this poor girl,\nand see what pretty cold feet she has. They are as white as our milk!\nAnd look and see what an odd cloak she has, just like the bit of velvet\nthat hangs up in our cupboard, and which you found that day the little\ncubs were killed by King Padella, in the forest! And look, why, bless\nus all! she has got round her neck just such another little shoe as\nthat you brought home, and have shown us so often--a little blue velvet\nshoe!’\n\n‘What,’ said the old woodman, ‘what is all this about a shoe and a\ncloak?’\n\nAnd Betsinda explained that she had been left, when quite a little\nchild, at the town with this cloak and this shoe. And the persons who\nhad taken care of her had--had been angry with her, for no fault, she\nhoped, of her own. And they had sent her away with her old clothes--and\nhere, in fact, she was. She remembered having been in a forest--and\nperhaps it was a dream--it was so very odd and strange--having lived in\na cave with lions there; and, before that, having lived in a very, very\nfine house, as fine as the King’s, in the town.\n\nWhen the woodman heard this, he was so astonished, it was quite curious\nto see how astonished he was. He went to his cupboard, and took out of\na stocking a five-shilling piece of King Cavolfiore, and vowed it was\nexactly like the young woman. And then he produced the shoe and piece\nof velvet which he had kept so long, and compared them with the things\nwhich Betsinda wore. In Betsinda’s little shoe was written, ‘Hopkins,\nmaker to the Royal Family’; so in the other shoe was written, ‘Hopkins,\nmaker to the Royal Family.’ In the inside of Betsinda’s piece of\ncloak was embroidered, ‘PRIN ROSAL’; in the other piece of cloak was\nembroidered ‘CESS BA. NO. 246.’ So that when put together you read,\n‘PRINCESS ROSALBA. NO. 246.’\n\nOn seeing this, the dear old woodman fell down on his knee, saying,\n‘O my Princess, O my gracious royal lady, O my rightful Queen of Crim\nTartary,--I hail thee--I acknowledge thee--I do thee homage!’ And in\ntoken of his fealty, he rubbed his venerable nose three times on the\nground, and put the Princess’s foot on his head.\n\n‘Why,’ said she, ‘my good woodman, you must be a nobleman of my royal\nfather’s Court!’ For in her lowly retreat, and under the name of\nBetsinda, HER MAJESTY, ROSALBA, Queen of Crim Tartary, had read of the\ncustoms of all foreign courts and nations.\n\n‘Marry, indeed, am I, my gracious liege--the poor Lord Spinachi\nonce--the humble woodman these fifteen years syne. Ever since the tyrant\nPadella (may ruin overtake the treacherous knave!) dismissed me from my\npost of First Lord.’\n\n‘First Lord of the Toothpick and Joint Keeper of the Snuffbox? I mind\nme! Thou heldest these posts under our royal Sire. They are restored to\nthee, Lord Spinachi! I make thee knight of the second class of our Order\nof the Pumpkin (the first class being reserved for crowned heads alone).\nRise, Marquis of Spinachi!’ And with indescribable majesty, the Queen,\nwho had no sword handy, waved the pewter spoon with which she had been\ntaking her bread-and-milk, over the bald head of the old nobleman, whose\ntears absolutely made a puddle on the ground, and whose dear children\nwent to bed that night Lords and Ladies Bartolomeo, Ubaldo, Catarina,\nand Ottavia degli Spinachi!\n\nThe acquaintance HER MAJESTY showed with the history, and noble families\nof her empire, was wonderful. ‘The House of Broccoli should remain\nfaithful to us,’ she said; ‘they were ever welcome at our Court. Have\nthe Articiocchi, as was their wont, turned to the Rising Sun? The family\nof Sauerkraut must sure be with us--they were ever welcome in the halls\nof King Cavolfiore.’ And so she went on enumerating quite a list of\nthe nobility and gentry of Crim Tartary, so admirably had Her Majesty\nprofited by her studies while in exile.\n\nThe old Marquis of Spinachi said he could answer for them all; that the\nwhole country groaned under Padella’s tyranny, and longed to return to\nits rightful sovereign; and late as it was, he sent his children, who\nknew the forest well, to summon this nobleman and that; and when his\neldest son, who had been rubbing the horse down and giving him his\nsupper, came into the house for his own, the Marquis told him to put his\nboots on, and a saddle on the mare, and ride hither and thither to such\nand such people.\n\n\nWhen the young man heard who his companion in the cart had been, he too\nknelt down and put her royal foot on his head; he too bedewed the ground\nwith his tears; he was frantically in love with her, as everybody now\nwas who saw her: so were the young Lords Bartolomeo and Ubaldo, who\npunched each other’s little heads out of jealousy; and so, when they\ncame from east and west at the summons of the Marquis degli Spinachi,\nwere the Crim Tartar Lords who still remained faithful to the House of\nCavolfiore. They were such very old gentlemen for the most part that Her\nMajesty never suspected their absurd passion, and went among them quite\nunaware of the havoc her beauty was causing, until an old blind Lord who\nhad joined her party told her what the truth was; after which, for fear\nof making the people too much in love with her, she always wore a veil.\nShe went about privately, from one nobleman’s castle to another; and\nthey visited among themselves again, and had meetings, and composed\nproclamations and counter-proclamations, and distributed all the best\nplaces of the kingdom amongst one another, and selected who of the\nopposition party should be executed when the Queen came to her own. And\nso in about a year they were ready to move.\n\nThe party of Fidelity was in truth composed of very feeble old fogies\nfor the most part; they went about the country waving their old swords\nand flags, and calling ‘God save the Queen!’ and King Padella happening\nto be absent upon an invasion, they had their own way for a little,\nand to be sure the people were very enthusiastic whenever they saw the\nQueen; otherwise the vulgar took matters very quietly, for they said,\nas far as they could recollect, they were pretty well as much taxed in\nCavolfiore’s time, as now in Padella’s.\n\n\n\n\nCHAPTER XIII. HOW QUEEN ROSALBA CAME TO THE CASTLE OF THE BOLD COUNT HOGGINARMO\n\nHer Majesty, having indeed nothing else to give, made all her followers\nKnights of the Pumpkin, and Marquises, Earls, and Baronets; and they had\na little court for her, and made her a little crown of gilt paper, and a\nrobe of cotton velvet; and they quarrelled about the places to be given\naway in her court, and about rank and precedence and dignities;--you\ncan’t think how they quarrelled! The poor Queen was very tired of her\nhonours before she had had them a month, and I dare say sighed sometimes\neven to be a lady’s-maid again. But we must all do our duty in our\nrespective stations, so the Queen resigned herself to perform hers.\n\nWe have said how it happened that none of the Usurper’s troops came out\nto oppose this Army of Fidelity: it pottered along as nimbly as the\ngout of the principal commanders allowed: it consisted of twice as many\nofficers as soldiers: and at length passed near the estates of one of\nthe most powerful noblemen of the country, who had not declared for the\nQueen, but of whom her party had hopes, as he was always quarrelling\nwith King Padella.\n\nWhen they came close to his park gates, this nobleman sent to say he\nwould wait upon Her Majesty: he was a most powerful warrior, and his\nname was Count Hogginarmo, whose helmet it took two strong negroes to\ncarry. He knelt down before her and said, ‘Madam and liege lady! it\nbecomes the great nobles of the Crimean realm to show every outward sign\nof respect to the wearer of the Crown, whoever that may be. We testify\nto our own nobility in acknowledging yours. The bold Hogginarmo bends\nthe knee to the first of the aristocracy of his country.’\n\nRosalba said, ‘The bold Count of Hogginarmo was uncommonly kind.’ But\nshe felt afraid of him, even while he was kneeling, and his eyes scowled\nat her from between his whiskers, which grew up to them.\n\n‘The first Count of the Empire, madam,’ he went on, ‘salutes the\nSovereign. The Prince addresses himself to the not more noble lady!\nMadam, my hand is free, and I offer it, and my heart and my sword to\nyour service! My three wives lie buried in my ancestral vaults. The\nthird perished but a year since; and this heart pines for a consort!\nDeign to be mine, and I swear to bring to your bridal table the head of\nKing Padella, the eyes and nose of his son Prince Bulbo, the right hand\nand ears of the usurping Sovereign of Paflagonia, which country shall\nthenceforth be an appanage to your--to OUR Crown! Say yes; Hogginarmo is\nnot accustomed to be denied. Indeed I cannot contemplate the possibility\nof a refusal: for frightful will be the result; dreadful the murders;\nfurious the devastations; horrible the tyranny; tremendous the tortures,\nmisery, taxation, which the people of this realm will endure, if\nHogginarmo’s wrath be aroused! I see consent in Your Majesty’s lovely\neyes--their glances fill my soul with rapture!’\n\n‘Oh, sir!’ Rosalba said, withdrawing her hand in great fright. ‘Your\nLordship is exceedingly kind; but I am sorry to tell you that I have a\nprior attachment to a young gentleman by the name of--Prince Giglio--and\nnever--never can marry any one but him.’\n\nWho can describe Hogginarmo’s wrath at this remark? Rising up from the\nground, he ground his teeth so that fire flashed out of his mouth, from\nwhich at the same time issued remarks and language, so LOUD,\nVIOLENT, AND IMPROPER, that this pen shall never repeat them!\n‘R-r-r-r-rr--Rejected! Fiends and perdition! The bold Hogginarmo\nrejected! All the world shall hear of my rage; and you, madam, you above\nall shall rue it!’ And kicking the two negroes before him, he rushed\naway, his whiskers streaming in the wind.\n\nHer Majesty’s Privy Council was in a dreadful panic when they saw\nHogginarmo issue from the royal presence in such a towering rage, making\nfootballs of the poor negroes--a panic which the events justified. They\nmarched off from Hogginarmo’s park very crestfallen; and in another\nhalf-hour they were met by that rapacious chieftain with a few of his\nfollowers, who cut, slashed, charged, whacked, banged, and pommelled\namongst them, took the Queen prisoner, and drove the Army of Fidelity to\nI don’t know where.\n\nPoor Queen! Hogginarmo, her conqueror, would not condescend to see her.\n‘Get a horse-van!’ he said to his grooms, ‘clap the hussy into it, and\nsend her, with my compliments, to His Majesty King Padella.’\n\nAlong with his lovely prisoner, Hogginarmo sent a letter full of servile\ncompliments and loathsome flatteries to King Padella, for whose life,\nand that of his royal family, the HYPOCRITICAL HUMBUG pretended to offer\nthe most fulsome prayers. And Hogginarmo promised speedily to pay his\nhumble homage at his august master’s throne, of which he begged leave to\nbe counted the most loyal and constant defender. Such a WARY old BIRD\nas King Padella was not to be caught by Master Hogginarmo’s CHAFF and we\nshall hear presently how the tyrant treated his upstart vassal. No, no;\ndepend on’s, two such rogues do not trust one another.\n\nSo this poor Queen was laid in the straw like Margery Daw, and driven\nalong in the dark ever so many miles to the Court, where King Padella\nhad now arrived, having vanquished all his enemies, murdered most of\nthem, and brought some of the richest into captivity with him for the\npurpose of torturing them and finding out where they had hidden their\nmoney.\n\nRosalba heard their shrieks and groans in the dungeon in which she was\nthrust; a most awful black hole, full of bats, rats, mice, toads, frogs,\nmosquitoes, bugs, fleas, serpents, and every kind of horror. No light\nwas let into it, otherwise the gaolers might have seen her and fallen in\nlove with her, as an owl that lived up in the roof of the tower did, and\na cat, you know, who can see in the dark, and having set its green eyes\non Rosalba, never would be got to go back to the turnkey’s wife to whom\nit belonged. And the toads in the dungeon came and kissed her feet,\nand the vipers wound round her neck and arms, and never hurt her, so\ncharming was this poor Princess in the midst of her misfortunes.\n\nAt last, after she had been kept in this place EVER SO LONG, the door of\nthe dungeon opened, and the terrible KING PADELLA came in.\n\nBut what he said and did must be reserved for another chapter, as we\nmust now back to Prince Giglio.\n\n\n\n\nCHAPTER XIV. WHAT BECAME OF GIGLIO\n\nThe idea of marrying such an old creature as Gruffanuff frightened\nPrince Giglio so, that he ran up to his room, packed his trunks,\nfetched in a couple of porters, and was off to the diligence office in a\ntwinkling.\n\nIt was well that he was so quick in his operations, did not dawdle over\nhis luggage, and took the early coach, for as soon as the mistake about\nPrince Bulbo was found out, that cruel Glumboso sent up a couple of\npolicemen to Prince Giglio’s room, with orders that he should be carried\nto Newgate, and his head taken off before twelve o’clock. But the coach\nwas out of the Paflagonian dominions before two o’clock; and I dare say\nthe express that was sent after Prince Giglio did not ride very quick,\nfor many people in Paflagonia had a regard for Giglio, as the son of\ntheir old sovereign; a Prince who, with all his weaknesses, was very\nmuch better than his brother, the usurping, lazy, careless, passionate,\ntyrannical, reigning monarch. That Prince busied himself with the balls,\nfetes, masquerades, hunting-parties, and so forth, which he thought\nproper to give on occasion of his daughter’s marriage to Prince Bulbo;\nand let us trust was not sorry in his own heart that his brother’s son\nhad escaped the scaffold.\n\nIt was very cold weather, and the snow was on the ground, and\nGiglio, who gave his name as simple Mr. Giles, was very glad to get a\ncomfortable place in the coupe of the diligence, where he sat with the\nconductor and another gentleman. At the first stage from Blombodinga,\nas they stopped to change horses, there came up to the diligence a very\nordinary, vulgar-looking woman, with a bag under her arm, who asked\nfor a place. All the inside places were taken, and the young woman was\ninformed that if she wished to travel, she must go upon the roof; and\nthe passenger inside with Giglio (a rude person, I should think), put\nhis head out of the window, and said, ‘Nice weather for travelling\noutside! I wish you a pleasant journey, my dear.’ The poor woman coughed\nvery much, and Giglio pitied her. ‘I will give up my place to her,’\nsays he, ‘rather than she should travel in the cold air with that horrid\ncough.’ On which the vulgar traveller said, ‘YOU’D keep her warm, I am\nsure, if it’s a MUFF she wants.’ On which Giglio pulled his nose, boxed\nhis ears, hit him in the eye, and gave this vulgar person a warning\nnever to call him MUFF again.\n\nThen he sprang up gaily on to the roof of the diligence, and made\nhimself very comfortable in the straw.\n\nThe vulgar traveller got down only at the next station, and Giglio took\nhis place again, and talked to the person next to him. She appeared\nto be a most agreeable, well-informed, and entertaining female. They\ntravelled together till night, and she gave Giglio all sorts of things\nout of the bag which she carried, and which indeed seemed to contain the\nmost wonderful collection of articles. He was thirsty--out there came a\npint bottle of Bass’s pale ale, and a silver mug! Hungry--she took out\na cold fowl, some slices of ham, bread, salt, and a most delicious piece\nof cold plum-pudding, and a little glass of brandy afterwards.\n\nAs they travelled, this plain-looking, queer woman talked to Giglio on\na variety of subjects, in which the poor Prince showed his ignorance as\nmuch as she did her capacity. He owned, with many blushes, how ignorant\nhe was; on which the lady said, ‘My dear Gigl--my good Mr. Giles, you\nare a young man, and have plenty of time before you. You have nothing to\ndo but to improve yourself. Who knows but that you may find use for your\nknowledge some day? When--when you may be wanted at home, as some people\nmay be.’\n\n‘Good heavens, madam!’ says he, ‘do you know me?’\n\n‘I know a number of funny things,’ says the lady. ‘I have been at some\npeople’s christenings, and turned away from other folks’ doors. I have\nseen some people spoilt by good fortune, and others, as I hope, improved\nby hardship. I advise you to stay at the town where the coach stops for\nthe night. Stay there and study, and remember your old friend to whom\nyou were kind.’\n\n‘And who is my old friend?’ asked Giglio.\n\n‘When you want anything,’ says the lady, ‘look in this bag, which I\nleave to you as a present, and be grateful to--’\n\n‘To whom, madam?’ says he.\n\n‘To the Fairy Blackstick,’ says the lady, flying out of the window. And\nthen Giglio asked the conductor if he knew where the lady was?\n\n‘What lady?’ says the man; ‘there has been no lady in this coach, except\nthe old woman, who got out at the last stage.’ And Giglio thought he\nhad been dreaming. But there was the bag which Blackstick had given him\nlying on his lap; and when he came to the town he took it in his hand\nand went into the inn.\n\nThey gave him a very bad bedroom, and Giglio, when he woke in the\nmorning, fancying himself in the Royal Palace at home, called, ‘John,\nCharles, Thomas! My chocolate--my dressing-gown--my slippers’; but\nnobody came. There was no bell, so he went and bawled out for water on\nthe top of the stairs.\n\nThe landlady came up.\n\n‘What are you a hollering and a bellaring for here, young man?’ says\nshe.\n\n‘There’s no warm water--no servants; my boots are not even cleaned.’\n\n‘He, he! Clean ‘em yourself,’ says the landlady. ‘You young students\ngive yourselves pretty airs. I never heard such impudence.’\n\n‘I’ll quit the house this instant,’ says Giglio.\n\n‘The sooner the better, young man. Pay your bill and be off. All my\nrooms is wanted for gentlefolks, and not for such as you.’\n\n‘You may well keep the Bear Inn,’ said Giglio. ‘You should have yourself\npainted as the sign.’\n\nThe landlady of the Bear went away GROWLING. And Giglio returned to his\nroom, where the first thing he saw was the fairy bag lying on the table,\nwhich seemed to give a little hop as he came in. ‘I hope it has some\nbreakfast in it,’ says Giglio, ‘for I have only a very little\nmoney left.’ But on opening the bag, what do you think was there? A\nblacking-brush and a pot of Warren’s jet, and on the pot was written:\n\n     Poor young men their boots must black:\n     Use me and cork me and put me back.\n\nSo Giglio laughed and blacked his boots, and put back the brush and the\nbottle into the bag.\n\nWhen he had done dressing himself, the bag gave another little hop, and\nhe went to it and took out--\n\n1. A tablecloth and a napkin.\n\n2. A sugar-basin full of the best loaf-sugar.\n\n4, 6, 8, 10. Two forks, two teaspoons, two knives, and a pair of\nsugar-tongs, and a butter-knife all marked G.\n\n11, 12, 13. A teacup, saucer, and slop-basin.\n\n14. A jug full of delicious cream.\n\n15. A canister with black tea and green.\n\n16. A large tea-urn and boiling water.\n\n17. A saucepan, containing three eggs nicely done.\n\n18. A quarter of a pound of best Epping butter.\n\n19. A brown loaf.\n\nAnd if he hadn’t enough now for a good breakfast, I should like to know\nwho ever had one?\n\nGiglio, having had his breakfast, popped all the things back into\nthe bag, and went out looking for lodgings. I forgot to say that this\ncelebrated university town was called Bosforo.\n\nHe took a modest lodging opposite the Schools, paid his bill at the\ninn, and went to his apartment with his trunk, carpet-bag, and not\nforgetting, we may be sure, his OTHER bag.\n\nWhen he opened his trunk, which the day before he had filled with his\nbest clothes, he found it contained only books. And in the first of them\nwhich he opened there was written--\n\nClothes for the back, books for the head: Read and remember them when\nthey are read.\n\nAnd in his bag, when Giglio looked in it, he found a student’s cap and\ngown, a writing-book full of paper, an inkstand, pens, and a Johnson’s\ndictionary, which was very useful to him, as his spelling had been sadly\nneglected.\n\nSo he sat down and worked away, very, very hard for a whole year,\nduring which ‘Mr. Giles’ was quite an example to all the students in the\nUniversity of Bosforo. He never got into any riots or disturbances. The\nProfessors all spoke well of him, and the students liked him too; so\nthat, when at examination, he took all the prizes, viz.\n\n     {The Spelling Prize  {The French Prize\n     {The Writing Prize   {The Arithmetic Prize\n     {The History Prize   {The Latin Prize\n     {The Catechism Prize  {The Good Conduct Prize,\n\nall his fellow-students said, ‘Hurrah! Hurray for Giles! Giles is\nthe boy--the student’s joy! Hurray for Giles!’ And he brought quite a\nquantity of medals, crowns, books, and tokens of distinction home to his\nlodgings.\n\nOne day after the Examinations, as he was diverting himself at a\ncoffee-house with two friends--(Did I tell you that in his bag, every\nSaturday night, he found just enough to pay his bills, with a guinea\nover, for pocket-money? Didn’t I tell you? Well, he did, as sure as twice\ntwenty makes forty-five)--he chanced to look in the Bosforo Chronicle,\nand read off, quite easily (for he could spell, read, and write the\nlongest words now), the following:--\n\n‘ROMANTIC CIRCUMSTANCE.--One of the most extraordinary adventures that\nwe have ever heard has set the neighbouring country of Crim Tartary in a\nstate of great excitement.\n\n‘It will be remembered that when the present revered sovereign of Crim\nTartary, His Majesty King PADELLA, took possession of the throne, after\nhaving vanquished, in the terrific battle of Blunderbusco, the late\nKing CAVOLFIORE, that Prince’s only child, the Princess Rosalba, was not\nfound in the royal palace, of which King Padella took possession, and,\nit was said, had strayed into the forest (being abandoned by all her\nattendants) where she had been eaten up by those ferocious lions, the\nlast pair of which were captured some time since, and brought to the\nTower, after killing several hundred persons.\n\n‘His Majesty King Padella, who has the kindest heart in the world,\nwas grieved at the accident which had occurred to the harmless little\nPrincess, for whom His Majesty’s known benevolence would certainly have\nprovided a fitting establishment. But her death seemed to be certain.\nThe mangled remains of a cloak, and a little shoe, were found in the\nforest, during a hunting-party, in which the intrepid sovereign of\nCrim Tartary slew two of the lions’ cubs with his own spear. And these\ninteresting relics of an innocent little creature were carried home\nand kept by their finder, the Baron Spinachi, formerly an officer in\nCavolfiore’s household. The Baron was disgraced in consequence of his\nknown legitimist opinions, and has lived for some time in the humble\ncapacity of a wood-cutter, in a forest on the outskirts of the Kingdom\nof Crim Tartary.\n\n‘Last Tuesday week Baron Spinachi and a number of gentlemen, attached\nto the former dynasty, appeared in arms, crying, “God save Rosalba,\nthe first Queen of Crim Tartary!” and surrounding a lady whom report\ndescribes as “BEAUTIFUL EXCEEDINGLY.” Her history MAY be authentic, is\ncertainly most romantic.\n\n‘The personage calling herself Rosalba states that she was brought out\nof the forest, fifteen years since, by a lady in a car drawn by dragons\n(this account is certainly IMPROBABLE), that she was left in the Palace\nGarden of Blombodinga, where Her Royal Highness the Princess Angelica,\nnow married to His Royal Highness Bulbo, Crown Prince of Crim Tartary,\nfound the child, and, with THAT ELEGANT BENEVOLENCE which has always\ndistinguished the heiress of the throne of Paflagonia, gave the little\noutcast a SHELTER AND A HOME! Her parentage not being known, and her\ngarb very humble, the foundling was educated in the Palace in a menial\ncapacity, under the name of BETSINDA.\n\n‘She did not give satisfaction, and was dismissed, carrying with her,\ncertainly, part of a mantle and a shoe, which she had on when first\nfound. According to her statement she quitted Blombodinga about a year\nago, since which time she has been with the Spinachi family. On the\nvery same morning the Prince Giglio, nephew to the King of Paflagonia,\na young Prince whose character for TALENT and ORDER were, to say truth,\nnone of the HIGHEST, also quitted Blombodinga, and has not been since\nheard of!’\n\n‘What an extraordinary story!’ said Smith and Jones, two young students,\nGiglio’s especial friends.\n\n‘Ha! what is this?’ Giglio went on, reading--\n\n‘SECOND EDITION, EXPRESS.--We hear that the troop under Baron Spinachi\nhas been surrounded, and utterly routed, by General Count Hogginarmo,\nand the soidisant Princess is sent a prisoner to the capital.\n\n‘UNIVERSITY NEWS.--Yesterday, at the Schools, the distinguished young\nstudent, Mr. Giles, read a Latin oration, and was complimented by\nthe Chancellor of Bosforo, Dr. Prugnaro, with the highest University\nhonour--the wooden spoon.’\n\n‘Never mind that stuff,’ says GILES, greatly disturbed. ‘Come home\nwith me, my friends. Gallant Smith! intrepid Jones! friends of my\nstudies--partakers of my academic toils--I have that to tell which shall\nastonish your honest minds.’\n\n‘Go it, old boy!’ cries the impetuous Smith.\n\n‘Talk away, my buck!’ says Jones, a lively fellow.\n\nWith an air of indescribable dignity, Giglio checked their natural, but\nno more seemly, familiarity. ‘Jones, Smith, my good friends,’ said the\nPRINCE, ‘disguise is henceforth useless; I am no more the humble student\nGiles, I am the descendant of a royal line.’\n\n‘Atavis edite regibus, I know, old co--’ cried Jones. He was going to\nsay old cock, but a flash from THE ROYAL EYE again awed him.\n\n‘Friends,’ continued the Prince, ‘I am that Giglio, I am, in fact,\nPaflagonia. Rise, Smith, and kneel not in the public street. Jones, thou\ntrue heart! My faithless uncle, when I was a baby, filched from me that\nbrave crown my father left me, bred me, all young and careless of my\nrights, like unto hapless Hamlet, Prince of Denmark; and had I any\nthoughts about my wrongs, soothed me with promises of near redress. I\nshould espouse his daughter, young Angelica; we two indeed should reign\nin Paflagonia. His words were false--false as Angelica’s heart!--false\nas Angelica’s hair, colour, front teeth! She looked with her skew eyes\nupon young Bulbo, Crim Tartary’s stupid heir, and she preferred him.’\nTwas then I turned my eyes upon Betsinda--Rosalba, as she now is. And\nI saw in her the blushing sum of all perfection; the pink of maiden\nmodesty; the nymph that my fond heart had ever woo’d in dreams,’ etc.\netc.\n\n(I don’t give this speech, which was very fine, but very long; and\nthough Smith and Jones knew nothing about the circumstances, my dear\nreader does, so I go on.)\n\nThe Prince and his young friends hastened home to his apartment,\nhighly excited by the intelligence, as no doubt by the ROYAL NARRATOR’S\nadmirable manner of recounting it, and they ran up to his room where he\nhad worked so hard at his books.\n\nOn his writing-table was his bag, grown so long that the Prince could\nnot help remarking it. He went to it, opened it, and what do you think\nhe found in it?\n\nA splendid long, gold-handled, red-velvet-scabbarded, cut-and-thrust\nsword, and on the sheath was embroidered ‘ROSALBA FOR EVER!’\n\nHe drew out the sword, which flashed and illuminated the whole room, and\ncalled out ‘Rosalba for ever!’ Smith and Jones following him, but quite\nrespectfully this time, and taking the time from His Royal Highness.\n\nAnd now his trunk opened with a sudden pony, and out there came three\nostrich feathers in a gold crown, surrounding a beautiful shining steel\nhelmet, a cuirass, a pair of spurs, finally a complete suit of armour.\n\nThe books on Giglio’s shelves were all gone. Where there had been some\ngreat dictionaries, Giglio’s friends found two pairs of jack-boots\nlabelled, ‘Lieutenant Smith,’ ‘--Jones, Esq.,’ which fitted them to a\nnicety. Besides, there were helmets, back and breast plates, swords,\netc., just like in Mr. G. P. R. James’s novels; and that evening three\ncavaliers might have been seen issuing from the gates of Bosforo, in\nwhom the porters, proctors, etc., never thought of recognising the young\nPrince and his friends.\n\nThey got horses at a livery stable-keeper’s, and never drew bridle\nuntil they reached the last town on the frontier before you come to Crim\nTartary. Here, as their animals were tired, and the cavaliers hungry,\nthey stopped and refreshed at an hostel. I could make a chapter of this\nif I were like some writers, but I like to cram my measure tight down,\nyou see, and give you a great deal for your money, and, in a word, they\nhad some bread and cheese and ale upstairs on the balcony of the inn.\nAs they were drinking, drums and trumpets sounded nearer and nearer,\nthe marketplace was filled with soldiers, and His Royal Highness looking\nforth, recognised the Paflagonian banners, and the Paflagonian national\nair which the bands were playing.\n\nThe troops all made for the tavern at once, and as they came up Giglio\nexclaimed, on beholding their leader, ‘Whom do I see? Yes! No! It is,\nit is! Phoo! No, it can’t be! Yes! It is my friend, my gallant faithful\nveteran, Captain Hedzoff! Ho! Hedzoff! Knowest thou not thy Prince, thy\nGiglio? Good Corporal, methinks we once were friends. Ha, Sergeant, an’\nmy memory serves me right, we have had many a bout at singlestick.’\n\n‘I’ faith, we have, a many, good my Lord,’ says the Sergeant.\n\n‘Tell me, what means this mighty armament,’ continued His Royal Highness\nfrom the balcony, ‘and whither march my Paflagonians?’\n\nHedzoff’s head fell. ‘My Lord,’ he said, ‘we march as the allies of\ngreat Padella, Crim Tartary’s monarch.’\n\n‘Crim Tartary’s usurper, gallant Hedzoff! Crim Tartary’s grim tyrant,\nhonest Hedzoff!’ said the Prince, on the balcony, quite sarcastically.\n\n‘A soldier, Prince, must needs obey his orders: mine are to help His\nMajesty Padella. And also (though alack that I should say it!) to seize\nwherever I should light upon him.’\n\n‘First catch your hare! ha, Hedzoff!’ exclaimed His Royal Highness.\n\n‘--On the body of GIGLIO, whilome Prince of Paflagonia’ Hedzoff went on,\nwith indescribable emotion. ‘My Prince, give up your sword without ado.\nLook! we are thirty thousand men to one!’\n\n‘Give up my sword! Giglio give up his sword!’ cried the Prince; and\nstepping well forward on to the balcony, the royal youth, WITHOUT\nPREPARATION, delivered a speech so magnificent, that no report can do\njustice to it. It was all in blank verse (in which, from this time, he\ninvariably spoke, as more becoming his majestic station). It lasted for\nthree days and three nights, during which not a single person who heard\nhim was tired, or remarked the difference between daylight and dark.\nThe soldiers only cheering tremendously, when occasionally, once in nine\nhours, the Prince paused to suck an orange, which Jones took out of the\nbag. He explained, in terms which we say we shall not attempt to convey,\nthe whole history of the previous transaction, and his determination not\nonly not to give up his sword, but to assume his rightful crown; and\nat the end of this extraordinary, this truly GIGANTIC effort, Captain\nHedzoff flung up his helmet, and cried, ‘Hurray! Hurray! Long live King\nGiglio!’\n\nSuch were the consequences of having employed his time well at College!\n\nWhen the excitement had ceased, beer was ordered out for the army, and\ntheir Sovereign himself did not disdain a little! And now it was with\nsome alarm that Captain Hedzoff told him his division was only the\nadvanced guard of the Paflagonian contingent, hastening to King\nPadella’s aid; the main force being a day’s march in the rear under His\nRoyal Highness Prince Bulbo.\n\n‘We will wait here, good friend, to beat the Prince,’ His Majesty said,\n‘and THEN will make his royal father wince.’\n\n\n\n\nCHAPTER XV. WE RETURN TO ROSALBA\n\nKing Padella made very similar proposals to Rosalba to those which she\nhad received from the various princes who, as we have seen, had fallen\nin love with her. His Majesty was a widower, and offered to marry his\nfair captive that instant, but she declined his invitation in her usual\npolite gentle manner, stating that Prince Giglio was her love, and\nthat any other union was out of the question. Having tried tears and\nsupplications in vain, this violent-tempered monarch menaced her with\nthreats and tortures; but she declared she would rather suffer all these\nthan accept the hand of her father’s murderer, who left her finally,\nuttering the most awful imprecations, and bidding her prepare for death\non the following morning.\n\nAll night long the King spent in advising how he should get rid of this\nobdurate young creature. Cutting off her head was much too easy a death\nfor her; hanging was so common in His Majesty’s dominions that it no\nlonger afforded him any sport; finally, he bethought himself of a pair\nof fierce lions which had lately been sent to him as presents, and he\ndetermined, with these ferocious brutes, to hunt poor Rosalba down.\nAdjoining his castle was an amphitheatre where the Prince indulged in\nbull-baiting, rat-hunting, and other ferocious sports. The two lions\nwere kept in a cage under this place; their roaring might be heard over\nthe whole city, the inhabitants of which, I am sorry to say, thronged in\nnumbers to see a poor young lady gobbled up by two wild beasts.\n\nThe King took his place in the royal box, having the officers of his\nCourt around and the Count Hogginarmo by his side, upon whom His Majesty\nwas observed to look very fiercely; the fact is, royal spies had told\nthe monarch of Hogginarmo’s behaviour, his proposals to Rosalba, and his\noffer to fight for the crown. Black as thunder looked King Padella at\nthis proud noble, as they sat in the front seats of the theatre waiting\nto see the tragedy whereof poor Rosalba was to be the heroine.\n\nAt length that Princess was brought out in her nightgown, with all her\nbeautiful hair falling down her back, and looking so pretty that even\nthe beef-eaters and keepers of the wild animals wept plentifully at\nseeing her. And she walked with her poor little feet (only luckily the\narena was covered with sawdust), and went and leaned up against a great\nstone in the centre of the amphitheatre, round which the Court and the\npeople were seated in boxes, with bars before them, for fear of\nthe great, fierce, red-maned, black-throated, long-tailed, roaring,\nbellowing, rushing lions. And now the gates were opened, and with a\nwurrawarrurawarar two great lean, hungry, roaring lions rushed out of\ntheir den, where they had been kept for three weeks on nothing but a\nlittle toast-and-water, and dashed straight up to the stone where poor\nRosalba was waiting. Commend her to your patron saints, all you kind\npeople, for she is in a dreadful state!\n\nThere was a hum and a buzz all through the circus, and the fierce King\nPadella even felt a little compassion. But Count Hogginarmo, seated by\nHis Majesty, roared out ‘Hurray! Now for it! Soo-soo-soo!’ that nobleman\nbeing uncommonly angry still at Rosalba’s refusal of him.\n\nBut O strange event! O remarkable circumstance! O extraordinary\ncoincidence, which I am sure none of you could BY ANY POSSIBILITY have\ndivined! When the lions came to Rosalba, instead of devouring her with\ntheir great teeth, it was with kisses they gobbled her up! They licked\nher pretty feet, they nuzzled their noses in her lap, they moo’d, they\nseemed to say, ‘Dear, dear sister don’t you recollect your brothers in\nthe forest?’ And she put her pretty white arms round their tawny necks,\nand kissed them.\n\nKing Padella was immensely astonished. The Count Hogginarmo was\nextremely disgusted. ‘Pooh!’ the Count cried. ‘Gammon!’ exclaimed his\nLordship.’ These lions are tame beasts come from Wombwell’s or Astley’s.\nIt is a shame to put people off in this way. I believe they are little\nboys dressed up in door-mats. They are no lions at all.’\n\n‘Ha!’ said the King, ‘you dare to say “gammon” to your Sovereign, do\nyou? These lions are no lions at all, aren’t they? Ho! my beef-eaters!\nHo! my bodyguard! Take this Count Hogginarmo and fling him into the\ncircus! Give him a sword and buckler, let him keep his armour on, and\nhis weather-eye out, and fight these lions.’\n\nThe haughty Hogginarmo laid down his opera-glass, and looked scowling\nround at the King and his attendants. ‘Touch me not, dogs!’ he said,\n‘or by St. Nicholas the Elder, I will gore you! Your Majesty thinks\nHogginarmo is afraid? No, not of a hundred thousand lions! Follow me\ndown into the circus, King Padella, and match thyself against one of\nyon brutes. Thou darest not. Let them both come on, then!’ And opening a\ngrating of the box, he jumped lightly down into the circus.\n\n              WURRA WURRA WURRA WUR-AW-AW-AW!!!\n                  In about two minutes\n                The Count Hogginarmo was\n                     GOBBLED UP\n                         by\n                     those lions,\n                 bones, boots, and all,\n                        and\n                    There was an\n                     End of him.\n\nAt this, the King said, ‘Serve him right, the rebellious ruffian! And\nnow, as those lions won’t eat that young woman--’\n\n‘Let her off!--let her off!’ cried the crowd.\n\n‘NO!’ roared the King. ‘Let the beef-eaters go down and chop her into\nsmall pieces. If the lions defend her, let the archers shoot them to\ndeath. That hussy shall die in tortures!’\n\n‘A-a-ah!’ cried the crowd. ‘Shame! shame!’\n\n‘Who dares cry out shame?’ cried the furious potentate (so little can\ntyrants command their passions). ‘Fling any scoundrel who says a word\ndown among the lions!’\n\nI warrant you there was a dead silence then, which was broken by a Pang\narang pang pangkarangpang, and a Knight and a Herald rode in at the\nfurther end of the circus: the Knight, in full armour, with his vizor\nup, and bearing a letter on the point of his lance.\n\n‘Ha!’ exclaimed the King, ‘by my fey, ‘tis Elephant and Castle,\npursuivant of my brother of Paflagonia; and the Knight, an’ my memory\nserves me, is the gallant Captain Hedzoff! What news from Paflagonia,\ngallant Hedzoff? Elephant and Castle, beshrew me, thy trumpeting must\nhave made thee thirsty. What will my trusty herald like to drink?’\n\n‘Bespeaking first safe conduct from your Lordship,’ said Captain\nHedzoff, ‘before we take a drink of anything, permit us to deliver our\nKing’s message.’\n\n‘My Lordship, ha!’ said Crim Tartary, frowning terrifically. ‘That title\nsoundeth strange in the anointed ears of a crowned King. Straightway\nspeak out your message, Knight and Herald!’\n\nReining up his charger in a most elegant manner close under the King’s\nbalcony, Hedzoff turned to the Herald, and bade him begin.\n\nElephant and Castle, dropping his trumpet over his shoulder, took a\nlarge sheet of paper out of his hat, and began to read:--\n\n‘O Yes! O Yes! O Yes! Know all men by these presents, that we, Giglio,\nKing of Paflagonia, Grand Duke of Cappadocia, Sovereign Prince of Turkey\nand the Sausage Islands, having assumed our rightful throne and title,\nlong time falsely borne by our usurping Uncle, styling himself King of\nPaflagonia--’\n\n‘Ha!’ growled Padella.\n\n‘Hereby summon the false traitor, Padella, calling himself King of Crim\nTartary--’\n\nThe King’s curses were dreadful. ‘Go on, Elephant and Castle!’ said the\nintrepid Hedzoff.\n\n‘--To release from cowardly imprisonment his liege lady and rightful\nSovereign, ROSALBA, Queen of Crim Tartary, and restore her to her royal\nthrone: in default of which, I, Giglio, proclaim the said Padella sneak,\ntraitor, humbug, usurper, and coward. I challenge him to meet me, with\nfists or with pistols, with battle-axe or sword, with blunderbuss or\nsinglestick, alone or at the head of his army, on foot or on horseback;\nand will prove my words upon his wicked ugly body!’\n\n‘God save the King!’ said Captain Hedzoff, executing a demivolte, two\nsemilunes, and three caracols.\n\n‘Is that all?’ said Padella, with the terrific calm of concentrated\nfury.\n\n‘That, sir, is all my royal master’s message. Here is His Majesty’s\nletter in autograph, and here is his glove, and if any gentleman of\nCrim Tartary chooses to find fault with His Majesty’s expressions, I,\nTuffskin Hedzoff, Captain of the Guard, am very much at his service,’\nand he waved his lance, and looked at the assembly all round.\n\n‘And what says my good brother of Paflagonia, my dear son’s\nfather-in-law, to this rubbish?’ asked the King.\n\n‘The King’s uncle hath been deprived of the crown he unjustly wore,’\nsaid Hedzoff gravely. ‘He and his axminister, Glumboso, are now in\nprison waiting the sentence of my royal master. After the battle of\nBombardaro--’\n\n‘Of what?’ asked the surprised Padella.\n\n‘Of Bombardaro, where my liege, his present Majesty, would have\nperformed prodigies of velour, but that the whole of his uncle’s army\ncame over to our side, with the exception of Prince Bulbo.’\n\n‘Ah! my boy, my boy, my Bulbo was no traitor!’ cried Padella.\n\n‘Prince Bulbo, far from coming over to us, ran away, sir; but I caught\nhim. The Prince is a prisoner in our army, and the most terrific\ntortures await him if a hair of the Princess Rosalba’s head is injured.’\n\n‘Do they?’ exclaimed the furious Padella, who was now perfectly LIVID\nwith rage.’ Do they indeed? So much the worse for Bulbo. I’ve twenty\nsons as lovely each as Bulbo. Not one but is as fit to reign as Bulbo.\nWhip, whack, flog, starve, rack, punish, torture Bulbo--break all his\nbones--roast him or flay him alive--pull all his pretty teeth out one by\none! But justly dear as Bulbo is to me,--joy of my eyes, fond treasure\nof my soul!--Ha, ha, ha, ha! revenge is dearer still. Ho! tortures,\nrack-men, executioners--light up the fires and make the pincers hot! get\nlots of boiling lead!--Bring out ROSALBA!’\n\n\n\n\nCHAPTER XVI. HOW HEDZOFF RODE BACK AGAIN TO KING GIGLIO\n\nCaptain Hedzoff rode away when King Padella uttered this cruel command,\nhaving done his duty in delivering the message with which his royal\nmaster had entrusted him. Of course he was very sorry for Rosalba, but\nwhat could he do?\n\nSo he returned to King Giglio’s camp, and found the young monarch in a\ndisturbed state of mind, smoking cigars in the royal tent. His\nMajesty’s agitation was not appeased by the news that was brought by\nhis ambassador. ‘The brutal ruthless ruffian royal wretch!’ Giglio\nexclaimed. ‘As England’s poesy has well remarked, “The man that lays\nhis hand upon a woman, save in the way of kindness, is a villain.” Ha,\nHedzoff!’\n\n‘That he is, your Majesty,’ said the attendant.\n\n‘And didst thou see her flung into the oil? and didn’t the soothing\noil--the emollient oil, refuse to boil, good Hedzoff--and to spoil the\nfairest lady ever eyes did look on?’\n\n‘Faith, good my liege, I had no heart to look and see a beauteous lady\nboiling down; I took your royal message to Padella, and bore his back\nto you. I told him you would hold Prince Bulbo answerable. He only said\nthat he had twenty sons as good as Bulbo, and forthwith he bade the\nruthless executioners proceed.’\n\n‘O cruel father--O unhappy son!’ cried the King. ‘Go, some of you, and\nbring Prince Bulbo hither.’\n\nBulbo was brought in chains, looking very uncomfortable. Though a\nprisoner, he had been tolerably happy, perhaps because his mind was at\nrest, and all the fighting was over, and he was playing at marbles with\nhis guards when the King sent for him.\n\n‘Oh, my poor Bulbo,’ said His Majesty, with looks of infinite\ncompassion, ‘hast thou heard the news?’ (for you see Giglio wanted to\nbreak the thing gently to the Prince), ‘thy brutal father has condemned\nRosalba--p-p-p-ut her to death, P-p-p-prince Bulbo!’\n\n‘What, killed Betsinda! Boo-hoo-hoo,’ cried out Bulbo. ‘Betsinda! pretty\nBetsinda! dear Betsinda! She was the dearest little girl in the world.\nI love her better twenty thousand times even than Angelica,’ and he went\non expressing his grief in so hearty and unaffected a manner that the\nKing was quite touched by it, and said, shaking Bulbo’s hand, that he\nwished he had known Bulbo sooner.\n\nBulbo, quite unconsciously, and meaning for the best, offered to come\nand sit with His Majesty, and smoke a cigar with him, and console him.\nThe ROYAL KINDNESS supplied Bulbo with a cigar; he had not had one, he\nsaid, since he was taken prisoner.\n\nAnd now think what must have been the feelings of the most MERCIFUL OF\nMONARCHS, when he informed his prisoner that, in consequence of King\nPadella’s cruel and DASTARDLY BEHAVIOUR to Rosalba, Prince Bulbo must\ninstantly be executed! The noble Giglio could not restrain his tears,\nnor could the Grenadiers, nor the officers, nor could Bulbo himself,\nwhen the matter was explained to him, and he was brought to understand\nthat His Majesty’s promise, of course, was ABOVE EVERY THING, and Bulbo\nmust submit. So poor Bulbo was led out, Hedzoff trying to console him,\nby pointing out that if he had won the battle of Bombardaro, he might\nhave hanged Prince Giglio. ‘Yes! But that is no comfort to me now!’ said\npoor Bulbo; nor indeed was it, poor fellow!\n\nHe was told the business would be done the next morning at eight, and\nwas taken back to his dungeon, where every attention was paid to him.\nThe gaoler’s wife sent him tea, and the turnkey’s daughter begged him\nto write his name in her album, where a many gentlemen had written it on\nlike occasions! ‘Bother your album!’ says Bulbo. The Undertaker came and\nmeasured him for the handsomest coffin which money could buy--even this\ndidn’t console Bulbo. The Cook brought him dishes which he once used to\nlike; but he wouldn’t touch them: he sat down and began writing an adieu\nto Angelica, as the clock kept always ticking, and the hands drawing\nnearer to next morning. The Barber came in at night, and offered to\nshave him for the next day. Prince Bulbo kicked him away, and went\non writing a few words to Princess Angelica, as the clock kept always\nticking, and the hands hopping nearer and nearer to next morning. He got\nup on the top of a hatbox, on the top of a chair, on the top of his bed,\non the top of his table, and looked out to see whether he might escape\nas the clock kept always ticking and the hands drawing nearer, and\nnearer, and nearer.\n\nBut looking out of the window was one thing, and jumping another: and\nthe town clock struck seven. So he got into bed for a little sleep, but\nthe gaoler came and woke him, and said, ‘Git up, your Royal Ighness, if\nyou please, it’s TEN MINUTES TO EIGHT!’\n\nSo poor Bulbo got up: he had gone to bed in his clothes (the lazy boy),\nand he shook himself, and said he didn’t mind about dressing, or having\nany breakfast, thank you; and he saw the soldiers who had come for him.\n‘Lead on!’ he said; and they led the way, deeply affected; and they came\ninto the courtyard, and out into the square, and there was King Giglio\ncome to take leave of him, and His Majesty most kindly shook hands with\nhim, and the ‘Take off that marched on:--when hark!\n\nHaw--wurraw--wurraw--aworr!\n\nA roar of wild beasts was heard. And who should come riding into the\ntown, frightening away the boys, and even the beadle and policeman, but\nROSALBA!\n\nThe fact is, that when Captain Hedzoff entered into the court of\nSnapdragon Castle, and was discoursing with King Padella, the lions made\na dash at the open gate, gobbled up the six beef-eaters in a jiffy, and\naway they went with Rosalba on the back of one of them, and they carried\nher, turn and turn about, till they came to the city where Prince\nGiglio’s army was encamped.\n\nWhen the KING heard of the QUEEN’S arrival, you may think how he rushed\nout of his breakfast-room to hand Her Majesty off her lion! The lions\nwere grown as fat as pigs now, having had Hogginarmo and all those\nbeefeaters, and were so tame, anybody might pat them.\n\nWhile Giglio knelt (most gracefully) and helped the Princess, Bulbo,\nfor his part, rushed up and kissed the lion. He flung his arms round the\nforest monarch; he hugged him, and laughed and cried for joy. ‘Oh, you\ndarling old beast, oh, how glad I am to see you, and the dear, dear\nBets--that is, Rosalba.’\n\n‘What, is it you? poor Bulbo!’ said the Queen.’ Oh, how glad I am to see\nyou,’ and she gave him her hand to kiss. King Giglio slapped him most\nkindly on the back, and said, ‘Bulbo, my boy, I am delighted, for your\nsake, that Her Majesty has arrived.’\n\n‘So am I,’ said Bulbo; ‘and YOU KNOW WHY.’ Captain Hedzoff here came up.\n‘Sire, it is half-past eight: shall we proceed with the execution?’\n\n‘Execution! what for?’ asked Bulbo.\n\n‘An officer only knows his orders,’ replied Captain Hedzoff, showing his\nwarrant, on which His Majesty King Giglio smilingly said, ‘Prince Bulbo\nwas reprieved this time,’ and most graciously invited him to breakfast.\n\n\n\n\nCHAPTER XVII. HOW A TREMENDOUS BATTLE TOOK PLACE, AND WHO WON IT\n\nAs soon as King Padella heard, what we know already, that his victim,\nthe lovely Rosalba, had escaped him, His Majesty’s fury knew no bounds,\nand he pitched the Lord Chancellor, Lord Chamberlain, and every officer\nof the Crown whom he could set eyes on, into the cauldron of boiling oil\nprepared for the Princess. Then he ordered out his whole army, horse,\nfoot, and artillery; and set forth at the head of an innumerable host,\nand I should think twenty thousand drummers, trumpeters, and fifers.\n\nKing Giglio’s advance guard, you may be sure, kept that monarch\nacquainted with the enemy’s dealings, and he was in nowise disconcerted.\nHe was much too polite to alarm the Princess, his lovely guest, with\nany unnecessary rumours of battles impending; on the contrary, he did\neverything to amuse and divert her; gave her a most elegant breakfast,\ndinner, lunch, and got up a ball for her that evening, when he danced\nwith her every single dance.\n\nPoor Bulbo was taken into favour again, and allowed to go quite free\nnow. He had new clothes given him, was called ‘My good cousin’ by His\nMajesty, and was treated with the greatest distinction by everybody.\nBut it was easy to see he was very melancholy. The fact is, the sight of\nBetsinda, who looked perfectly lovely in an elegant new dress, set\npoor Bulbo frantic in love with her again. And he never thought about\nAngelica, now Princess Bulbo, whom he had left at home, and who, as we\nknow, did not care much about him.\n\nThe King, dancing the twenty-fifth polka with Rosalba, remarked with\nwonder the ring she wore; and then Rosalba told him how she had got it\nfrom Gruffanuff, who no doubt had picked it up when Angelica flung it\naway.\n\n‘Yes,’ says the Fairy Blackstick, who had come to see the young people,\nand who had very likely certain plans regarding them. ‘That ring I gave\nthe Queen, Giglio’s mother, who was not, saving your presence, a very\nwise woman; it is enchanted, and whoever wears it looks beautiful in the\neyes of the world, I made poor Prince Bulbo, when he was christened, the\npresent of a rose which made him look handsome while he had it; but he\ngave it to Angelica, who instantly looked beautiful again, whilst Bulbo\nrelapsed into his natural plainness.’\n\n‘Rosalba needs no ring, I am sure,’ says Giglio, with a low bow. ‘She is\nbeautiful enough, in my eyes, without any enchanted aid.’\n\n‘Oh, sir!’ said Rosalba.\n\n‘Take off the ring and try,’ said the King, and resolutely drew the ring\noff her finger. In HIS eyes she looked just as handsome as before!\n\nThe King was thinking of throwing the ring away, as it was so dangerous\nand made all the people so mad about Rosalba; but being a Prince of\ngreat humour, and good humour too, he cast eyes upon a poor youth who\nhappened to be looking on very disconsolately, and said--\n\n‘Bulbo, my poor lad! come and try on this ring. The Princess Rosalba\nmakes it a present to you.’\n\nThe magic properties of this ring were uncommonly strong, for no sooner\nhad Bulbo put it on, but lo and behold, he appeared a personable,\nagreeable young Prince enough--with a fine complexion, fair hair, rather\nstout, and with bandy legs; but these were encased in such a beautiful\npair of yellow morocco boots that nobody remarked them. And Bulbo’s\nspirits rose up almost immediately after he had looked in the glass, and\nhe talked to their Majesties in the most lively, agreeable manner, and\ndanced opposite the Queen with one of the prettiest maids of honour, and\nafter looking at Her Majesty, could not help saying--\n\n‘How very odd! she is very pretty, but not so EXTRAORDINARILY handsome.’\n\n‘Oh no, by no means!’ says the Maid of Honour.\n\n‘But what care I, dear sir,’ says the Queen, who overheard them, ‘if YOU\nthink I am good-looking enough?’\n\nHis Majesty’s glance in reply to this affectionate speech was such that\nno painter could draw it. And the Fairy Blackstick said, ‘Bless you, my\ndarling children! Now you are united and happy; and now you see what I\nsaid from the first, that a little misfortune has done you both good.\nYOU, Giglio, had you been bred in prosperity, would scarcely have\nlearned to read or write--you would have been idle and extravagant, and\ncould not have been a good King as now you will be. You, Rosalba, would\nhave been so flattered, that your little head might have been turned\nlike Angelica’s, who thought herself too good for Giglio.’\n\n‘As if anybody could be good enough for HIM,’ cried Rosalba.\n\n‘Oh, you, you darling!’ says Giglio. And so she was; and he was just\nholding out his arms in order to give her a hug before the whole\ncompany, when a messenger came rushing in, and said, ‘My Lord, the\nenemy!’\n\n‘To arms!’ cries Giglio.\n\n‘Oh, mercy!’ says Rosalba, and fainted of course.\n\nHe snatched one kiss from her lips, and rushed FORTH TO THE FIELD of\nbattle!\n\nThe Fairy had provided King Giglio with a suit of armour, which was not\nonly embroidered all over with jewels, and blinding to your eyes to\nlook at, but was water-proof, gun-proof, and sword-proof; so that in the\nmidst of the very hottest battles His Majesty rode about as calmly as if\nhe had been a British Grenadier at Alma. Were I engaged in fighting for\nmy country, _I_ should like such a suit of armour as Prince Giglio wore;\nbut, you know, he was a Prince of a fairy tale, and they always have\nthese wonderful things.\n\nBesides the fairy armour, the Prince had a fairy horse, which would\ngallop at any pace you pleased; and a fairy sword, which would lengthen\nand run through a whole regiment of enemies at once. With such a weapon\nat command, I wonder, for my part, he thought of ordering his army out;\nbut forth they all came, in magnificent new uniforms, Hedzoff and the\nPrince’s two college friends each commanding a division, and His Majesty\nprancing in person at the head of them all.\n\nAh! if I had the pen of a Sir Archibald Alison, my dear friends, would\nI not now entertain you with the account of a most tremendous shindy?\nShould not fine blows be struck? dreadful wounds be delivered? arrows\ndarken the air? cannon balls crash through the battalions? cavalry\ncharge infantry? infantry pitch into cavalry? bugles blow; drums beat;\nhorses neigh; fifes sing; soldiers roar, swear, hurray; officers shout\nout ‘Forward, my men!’ ‘This way, lads!’ ‘Give it ‘em, boys!’ ‘Fight for\nKing Giglio, and the cause of right!’ ‘King Padella for ever!’ Would I\nnot describe all this, I say, and in the very finest language too? But\nthis humble pen does not possess the skill necessary for the description\nof combats. In a word, the overthrow of King Padella’s army was so\ncomplete, that if they had been Russians you could not have wished them\nto be more utterly smashed and confounded.\n\nAs for that usurping monarch, having performed acts of velour much more\nconsiderable than could be expected of a royal ruffian and usurper,\nwho had such a bad cause, and who was so cruel to women,--as for King\nPadella, I say, when his army ran away, the King ran away too, kicking\nhis first general, Prince Punchikoff, from his saddle, and galloping\naway on the Prince’s horse, having, indeed, had twenty-five or\ntwenty-six of his own shot under him. Hedzoff coming up, and finding\nPunchikoff down, as you may imagine, very speedily disposed of HIM.\nMeanwhile King Padella was scampering off as hard as his horse could\nlay legs to ground. Fast as he scampered, I promise you somebody else\ngalloped faster; and that individual, as no doubt you are aware, was the\nRoyal Giglio, who kept bawling out, ‘Stay, traitor! Turn, miscreant, and\ndefend thyself! Stand, tyrant, coward, ruffian, royal wretch, till I cut\nthy ugly head from thy usurping shoulders!’ And, with his fairy sword,\nwhich elongated itself at will, His Majesty kept poking and prodding\nPadella in the back, until that wicked monarch roared with anguish.\n\nWhen he was fairly brought to bay, Padella turned and dealt Prince\nGiglio a prodigious crack over the sconce with his battle-axe, a most\nenormous weapon, which had cut down I don’t know how many regiments in\nthe course of the afternoon. But, Law bless you! though the blow fell\nright down on His Majesty’s helmet, it made no more impression than if\nPadella had struck him with a pat of butter: his battle-axe crumpled up\nin Padella’s hand, and the Royal Giglio laughed for very scorn at the\nimpotent efforts of that atrocious usurper.\n\nAt the ill success of his blow the Crim Tartar monarch was justly\nirritated. ‘If,’ says he to Giglio, ‘you ride a fairy horse, and wear\nfairy armour, what on earth is the use of my hitting you? I may as well\ngive myself up a prisoner at once. Your Majesty won’t, I suppose, be so\nmean as to strike a poor fellow who can’t strike again?’\n\nThe justice of Padella’s remark struck the magnanimous Giglio. ‘Do you\nyield yourself a prisoner, Padella?’ says he.\n\n‘Of course I do,’ says Padella.\n\n‘Do you acknowledge Rosalba as your rightful Queen, and give up the\ncrown and all your treasures to your rightful mistress?’\n\n‘If I must, I must,’ says Padella, who was naturally very sulky.\n\nBy this time King Giglio’s aides-de-camp had come up, whom His Majesty\nordered to bind the prisoner. And they tied his hands behind him, and\nbound his legs tight under his horse, having set him with his face to\nthe tail; and in this fashion he was led back to King Giglio’s quarters,\nand thrust into the very dungeon where young Bulbo had been confined.\n\nPadella (who was a very different person in the depth of his distress,\nto Padella, the proud wearer of the Crim Tartar crown), now most\naffectionately and earnestly asked to see his son--his dear eldest\nboy--his darling Bulbo; and that good-natured young man never once\nreproached his haughty parent for his unkind conduct the day before,\nwhen he would have left Bulbo to be shot without any pity, but came to\nsee his father, and spoke to him through the grating of the door, beyond\nwhich he was not allowed to go; and brought him some sandwiches from the\ngrand supper which His Majesty was giving above stairs, in honour of the\nbrilliant victory which had just been achieved.\n\n‘I cannot stay with you long, sir,’ says Bulbo, who was in his best ball\ndress, as he handed his father in the prog, ‘I am engaged to dance the\nnext quadrille with Her Majesty Queen Rosalba, and I hear the fiddles\nplaying at this very moment.’\n\nSo Bulbo went back to the ball-room and the wretched Padella ate his\nsolitary supper in silence and tears.\n\nAll was now joy in King Giglio’s circle. Dancing, feasting, fun,\nilluminations, and jollifications of all sorts ensued. The people\nthrough whose villages they passed were ordered to illuminate their\ncottages at night, and scatter flowers on the roads during the day. They\nwere requested, and I promise you they did not like to refuse, to serve\nthe troops liberally with eatables and wine; besides, the army was\nenriched by the immense quantity of plunder which was found in King\nPadella’s camp, and taken from his soldiers; who (after they had given\nup everything) were allowed to fraternise with the conquerors; and the\nunited forces marched back by easy stages towards King Giglio’s capital,\nhis royal banner and that of Queen Rosalba being carried in front of the\ntroops. Hedzoff was made a Duke and a Field-Marshal. Smith and Jones\nwere promoted to be Earls; the Crim Tartar Order of the Pumpkin and the\nPaflagonian decoration of the Cucumber were freely distributed by their\nMajesties to the army. Queen Rosalba wore the Paflagonian Ribbon of\nthe Cucumber across her riding-habit, whilst King Giglio never appeared\nwithout the grand Cordon of the Pumpkin. How the people cheered them as\nthey rode along side by side! They were pronounced to be the handsomest\ncouple ever seen: that was a matter of course; but they really WERE very\nhandsome, and, had they been otherwise, would have looked so, they were\nso happy! Their Majesties were never separated during the whole day, but\nbreakfasted, dined, and supped together always, and rode side by side,\ninterchanging elegant compliments, and indulging in the most delightful\nconversation. At night, Her Majesty’s ladies of honour (who had\nall rallied round her the day after King Padella’s defeat) came and\nconducted her to the apartments prepared for her; whilst King Giglio,\nsurrounded by his gentlemen, withdrew to his own Royal quarters. It was\nagreed they should be married as soon as they reached the capital, and\norders were dispatched to the Archbishop of Blombodinga, to hold himself\nin readiness to perform the interesting ceremony. Duke Hedzoff carried\nthe message, and gave instructions to have the Royal Castle splendidly\nrefurnished and painted afresh. The Duke seized Glumboso, the Ex-Prime\nMinister, and made him refund that considerable sum of money which the\nold scoundrel had secreted out of the late King’s treasure. He also\nclapped Valoroso into prison (who, by the way, had been dethroned\nfor some considerable period past), and when the Ex-Monarch weakly\nremonstrated, Hedzoff said, ‘A soldier, sir, knows but his duty; my\norders are to lock you up along with the Ex-King Padella, whom I have\nbrought hither a prisoner under guard.’ So these two Ex-Royal personages\nwere sent for a year to the House of Correction, and thereafter were\nobliged to become monks of the severest Order of Flagellants, in which\nstate, by fasting, by vigils, by flogging (which they administered\nto one another, humbly but resolutely), no doubt they exhibited a\nrepentance for their past misdeeds, usurpations, and private and public\ncrimes.\n\nAs for Glumboso, that rogue was sent to the galleys, and never had an\nopportunity to steal any more.\n\n\n\n\nCHAPTER XVIII. HOW THEY ALL JOURNEYED BACK TO THE CAPITAL\n\nThe Fairy Blackstick, by whose means this young King and Queen had\ncertainly won their respective crowns back, would come not unfrequently,\nto pay them a little visit--as they were riding in their triumphal\nprogress towards Giglio’s capital--change her wand into a pony, and\ntravel by their Majesties’ side, giving them the very best advice. I am\nnot sure that King Giglio did not think the Fairy and her advice rather\na bore, fancying it was his own velour and merits which had put him on\nhis throne, and conquered Padella: and, in fine, I fear he rather gave\nhimself airs towards his best friend and patroness. She exhorted him to\ndeal justly by his subjects, to draw mildly on the taxes, never to break\nhis promise when he had once given it--and in all respects to be a good\nKing.\n\n‘A good King, my dear Fairy!’ cries Rosalba. ‘Of course he will. Break\nhis promise! can you fancy my Giglio would ever do anything so improper,\nso unlike him? No! never!’ And she looked fondly towards Giglio, whom\nshe thought a pattern of perfection.\n\n‘Why is Fairy Blackstick always advising me, and telling me how to\nmanage my government, and warning me to keep my word? Does she suppose\nthat I am not a man of sense, and a man of honour?’ asks Giglio testily.\n‘Methinks she rather presumes upon her position.’\n\n‘Hush! dear Giglio,’ says Rosalba. ‘You know Blackstick has been very\nkind to us, and we must not offend her.’ But the Fairy was not listening\nto Giglio’s testy observations, she had fallen back, and was trotting\non her pony now, by Master Bulbo’s side, who rode a donkey, and made\nhimself generally beloved in the army by his cheerfulness, kindness, and\ngood-humour to everybody. He was eager to see his darling Angelica. He\nthought there never was such a charming being. Blackstick did not tell\nhim it was the possession of the magic rose that made Angelica so lovely\nin his eyes. She brought him the very best accounts of his little wife,\nwhose misfortunes and humiliations had indeed very greatly improved\nher; and, you see, she could whisk off on her wand a hundred miles in a\nminute, and be back in no time, and so carry polite messages from Bulbo\nto Angelica, and from Angelica to Bulbo, and comfort that young man upon\nhis journey.\n\nWhen the Royal party arrived at the last stage before you reach\nBlombodinga, who should be in waiting, in her carriage there with her\nlady of honour by her side, but the Princess Angelica! She rushed into\nher husband’s arms, scarcely stopping to make a passing curtsey to the\nKing and Queen. She had no eyes but for Bulbo, who appeared perfectly\nlovely to her on account of the fairy ring which he wore; whilst she\nherself, wearing the magic rose in her bonnet, seemed entirely beautiful\nto the enraptured Bulbo.\n\nA splendid luncheon was served to the Royal party, of which the\nArchbishop, the Chancellor, Duke Hedzoff, Countess Gruffanuff, and all\nour friends partook, the Fairy Blackstick being seated on the left of\nKing Giglio, with Bulbo and Angelica beside her. You could hear the\njoy-bells ringing in the capital, and the guns which the citizens were\nfiring off in honour of their Majesties.\n\n‘What can have induced that hideous old Gruffanuff to dress herself up\nin such an absurd way? Did you ask her to be your bridesmaid, my dear?’\nsays Giglio to Rosalba. ‘What a figure of fun Gruffy is!’\n\nGruffy was seated opposite their Majesties, between the Archbishop and\nthe Lord Chancellor, and a figure of fun she certainly was, for she was\ndressed in a low white silk dress, with lace over, a wreath of white\nroses on her wig, a splendid lace veil, and her yellow old neck was\ncovered with diamonds. She ogled the King in such a manner that His\nMajesty burst out laughing.\n\n‘Eleven o’clock!’ cries Giglio, as the great Cathedral bell of\nBlombodinga tolled that hour. ‘Gentlemen and ladies, we must be\nstarting. Archbishop, you must be at church, I think, before twelve?’\n\n‘We must be at church before twelve,’ sighs out Gruffanuff in a\nlanguishing voice, hiding her old face behind her fan.\n\n‘And then I shall be the happiest man in my dominions,’ cries Giglio,\nwith an elegant bow to the blushing Rosalba.\n\n‘Oh, my Giglio! Oh, my dear Majesty!’ exclaims Gruffanuff; ‘and can it\nbe that this happy moment at length has arrived--’\n\n‘Of course it has arrived,’ says the King.\n\n‘--and that I am about to become the enraptured bride of my adored\nGiglio!’ continues Gruffanuff. ‘Lend me a smelling-bottle, somebody. I\ncertainly shall faint with joy.’\n\n‘YOU my bride?’ roars out Giglio.\n\n‘YOU marry my Prince?’ cried poor little Rosalba.\n\n‘Pooh! Nonsense! The woman’s mad!’ exclaims the King. And all the\ncourtiers exhibited by their countenances and expressions, marks of\nsurprise, or ridicule, or incredulity, or wonder.\n\n‘I should like to know who else is going to be married, if I am not?’\nshrieks out Gruffanuff. ‘I should like to know if King Giglio is a\ngentleman, and if there is such a thing as justice in Paflagonia? Lord\nChancellor! my Lord Archbishop! will your Lordships sit by and see a\npoor, fond, confiding, tender creature put upon? Has not Prince Giglio\npromised to marry his Barbara? Is not this Giglio’s signature? Does not\nthis paper declare that he is mine, and only mine?’ And she handed\nto his Grace the Archbishop the document which the Prince signed\nthat evening when she wore the magic ring, and Giglio drank so much\nchampagne. And the old Archbishop, taking out his eyeglasses, read--\n\n“‘This is to give notice, that I, Giglio, only son of Savio, King of\nPaflagonia, hereby promise to marry the charming Barbara Griselda,\nCountess Gruffanuff, and widow of the late Jenkins Gruffanuff, Esq.”\n\n‘H’m,’ says the Archbishop, ‘the document is certainly a--a document.’\n\n‘Phoo!’ says the Lord Chancellor, ‘the signature is not in His Majesty’s\nhandwriting.’ Indeed, since his studies at Bosforo, Giglio had made an\nimmense improvement in caligraphy.\n\n‘Is it your handwriting, Giglio?’ cries the Fairy Blackstick, with an\nawful severity of countenance.\n\n‘Y--y--y--es,’ poor Giglio gasps out, ‘I had quite forgotten the\nconfounded paper: she can’t mean to hold me by it. You old wretch, what\nwill you take to let me off? Help the Queen, some one--Her Majesty has\nfainted.’\n\n‘Chop her head off!’ } exclaim the impetuous ‘Smother the old witch!’ }\nHedzoff, the ardent Smith, and ‘Pitch her into the river!’ } the faithful\nJones.\n\nBut Gruffanuff flung her arms round the Archbishop’s neck, and bellowed\nout, ‘Justice, justice, my Lord Chancellor!’ so loudly, that her\npiercing shrieks caused everybody to pause. As for Rosalba, she was\nborne away lifeless by her ladies; and you may imagine the look of agony\nwhich Giglio cast towards that lovely being, as his hope, his joy, his\ndarling, his all in all, was thus removed, and in her place the horrid\nold Gruffanuff rushed up to his side, and once more shrieked out,\n‘Justice, justice!’\n\n‘Won’t you take that sum of money which Glumboso hid?’ says Giglio; ‘two\nhundred and eighteen thousand millions, or thereabouts. It’s a handsome\nsum.’\n\n‘I will have that and you too!’ says Gruffanuff.\n\n‘Let us throw the crown jewels into the bargain,’ gasps out Giglio.\n\n‘I will wear them by my Giglio’s side!’ says Gruffanuff.\n\n‘Will half, three-quarters, five-sixths, nineteen-twentieths, of my\nkingdom do, Countess?’ asks the trembling monarch.\n\n‘What were all Europe to me without YOU, my Giglio?’ cries Gruff,\nkissing his hand.\n\n‘I won’t, I can’t, I shan’t,--I’ll resign the crown first,’ shouts\nGiglio, tearing away his hand; but Gruff clung to it.\n\n‘I have a competency, my love,’ she says, ‘and with thee and a cottage\nthy Barbara will be happy.’\n\nGiglio was half mad with rage by this time. ‘I will not marry her,’\nsays he. ‘Oh, Fairy, Fairy, give me counsel?’ And as he spoke he looked\nwildly round at the severe face of the Fairy Blackstick.\n\n“‘Why is Fairy Blackstick always advising me, and warning me to keep my\nword? Does she suppose that I am not a man of honour?”’ said the Fairy,\nquoting Giglio’s own haughty words. He quailed under the brightness\nof her eyes; he felt that there was no escape for him from that awful\ninquisition.\n\n‘Well, Archbishop,’ said he in a dreadful voice, that made his Grace\nstart, ‘since this Fairy has led me to the height of happiness but to\ndash me down into the depths of despair, since I am to lose Rosalba, let\nme at least keep my honour. Get up, Countess, and let us be married; I\ncan keep my word, but I can die afterwards.’\n\n‘Oh, dear Giglio,’ cries Gruffanuff, skipping up, ‘I knew, I knew I\ncould trust thee--I knew that my Prince was the soul of honour. Jump\ninto your carriages, ladies and gentlemen, and let us go to church at\nonce; and as for dying, dear Giglio, no, no:--thou wilt forget that\ninsignificant little chambermaid of a Queen--thou wilt live to be\nconsoled by thy Barbara! She wishes to be a Queen, and not a Queen\nDowager, my gracious Lord!’ And hanging upon poor Giglio’s arm, and\nleering and grinning in his face in the most disgusting manner, this old\nwretch tripped off in her white satin shoes, and jumped into the very\ncarriage which had been got ready to convey Giglio and Rosalba to\nchurch. The cannons roared again, the bells pealed triple-bobmajors, the\npeople came out flinging flowers upon the path of the royal bride and\nbridegroom, and Gruff looked out of the gilt coach window and bowed and\ngrinned to them. Phoo! the horrid old wretch!\n\n\n\n\nCHAPTER XIX. AND NOW WE COME TO THE LAST SCENE IN THE PANTOMIME\n\nThe many ups and downs of her life had given the Princess Rosalba\nprodigious strength of mind, and that highly principled young\nwoman presently recovered from her fainting-fit, out of which Fairy\nBlackstick, by a precious essence which the Fairy always carried in her\npocket, awakened her. Instead of tearing her hair, crying, and bemoaning\nherself, and fainting again, as many young women would have done,\nRosalba remembered that she owed an example of firmness to her subjects;\nand though she loved Giglio more than her life, was determined, as she\ntold the Fairy, not to interfere between him and justice, or to cause\nhim to break his royal word.\n\n‘I cannot marry him, but I shall love him always,’ says she to\nBlackstick; ‘I will go and be present at his marriage with the Countess,\nand sign the book, and wish them happy with all my heart. I will see,\nwhen I get home, whether I cannot make the new Queen some handsome\npresents. The Crim Tartary crown diamonds are uncommonly fine, and I\nshall never have any use for them. I will live and die unmarried like\nQueen Elizabeth, and, of course, I shall leave my crown to Giglio when\nI quit this world. Let us go and see them married, my dear Fairy, let me\nsay one last farewell to him; and then, if you please, I will return to\nmy own dominions.’\n\nSo the Fairy kissed Rosalba with peculiar tenderness, and at once\nchanged her wand into a very comfortable coach-and-four, with a steady\ncoachman, and two respectable footmen behind, and the Fairy and Rosalba\ngot into the coach, which Angelica and Bulbo entered after them. As\nfor honest Bulbo, he was blubbering in the most pathetic manner, quite\novercome by Rosalba’s misfortune. She was touched by the honest fellow’s\nsympathy, promised to restore to him the confiscated estates of Duke\nPadella his father, and created him, as he sat there in the coach,\nPrince, Highness, and First Grandee of the Crim Tartar Empire. The\ncoach moved on, and, being a fairy coach, soon came up with the bridal\nprocession.\n\nBefore the ceremony at church it was the custom in Paflagonia, as it is\nin other countries, for the bride and bridegroom to sign the Contract\nof Marriage, which was to be witnessed by the Chancellor, Minister, Lord\nMayor, and principal officers of state. Now, as the royal palace was\nbeing painted and furnished anew, it was not ready for the reception of\nthe King and his bride, who proposed at first to take up their residence\nat the Prince’s palace, that one which Valoroso occupied when Angelica\nwas born, and before he usurped the throne.\n\nSo the marriage party drove up to the palace: the dignitaries got out of\ntheir carriages and stood aside: poor Rosalba stepped out of her coach,\nsupported by Bulbo, and stood almost fainting up against the railings\nso as to have a last look of her dear Giglio. As for Blackstick, she,\naccording to her custom, had flown out of the coach window in some\ninscrutable manner, and was now standing at the palace door.\n\nGiglio came up the steps with his horrible bride on his arm, looking\nas pale as if he was going to execution. He only frowned at the Fairy\nBlackstick--he was angry with her, and thought she came to insult his\nmisery.\n\n‘Get out of the way, pray,’ says Gruffanuff haughtily. ‘I wonder why you\nare always poking your nose into other people’s affairs?’\n\n‘Are you determined to make this poor young man unhappy?’ says\nBlackstick.\n\n‘To marry him, yes! What business is it of yours? Pray, madam, don’t say\n“you” to a Queen,’ cries Gruffanuff.\n\n‘You won’t take the money he offered you?’\n\n‘No.’\n\n‘You won’t let him off his bargain, though you know you cheated him when\nyou made him sign the paper?’\n\n‘Impudence! Policemen, remove this woman!’ cries Gruffanuff. And the\npolicemen were rushing forward, but with a wave of her wand the Fairy\nstruck them all like so many statues in their places.\n\n‘You won’t take anything in exchange for your bond, Mrs. Gruffanuff,’\ncries the Fairy, with awful severity. ‘I speak for the last time.’\n\n‘No!’ shrieks Gruffanuff, stamping with her foot. ‘I’ll have my husband,\nmy husband, my husband!’\n\n‘YOU SHALL HAVE YOUR HUSBAND!’ the Fairy Blackstick cried; and advancing\na step, laid her hand upon the nose of the KNOCKER.\n\nAs she touched it, the brass nose seemed to elongate, the open mouth\nopened still wider, and uttered a roar which made everybody start.\nThe eyes rolled wildly; the arms and legs uncurled themselves, writhed\nabout, and seemed to lengthen with each twist; the knocker expanded into\na figure in yellow livery, six feet high; the screws by which it was\nfixed to the door unloosed themselves, and JENKINS GRUFFANUFF once more\ntrod the threshold off which he had been lifted more than twenty years\nago!\n\n‘Master’s not at home,’ says Jenkins, just in his old voice; and Mrs.\nJenkins, giving a dreadful YOUP, fell down in a fit, in which nobody\nminded her.\n\nFor everybody was shouting, ‘Huzzay! huzzay!’ ‘Hip, hip, hurray!’ ‘Long\nlive the King and Queen!’ ‘Were such things ever seen?’ ‘No, never,\nnever, never!’ ‘The Fairy Blackstick for ever!’\n\nThe bells were ringing double peals, the guns roaring and banging most\nprodigiously. Bulbo was embracing everybody; the Lord Chancellor was\nflinging up his wig and shouting like a madman; Hedzoff had got the\nArchbishop round the waist, and they were dancing a jig for joy; and as\nfor Giglio, I leave you to imagine what HE was doing, and if he kissed\nRosalba once, twice--twenty thousand times, I’m sure I don’t think he\nwas wrong.\n\nSo Gruffanuff opened the hall door with a low bow, just as he had been\naccustomed to do, and they all went in and signed the book, and then\nthey went to church and were married, and the Fairy Blackstick sailed\naway on her cane, and was never more heard of in Paflagonia.\n\nand here ends the Fireside Pantomime.\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      51,
      59,
      1
    ],
    [
      "chapter.title",
      1965,
      2025,
      2
    ],
    [
      "chapter.title",
      7656,
      7731,
      3
    ],
    [
      "chapter.title",
      13238,
      13337,
      4
    ],
    [
      "chapter.title",
      20746,
      20825,
      5
    ],
    [
      "chapter.title",
      24579,
      24630,
      6
    ],
    [
      "chapter.title",
      31464,
      31509,
      7
    ],
    [
      "chapter.title",
      41611,
      41661,
      8
    ],
    [
      "chapter.title",
      49534,
      49619,
      9
    ],
    [
      "chapter.title",
      60735,
      60779,
      10
    ],
    [
      "chapter.title",
      68615,
      68669,
      11
    ],
    [
      "chapter.title",
      72476,
      72530,
      12
    ],
    [
      "chapter.title",
      86045,
      86099,
      13
    ],
    [
      "chapter.title",
      93929,
      94008,
      14
    ],
    [
      "chapter.title",
      100287,
      100321,
      15
    ],
    [
      "chapter.title",
      119805,
      119837,
      16
    ],
    [
      "chapter.title",
      129761,
      129816,
      17
    ],
    [
      "chapter.title",
      136680,
      136744,
      18
    ],
    [
      "chapter.title",
      150349,
      150406,
      19
    ],
    [
      "chapter.title",
      159830,
      159893,
      20
    ]
  ]
}