{
  "content": "The Story of the Treasure Seekers\nE. Nesbit\n\nBeing the adventures of the Bastable children in search of a fortune\n\n\n\n\nTO OSWALD BARRON Without whom this book could never have been written\n\nThe Treasure Seekers is dedicated in memory of childhoods identical but\nfor the accidents of time and space\n\n\n\n\n\nCHAPTER 1. THE COUNCIL OF WAYS AND MEANS\n\nThis is the story of the different ways we looked for treasure, and I\nthink when you have read it you will see that we were not lazy about the\nlooking.\n\nThere are some things I must tell before I begin to tell about the\ntreasure-seeking, because I have read books myself, and I know how\nbeastly it is when a story begins, ‘“Alas!” said Hildegarde with a deep\nsigh, “we must look our last on this ancestral home”’--and then some one\nelse says something--and you don’t know for pages and pages where the\nhome is, or who Hildegarde is, or anything about it. Our ancestral home\nis in the Lewisham Road. It is semi-detached and has a garden, not a\nlarge one. We are the Bastables. There are six of us besides Father. Our\nMother is dead, and if you think we don’t care because I don’t tell you\nmuch about her you only show that you do not understand people at all.\nDora is the eldest. Then Oswald--and then Dicky. Oswald won the Latin\nprize at his preparatory school--and Dicky is good at sums. Alice\nand Noel are twins: they are ten, and Horace Octavius is my youngest\nbrother. It is one of us that tells this story--but I shall not tell you\nwhich: only at the very end perhaps I will. While the story is going\non you may be trying to guess, only I bet you don’t. It was Oswald\nwho first thought of looking for treasure. Oswald often thinks of very\ninteresting things. And directly he thought of it he did not keep it\nto himself, as some boys would have done, but he told the others, and\nsaid--\n\n‘I’ll tell you what, we must go and seek for treasure: it is always what\nyou do to restore the fallen fortunes of your House.’\n\nDora said it was all very well. She often says that. She was trying to\nmend a large hole in one of Noel’s stockings. He tore it on a nail when\nwe were playing shipwrecked mariners on top of the chicken-house the day\nH. O. fell off and cut his chin: he has the scar still. Dora is the only\none of us who ever tries to mend anything. Alice tries to make things\nsometimes. Once she knitted a red scarf for Noel because his chest\nis delicate, but it was much wider at one end than the other, and he\nwouldn’t wear it. So we used it as a pennon, and it did very well,\nbecause most of our things are black or grey since Mother died; and\nscarlet was a nice change. Father does not like you to ask for new\nthings. That was one way we had of knowing that the fortunes of the\nancient House of Bastable were really fallen. Another way was that there\nwas no more pocket-money--except a penny now and then to the little\nones, and people did not come to dinner any more, like they used to,\nwith pretty dresses, driving up in cabs--and the carpets got holes in\nthem--and when the legs came off things they were not sent to be mended,\nand we gave _up_ having the gardener except for the front garden, and\nnot that very often. And the silver in the big oak plate-chest that is\nlined with green baize all went away to the shop to have the dents\nand scratches taken out of it, and it never came back. We think Father\nhadn’t enough money to pay the silver man for taking out the dents and\nscratches. The new spoons and forks were yellowy-white, and not so heavy\nas the old ones, and they never shone after the first day or two.\n\nFather was very ill after Mother died; and while he was ill his\nbusiness-partner went to Spain--and there was never much money\nafterwards. I don’t know why. Then the servants left and there was only\none, a General. A great deal of your comfort and happiness depends on\nhaving a good General. The last but one was nice: she used to make jolly\ngood currant puddings for us, and let us have the dish on the floor\nand pretend it was a wild boar we were killing with our forks. But the\nGeneral we have now nearly always makes sago puddings, and they are\nthe watery kind, and you cannot pretend anything with them, not even\nislands, like you do with porridge.\n\nThen we left off going to school, and Father said we should go to a good\nschool as soon as he could manage it. He said a holiday would do us all\ngood. We thought he was right, but we wished he had told us he couldn’t\nafford it. For of course we knew.\n\nThen a great many people used to come to the door with envelopes with\nno stamps on them, and sometimes they got very angry, and said they\nwere calling for the last time before putting it in other hands. I asked\nEliza what that meant, and she kindly explained to me, and I was so\nsorry for Father.\n\nAnd once a long, blue paper came; a policeman brought it, and we were\nso frightened. But Father said it was all right, only when he went up\nto kiss the girls after they were in bed they said he had been crying,\nthough I’m sure that’s not true. Because only cowards and snivellers\ncry, and my Father is the bravest man in the world.\n\nSo you see it was time we looked for treasure and Oswald said so, and\nDora said it was all very well. But the others agreed with Oswald. So we\nheld a council. Dora was in the chair--the big dining-room chair, that\nwe let the fireworks off from, the Fifth of November when we had the\nmeasles and couldn’t do it in the garden. The hole has never been\nmended, so now we have that chair in the nursery, and I think it was\ncheap at the blowing-up we boys got when the hole was burnt.\n\n‘We must do something,’ said Alice, ‘because the exchequer is empty.’\nShe rattled the money-box as she spoke, and it really did rattle because\nwe always keep the bad sixpence in it for luck.\n\n‘Yes--but what shall we do?’ said Dicky. ‘It’s so jolly easy to say\nlet’s do _something_.’ Dicky always wants everything settled exactly.\nFather calls him the Definite Article.\n\n‘Let’s read all the books again. We shall get lots of ideas out of\nthem.’ It was Noel who suggested this, but we made him shut up, because\nwe knew well enough he only wanted to get back to his old books. Noel\nis a poet. He sold some of his poetry once--and it was printed, but that\ndoes not come in this part of the story.\n\nThen Dicky said, ‘Look here. We’ll be quite quiet for ten minutes by\nthe clock--and each think of some way to find treasure. And when we’ve\nthought we’ll try all the ways one after the other, beginning with the\neldest.’\n\n‘I shan’t be able to think in ten minutes, make it half an hour,’ said\nH. O. His real name is Horace Octavius, but we call him H. O. because of\nthe advertisement, and it’s not so very long ago he was afraid to pass\nthe hoarding where it says ‘Eat H. O.’ in big letters. He says it was\nwhen he was a little boy, but I remember last Christmas but one, he woke\nin the middle of the night crying and howling, and they said it was the\npudding. But he told me afterwards he had been dreaming that they really\n_had_ come to eat H. O., and it couldn’t have been the pudding, when you\ncome to think of it, because it was so very plain.\n\nWell, we made it half an hour--and we all sat quiet, and thought and\nthought. And I made up my mind before two minutes were over, and I\nsaw the others had, all but Dora, who is always an awful time over\neverything. I got pins and needles in my leg from sitting still so long,\nand when it was seven minutes H. O. cried out--‘Oh, it must be more than\nhalf an hour!’\n\nH. O. is eight years old, but he cannot tell the clock yet. Oswald could\ntell the clock when he was six.\n\nWe all stretched ourselves and began to speak at once, but Dora put up\nher hands to her ears and said--\n\n‘One at a time, please. We aren’t playing Babel.’ (It is a very good\ngame. Did you ever play it?)\n\nSo Dora made us all sit in a row on the floor, in ages, and then she\npointed at us with the finger that had the brass thimble on. Her silver\none got lost when the last General but two went away. We think she must\nhave forgotten it was Dora’s and put it in her box by mistake. She was a\nvery forgetful girl. She used to forget what she had spent money on, so\nthat the change was never quite right.\n\nOswald spoke first. ‘I think we might stop people on Blackheath--with\ncrape masks and horse-pistols--and say “Your money or your life!\nResistance is useless, we are armed to the teeth”--like Dick Turpin\nand Claude Duval. It wouldn’t matter about not having horses, because\ncoaches have gone out too.’\n\nDora screwed up her nose the way she always does when she is going to\ntalk like the good elder sister in books, and said, ‘That would be\nvery wrong: it’s like pickpocketing or taking pennies out of Father’s\ngreat-coat when it’s hanging in the hall.’\n\nI must say I don’t think she need have said that, especially before the\nlittle ones--for it was when I was only four.\n\nBut Oswald was not going to let her see he cared, so he said--\n\n‘Oh, very well. I can think of lots of other ways. We could rescue an\nold gentleman from deadly Highwaymen.’\n\n‘There aren’t any,’ said Dora.\n\n‘Oh, well, it’s all the same--from deadly peril, then. There’s plenty\nof that. Then he would turn out to be the Prince of Wales, and he would\nsay, “My noble, my cherished preserver! Here is a million pounds a year.\nRise up, Sir Oswald Bastable.”’\n\nBut the others did not seem to think so, and it was Alice’s turn to say.\n\nShe said, ‘I think we might try the divining-rod. I’m sure I could do\nit. I’ve often read about it. You hold a stick in your hands, and when\nyou come to where there is gold underneath the stick kicks about. So you\nknow. And you dig.’\n\n‘Oh,’ said Dora suddenly, ‘I have an idea. But I’ll say last. I hope the\ndivining-rod isn’t wrong. I believe it’s wrong in the Bible.’\n\n‘So is eating pork and ducks,’ said Dicky. ‘You can’t go by that.’\n\n‘Anyhow, we’ll try the other ways first,’ said Dora. ‘Now, H. O.’\n\n‘Let’s be Bandits,’ said H. O. ‘I dare say it’s wrong but it would be\nfun pretending.’\n\n‘I’m sure it’s wrong,’ said Dora.\n\nAnd Dicky said she thought everything wrong. She said she didn’t, and\nDicky was very disagreeable. So Oswald had to make peace, and he said--\n\n‘Dora needn’t play if she doesn’t want to. Nobody asked her. And, Dicky,\ndon’t be an idiot: do dry up and let’s hear what Noel’s idea is.’\n\nDora and Dicky did not look pleased, but I kicked Noel under the table\nto make him hurry up, and then he said he didn’t think he wanted to\nplay any more. That’s the worst of it. The others are so jolly ready to\nquarrel. I told Noel to be a man and not a snivelling pig, and at last\nhe said he had not made up his mind whether he would print his poetry in\na book and sell it, or find a princess and marry her.\n\n‘Whichever it is,’ he added, ‘none of you shall want for anything,\nthough Oswald did kick me, and say I was a snivelling pig.’\n\n‘I didn’t,’ said Oswald, ‘I told you not to be.’ And Alice explained to\nhim that that was quite the opposite of what he thought. So he agreed to\ndrop it.\n\nThen Dicky spoke.\n\n‘You must all of you have noticed the advertisements in the papers,\ntelling you that ladies and gentlemen can easily earn two pounds a\nweek in their spare time, and to send two shillings for sample and\ninstructions, carefully packed free from observation. Now that we don’t\ngo to school all our time is spare time. So I should think we could\neasily earn twenty pounds a week each. That would do us very well. We’ll\ntry some of the other things first, and directly we have any money we’ll\nsend for the sample and instructions. And I have another idea, but I\nmust think about it before I say.’\n\nWe all said, ‘Out with it--what’s the other idea?’\n\nBut Dicky said, ‘No.’ That is Dicky all over. He never will show you\nanything he’s making till it’s quite finished, and the same with his\ninmost thoughts. But he is pleased if you seem to want to know, so\nOswald said--\n\n‘Keep your silly old secret, then. Now, Dora, drive ahead. We’ve all\nsaid except you.’\n\nThen Dora jumped up and dropped the stocking and the thimble (it rolled\naway, and we did not find it for days), and said--\n\n‘Let’s try my way _now_. Besides, I’m the eldest, so it’s only fair.\nLet’s dig for treasure. Not any tiresome divining-rod--but just plain\ndigging. People who dig for treasure always find it. And then we shall\nbe rich and we needn’t try your ways at all. Some of them are rather\ndifficult: and I’m certain some of them are wrong--and we must always\nremember that wrong things--’\n\nBut we told her to shut up and come on, and she did.\n\nI couldn’t help wondering as we went down to the garden, why Father\nhad never thought of digging there for treasure instead of going to his\nbeastly office every day.\n\n\n\nCHAPTER 2. DIGGING FOR TREASURE\n\nI am afraid the last chapter was rather dull. It is always dull in books\nwhen people talk and talk, and don’t do anything, but I was obliged to\nput it in, or else you wouldn’t have understood all the rest. The best\npart of books is when things are happening. That is the best part of\nreal things too. This is why I shall not tell you in this story about\nall the days when nothing happened. You will not catch me saying, ‘thus\nthe sad days passed slowly by’--or ‘the years rolled on their weary\ncourse’--or ‘time went on’--because it is silly; of course time goes\non--whether you say so or not. So I shall just tell you the nice,\ninteresting parts--and in between you will understand that we had our\nmeals and got up and went to bed, and dull things like that. It would be\nsickening to write all that down, though of course it happens. I said\nso to Albert-next-door’s uncle, who writes books, and he said, ‘Quite\nright, that’s what we call selection, a necessity of true art.’ And he\nis very clever indeed. So you see.\n\nI have often thought that if the people who write books for children\nknew a little more it would be better. I shall not tell you anything\nabout us except what I should like to know about if I was reading the\nstory and you were writing it. Albert’s uncle says I ought to have put\nthis in the preface, but I never read prefaces, and it is not much good\nwriting things just for people to skip. I wonder other authors have\nnever thought of this.\n\nWell, when we had agreed to dig for treasure we all went down into the\ncellar and lighted the gas. Oswald would have liked to dig there, but\nit is stone flags. We looked among the old boxes and broken chairs and\nfenders and empty bottles and things, and at last we found the spades we\nhad to dig in the sand with when we went to the seaside three years ago.\nThey are not silly, babyish, wooden spades, that split if you look at\nthem, but good iron, with a blue mark across the top of the iron part,\nand yellow wooden handles. We wasted a little time getting them dusted,\nbecause the girls wouldn’t dig with spades that had cobwebs on them.\nGirls would never do for African explorers or anything like that, they\nare too beastly particular.\n\nIt was no use doing the thing by halves. We marked out a sort of square\nin the mouldy part of the garden, about three yards across, and began\nto dig. But we found nothing except worms and stones--and the ground was\nvery hard.\n\nSo we thought we’d try another part of the garden, and we found a\nplace in the big round flower bed, where the ground was much softer. We\nthought we’d make a smaller hole to begin with, and it was much better.\nWe dug and dug and dug, and it was jolly hard work! We got very hot\ndigging, but we found nothing.\n\nPresently Albert-next-door looked over the wall. We do not like him very\nmuch, but we let him play with us sometimes, because his father is dead,\nand you must not be unkind to orphans, even if their mothers are\nalive. Albert is always very tidy. He wears frilly collars and velvet\nknickerbockers. I can’t think how he can bear to.\n\nSo we said, ‘Hallo!’\n\nAnd he said, ‘What are you up to?’\n\n‘We’re digging for treasure,’ said Alice; ‘an ancient parchment revealed\nto us the place of concealment. Come over and help us. When we have\ndug deep enough we shall find a great pot of red clay, full of gold and\nprecious jewels.’\n\nAlbert-next-door only sniggered and said, ‘What silly nonsense!’ He\ncannot play properly at all. It is very strange, because he has a very\nnice uncle. You see, Albert-next-door doesn’t care for reading, and he\nhas not read nearly so many books as we have, so he is very foolish and\nignorant, but it cannot be helped, and you just have to put up with it\nwhen you want him to do anything. Besides, it is wrong to be angry with\npeople for not being so clever as you are yourself. It is not always\ntheir faults.\n\nSo Oswald said, ‘Come and dig! Then you shall share the treasure when\nwe’ve found it.’\n\nBut he said, ‘I shan’t--I don’t like digging--and I’m just going in to\nmy tea.’\n\n‘Come along and dig, there’s a good boy,’ Alice said. ‘You can use my\nspade. It’s much the best--’\n\nSo he came along and dug, and when once he was over the wall we kept him\nat it, and we worked as well, of course, and the hole got deep. Pincher\nworked too--he is our dog and he is very good at digging. He digs for\nrats in the dustbin sometimes, and gets very dirty. But we love our dog,\neven when his face wants washing.\n\n‘I expect we shall have to make a tunnel,’ Oswald said, ‘to reach the\nrich treasure.’ So he jumped into the hole and began to dig at one side.\nAfter that we took it in turns to dig at the tunnel, and Pincher was\nmost useful in scraping the earth out of the tunnel--he does it with\nhis back feet when you say ‘Rats!’ and he digs with his front ones, and\nburrows with his nose as well.\n\nAt last the tunnel was nearly a yard long, and big enough to creep\nalong to find the treasure, if only it had been a bit longer. Now it was\nAlbert’s turn to go in and dig, but he funked it.\n\n‘Take your turn like a man,’ said Oswald--nobody can say that Oswald\ndoesn’t take his turn like a man. But Albert wouldn’t. So we had to make\nhim, because it was only fair.\n\n‘It’s quite easy,’ Alice said. ‘You just crawl in and dig with your\nhands. Then when you come out we can scrape out what you’ve done, with\nthe spades. Come--be a man. You won’t notice it being dark in the tunnel\nif you shut your eyes tight. We’ve all been in except Dora--and she\ndoesn’t like worms.’\n\n‘I don’t like worms neither.’ Albert-next-door said this; but we\nremembered how he had picked a fat red and black worm up in his fingers\nand thrown it at Dora only the day before. So we put him in.\n\nBut he would not go in head first, the proper way, and dig with his\nhands as we had done, and though Oswald was angry at the time, for he\nhates snivellers, yet afterwards he owned that perhaps it was just\nas well. You should never be afraid to own that perhaps you were\nmistaken--but it is cowardly to do it unless you are quite sure you are\nin the wrong.\n\n‘Let me go in feet first,’ said Albert-next-door. ‘I’ll dig with my\nboots--I will truly, honour bright.’\n\nSo we let him get in feet first--and he did it very slowly and at last\nhe was in, and only his head sticking out into the hole; and all the\nrest of him in the tunnel.\n\n‘Now dig with your boots,’ said Oswald; ‘and, Alice, do catch hold of\nPincher, he’ll be digging again in another minute, and perhaps it would\nbe uncomfortable for Albert if Pincher threw the mould into his eyes.’\n\nYou should always try to think of these little things. Thinking of other\npeople’s comfort makes them like you. Alice held Pincher, and we all\nshouted, ‘Kick! dig with your feet, for all you’re worth!’\n\nSo Albert-next-door began to dig with his feet, and we stood on the\nground over him, waiting--and all in a minute the ground gave way, and\nwe tumbled together in a heap: and when we got up there was a little\nshallow hollow where we had been standing, and Albert-next-door was\nunderneath, stuck quite fast, because the roof of the tunnel had tumbled\nin on him. He is a horribly unlucky boy to have anything to do with.\n\nIt was dreadful the way he cried and screamed, though he had to own it\ndidn’t hurt, only it was rather heavy and he couldn’t move his legs. We\nwould have dug him out all right enough, in time, but he screamed so we\nwere afraid the police would come, so Dicky climbed over the wall, to\ntell the cook there to tell Albert-next-door’s uncle he had been buried\nby mistake, and to come and help dig him out.\n\nDicky was a long time gone. We wondered what had become of him, and all\nthe while the screaming went on and on, for we had taken the loose earth\noff Albert’s face so that he could scream quite easily and comfortably.\n\nPresently Dicky came back and Albert-next-door’s uncle came with him. He\nhas very long legs, and his hair is light and his face is brown. He has\nbeen to sea, but now he writes books. I like him.\n\nHe told his nephew to stow it, so Albert did, and then he asked him if\nhe was hurt--and Albert had to say he wasn’t, for though he is a coward,\nand very unlucky, he is not a liar like some boys are.\n\n‘This promises to be a protracted if agreeable task,’ said\nAlbert-next-door’s uncle, rubbing his hands and looking at the hole with\nAlbert’s head in it. ‘I will get another spade,’ so he fetched the big\nspade out of the next-door garden tool-shed, and began to dig his nephew\nout.\n\n‘Mind you keep very still,’ he said, ‘or I might chunk a bit out of you\nwith the spade.’ Then after a while he said--\n\n‘I confess that I am not absolutely insensible to the dramatic interest\nof the situation. My curiosity is excited. I own that I should like to\nknow how my nephew happened to be buried. But don’t tell me if you’d\nrather not. I suppose no force was used?’\n\n‘Only moral force,’ said Alice. They used to talk a lot about moral\nforce at the High School where she went, and in case you don’t know what\nit means I’ll tell you that it is making people do what they don’t want\nto, just by slanging them, or laughing at them, or promising them things\nif they’re good.\n\n‘Only moral force, eh?’ said Albert-next-door’s uncle. ‘Well?’\n\n‘Well,’ Dora said, ‘I’m very sorry it happened to Albert--I’d rather it\nhad been one of us. It would have been my turn to go into the tunnel,\nonly I don’t like worms, so they let me off. You see we were digging for\ntreasure.’\n\n‘Yes,’ said Alice, ‘and I think we were just coming to the underground\npassage that leads to the secret hoard, when the tunnel fell in on\nAlbert. He _is_ so unlucky,’ and she sighed.\n\nThen Albert-next-door began to scream again, and his uncle wiped his\nface--his own face, not Albert’s--with his silk handkerchief, and then\nhe put it in his trousers pocket. It seems a strange place to put a\nhandkerchief, but he had his coat and waistcoat off and I suppose he\nwanted the handkerchief handy. Digging is warm work.\n\nHe told Albert-next-door to drop it, or he wouldn’t proceed further\nin the matter, so Albert stopped screaming, and presently his uncle\nfinished digging him out. Albert did look so funny, with his hair all\ndusty and his velvet suit covered with mould and his face muddy with\nearth and crying.\n\nWe all said how sorry we were, but he wouldn’t say a word back to us. He\nwas most awfully sick to think he’d been the one buried, when it might\njust as well have been one of us. I felt myself that it was hard lines.\n\n‘So you were digging for treasure,’ said Albert-next-door’s uncle,\nwiping his face again with his handkerchief. ‘Well, I fear that your\nchances of success are small. I have made a careful study of the whole\nsubject. What I don’t know about buried treasure is not worth knowing.\nAnd I never knew more than one coin buried in any one garden--and that\nis generally--Hullo--what’s that?’\n\nHe pointed to something shining in the hole he had just dragged Albert\nout of. Oswald picked it up. It was a half-crown. We looked at each\nother, speechless with surprise and delight, like in books.\n\n‘Well, that’s lucky, at all events,’ said Albert-next-door’s uncle.\n\n‘Let’s see, that’s fivepence each for you.’\n\n‘It’s fourpence--something; I can’t do fractions,’ said Dicky; ‘there\nare seven of us, you see.’\n\n‘Oh, you count Albert as one of yourselves on this occasion, eh?’\n\n‘Of course,’ said Alice; ‘and I say, he was buried after all. Why\nshouldn’t we let him have the odd somethings, and we’ll have fourpence\neach.’\n\nWe all agreed to do this, and told Albert-next-door we would bring his\nshare as soon as we could get the half-crown changed. He cheered up a\nlittle at that, and his uncle wiped his face again--he did look hot--and\nbegan to put on his coat and waistcoat.\n\nWhen he had done it he stooped and picked up something. He held it up,\nand you will hardly believe it, but it is quite true--it was another\nhalf-crown!\n\n‘To think that there should be two!’ he said; ‘in all my experience of\nburied treasure I never heard of such a thing!’\n\nI wish Albert-next-door’s uncle would come treasure-seeking with us\nregularly; he must have very sharp eyes: for Dora says she was looking\njust the minute before at the very place where the second half-crown was\npicked up from, and _she_ never saw it.\n\n\n\nCHAPTER 3. BEING DETECTIVES\n\nThe next thing that happened to us was very interesting. It was as real\nas the half-crowns--not just pretending. I shall try to write it as like\na real book as I can. Of course we have read Mr Sherlock Holmes, as\nwell as the yellow-covered books with pictures outside that are so badly\nprinted; and you get them for fourpence-halfpenny at the bookstall when\nthe corners of them are beginning to curl up and get dirty, with people\nlooking to see how the story ends when they are waiting for trains. I\nthink this is most unfair to the boy at the bookstall. The books are\nwritten by a gentleman named Gaboriau, and Albert’s uncle says they are\nthe worst translations in the world--and written in vile English. Of\ncourse they’re not like Kipling, but they’re jolly good stories. And we\nhad just been reading a book by Dick Diddlington--that’s not his right\nname, but I know all about libel actions, so I shall not say what his\nname is really, because his books are rot. Only they put it into our\nheads to do what I am going to narrate.\n\nIt was in September, and we were not to go to the seaside because it is\nso expensive, even if you go to Sheerness, where it is all tin cans and\nold boots and no sand at all. But every one else went, even the people\nnext door--not Albert’s side, but the other. Their servant told Eliza\nthey were all going to Scarborough, and next day sure enough all the\nblinds were down and the shutters up, and the milk was not left any\nmore. There is a big horse-chestnut tree between their garden and ours,\nvery useful for getting conkers out of and for making stuff to rub on\nyour chilblains. This prevented our seeing whether the blinds were\ndown at the back as well, but Dicky climbed to the top of the tree and\nlooked, and they were.\n\nIt was jolly hot weather, and very stuffy indoors--we used to play a\ngood deal in the garden. We made a tent out of the kitchen clothes-horse\nand some blankets off our beds, and though it was quite as hot in the\ntent as in the house it was a very different sort of hotness. Albert’s\nuncle called it the Turkish Bath. It is not nice to be kept from the\nseaside, but we know that we have much to be thankful for. We might be\npoor little children living in a crowded alley where even at summer\nnoon hardly a ray of sunlight penetrates; clothed in rags and with bare\nfeet--though I do not mind holes in my clothes myself, and bare\nfeet would not be at all bad in this sort of weather. Indeed we do,\nsometimes, when we are playing at things which require it. It was\nshipwrecked mariners that day, I remember, and we were all in the\nblanket tent. We had just finished eating the things we had saved, at\nthe peril of our lives, from the st-sinking vessel. They were rather\nnice things. Two-pennyworth of coconut candy--it was got in Greenwich,\nwhere it is four ounces a penny--three apples, some macaroni--the\nstraight sort that is so useful to suck things through--some raw rice,\nand a large piece of cold suet pudding that Alice nicked from the larder\nwhen she went to get the rice and macaroni. And when we had finished\nsome one said--\n\n‘I should like to be a detective.’\n\nI wish to be quite fair, but I cannot remember exactly who said it.\nOswald thinks he said it, and Dora says it was Dicky, but Oswald is too\nmuch of a man to quarrel about a little thing like that.\n\n‘I should like to be a detective,’ said--perhaps it was Dicky, but I\nthink not--‘and find out strange and hidden crimes.’\n\n‘You have to be much cleverer than you are,’ said H. O.\n\n‘Not so very,’ Alice said, ‘because when you’ve read the books you know\nwhat the things mean: the red hair on the handle of the knife, or the\ngrains of white powder on the velvet collar of the villain’s overcoat. I\nbelieve we could do it.’\n\n‘I shouldn’t like to have anything to do with murders,’ said Dora;\n‘somehow it doesn’t seem safe--’\n\n‘And it always ends in the poor murderer being hanged,’ said Alice.\n\nWe explained to her why murderers have to be hanged, but she only said,\n‘I don’t care. I’m sure no one would ever do murdering _twice_. Think\nof the blood and things, and what you would see when you woke up in the\nnight! I shouldn’t mind being a detective to lie in wait for a gang\nof coiners, now, and spring upon them unawares, and secure\nthem--single-handed, you know, or with only my faithful bloodhound.’\n\nShe stroked Pincher’s ears, but he had gone to sleep because he knew\nwell enough that all the suet pudding was finished. He is a very\nsensible dog. ‘You always get hold of the wrong end of the stick,’\nOswald said. ‘You can’t choose what crimes you’ll be a detective about.\nYou just have to get a suspicious circumstance, and then you look for a\nclue and follow it up. Whether it turns out a murder or a missing will\nis just a fluke.’\n\n‘That’s one way,’ Dicky said. ‘Another is to get a paper and find\ntwo advertisements or bits of news that fit. Like this: “Young Lady\nMissing,” and then it tells about all the clothes she had on, and the\ngold locket she wore, and the colour of her hair, and all that; and then\nin another piece of the paper you see, “Gold locket found,” and then it\nall comes out.’\n\nWe sent H. O. for the paper at once, but we could not make any of the\nthings fit in. The two best were about how some burglars broke into\na place in Holloway where they made preserved tongues and invalid\ndelicacies, and carried off a lot of them. And on another page there\nwas, ‘Mysterious deaths in Holloway.’\n\nOswald thought there was something in it, and so did Albert’s uncle when\nwe asked him, but the others thought not, so Oswald agreed to drop it.\nBesides, Holloway is a long way off. All the time we were talking about\nthe paper Alice seemed to be thinking about something else, and when we\nhad done she said--\n\n‘I believe we might be detectives ourselves, but I should not like to\nget anybody into trouble.’\n\n‘Not murderers or robbers?’ Dicky asked.\n\n‘It wouldn’t be murderers,’ she said; ‘but I _have_ noticed something\nstrange. Only I feel a little frightened. Let’s ask Albert’s uncle\nfirst.’\n\nAlice is a jolly sight too fond of asking grown-up people things. And we\nall said it was tommyrot, and she was to tell us.\n\n‘Well, promise you won’t do anything without me,’ Alice said, and we\npromised. Then she said--\n\n‘This is a dark secret, and any one who thinks it is better not to be\ninvolved in a career of crime-discovery had better go away ere yet it be\ntoo late.’\n\nSo Dora said she had had enough of tents, and she was going to look at\nthe shops. H. O. went with her because he had twopence to spend. They\nthought it was only a game of Alice’s but Oswald knew by the way she\nspoke. He can nearly always tell. And when people are not telling the\ntruth Oswald generally knows by the way they look with their eyes.\nOswald is not proud of being able to do this. He knows it is through no\nmerit of his own that he is much cleverer than some people.\n\nWhen they had gone, the rest of us got closer together and said--\n\n‘Now then.’\n\n‘Well,’ Alice said, ‘you know the house next door? The people have gone\nto Scarborough. And the house is shut up. But last night _I saw a light\nin the windows_.’\n\nWe asked her how and when, because her room is in the front, and she\ncouldn’t possibly have seen. And then she said--\n\n‘I’ll tell you if you boys will promise not ever to go fishing again\nwithout me.’\n\nSo we had to promise.\n\nThen she said--\n\n‘It was last night. I had forgotten to feed my rabbits and I woke up and\nremembered it. And I was afraid I should find them dead in the morning,\nlike Oswald did.’\n\n‘It wasn’t my fault,’ Oswald said; ‘there was something the matter with\nthe beasts. I fed them right enough.’\n\nAlice said she didn’t mean that, and she went on--\n\n‘I came down into the garden, and I saw a light in the house, and dark\nfigures moving about. I thought perhaps it was burglars, but Father\nhadn’t come home, and Eliza had gone to bed, so I couldn’t do anything.\nOnly I thought perhaps I would tell the rest of you.’\n\n‘Why didn’t you tell us this morning?’ Noel asked. And Alice explained\nthat she did not want to get any one into trouble, even burglars. ‘But\nwe might watch to-night,’ she said, ‘and see if we see the light again.’\n\n‘They might have been burglars,’ Noel said. He was sucking the last bit\nof his macaroni. ‘You know the people next door are very grand. They\nwon’t know us--and they go out in a real private carriage sometimes. And\nthey have an “At Home” day, and people come in cabs. I daresay they have\npiles of plate and jewellery and rich brocades, and furs of price and\nthings like that. Let us keep watch to-night.’\n\n‘It’s no use watching to-night,’ Dicky said; ‘if it’s only burglars they\nwon’t come again. But there are other things besides burglars that are\ndiscovered in empty houses where lights are seen moving.’\n\n‘You mean coiners,’ said Oswald at once. ‘I wonder what the reward is\nfor setting the police on their track?’\n\nDicky thought it ought to be something fat, because coiners are always\na desperate gang; and the machinery they make the coins with is so heavy\nand handy for knocking down detectives.\n\nThen it was tea-time, and we went in; and Dora and H. O. had clubbed\ntheir money together and bought a melon; quite a big one, and only a\nlittle bit squashy at one end. It was very good, and then we washed the\nseeds and made things with them and with pins and cotton. And nobody\nsaid any more about watching the house next door.\n\nOnly when we went to bed Dicky took off his coat and waistcoat, but he\nstopped at his braces, and said--\n\n‘What about the coiners?’\n\nOswald had taken off his collar and tie, and he was just going to say\nthe same, so he said, ‘Of course I meant to watch, only my collar’s\nrather tight, so I thought I’d take it off first.’\n\nDicky said he did not think the girls ought to be in it, because there\nmight be danger, but Oswald reminded him that they had promised Alice,\nand that a promise is a sacred thing, even when you’d much rather\nnot. So Oswald got Alice alone under pretence of showing her a\ncaterpillar--Dora does not like them, and she screamed and ran away when\nOswald offered to show it her. Then Oswald explained, and Alice agreed\nto come and watch if she could. This made us later than we ought to have\nbeen, because Alice had to wait till Dora was quiet and then creep out\nvery slowly, for fear of the boards creaking. The girls sleep with their\nroom-door open for fear of burglars. Alice had kept on her clothes\nunder her nightgown when Dora wasn’t looking, and presently we got down,\ncreeping past Father’s study, and out at the glass door that leads on\nto the veranda and the iron steps into the garden. And we went down very\nquietly, and got into the chestnut-tree; and then I felt that we had\nonly been playing what Albert’s uncle calls our favourite instrument--I\nmean the Fool. For the house next door was as dark as dark. Then\nsuddenly we heard a sound--it came from the gate at the end of the\ngarden. All the gardens have gates; they lead into a kind of lane that\nruns behind them. It is a sort of back way, very convenient when you\ndon’t want to say exactly where you are going. We heard the gate at the\nend of the next garden click, and Dicky nudged Alice so that she\nwould have fallen out of the tree if it had not been for Oswald’s\nextraordinary presence of mind. Oswald squeezed Alice’s arm tight, and\nwe all looked; and the others were rather frightened because really we\nhad not exactly expected anything to happen except perhaps a light. But\nnow a muffled figure, shrouded in a dark cloak, came swiftly up the\npath of the next-door garden. And we could see that under its cloak the\nfigure carried a mysterious burden. The figure was dressed to look like\na woman in a sailor hat.\n\nWe held our breath as it passed under the tree where we were, and then\nit tapped very gently on the back door and was let in, and then a light\nappeared in the window of the downstairs back breakfast-room. But the\nshutters were up.\n\nDicky said, ‘My eye!’ and wouldn’t the others be sick to think they\nhadn’t been in this! But Alice didn’t half like it--and as she is a girl\nI do not blame her. Indeed, I thought myself at first that perhaps\nit would be better to retire for the present, and return later with a\nstrongly armed force.\n\n‘It’s not burglars,’ Alice whispered; ‘the mysterious stranger was\nbringing things in, not taking them out. They must be coiners--and oh,\nOswald!--don’t let’s! The things they coin with must hurt very much. Do\nlet’s go to bed!’\n\nBut Dicky said he was going to see; if there was a reward for finding\nout things like this he would like to have the reward.\n\n‘They locked the back door,’ he whispered, ‘I heard it go. And I could\nlook in quite well through the holes in the shutters and be back over\nthe wall long before they’d got the door open, even if they started to\ndo it at once.’\n\nThere were holes at the top of the shutters the shape of hearts, and the\nyellow light came out through them as well as through the chinks of the\nshutters.\n\nOswald said if Dicky went he should, because he was the eldest; and\nAlice said, ‘If any one goes it ought to be me, because I thought of\nit.’\n\nSo Oswald said, ‘Well, go then’; and she said, ‘Not for anything!’ And\nshe begged us not to, and we talked about it in the tree till we were\nall quite hoarse with whispering.\n\nAt last we decided on a plan of action.\n\nAlice was to stay in the tree, and scream ‘Murder!’ if anything\nhappened. Dicky and I were to get down into the next garden and take it\nin turns to peep.\n\nSo we got down as quietly as we could, but the tree made much more noise\nthan it does in the day, and several times we paused, fearing that all\nwas discovered. But nothing happened.\n\nThere was a pile of red flower-pots under the window and one very large\none was on the window-ledge. It seemed as if it was the hand of Destiny\nhad placed it there, and the geranium in it was dead, and there was\nnothing to stop your standing on it--so Oswald did. He went first\nbecause he is the eldest, and though Dicky tried to stop him because he\nthought of it first it could not be, on account of not being able to say\nanything.\n\nSo Oswald stood on the flower-pot and tried to look through one of the\nholes. He did not really expect to see the coiners at their fell work,\nthough he had pretended to when we were talking in the tree. But if he\nhad seen them pouring the base molten metal into tin moulds the shape of\nhalf-crowns he would not have been half so astonished as he was at the\nspectacle now revealed.\n\nAt first he could see little, because the hole had unfortunately been\nmade a little too high, so that the eye of the detective could only see\nthe Prodigal Son in a shiny frame on the opposite wall. But Oswald held\non to the window-frame and stood on tiptoe and then he _saw_.\n\nThere was no furnace, and no base metal, no bearded men in leathern\naprons with tongs and things, but just a table with a table-cloth on it\nfor supper, and a tin of salmon and a lettuce and some bottled beer. And\nthere on a chair was the cloak and the hat of the mysterious stranger,\nand the two people sitting at the table were the two youngest grown-up\ndaughters of the lady next door, and one of them was saying--\n\n‘So I got the salmon three-halfpence cheaper, and the lettuces are only\nsix a penny in the Broadway, just fancy! We must save as much as ever we\ncan on our housekeeping money if we want to go away decent next year.’\n\nAnd the other said, ‘I wish we could _all_ go _every_ year, or\nelse--Really, I almost wish--’\n\nAnd all the time Oswald was looking Dicky was pulling at his jacket to\nmake him get down and let Dicky have a squint. And just as she said ‘I\nalmost,’ Dicky pulled too hard and Oswald felt himself toppling on the\ngiddy verge of the big flower-pots. Putting forth all his strength our\nhero strove to recover his equi-what’s-its-name, but it was now lost\nbeyond recall.\n\n‘You’ve done it this time!’ he said, then he fell heavily among the\nflower-pots piled below. He heard them crash and rattle and crack, and\nthen his head struck against an iron pillar used for holding up the\nnext-door veranda. His eyes closed and he knew no more.\n\nNow you will perhaps expect that at this moment Alice would have cried\n‘Murder!’ If you think so you little know what girls are. Directly she\nwas left alone in that tree she made a bolt to tell Albert’s uncle all\nabout it and bring him to our rescue in case the coiner’s gang was a\nvery desperate one. And just when I fell, Albert’s uncle was getting\nover the wall. Alice never screamed at all when Oswald fell, but Dicky\nthinks he heard Albert’s uncle say, ‘Confound those kids!’ which would\nnot have been kind or polite, so I hope he did not say it.\n\nThe people next door did not come out to see what the row was. Albert’s\nuncle did not wait for them to come out. He picked up Oswald and carried\nthe insensible body of the gallant young detective to the wall, laid it\non the top, and then climbed over and bore his lifeless burden into our\nhouse and put it on the sofa in Father’s study. Father was out, so\nwe needn’t have _crept_ so when we were getting into the garden. Then\nOswald was restored to consciousness, and his head tied up, and sent\nto bed, and next day there was a lump on his young brow as big as a\nturkey’s egg, and very uncomfortable.\n\nAlbert’s uncle came in next day and talked to each of us separately.\nTo Oswald he said many unpleasant things about ungentlemanly to spy on\nladies, and about minding your own business; and when I began to tell\nhim what I had heard he told me to shut up, and altogether he made me\nmore uncomfortable than the bump did.\n\nOswald did not say anything to any one, but next day, as the shadows of\neve were falling, he crept away, and wrote on a piece of paper, ‘I want\nto speak to you,’ and shoved it through the hole like a heart in the top\nof the next-door shutters. And the youngest young lady put an eye to\nthe heart-shaped hole, and then opened the shutter and said ‘Well?’ very\ncrossly. Then Oswald said--\n\n‘I am very sorry, and I beg your pardon. We wanted to be detectives, and\nwe thought a gang of coiners infested your house, so we looked through\nyour window last night. I saw the lettuce, and I heard what you said\nabout the salmon being three-halfpence cheaper, and I know it is very\ndishonourable to pry into other people’s secrets, especially ladies’,\nand I never will again if you will forgive me this once.’\n\nThen the lady frowned and then she laughed, and then she said--\n\n‘So it was you tumbling into the flower-pots last night? We thought it\nwas burglars. It frightened us horribly. Why, what a bump on your poor\nhead!’\n\nAnd then she talked to me a bit, and presently she said she and her\nsister had not wished people to know they were at home, because--And\nthen she stopped short and grew very red, and I said, ‘I thought you\nwere all at Scarborough; your servant told Eliza so. Why didn’t you want\npeople to know you were at home?’\n\nThe lady got redder still, and then she laughed and said--\n\n‘Never mind the reason why. I hope your head doesn’t hurt much. Thank\nyou for your nice, manly little speech. _You’ve_ nothing to be ashamed\nof, at any rate.’ Then she kissed me, and I did not mind. And then she\nsaid, ‘Run away now, dear. I’m going to--I’m going to pull up the blinds\nand open the shutters, and I want to do it at _once_, before it gets\ndark, so that every one can see we’re at home, and not at Scarborough.’\n\n\n\nCHAPTER 4. GOOD HUNTING\n\nWhen we had got that four shillings by digging for treasure we ought, by\nrights, to have tried Dicky’s idea of answering the advertisement about\nladies and gentlemen and spare time and two pounds a week, but there\nwere several things we rather wanted.\n\nDora wanted a new pair of scissors, and she said she was going to get\nthem with her eight-pence. But Alice said--\n\n‘You ought to get her those, Oswald, because you know you broke the\npoints off hers getting the marble out of the brass thimble.’\n\nIt was quite true, though I had almost forgotten it, but then it was H.\nO. who jammed the marble into the thimble first of all. So I said--\n\n‘It’s H. O.’s fault as much as mine, anyhow. Why shouldn’t he pay?’\n\nOswald didn’t so much mind paying for the beastly scissors, but he hates\ninjustice of every kind.\n\n‘He’s such a little kid,’ said Dicky, and of course H. O. said he wasn’t\na little kid, and it very nearly came to being a row between them. But\nOswald knows when to be generous; so he said--\n\n‘Look here! I’ll pay sixpence of the scissors, and H. O. shall pay the\nrest, to teach him to be careful.’\n\nH. O. agreed: he is not at all a mean kid, but I found out afterwards\nthat Alice paid his share out of her own money.\n\nThen we wanted some new paints, and Noel wanted a pencil and a halfpenny\naccount-book to write poetry with, and it does seem hard never to have\nany apples. So, somehow or other nearly all the money got spent, and we\nagreed that we must let the advertisement run loose a little longer.\n\n‘I only hope,’ Alice said, ‘that they won’t have got all the ladies and\ngentlemen they want before we have got the money to write for the sample\nand instructions.’\n\nAnd I was a little afraid myself, because it seemed such a splendid\nchance; but we looked in the paper every day, and the advertisement was\nalways there, so we thought it was all right.\n\nThen we had the detective try-on--and it proved no go; and then, when\nall the money was gone, except a halfpenny of mine and twopence of\nNoel’s and three-pence of Dicky’s and a few pennies that the girls had\nleft, we held another council.\n\nDora was sewing the buttons on H. O.’s Sunday things. He got himself a\nknife with his money, and he cut every single one of his best buttons\noff. You’ve no idea how many buttons there are on a suit. Dora counted\nthem. There are twenty-four, counting the little ones on the sleeves\nthat don’t undo.\n\nAlice was trying to teach Pincher to beg; but he has too much sense\nwhen he knows you’ve got nothing in your hands, and the rest of us were\nroasting potatoes under the fire. We had made a fire on purpose,\nthough it was rather warm. They are very good if you cut away the burnt\nparts--but you ought to wash them first, or you are a dirty boy.\n\n‘Well, what can we do?’ said Dicky. ‘You are so fond of saying “Let’s do\nsomething!” and never saying what.’\n\n‘We can’t try the advertisement yet. Shall we try rescuing some one?’\nsaid Oswald. It was his own idea, but he didn’t insist on doing it,\nthough he is next to the eldest, for he knows it is bad manners to make\npeople do what you want, when they would rather not.\n\n‘What was Noel’s plan?’ Alice asked.\n\n‘A Princess or a poetry book,’ said Noel sleepily. He was lying on his\nback on the sofa, kicking his legs. ‘Only I shall look for the Princess\nall by myself. But I’ll let you see her when we’re married.’\n\n‘Have you got enough poetry to make a book?’ Dicky asked that, and it\nwas rather sensible of him, because when Noel came to look there were\nonly seven of his poems that any of us could understand. There was the\n‘Wreck of the Malabar’, and the poem he wrote when Eliza took us to hear\nthe Reviving Preacher, and everybody cried, and Father said it must have\nbeen the Preacher’s Eloquence. So Noel wrote:\n\n    O Eloquence and what art thou?\n    Ay what art thou? because we cried\n    And everybody cried inside\n    When they came out their eyes were red--\n    And it was your doing Father said.\n\nBut Noel told Alice he got the first line and a half from a book a boy\nat school was going to write when he had time. Besides this there were\nthe ‘Lines on a Dead Black Beetle that was poisoned’--\n\n    O Beetle how I weep to see\n       Thee lying on thy poor back!\n    It is so very sad indeed.\n       You were so shiny and black.\n    I wish you were alive again\n    But Eliza says wishing it is nonsense and a shame.\n\nIt was very good beetle poison, and there were hundreds of them lying\ndead--but Noel only wrote a piece of poetry for one of them. He said he\nhadn’t time to do them all, and the worst of it was he didn’t know which\none he’d written it to--so Alice couldn’t bury the beetle and put the\nlines on its grave, though she wanted to very much.\n\nWell, it was quite plain that there wasn’t enough poetry for a book.\n\n‘We might wait a year or two,’ said Noel. ‘I shall be sure to make some\nmore some time. I thought of a piece about a fly this morning that knew\ncondensed milk was sticky.’\n\n‘But we want the money _now_,’ said Dicky, ‘and you can go on writing\njust the same. It will come in some time or other.’\n\n‘There’s poetry in newspapers,’ said Alice. ‘Down, Pincher! you’ll never\nbe a clever dog, so it’s no good trying.’\n\n‘Do they pay for it?’ Dicky thought of that; he often thinks of things\nthat are really important, even if they are a little dull.\n\n‘I don’t know. But I shouldn’t think any one would let them print their\npoetry without. I wouldn’t I know.’ That was Dora; but Noel said he\nwouldn’t mind if he didn’t get paid, so long as he saw his poetry\nprinted and his name at the end.\n\n‘We might try, anyway,’ said Oswald. He is always willing to give other\npeople’s ideas a fair trial.\n\nSo we copied out ‘The Wreck of the Malabar’ and the other six poems on\ndrawing-paper--Dora did it, she writes best--and Oswald drew a picture\nof the Malabar going down with all hands. It was a full-rigged schooner,\nand all the ropes and sails were correct; because my cousin is in the\nNavy, and he showed me.\n\nWe thought a long time whether we’d write a letter and send it by post\nwith the poetry--and Dora thought it would be best. But Noel said he\ncouldn’t bear not to know at once if the paper would print the poetry,\nSo we decided to take it.\n\nI went with Noel, because I am the eldest, and he is not old enough to\ngo to London by himself. Dicky said poetry was rot--and he was glad he\nhadn’t got to make a fool of himself. That was because there was not\nenough money for him to go with us. H. O. couldn’t come either, but\nhe came to the station to see us off, and waved his cap and called out\n‘Good hunting!’ as the train started.\n\nThere was a lady in spectacles in the corner. She was writing with a\npencil on the edges of long strips of paper that had print all down\nthem. When the train started she asked--\n\n‘What was that he said?’\n\nSo Oswald answered--\n\n‘It was “Good hunting”--it’s out of the Jungle Book!’ ‘That’s very\npleasant to hear,’ the lady said; ‘I am very pleased to meet people who\nknow their Jungle Book. And where are you off to--the Zoological Gardens\nto look for Bagheera?’\n\nWe were pleased, too, to meet some one who knew the Jungle Book.\n\nSo Oswald said--\n\n‘We are going to restore the fallen fortunes of the House of\nBastable--and we have all thought of different ways--and we’re going to\ntry them all. Noel’s way is poetry. I suppose great poets get paid?’\n\nThe lady laughed--she was awfully jolly--and said she was a sort of\npoet, too, and the long strips of paper were the proofs of her new book\nof stories. Because before a book is made into a real book with pages\nand a cover, they sometimes print it all on strips of paper, and the\nwriter make marks on it with a pencil to show the printers what idiots\nthey are not to understand what a writer means to have printed.\n\nWe told her all about digging for treasure, and what we meant to do.\nThen she asked to see Noel’s poetry--and he said he didn’t like--so she\nsaid, ‘Look here--if you’ll show me yours I’ll show you some of mine.’\nSo he agreed.\n\nThe jolly lady read Noel’s poetry, and she said she liked it very much.\nAnd she thought a great deal of the picture of the Malabar. And then she\nsaid, ‘I write serious poetry like yours myself; too, but I have a piece\nhere that I think you will like because it’s about a boy.’ She gave it\nto us--and so I can copy it down, and I will, for it shows that some\ngrown-up ladies are not so silly as others. I like it better than Noel’s\npoetry, though I told him I did not, because he looked as if he was\ngoing to cry. This was very wrong, for you should always speak the\ntruth, however unhappy it makes people. And I generally do. But I did\nnot want him crying in the railway carriage. The lady’s piece of poetry:\n\n    Oh when I wake up in my bed\n    And see the sun all fat and red,\n    I’m glad to have another day\n    For all my different kinds of play.\n\n    There are so many things to do--\n    The things that make a man of you,\n    If grown-ups did not get so vexed\n    And wonder what you will do next.\n\n    I often wonder whether they\n    Ever made up our kinds of play--\n    If they were always good as gold\n    And only did what they were told.\n\n    They like you best to play with tops\n    And toys in boxes, bought in shops;\n    They do not even know the names\n    Of really interesting games.\n\n    They will not let you play with fire\n    Or trip your sister up with wire,\n    They grudge the tea-tray for a drum,\n    Or booby-traps when callers come.\n\n    They don’t like fishing, and it’s true\n    You sometimes soak a suit or two:\n    They look on fireworks, though they’re dry,\n    With quite a disapproving eye.\n\n    They do not understand the way\n    To get the most out of your day:\n    They do not know how hunger feels\n    Nor what you need between your meals.\n\n    And when you’re sent to bed at night,\n    They’re happy, but they’re not polite.\n    For through the door you hear them say:\n    ‘_He’s_ done _his_ mischief for the day!’\n\nShe told us a lot of other pieces but I cannot remember them, and she\ntalked to us all the way up, and when we got nearly to Cannon Street she\nsaid--\n\n‘I’ve got two new shillings here! Do you think they would help to smooth\nthe path to Fame?’\n\nNoel said, ‘Thank you,’ and was going to take the shilling. But Oswald,\nwho always remembers what he is told, said--\n\n‘Thank you very much, but Father told us we ought never to take anything\nfrom strangers.’\n\n‘That’s a nasty one,’ said the lady--she didn’t talk a bit like a real\nlady, but more like a jolly sort of grown-up boy in a dress and hat--‘a\nvery nasty one! But don’t you think as Noel and I are both poets I might\nbe considered a sort of relation? You’ve heard of brother poets, haven’t\nyou? Don’t you think Noel and I are aunt and nephew poets, or some\nrelationship of that kind?’\n\nI didn’t know what to say, and she went on--\n\n‘It’s awfully straight of you to stick to what your Father tells you,\nbut look here, you take the shillings, and here’s my card. When you\nget home tell your Father all about it, and if he says No, you can just\nbring the shillings back to me.’\n\nSo we took the shillings, and she shook hands with us and said,\n‘Good-bye, and good hunting!’\n\nWe did tell Father about it, and he said it was all right, and when\nhe looked at the card he told us we were highly honoured, for the lady\nwrote better poetry than any other lady alive now. We had never heard of\nher, and she seemed much too jolly for a poet. Good old Kipling! We owe\nhim those two shillings, as well as the Jungle books!\n\n\n\nCHAPTER 5. THE POET AND THE EDITOR\n\nIt was not bad sport--being in London entirely on our own hook. We asked\nthe way to Fleet Street, where Father says all the newspaper offices\nare. They said straight on down Ludgate Hill--but it turned out to be\nquite another way. At least _we_ didn’t go straight on.\n\nWe got to St Paul’s. Noel _would_ go in, and we saw where Gordon was\nburied--at least the monument. It is very flat, considering what a man\nhe was.\n\nWhen we came out we walked a long way, and when we asked a policeman he\nsaid we’d better go back through Smithfield. So we did. They don’t burn\npeople any more there now, so it was rather dull, besides being a long\nway, and Noel got very tired. He’s a peaky little chap; it comes of\nbeing a poet, I think. We had a bun or two at different shops--out of\nthe shillings--and it was quite late in the afternoon when we got to\nFleet Street. The gas was lighted and the electric lights. There is a\njolly Bovril sign that comes off and on in different coloured lamps. We\nwent to the Daily Recorder office, and asked to see the Editor. It is a\nbig office, very bright, with brass and mahogany and electric lights.\n\nThey told us the Editor wasn’t there, but at another office. So we went\ndown a dirty street, to a very dull-looking place. There was a man there\ninside, in a glass case, as if he was a museum, and he told us to write\ndown our names and our business. So Oswald wrote--\n\n           OSWALD BASTABLE\n            NOEL BASTABLE\n      BUSINESS VERY PRIVATE INDEED\n\nThen we waited on the stone stairs; it was very draughty. And the man in\nthe glass case looked at us as if we were the museum instead of him. We\nwaited a long time, and then a boy came down and said--\n\n‘The Editor can’t see you. Will you please write your business?’ And he\nlaughed. I wanted to punch his head.\n\nBut Noel said, ‘Yes, I’ll write it if you’ll give me a pen and ink, and\na sheet of paper and an envelope.’\n\nThe boy said he’d better write by post. But Noel is a bit pig-headed;\nit’s his worst fault. So he said--‘No, I’ll write it _now_.’ So I backed\nhim up by saying--\n\n‘Look at the price penny stamps are since the coal strike!’\n\nSo the boy grinned, and the man in the glass case gave us pen and paper,\nand Noel wrote. Oswald writes better than he does; but Noel would do it;\nand it took a very long time, and then it was inky.\n\n    DEAR MR EDITOR, I want you to print my poetry and pay for it,\n    and I am a friend of Mrs Leslie’s; she is a poet too.\n\n    Your affectionate friend,\n\n    NOEL BASTABLE.\n\nHe licked the envelope a good deal, so that that boy shouldn’t read it\ngoing upstairs; and he wrote ‘Very private’ outside, and gave the letter\nto the boy. I thought it wasn’t any good; but in a minute the grinning\nboy came back, and he was quite respectful, and said--‘The Editor says,\nplease will you step up?’\n\nWe stepped up. There were a lot of stairs and passages, and a queer sort\nof humming, hammering sound and a very funny smell. The boy was now very\npolite, and said it was the ink we smelt, and the noise was the printing\nmachines.\n\nAfter going through a lot of cold passages we came to a door; the boy\nopened it, and let us go in. There was a large room, with a big, soft,\nblue-and-red carpet, and a roaring fire, though it was only October; and\na large table with drawers, and littered with papers, just like the one\nin Father’s study. A gentleman was sitting at one side of the table; he\nhad a light moustache and light eyes, and he looked very young to be an\neditor--not nearly so old as Father. He looked very tired and sleepy,\nas if he had got up very early in the morning; but he was kind, and we\nliked him. Oswald thought he looked clever. Oswald is considered a judge\nof faces.\n\n‘Well,’ said he, ‘so you are Mrs Leslie’s friends?’\n\n‘I think so,’ said Noel; ‘at least she gave us each a shilling, and she\nwished us “good hunting!”’\n\n‘Good hunting, eh? Well, what about this poetry of yours? Which is the\npoet?’\n\nI can’t think how he could have asked! Oswald is said to be a very\nmanly-looking boy for his age. However, I thought it would look duffing\nto be offended, so I said--\n\n‘This is my brother Noel. He is the poet.’ Noel had turned quite pale.\nHe is disgustingly like a girl in some ways. The Editor told us to sit\ndown, and he took the poems from Noel, and began to read them. Noel got\npaler and paler; I really thought he was going to faint, like he did\nwhen I held his hand under the cold-water tap, after I had accidentally\ncut him with my chisel. When the Editor had read the first poem--it was\nthe one about the beetle--he got up and stood with his back to us. It\nwas not manners; but Noel thinks he did it ‘to conceal his emotion,’ as\nthey do in books. He read all the poems, and then he said--\n\n‘I like your poetry very much, young man. I’ll give you--let me see; how\nmuch shall I give you for it?’\n\n‘As much as ever you can,’ said Noel. ‘You see I want a good deal of\nmoney to restore the fallen fortunes of the house of Bastable.’\n\nThe gentleman put on some eye-glasses and looked hard at us. Then he sat\ndown.\n\n‘That’s a good idea,’ said he. ‘Tell me how you came to think of it.\nAnd, I say, have you had any tea? They’ve just sent out for mine.’\n\nHe rang a tingly bell, and the boy brought in a tray with a teapot and\na thick cup and saucer and things, and he had to fetch another tray for\nus, when he was told to; and we had tea with the Editor of the Daily\nRecorder. I suppose it was a very proud moment for Noel, though I\ndid not think of that till afterwards. The Editor asked us a lot of\nquestions, and we told him a good deal, though of course I did not tell\na stranger all our reasons for thinking that the family fortunes wanted\nrestoring. We stayed about half an hour, and when we were going away he\nsaid again--\n\n‘I shall print all your poems, my poet; and now what do you think\nthey’re worth?’\n\n‘I don’t know,’ Noel said. ‘You see I didn’t write them to sell.’\n\n‘Why did you write them then?’ he asked.\n\nNoel said he didn’t know; he supposed because he wanted to.\n\n‘Art for Art’s sake, eh?’ said the Editor, and he seemed quite\ndelighted, as though Noel had said something clever.\n\n‘Well, would a guinea meet your views?’ he asked.\n\nI have read of people being at a loss for words, and dumb with emotion,\nand I’ve read of people being turned to stone with astonishment, or\njoy, or something, but I never knew how silly it looked till I saw Noel\nstanding staring at the Editor with his mouth open. He went red and he\nwent white, and then he got crimson, as if you were rubbing more and\nmore crimson lake on a palette. But he didn’t say a word, so Oswald had\nto say--\n\n‘I should jolly well think so.’\n\nSo the Editor gave Noel a sovereign and a shilling, and he shook hands\nwith us both, but he thumped Noel on the back and said--\n\n‘Buck up, old man! It’s your first guinea, but it won’t be your last.\nNow go along home, and in about ten years you can bring me some more\npoetry. Not before--see? I’m just taking this poetry of yours because I\nlike it very much; but we don’t put poetry in this paper at all. I shall\nhave to put it in another paper I know of.’\n\n‘What _do_ you put in your paper?’ I asked, for Father always takes the\nDaily Chronicle, and I didn’t know what the Recorder was like. We chose\nit because it has such a glorious office, and a clock outside lighted\nup.\n\n‘Oh, news,’ said he, ‘and dull articles, and things about Celebrities.\nIf you know any Celebrities, now?’\n\nNoel asked him what Celebrities were.\n\n‘Oh, the Queen and the Princes, and people with titles, and people who\nwrite, or sing, or act--or do something clever or wicked.’\n\n‘I don’t know anybody wicked,’ said Oswald, wishing he had known Dick\nTurpin, or Claude Duval, so as to be able to tell the Editor things\nabout them. ‘But I know some one with a title--Lord Tottenham.’\n\n‘The mad old Protectionist, eh? How did you come to know him?’\n\n‘We don’t know him to speak to. But he goes over the Heath every day at\nthree, and he strides along like a giant--with a black cloak like Lord\nTennyson’s flying behind him, and he talks to himself like one o’clock.’\n\n‘What does he say?’ The Editor had sat down again, and he was fiddling\nwith a blue pencil.\n\n‘We only heard him once, close enough to understand, and then he said,\n“The curse of the country, sir--ruin and desolation!” And then he went\nstriding along again, hitting at the furze-bushes as if they were the\nheads of his enemies.’\n\n‘Excellent descriptive touch,’ said the Editor. ‘Well, go on.’\n\n‘That’s all I know about him, except that he stops in the middle of the\nHeath every day, and he looks all round to see if there’s any one about,\nand if there isn’t, he takes his collar off.’\n\nThe Editor interrupted--which is considered rude--and said--\n\n‘You’re not romancing?’\n\n‘I beg your pardon?’ said Oswald. ‘Drawing the long bow, I mean,’ said\nthe Editor.\n\nOswald drew himself up, and said he wasn’t a liar.\n\nThe Editor only laughed, and said romancing and lying were not at all\nthe same; only it was important to know what you were playing at. So\nOswald accepted his apology, and went on.\n\n‘We were hiding among the furze-bushes one day, and we saw him do it. He\ntook off his collar, and he put on a clean one, and he threw the other\namong the furze-bushes. We picked it up afterwards, and it was a beastly\npaper one!’\n\n‘Thank you,’ said the Editor, and he got up and put his hand in his\npocket. ‘That’s well worth five shillings, and there they are. Would you\nlike to see round the printing offices before you go home?’\n\nI pocketed my five bob, and thanked him, and I said we should like it\nvery much. He called another gentleman and said something we couldn’t\nhear. Then he said good-bye again; and all this time Noel hadn’t said a\nword. But now he said, ‘I’ve made a poem about you. It is called “Lines\nto a Noble Editor.” Shall I write it down?’\n\nThe Editor gave him the blue pencil, and he sat down at the Editor’s\ntable and wrote. It was this, he told me afterwards as well as he could\nremember--\n\n    May Life’s choicest blessings be your lot\n    I think you ought to be very blest\n    For you are going to print my poems--\n    And you may have this one as well as the rest.\n\n‘Thank you,’ said the Editor. ‘I don’t think I ever had a poem addressed\nto me before. I shall treasure it, I assure you.’\n\nThen the other gentleman said something about Maecenas, and we went off\nto see the printing office with at least one pound seven in our pockets.\n\nIt _was_ good hunting, and no mistake!\n\nBut he never put Noel’s poetry in the Daily Recorder. It was quite a\nlong time afterwards we saw a sort of story thing in a magazine, on the\nstation bookstall, and that kind, sleepy-looking Editor had written it,\nI suppose. It was not at all amusing. It said a lot about Noel and me,\ndescribing us all wrong, and saying how we had tea with the Editor;\nand all Noel’s poems were in the story thing. I think myself the Editor\nseemed to make game of them, but Noel was quite pleased to see them\nprinted--so that’s all right. It wasn’t my poetry anyhow, I am glad to\nsay.\n\n\n\nCHAPTER 6. NOEL’S PRINCESS\n\nShe happened quite accidentally. We were not looking for a Princess at\nall just then; but Noel had said he was going to find a Princess all by\nhimself; and marry her--and he really did. Which was rather odd, because\nwhen people say things are going to befall, very often they don’t. It\nwas different, of course, with the prophets of old.\n\nWe did not get any treasure by it, except twelve chocolate drops; but we\nmight have done, and it was an adventure, anyhow.\n\nGreenwich Park is a jolly good place to play in, especially the parts\nthat aren’t near Greenwich. The parts near the Heath are first-rate.\nI often wish the Park was nearer our house; but I suppose a Park is a\ndifficult thing to move.\n\nSometimes we get Eliza to put lunch in a basket, and we go up to the\nPark. She likes that--it saves cooking dinner for us; and sometimes she\nsays of her own accord, ‘I’ve made some pasties for you, and you might\nas well go into the Park as not. It’s a lovely day.’\n\nShe always tells us to rinse out the cup at the drinking-fountain, and\nthe girls do; but I always put my head under the tap and drink. Then you\nare an intrepid hunter at a mountain stream--and besides, you’re sure\nit’s clean. Dicky does the same, and so does H. O. But Noel always\ndrinks out of the cup. He says it is a golden goblet wrought by\nenchanted gnomes.\n\nThe day the Princess happened was a fine, hot day, last October, and we\nwere quite tired with the walk up to the Park.\n\nWe always go in by the little gate at the top of Croom’s Hill. It is\nthe postern gate that things always happen at in stories. It was dusty\nwalking, but when we got in the Park it was ripping, so we rested a bit,\nand lay on our backs, and looked up at the trees, and wished we could\nplay monkeys. I have done it before now, but the Park-keeper makes a row\nif he catches you.\n\nWhen we’d rested a little, Alice said--\n\n‘It was a long way to the enchanted wood, but it is very nice now we are\nthere. I wonder what we shall find in it?’\n\n‘We shall find deer,’ said Dicky, ‘if we go to look; but they go on the\nother side of the Park because of the people with buns.’\n\nSaying buns made us think of lunch, so we had it; and when we had done\nwe scratched a hole under a tree and buried the papers, because we know\nit spoils pretty places to leave beastly, greasy papers lying about. I\nremember Mother teaching me and Dora that, when we were quite little.\nI wish everybody’s parents would teach them this useful lesson, and the\nsame about orange peel.\n\nWhen we’d eaten everything there was, Alice whispered--\n\n‘I see the white witch bear yonder among the trees! Let’s track it and\nslay it in its lair.’\n\n‘I am the bear,’ said Noel; so he crept away, and we followed him among\nthe trees. Often the witch bear was out of sight, and then you didn’t\nknow where it would jump out from; but sometimes we saw it, and just\nfollowed.\n\n‘When we catch it there’ll be a great fight,’ said Oswald; ‘and I shall\nbe Count Folko of Mont Faucon.’\n\n‘I’ll be Gabrielle,’ said Dora. She is the only one of us who likes\ndoing girl’s parts.\n\n‘I’ll be Sintram,’ said Alice; ‘and H. O. can be the Little Master.’\n\n‘What about Dicky?’\n\n‘Oh, I can be the Pilgrim with the bones.’\n\n‘Hist!’ whispered Alice. ‘See his white fairy fur gleaming amid yonder\ncovert!’\n\nAnd I saw a bit of white too. It was Noel’s collar, and it had come\nundone at the back.\n\nWe hunted the bear in and out of the trees, and then we lost him\naltogether; and suddenly we found the wall of the Park--in a place where\nI’m sure there wasn’t a wall before. Noel wasn’t anywhere about, and\nthere was a door in the wall. And it was open; so we went through.\n\n‘The bear has hidden himself in these mountain fastnesses,’ Oswald said.\n‘I will draw my good sword and after him.’\n\nSo I drew the umbrella, which Dora always will bring in case it rains,\nbecause Noel gets a cold on the chest at the least thing--and we went\non.\n\nThe other side of the wall it was a stable yard, all cobble-stones.\n\nThere was nobody about--but we could hear a man rubbing down a horse\nand hissing in the stable; so we crept very quietly past, and Alice\nwhispered--\n\n‘’Tis the lair of the Monster Serpent; I hear his deadly hiss! Beware!\nCourage and despatch!’\n\nWe went over the stones on tiptoe, and we found another wall with\nanother door in it on the other side. We went through that too, on\ntiptoe. It really was an adventure. And there we were in a shrubbery,\nand we saw something white through the trees. Dora said it was the white\nbear. That is so like Dora. She always begins to take part in a play\njust when the rest of us are getting tired of it. I don’t mean this\nunkindly, because I am very fond of Dora. I cannot forget how kind she\nwas when I had bronchitis; and ingratitude is a dreadful vice. But it is\nquite true.\n\n‘It is not a bear,’ said Oswald; and we all went on, still on tiptoe,\nround a twisty path and on to a lawn, and there was Noel. His collar had\ncome undone, as I said, and he had an inky mark on his face that he made\njust before we left the house, and he wouldn’t let Dora wash it off,\nand one of his bootlaces was coming down. He was standing looking at a\nlittle girl; she was the funniest little girl you ever saw.\n\nShe was like a china doll--the sixpenny kind; she had a white face, and\nlong yellow hair, done up very tight in two pigtails; her forehead was\nvery big and lumpy, and her cheeks came high up, like little shelves\nunder her eyes. Her eyes were small and blue. She had on a funny black\nfrock, with curly braid on it, and button boots that went almost up to\nher knees. Her legs were very thin. She was sitting in a hammock chair\nnursing a blue kitten--not a sky-blue one, of course, but the colour\nof a new slate pencil. As we came up we heard her say to Noel--‘Who are\nyou?’\n\nNoel had forgotten about the bear, and he was taking his favourite part,\nso he said--‘I’m Prince Camaralzaman.’\n\nThe funny little girl looked pleased--\n\n‘I thought at first you were a common boy,’ she said. Then she saw the\nrest of us and said--\n\n‘Are you all Princesses and Princes too?’\n\nOf course we said ‘Yes,’ and she said--\n\n‘I am a Princess also.’ She said it very well too, exactly as if it were\ntrue. We were very glad, because it is so seldom you meet any children\nwho can begin to play right off without having everything explained to\nthem. And even then they will say they are going to ‘pretend to be’ a\nlion, or a witch, or a king. Now this little girl just said ‘I _am_ a\nPrincess.’ Then she looked at Oswald and said, ‘I fancy I’ve seen you at\nBaden.’\n\nOf course Oswald said, ‘Very likely.’\n\nThe little girl had a funny voice, and all her words were quite plain,\neach word by itself; she didn’t talk at all like we do.\n\nH. O. asked her what the cat’s name was, and she said ‘Katinka.’ Then\nDicky said--\n\n‘Let’s get away from the windows; if you play near windows some one\ninside generally knocks at them and says “Don’t”.’\n\nThe Princess put down the cat very carefully and said--\n\n‘I am forbidden to walk off the grass.’\n\n‘That’s a pity,’ said Dora.\n\n‘But I will if you like,’ said the Princess.\n\n‘You mustn’t do things you are forbidden to do,’ Dora said; but Dicky\nshowed us that there was some more grass beyond the shrubs with only a\ngravel path between. So I lifted the Princess over the gravel, so that\nshe should be able to say she hadn’t walked off the grass. When we got\nto the other grass we all sat down, and the Princess asked us if\nwe liked ‘dragees’ (I know that’s how you spell it, for I asked\nAlbert-next-door’s uncle).\n\nWe said we thought not, but she pulled a real silver box out of her\npocket and showed us; they were just flat, round chocolates. We had two\neach. Then we asked her her name, and she began, and when she began she\nwent on, and on, and on, till I thought she was never going to stop. H.\nO. said she had fifty names, but Dicky is very good at figures, and he\nsays there were only eighteen. The first were Pauline, Alexandra, Alice,\nand Mary was one, and Victoria, for we all heard that, and it ended\nup with Hildegarde Cunigonde something or other, Princess of something\nelse.\n\nWhen she’d done, H. O. said, ‘That’s jolly good! Say it again!’ and she\ndid, but even then we couldn’t remember it. We told her our names, but\nshe thought they were too short, so when it was Noel’s turn he said he\nwas Prince Noel Camaralzaman Ivan Constantine Charlemagne James John\nEdward Biggs Maximilian Bastable Prince of Lewisham, but when she asked\nhim to say it again of course he could only get the first two names\nright, because he’d made it up as he went on.\n\nSo the Princess said, ‘You are quite old enough to know your own name.’\nShe was very grave and serious.\n\nShe told us that she was the fifth cousin of Queen Victoria. We asked\nwho the other cousins were, but she did not seem to understand. She went\non and said she was seven times removed. She couldn’t tell us what that\nmeant either, but Oswald thinks it means that the Queen’s cousins are\nso fond of her that they will keep coming bothering, so the Queen’s\nservants have orders to remove them. This little girl must have been\nvery fond of the Queen to try so often to see her, and to have been\nseven times removed. We could see that it is considered something to\nbe proud of; but we thought it was hard on the Queen that her cousins\nwouldn’t let her alone.\n\nPresently the little girl asked us where our maids and governesses were.\n\nWe told her we hadn’t any just now. And she said--\n\n‘How pleasant! And did you come here alone?’\n\n‘Yes,’ said Dora; ‘we came across the Heath.’\n\n‘You are very fortunate,’ said the little girl. She sat very upright on\nthe grass, with her fat little hands in her lap. ‘I should like to go on\nthe Heath. There are donkeys there, with white saddle covers. I should\nlike to ride them, but my governess will not permit.’\n\n‘I’m glad we haven’t a governess,’ H. O. said. ‘We ride the donkeys\nwhenever we have any pennies, and once I gave the man another penny to\nmake it gallop.’\n\n‘You are indeed fortunate!’ said the Princess again, and when she looked\nsad the shelves on her cheeks showed more than ever. You could have laid\na sixpence on them quite safely if you had had one.\n\n‘Never mind,’ said Noel; ‘I’ve got a lot of money. Come out and have a\nride now.’ But the little girl shook her head and said she was afraid it\nwould not be correct.\n\nDora said she was quite right; then all of a sudden came one of those\nuncomfortable times when nobody can think of anything to say, so we sat\nand looked at each other. But at last Alice said we ought to be going.\n\n‘Do not go yet,’ the little girl said. ‘At what time did they order your\ncarriage?’\n\n‘Our carriage is a fairy one, drawn by griffins, and it comes when we\nwish for it,’ said Noel.\n\nThe little girl looked at him very queerly, and said, ‘That is out of a\npicture-book.’\n\nThen Noel said he thought it was about time he was married if we were to\nbe home in time for tea. The little girl was rather stupid over it,\nbut she did what we told her, and we married them with Dora’s\npocket-handkerchief for a veil, and the ring off the back of one of the\nbuttons on H. O.’s blouse just went on her little finger.\n\nThen we showed her how to play cross-touch, and puss in the corner,\nand tag. It was funny, she didn’t know any games but battledore and\nshuttlecock and les graces. But she really began to laugh at last and\nnot to look quite so like a doll.\n\nShe was Puss and was running after Dicky when suddenly she stopped short\nand looked as if she was going to cry. And we looked too, and there were\ntwo prim ladies with little mouths and tight hair. One of them said in\nquite an awful voice, ‘Pauline, who are these children?’ and her voice\nwas gruff; with very curly R’s.\n\nThe little girl said we were Princes and Princesses--which was silly, to\na grown-up person that is not a great friend of yours.\n\nThe gruff lady gave a short, horrid laugh, like a husky bark, and said--\n\n‘Princes, indeed! They’re only common children!’\n\nDora turned very red and began to speak, but the little girl cried out\n‘Common children! Oh, I am so glad! When I am grown up I’ll always play\nwith common children.’\n\nAnd she ran at us, and began to kiss us one by one, beginning\nwith Alice; she had got to H. O. when the horrid lady said--‘Your\nHighness--go indoors at once!’\n\nThe little girl answered, ‘I won’t!’\n\nThen the prim lady said--‘Wilson, carry her Highness indoors.’\n\nAnd the little girl was carried away screaming, and kicking with her\nlittle thin legs and her buttoned boots, and between her screams she\nshrieked:\n\n‘Common children! I am glad, glad, glad! Common children! Common\nchildren!’\n\nThe nasty lady then remarked--‘Go at once, or I will send for the\npolice!’\n\nSo we went. H. O. made a face at her and so did Alice, but Oswald took\noff his cap and said he was sorry if she was annoyed about anything;\nfor Oswald has always been taught to be polite to ladies, however nasty.\nDicky took his off, too, when he saw me do it; he says he did it first,\nbut that is a mistake. If I were really a common boy I should say it was\na lie.\n\nThen we all came away, and when we got outside Dora said, ‘So she was\nreally a Princess. Fancy a Princess living _there_!’\n\n‘Even Princesses have to live somewhere,’ said Dicky.\n\n‘And I thought it was play. And it was real. I wish I’d known! I should\nhave liked to ask her lots of things,’ said Alice.\n\nH. O. said he would have liked to ask her what she had for dinner and\nwhether she had a crown.\n\nI felt, myself, we had lost a chance of finding out a great deal about\nkings and queens. I might have known such a stupid-looking little girl\nwould never have been able to pretend, as well as that.\n\nSo we all went home across the Heath, and made dripping toast for tea.\n\nWhen we were eating it Noel said, ‘I wish I could give _her_ some! It is\nvery good.’\n\nHe sighed as he said it, and his mouth was very full, so we knew he was\nthinking of his Princess. He says now that she was as beautiful as the\nday, but we remember her quite well, and she was nothing of the kind.\n\n\n\nCHAPTER 7. BEING BANDITS\n\nNoel was quite tiresome for ever so long after we found the Princess. He\nwould keep on wanting to go to the Park when the rest of us didn’t, and\nthough we went several times to please him, we never found that door\nopen again, and all of us except him knew from the first that it would\nbe no go.\n\nSo now we thought it was time to do something to rouse him from the\nstupor of despair, which is always done to heroes when anything baffling\nhas occurred. Besides, we were getting very short of money again--the\nfortunes of your house cannot be restored (not so that they will last,\nthat is), even by the one pound eight we got when we had the ‘good\nhunting.’ We spent a good deal of that on presents for Father’s\nbirthday. We got him a paper-weight, like a glass bun, with a picture\nof Lewisham Church at the bottom; and a blotting-pad, and a box of\npreserved fruits, and an ivory penholder with a view of Greenwich\nPark in the little hole where you look through at the top. He was most\nawfully pleased and surprised, and when he heard how Noel and Oswald had\nearned the money to buy the things he was more surprised still. Nearly\nall the rest of our money went to get fireworks for the Fifth of\nNovember. We got six Catherine wheels and four rockets; two hand-lights,\none red and one green; a sixpenny maroon; two Roman-candles--they cost\na shilling; some Italian streamers, a fairy fountain, and a tourbillon\nthat cost eighteen-pence and was very nearly worth it.\n\nBut I think crackers and squibs are a mistake. It’s true you get a lot\nof them for the money, and they are not bad fun for the first two or\nthree dozen, but you get jolly sick of them before you’ve let off your\nsixpenn’orth. And the only amusing way is not allowed: it is putting\nthem in the fire.\n\nIt always seems a long time till the evening when you have got fireworks\nin the house, and I think as it was a rather foggy day we should have\ndecided to let them off directly after breakfast, only Father had said\nhe would help us to let them off at eight o’clock after he had had his\ndinner, and you ought never to disappoint your father if you can help\nit.\n\nYou see we had three good reasons for trying H. O.’s idea of restoring\nthe fallen fortunes of our house by becoming bandits on the Fifth of\nNovember. We had a fourth reason as well, and that was the best reason\nof the lot. You remember Dora thought it would be wrong to be bandits.\nAnd the Fifth of November came while Dora was away at Stroud staying\nwith her godmother. Stroud is in Gloucestershire. We were determined to\ndo it while she was out of the way, because we did not think it wrong,\nand besides we meant to do it anyhow.\n\nWe held a Council, of course, and laid our plans very carefully. We let\nH. O. be Captain, because it was his idea. Oswald was Lieutenant. Oswald\nwas quite fair, because he let H. O. call himself Captain; but Oswald is\nthe eldest next to Dora, after all.\n\nOur plan was this. We were all to go up on to the Heath. Our house is in\nthe Lewisham Road, but it’s quite close to the Heath if you cut up the\nshort way opposite the confectioner’s, past the nursery gardens and\nthe cottage hospital, and turn to the left again and afterwards to the\nright. You come out then at the top of the hill, where the big guns are\nwith the iron fence round them, and where the bands play on Thursday\nevenings in the summer.\n\nWe were to lurk in ambush there, and waylay an unwary traveller. We were\nto call upon him to surrender his arms, and then bring him home and put\nhim in the deepest dungeon below the castle moat; then we were to load\nhim with chains and send to his friends for ransom.\n\nYou may think we had no chains, but you are wrong, because we used\nto keep two other dogs once, besides Pincher, before the fall of the\nfortunes of the ancient House of Bastable. And they were quite big dogs.\n\nIt was latish in the afternoon before we started. We thought we could\nlurk better if it was nearly dark. It was rather foggy, and we waited\na good while beside the railings, but all the belated travellers were\neither grown up or else they were Board School children. We weren’t\ngoing to get into a row with grown-up people--especially strangers--and\nno true bandit would ever stoop to ask a ransom from the relations of\nthe poor and needy. So we thought it better to wait.\n\nAs I said, it was Guy Fawkes Day, and if it had not been we should never\nhave been able to be bandits at all, for the unwary traveller we did\ncatch had been forbidden to go out because he had a cold in his head.\nBut he would run out to follow a guy, without even putting on a coat or\na comforter, and it was a very damp, foggy afternoon and nearly dark, so\nyou see it was his own fault entirely, and served him jolly well right.\n\nWe saw him coming over the Heath just as we were deciding to go home\nto tea. He had followed that guy right across to the village (we call\nBlackheath the village; I don’t know why), and he was coming back\ndragging his feet and sniffing.\n\n‘Hist, an unwary traveller approaches!’ whispered Oswald.\n\n‘Muffle your horses’ heads and see to the priming of your pistols,’\nmuttered Alice. She always will play boys’ parts, and she makes Ellis\ncut her hair short on purpose. Ellis is a very obliging hairdresser.\n\n‘Steal softly upon him,’ said Noel; ‘for lo! ‘tis dusk, and no human\neyes can mark our deeds.’\n\nSo we ran out and surrounded the unwary traveller. It turned out to be\nAlbert-next-door, and he was very frightened indeed until he saw who we\nwere.\n\n‘Surrender!’ hissed Oswald, in a desperate-sounding voice, as he caught\nthe arm of the Unwary. And Albert-next-door said, ‘All right! I’m\nsurrendering as hard as I can. You needn’t pull my arm off.’\n\nWe explained to him that resistance was useless, and I think he saw that\nfrom the first. We held him tight by both arms, and we marched him home\ndown the hill in a hollow square of five.\n\nHe wanted to tell us about the guy, but we made him see that it was not\nproper for prisoners to talk to the guard, especially about guys that\nthe prisoner had been told not to go after because of his cold.\n\nWhen we got to where we live he said, ‘All right, I don’t want to tell\nyou. You’ll wish I had afterwards. You never saw such a guy.’\n\n‘I can see _you_!’ said H. O. It was very rude, and Oswald told him so\nat once, because it is his duty as an elder brother. But H. O. is very\nyoung and does not know better yet, and besides it wasn’t bad for H. O.\n\nAlbert-next-door said, ‘You haven’t any manners, and I want to go in to\nmy tea. Let go of me!’\n\nBut Alice told him, quite kindly, that he was not going in to his tea,\nbut coming with us.\n\n‘I’m not,’ said Albert-next-door; ‘I’m going home. Leave go! I’ve got\na bad cold. You’re making it worse.’ Then he tried to cough, which was\nvery silly, because we’d seen him in the morning, and he’d told us where\nthe cold was that he wasn’t to go out with. When he had tried to cough,\nhe said, ‘Leave go of me! You see my cold’s getting worse.’\n\n‘You should have thought of that before,’ said Dicky; ‘you’re coming in\nwith us.’\n\n‘Don’t be a silly,’ said Noel; ‘you know we told you at the very\nbeginning that resistance was useless. There is no disgrace in yielding.\nWe are five to your one.’\n\nBy this time Eliza had opened the door, and we thought it best to take\nhim in without any more parlaying. To parley with a prisoner is not done\nby bandits.\n\nDirectly we got him safe into the nursery, H. O. began to jump about and\nsay, ‘Now you’re a prisoner really and truly!’\n\nAnd Albert-next-door began to cry. He always does. I wonder he didn’t\nbegin long before--but Alice fetched him one of the dried fruits we\ngave Father for his birthday. It was a green walnut. I have noticed\nthe walnuts and the plums always get left till the last in the box; the\napricots go first, and then the figs and pears; and the cherries, if\nthere are any.\n\nSo he ate it and shut up. Then we explained his position to him, so that\nthere should be no mistake, and he couldn’t say afterwards that he had\nnot understood.\n\n‘There will be no violence,’ said Oswald--he was now Captain of the\nBandits, because we all know H. O. likes to be Chaplain when we\nplay prisoners--‘no violence. But you will be confined in a dark,\nsubterranean dungeon where toads and snakes crawl, and but little of the\nlight of day filters through the heavily mullioned windows. You will be\nloaded with chains. Now don’t begin again, Baby, there’s nothing to\ncry about; straw will be your pallet; beside you the gaoler will set a\newer--a ewer is only a jug, stupid; it won’t eat you--a ewer with water;\nand a mouldering crust will be your food.’\n\nBut Albert-next-door never enters into the spirit of a thing. He mumbled\nsomething about tea-time.\n\nNow Oswald, though stern, is always just, and besides we were all rather\nhungry, and tea was ready. So we had it at once, Albert-next-door and\nall--and we gave him what was left of the four-pound jar of apricot jam\nwe got with the money Noel got for his poetry. And we saved our crusts\nfor the prisoner.\n\nAlbert-next-door was very tiresome. Nobody could have had a nicer prison\nthan he had. We fenced him into a corner with the old wire nursery\nfender and all the chairs, instead of putting him in the coal-cellar\nas we had first intended. And when he said the dog-chains were cold the\ngirls were kind enough to warm his fetters thoroughly at the fire before\nwe put them on him.\n\nWe got the straw cases of some bottles of wine someone sent Father\none Christmas--it is some years ago, but the cases are quite good. We\nunpacked them very carefully and pulled them to pieces and scattered\nthe straw about. It made a lovely straw pallet, and took ever so long to\nmake--but Albert-next-door has yet to learn what gratitude really is.\nWe got the bread trencher for the wooden platter where the prisoner’s\ncrusts were put--they were not mouldy, but we could not wait till they\ngot so, and for the ewer we got the toilet jug out of the spare-room\nwhere nobody ever sleeps. And even then Albert-next-door couldn’t be\nhappy like the rest of us. He howled and cried and tried to get out, and\nhe knocked the ewer over and stamped on the mouldering crusts. Luckily\nthere was no water in the ewer because we had forgotten it, only dust\nand spiders. So we tied him up with the clothes-line from the back\nkitchen, and we had to hurry up, which was a pity for him. We might have\nhad him rescued by a devoted page if he hadn’t been so tiresome. In fact\nNoel was actually dressing up for the page when Albert-next-door kicked\nover the prison ewer.\n\nWe got a sheet of paper out of an old exercise-book, and we made H. O.\nprick his own thumb, because he is our little brother and it is our duty\nto teach him to be brave. We none of us mind pricking ourselves; we’ve\ndone it heaps of times. H. O. didn’t like it, but he agreed to do it,\nand I helped him a little because he was so slow, and when he saw the\nred bead of blood getting fatter and bigger as I squeezed his thumb he\nwas very pleased, just as I had told him he would be.\n\nThis is what we wrote with H. O.’s blood, only the blood gave out when\nwe got to ‘Restored’, and we had to write the rest with crimson lake,\nwhich is not the same colour, though I always use it, myself, for\npainting wounds.\n\nWhile Oswald was writing it he heard Alice whispering to the prisoner\nthat it would soon be over, and it was only play. The prisoner left off\nhowling, so I pretended not to hear what she said. A Bandit Captain has\nto overlook things sometimes. This was the letter--\n\n    ‘Albert Morrison is held a prisoner by Bandits.\n    On payment of three thousand pounds he will be\n    restored to his sorrowing relatives, and all\n    will be forgotten and forgiven.’\n\nI was not sure about the last part, but Dicky was certain he had seen it\nin the paper, so I suppose it must have been all right.\n\nWe let H. O. take the letter; it was only fair, as it was his blood it\nwas written with, and told him to leave it next door for Mrs Morrison.\n\nH. O. came back quite quickly, and Albert-next-door’s uncle came with\nhim.\n\n‘What is all this, Albert?’ he cried. ‘Alas, alas, my nephew! Do I find\nyou the prisoner of a desperate band of brigands?’\n\n‘Bandits,’ said H. O; ‘you know it says bandits.’\n\n‘I beg your pardon, gentlemen,’ said Albert-next-door’s uncle, ‘bandits\nit is, of course. This, Albert, is the direct result of the pursuit of\nthe guy on an occasion when your doting mother had expressly warned you\nto forgo the pleasures of the chase.’\n\nAlbert said it wasn’t his fault, and he hadn’t wanted to play.\n\n‘So ho!’ said his uncle, ‘impenitent too! Where’s the dungeon?’\n\nWe explained the dungeon, and showed him the straw pallet and the ewer\nand the mouldering crusts and other things.\n\n‘Very pretty and complete,’ he said. ‘Albert, you are more highly\nprivileged than ever I was. No one ever made me a nice dungeon when I\nwas your age. I think I had better leave you where you are.’\n\nAlbert began to cry again and said he was sorry, and he would be a good\nboy.\n\n‘And on this old familiar basis you expect me to ransom you, do you?\nHonestly, my nephew, I doubt whether you are worth it. Besides, the sum\nmentioned in this document strikes me as excessive: Albert really is\n_not_ worth three thousand pounds. Also by a strange and unfortunate\nchance I haven’t the money about me. Couldn’t you take less?’\n\nWe said perhaps we could.\n\n‘Say eightpence,’ suggested Albert-next-door’s uncle, ‘which is all the\nsmall change I happen to have on my person.’\n\n‘Thank you very much,’ said Alice as he held it out; ‘but are you sure\nyou can spare it? Because really it was only play.’\n\n‘Quite sure. Now, Albert, the game is over. You had better run home to\nyour mother and tell her how much you’ve enjoyed yourself.’\n\nWhen Albert-next-door had gone his uncle sat in the Guy Fawkes armchair\nand took Alice on his knee, and we sat round the fire waiting till it\nwould be time to let off our fireworks. We roasted the chestnuts he\nsent Dicky out for, and he told us stories till it was nearly seven. His\nstories are first-rate--he does all the parts in different voices. At\nlast he said--\n\n‘Look here, young-uns. I like to see you play and enjoy yourselves, and\nI don’t think it hurts Albert to enjoy himself too.’\n\n‘I don’t think he did much,’ said H. O. But I knew what\nAlbert-next-door’s uncle meant because I am much older than H. O. He\nwent on--\n\n‘But what about Albert’s mother? Didn’t you think how anxious she would\nbe at his not coming home? As it happens I saw him come in with you, so\nwe knew it was all right. But if I hadn’t, eh?’\n\nHe only talks like that when he is very serious, or even angry. Other\ntimes he talks like people in books--to us, I mean.\n\nWe none of us said anything. But I was thinking. Then Alice spoke.\n\nGirls seem not to mind saying things that we don’t say. She put her arms\nround Albert-next-door’s uncle’s neck and said--\n\n‘We’re very, very sorry. We didn’t think about his mother. You see we\ntry very hard not to think about other people’s mothers because--’\n\nJust then we heard Father’s key in the door and Albert-next-door’s uncle\nkissed Alice and put her down, and we all went down to meet Father. As\nwe went I thought I heard Albert-next-door’s uncle say something that\nsounded like ‘Poor little beggars!’\n\nHe couldn’t have meant us, when we’d been having such a jolly time, and\nchestnuts, and fireworks to look forward to after dinner and everything!\n\n\n\nCHAPTER 8. BEING EDITORS\n\nIt was Albert’s uncle who thought of our trying a newspaper. He said he\nthought we should not find the bandit business a paying industry, as a\npermanency, and that journalism might be.\n\nWe had sold Noel’s poetry and that piece of information about Lord\nTottenham to the good editor, so we thought it would not be a bad idea\nto have a newspaper of our own. We saw plainly that editors must be very\nrich and powerful, because of the grand office and the man in the glass\ncase, like a museum, and the soft carpets and big writing-table. Besides\nour having seen a whole handful of money that the editor pulled out\nquite carelessly from his trousers pocket when he gave me my five bob.\n\nDora wanted to be editor and so did Oswald, but he gave way to her\nbecause she is a girl, and afterwards he knew that it is true what it\nsays in the copy-books about Virtue being its own Reward. Because you’ve\nno idea what a bother it is. Everybody wanted to put in everything just\nas they liked, no matter how much room there was on the page. It was\nsimply awful! Dora put up with it as long as she could and then she said\nif she wasn’t let alone she wouldn’t go on being editor; they could be\nthe paper’s editors themselves, so there.\n\nThen Oswald said, like a good brother: ‘I will help you if you like,\nDora,’ and she said, ‘You’re more trouble than all the rest of them!\nCome and be editor and see how you like it. I give it up to you.’\nBut she didn’t, and we did it together. We let Albert-next-door be\nsub-editor, because he had hurt his foot with a nail in his boot that\ngathered.\n\nWhen it was done Albert-next-door’s uncle had it copied for us in\ntypewriting, and we sent copies to all our friends, and then of course\nthere was no one left that we could ask to buy it. We did not think of\nthat until too late. We called the paper the Lewisham Recorder; Lewisham\nbecause we live there, and Recorder in memory of the good editor. I\ncould write a better paper on my head, but an editor is not allowed to\nwrite all the paper. It is very hard, but he is not. You just have to\nfill up with what you can get from other writers. If I ever have time I\nwill write a paper all by myself. It won’t be patchy. We had no time to\nmake it an illustrated paper, but I drew the ship going down with all\nhands for the first copy. But the typewriter can’t draw ships, so it was\nleft out in the other copies. The time the first paper took to write out\nno one would believe! This was the Newspaper:\n\n          THE LEWISHAM RECORDER\n\n    EDITORS:  DORA AND OSWALD BASTABLE\n\n             ------------             EDITORIAL NOTE\n\nEvery paper is written for some reason. Ours is because we want to sell\nit and get money. If what we have written brings happiness to any sad\nheart we shall not have laboured in vain. But we want the money too.\nMany papers are content with the sad heart and the happiness, but we are\nnot like that, and it is best not to be deceitful. EDITORS.\n\nThere will be two serial stories; One by Dicky and one by all of us. In\na serial story you only put in one chapter at a time. But we shall put\nall our serial story at once, if Dora has time to copy it. Dicky’s will\ncome later on.\n\n            SERIAL STORY\n             BY US ALL\n\n         CHAPTER I--by Dora\n\nThe sun was setting behind a romantic-looking tower when two strangers\nmight have been observed descending the crest of the hill. The eldest,\na man in the prime of life; the other a handsome youth who reminded\neverybody of Quentin Durward. They approached the Castle, in which the\nfair Lady Alicia awaited her deliverers. She leaned from the castellated\nwindow and waved her lily hand as they approached. They returned her\nsignal, and retired to seek rest and refreshment at a neighbouring\nhostelry.\n\n             ------------         CHAPTER II--by Alice\n\nThe Princess was very uncomfortable in the tower, because her fairy\ngodmother had told her all sorts of horrid things would happen if she\ndidn’t catch a mouse every day, and she had caught so many mice that now\nthere were hardly any left to catch. So she sent her carrier pigeon to\nask the noble Strangers if they could send her a few mice--because she\nwould be of age in a few days and then it wouldn’t matter. So the fairy\ngodmother--- (I’m very sorry, but there’s no room to make the chapters\nany longer.-ED.)\n\n             ------------         CHAPTER III--by the Sub-Editor\n\n(I can’t--I’d much rather not--I don’t know how.)\n\n            ------------         CHAPTER IV--by Dicky\n\nI must now retrace my steps and tell you something about our hero. You\nmust know he had been to an awfully jolly school, where they had turkey\nand goose every day for dinner, and never any mutton, and as many helps\nof pudding as a fellow cared to send up his plate for--so of course they\nhad all grown up very strong, and before he left school he challenged\nthe Head to have it out man to man, and he gave it him, I tell you. That\nwas the education that made him able to fight Red Indians, and to be the\nstranger who might have been observed in the first chapter.\n\n             ------------         CHAPTER V--by Noel\n\nI think it’s time something happened in this story. So then the dragon\nhe came out, blowing fire out of his nose, and he said--\n\n‘Come on, you valiant man and true, I’d like to have a set-to along of\nyou!’\n\n(That’s bad English.--ED. I don’t care; it’s what the dragon said. Who\ntold you dragons didn’t talk bad English?--Noel.)\n\nSo the hero, whose name was Noeloninuris, replied--\n\n     ‘My blade is sharp, my axe is keen,\n     You’re not nearly as big\n     As a good many dragons I’ve seen.’\n\n(Don’t put in so much poetry, Noel. It’s not fair, because none of the\nothers can do it.--ED.)\n\nAnd then they went at it, and he beat the dragon, just as he did the\nHead in Dicky’s part of the Story, and so he married the Princess, and\nthey lived--- (No they didn’t--not till the last chapter.--ED.)\n\n             ------------         CHAPTER VI--by H. O.\n\nI think it’s a very nice Story--but what about the mice? I don’t want to\nsay any more. Dora can have what’s left of my chapter.\n\n             ------------         CHAPTER VII--by the Editors\n\nAnd so when the dragon was dead there were lots of mice, because he used\nto kill them for his tea but now they rapidly multiplied and ravaged the\ncountry, so the fair lady Alicia, sometimes called the Princess, had\nto say she would not marry any one unless they could rid the country of\nthis plague of mice. Then the Prince, whose real name didn’t begin\nwith N, but was Osrawalddo, waved his magic sword, and the dragon stood\nbefore them, bowing gracefully. They made him promise to be good, and\nthen they forgave him; and when the wedding breakfast came, all the\nbones were saved for him. And so they were married and lived happy ever\nafter.\n\n(What became of the other stranger?--NOEL. The dragon ate him because he\nasked too many questions.--EDITORS.)\n\nThis is the end of the story.\n\n            INSTRUCTIVE\n\nIt only takes four hours and a quarter now to get from London to\nManchester; but I should not think any one would if they could help it.\n\nA DREADFUL WARNING. A wicked boy told me a very instructive thing about\nginger. They had opened one of the large jars, and he happened to take\nout quite a lot, and he made it all right by dropping marbles in, till\nthere was as much ginger as before. But he told me that on the Sunday,\nwhen it was coming near the part where there is only juice generally, I\nhad no idea what his feelings were. I don’t see what he could have said\nwhen they asked him. I should be sorry to act like it.\n\n             ------------             SCIENTIFIC\n\nExperiments should always be made out of doors. And don’t use\nbenzoline.--DICKY. (That was when he burnt his eyebrows off.--ED.)\n\nThe earth is 2,400 miles round, and 800 through--at least I think so,\nbut perhaps it’s the other way.--DICKY. (You ought to have been sure\nbefore you began.--ED.)\n\n             ------------            SCIENTIFIC COLUMN\n\nIn this so-called Nineteenth Century Science is but too little\nconsidered in the nurseries of the rich and proud. But we are not like\nthat.\n\nIt is not generally known that if you put bits of camphor in luke-warm\nwater it will move about. If you drop sweet oil in, the camphor will\ndart away and then stop moving. But don’t drop any till you are tired\nof it, because the camphor won’t any more afterwards. Much amusement and\ninstruction is lost by not knowing things like this.\n\nIf you put a sixpence under a shilling in a wine-glass, and blow hard\ndown the side of the glass, the sixpence will jump up and sit on the top\nof the shilling. At least I can’t do it myself, but my cousin can. He is\nin the Navy.\n\n             ------------         ANSWERS TO CORRESPONDENTS\n\nNoel. You are very poetical, but I am sorry to say it will not do.\n\nAlice. Nothing will ever make your hair curl, so it’s no use. Some\npeople say it’s more important to tidy up as you go along. I don’t mean\nyou in particular, but every one.\n\nH. O. We never said you were tubby, but the Editor does not know any\ncure.\n\nNoel. If there is any of the paper over when this newspaper is finished,\nI will exchange it for your shut-up inkstand, or the knife that has the\nuseful thing in it for taking stones out of horses’ feet, but you can’t\nhave it without.\n\nH. O. There are many ways how your steam engine might stop working.\nYou might ask Dicky. He knows one of them. I think it is the way yours\nstopped.\n\nNoel. If you think that by filling the garden with sand you can make\ncrabs build their nests there you are not at all sensible.\n\nYou have altered your poem about the battle of Waterloo so often, that\nwe cannot read it except where the Duke waves his sword and says some\nthing we can’t read either. Why did you write it on blotting-paper with\npurple chalk?--ED. (Because YOU KNOW WHO sneaked my pencil.--NOEL.)\n\n             ------------             POETRY\n\n    The Assyrian came down like a wolf on the fold,\n    And the way he came down was awful, I’m told;\n    But it’s nothing to the way one of the Editors comes down on me,\n    If I crumble my bread-and-butter or spill my tea.\n                                               NOEL.\n             ------------             CURIOUS FACTS\n\nIf you hold a guinea-pig up by his tail his eyes drop out.\n\nYou can’t do half the things yourself that children in books do, making\nmodels or soon. I wonder why?--ALICE.\n\nIf you take a date’s stone out and put in an almond and eat them\ntogether, it is prime. I found this out.--SUB-EDITOR.\n\nIf you put your wet hand into boiling lead it will not hurt you if you\ndraw it out quickly enough. I have never tried this.--DORA.\n\n             ------------           THE PURRING CLASS\n\n         (Instructive Article)\n\nIf I ever keep a school everything shall be quite different. Nobody\nshall learn anything they don’t want to. And sometimes instead of having\nmasters and mistresses we will have cats, and we will dress up in cat\nskins and learn purring. ‘Now, my dears,’ the old cat will say, ‘one,\ntwo, three all purr together,’ and we shall purr like anything.\n\nShe won’t teach us to mew, but we shall know how without teaching.\nChildren do know some things without being taught.--ALICE.\n\n             ------------             POETRY\n      (Translated into French by Dora)\n\n     Quand j’etais jeune et j’etais fou\n     J’achetai un violon pour dix-huit sous\n     Et tous les airs que je jouai\n     Etait over the hills and far away.\n\n              Another piece of it\n\n     Mercie jolie vache qui fait\n     Bon lait pour mon dejeuner\n     Tous les matins tous les soirs\n     Mon pain je mange, ton lait je boire.\n\n             ------------             RECREATIONS\n\nIt is a mistake to think that cats are playful. I often try to get a cat\nto play with me, and she never seems to care about the game, no matter\nhow little it hurts.--H. O.\n\nMaking pots and pans with clay is fun, but do not tell the grown-ups. It\nis better to surprise them; and then you must say at once how easily it\nwashes off--much easier than ink.--DICKY.\n\n             ------------    SAM REDFERN, OR THE BUSH RANGER’S BURIAL\n\n             By Dicky\n\n‘Well, Annie, I have bad news for you,’ said Mr Ridgway, as he entered\nthe comfortable dining-room of his cabin in the Bush. ‘Sam Redfern the\nBushranger is about this part of the Bush just now. I hope he will not\nattack us with his gang.’\n\n‘I hope not,’ responded Annie, a gentle maiden of some sixteen summers.\n\nJust then came a knock at the door of the hut, and a gruff voice asked\nthem to open the door.\n\n‘It is Sam Redfern the Bushranger, father,’ said the girl.\n\n‘The same,’ responded the voice, and the next moment the hall door was\nsmashed in, and Sam Redfern sprang in, followed by his gang.\n\n             ------------             CHAPTER II\n\nAnnie’s Father was at once overpowered, and Annie herself lay bound with\ncords on the drawing-room sofa. Sam Redfern set a guard round the lonely\nhut, and all human aid was despaired of. But you never know. Far away in\nthe Bush a different scene was being enacted.\n\n‘Must be Injuns,’ said a tall man to himself as he pushed his way\nthrough the brushwood. It was Jim Carlton, the celebrated detective. ‘I\nknow them,’ he added; ‘they are Apaches.’ just then ten Indians in full\nwar-paint appeared. Carlton raised his rifle and fired, and slinging\ntheir scalps on his arm he hastened towards the humble log hut where\nresided his affianced bride, Annie Ridgway, sometimes known as the\nFlower of the Bush.\n\n             ------------             CHAPTER III\n\nThe moon was low on the horizon, and Sam Redfern was seated at a\ndrinking bout with some of his boon companions.\n\nThey had rifled the cellars of the hut, and the rich wines flowed like\nwater in the golden goblets of Mr Ridgway.\n\nBut Annie had made friends with one of the gang, a noble, good-hearted\nman who had joined Sam Redfern by mistake, and she had told him to go\nand get the police as quickly as possible.\n\n‘Ha! ha!’ cried Redfern, ‘now I am enjoying myself!’ He little knew that\nhis doom was near upon him.\n\nJust then Annie gave a piercing scream, and Sam Redfern got up, seizing\nhis revolver. ‘Who are you?’ he cried, as a man entered.\n\n‘I am Jim Carlton, the celebrated detective,’ said the new arrival.\n\nSam Redfern’s revolver dropped from his nerveless fingers, but the next\nmoment he had sprung upon the detective with the well-known activity of\nthe mountain sheep, and Annie shrieked, for she had grown to love the\nrough Bushranger.\n\n(To be continued at the end of the paper if there is room.)\n\n             ------------             SCHOLASTIC\n\nA new slate is horrid till it is washed in milk. I like the green spots\non them to draw patterns round. I know a good way to make a slate-pencil\nsqueak, but I won’t put it in because I don’t want to make it\ncommon.--SUB-EDITOR.\n\nPeppermint is a great help with arithmetic. The boy who was second in\nthe Oxford Local always did it. He gave me two. The examiner said to\nhim, ‘Are you eating peppermints?’ And he said, ‘No, Sir.’\n\nHe told me afterwards it was quite true, because he was only sucking\none. I’m glad I wasn’t asked. I should never have thought of that, and I\ncould have had to say ‘Yes.’--OSWALD.\n\n             ------------        THE WRECK OF THE ‘MALABAR’\n\n             By Noel\n\n(Author of ‘A Dream of Ancient Ancestors.’) He isn’t really--but he put\nit in to make it seem more real.\n\n    Hark! what is that noise of rolling\n       Waves and thunder in the air?\n    ‘Tis the death-knell of the sailors\n       And officers and passengers of the good ship Malabar.\n\n    It was a fair and lovely noon\n       When the good ship put out of port\n    And people said ‘ah little we think\n       How soon she will be the elements’ sport.’\n\n    She was indeed a lovely sight\n       Upon the billows with sails spread.\n    But the captain folded his gloomy arms,\n       Ah--if she had been a life-boat instead!\n\n    See the captain stern yet gloomy\n       Flings his son upon a rock,\n    Hoping that there his darling boy\n       May escape the wreck.\n\n    Alas in vain the loud winds roared\n       And nobody was saved.\n    That was the wreck of the Malabar,\n       Then let us toll for the brave.\n                                    NOEL.\n\n             ------------            GARDENING NOTES\n\nIt is useless to plant cherry-stones in the hope of eating the fruit,\nbecause they don’t!\n\nAlice won’t lend her gardening tools again, because the last time Noel\nleft them out in the rain, and I don’t like it. He said he didn’t.\n\n             ------------            SEEDS AND BULBS\n\nThese are useful to play at shop with, until you are ready. Not at\ndinner-parties, for they will not grow unless uncooked. Potatoes are\nnot grown with seed, but with chopped-up potatoes. Apple trees are grown\nfrom twigs, which is less wasteful.\n\nOak trees come from acorns. Every one knows this. When Noel says he\ncould grow one from a peach stone wrapped up in oak leaves, he shows\nthat he knows nothing about gardening but marigolds, and when I passed\nby his garden I thought they seemed just like weeds now the flowers have\nbeen picked.\n\nA boy once dared me to eat a bulb.\n\nDogs are very industrious and fond of gardening. Pincher is always\nplanting bones, but they never grow up. There couldn’t be a bone tree.\nI think this is what makes him bark so unhappily at night. He has never\ntried planting dog-biscuit, but he is fonder of bones, and perhaps he\nwants to be quite sure about them first.\n\n             ------------     SAM REDFERN, OR THE BUSHRANGER’S BURIAL\n\n                By Dicky\n\n             ------------         CHAPTER IV AND LAST\n\nThis would have been a jolly good story if they had let me finish it at\nthe beginning of the paper as I wanted to. But now I have forgotten how\nI meant it to end, and I have lost my book about Red Indians, and all my\nBoys of England have been sneaked. The girls say ‘Good riddance!’ so I\nexpect they did it. They want me just to put in which Annie married, but\nI shan’t, so they will never know.\n\nWe have now put everything we can think of into the paper. It takes a\nlot of thinking about. I don’t know how grown-ups manage to write all\nthey do. It must make their heads ache, especially lesson books.\n\nAlbert-next-door only wrote one chapter of the serial story, but he\ncould have done some more if he had wanted to. He could not write out\nany of the things because he cannot spell. He says he can, but it takes\nhim such a long time he might just as well not be able. There are one or\ntwo things more. I am sick of it, but Dora says she will write them in.\n\nLEGAL ANSWER WANTED. A quantity of excellent string is offered if you\nknow whether there really is a law passed about not buying gunpowder\nunder thirteen.--DICKY.\n\nThe price of this paper is one shilling each, and sixpence extra for the\npicture of the Malabar going down with all hands. If we sell one hundred\ncopies we will write another paper.\n\n                  *   *   *\n\nAnd so we would have done, but we never did. Albert-next-door’s uncle\ngave us two shillings, that was all. You can’t restore fallen fortunes\nwith two shillings!\n\n\n\nCHAPTER 9. THE G. B.\n\nBeing editors is not the best way to wealth. We all feel this now, and\nhighwaymen are not respected any more like they used to be.\n\nI am sure we had tried our best to restore our fallen fortunes. We felt\ntheir fall very much, because we knew the Bastables had been rich once.\nDora and Oswald can remember when Father was always bringing nice things\nhome from London, and there used to be turkeys and geese and wine and\ncigars come by the carrier at Christmas-time, and boxes of candied fruit\nand French plums in ornamental boxes with silk and velvet and gilding\non them. They were called prunes, but the prunes you buy at the grocer’s\nare quite different. But now there is seldom anything nice brought from\nLondon, and the turkey and the prune people have forgotten Father’s\naddress.\n\n‘How _can_ we restore those beastly fallen fortunes?’ said Oswald.\n‘We’ve tried digging and writing and princesses and being editors.’\n\n‘And being bandits,’ said H. O.\n\n‘When did you try that?’ asked Dora quickly. ‘You know I told you it was\nwrong.’\n\n‘It wasn’t wrong the way we did it,’ said Alice, quicker still, before\nOswald could say, ‘Who asked you to tell us anything about it?’\nwhich would have been rude, and he is glad he didn’t. ‘We only caught\nAlbert-next-door.’\n\n‘Oh, Albert-next-door!’ said Dora contemptuously, and I felt more\ncomfortable; for even after I didn’t say, ‘Who asked you, and cetera,’\nI was afraid Dora was going to come the good elder sister over us. She\ndoes that a jolly sight too often.\n\nDicky looked up from the paper he was reading and said, ‘This sounds\nlikely,’ and he read out--\n\n    ‘L100 secures partnership in lucrative business for sale of\n    useful patent.  L10 weekly.  No personal attendance necessary.\n    Jobbins, 300, Old Street Road.’\n\n‘I wish we could secure that partnership,’ said Oswald. He is twelve,\nand a very thoughtful boy for his age.\n\nAlice looked up from her painting. She was trying to paint a fairy\nqueen’s frock with green bice, and it wouldn’t rub. There is something\nfunny about green bice. It never will rub off; no matter how expensive\nyour paintbox is--and even boiling water is very little use.\n\nShe said, ‘Bother the bice! And, Oswald, it’s no use thinking about\nthat. Where are we to get a hundred pounds?’\n\n‘Ten pounds a week is five pounds to us,’ Oswald went on--he had done\nthe sum in his head while Alice was talking--‘because partnership means\nhalves. It would be A1.’\n\nNoel sat sucking his pencil--he had been writing poetry as usual. I saw\nthe first two lines--\n\n     I wonder why Green Bice\n     Is never very nice.\n\nSuddenly he said, ‘I wish a fairy would come down the chimney and drop a\njewel on the table--a jewel worth just a hundred pounds.’\n\n‘She might as well give you the hundred pounds while she was about it,’\nsaid Dora.\n\n‘Or while she was about it she might as well give us five pounds a\nweek,’ said Alice.\n\n‘Or fifty,’ said I.\n\n‘Or five hundred,’ said Dicky.\n\nI saw H. O. open his mouth, and I knew he was going to say, ‘Or five\nthousand,’ so I said--\n\n‘Well, she won’t give us fivepence, but if you’d only do as I am always\nsaying, and rescue a wealthy old gentleman from deadly peril he would\ngive us a pot of money, and we could have the partnership and five\npounds a week. Five pounds a week would buy a great many things.’\n\nThen Dicky said, ‘Why shouldn’t we borrow it?’ So we said, ‘Who from?’\nand then he read this out of the paper--\n\n     MONEY PRIVATELY WITHOUT FEES\n     THE BOND STREET BANK\n     Manager, Z. Rosenbaum.\n\n     Advances cash from L20 to L10,000 on ladies’ or gentlemen’s\n     note of hand alone, without security.  No fees.  No inquiries.\n     Absolute privacy guaranteed.\n\n‘What does it all mean?’ asked H. O.\n\n‘It means that there is a kind gentleman who has a lot of money, and he\ndoesn’t know enough poor people to help, so he puts it in the paper\nthat he will help them, by lending them his money--that’s it, isn’t it,\nDicky?’\n\nDora explained this and Dicky said, ‘Yes.’ And H. O. said he was a\nGenerous Benefactor, like in Miss Edgeworth. Then Noel wanted to know\nwhat a note of hand was, and Dicky knew that, because he had read it in\na book, and it was just a letter saying you will pay the money when you\ncan, and signed with your name.\n\n‘No inquiries!’ said Alice. ‘Oh--Dicky--do you think he would?’\n\n‘Yes, I think so,’ said Dicky. ‘I wonder Father doesn’t go to this kind\ngentleman. I’ve seen his name before on a circular in Father’s study.’\n\n‘Perhaps he has.’ said Dora.\n\nBut the rest of us were sure he hadn’t, because, of course, if he had,\nthere would have been more money to buy nice things. Just then Pincher\njumped up and knocked over the painting-water. He is a very careless\ndog. I wonder why painting-water is always such an ugly colour? Dora ran\nfor a duster to wipe it up, and H. O. dropped drops of the water on his\nhands and said he had got the plague. So we played at the plague for a\nbit, and I was an Arab physician with a bath-towel turban, and cured\nthe plague with magic acid-drops. After that it was time for dinner, and\nafter dinner we talked it all over and settled that we would go and see\nthe Generous Benefactor the very next day. But we thought perhaps the G.\nB.--it is short for Generous Benefactor--would not like it if there were\nso many of us. I have often noticed that it is the worst of our being\nsix--people think six a great many, when it’s children. That sentence\nlooks wrong somehow. I mean they don’t mind six pairs of boots, or six\npounds of apples, or six oranges, especially in equations, but they\nseem to think you ought not to have five brothers and sisters. Of course\nDicky was to go, because it was his idea. Dora had to go to Blackheath\nto see an old lady, a friend of Father’s, so she couldn’t go. Alice\nsaid _she_ ought to go, because it said, ‘Ladies _and_ gentlemen,’ and\nperhaps the G. B. wouldn’t let us have the money unless there were both\nkinds of us.\n\nH. O. said Alice wasn’t a lady; and she said _he_ wasn’t going, anyway.\nThen he called her a disagreeable cat, and she began to cry.\n\nBut Oswald always tries to make up quarrels, so he said--\n\n‘You’re little sillies, both of you!’\n\nAnd Dora said, ‘Don’t cry, Alice; he only meant you weren’t a grown-up\nlady.’\n\nThen H. O. said, ‘What else did you think I meant, Disagreeable?’\n\nSo Dicky said, ‘Don’t be disagreeable yourself, H. O. Let her alone and\nsay you’re sorry, or I’ll jolly well make you!’\n\nSo H. O. said he was sorry. Then Alice kissed him and said she was sorry\ntoo; and after that H. O. gave her a hug, and said, ‘Now I’m _really and\ntruly_ sorry,’ So it was all right.\n\nNoel went the last time any of us went to London, so he was out of it,\nand Dora said she would take him to Blackheath if we’d take H. O. So as\nthere’d been a little disagreeableness we thought it was better to take\nhim, and we did. At first we thought we’d tear our oldest things a bit\nmore, and put some patches of different colours on them, to show the\nG. B. how much we wanted money. But Dora said that would be a sort\nof cheating, pretending we were poorer than we are. And Dora is right\nsometimes, though she is our elder sister. Then we thought we’d better\nwear our best things, so that the G. B. might see we weren’t so very\npoor that he couldn’t trust us to pay his money back when we had it. But\nDora said that would be wrong too. So it came to our being quite honest,\nas Dora said, and going just as we were, without even washing our faces\nand hands; but when I looked at H. O. in the train I wished we had not\nbeen quite so particularly honest.\n\nEvery one who reads this knows what it is like to go in the train, so I\nshall not tell about it--though it was rather fun, especially the part\nwhere the guard came for the tickets at Waterloo, and H. O. was under\nthe seat and pretended to be a dog without a ticket. We went to Charing\nCross, and we just went round to Whitehall to see the soldiers and then\nby St James’s for the same reason--and when we’d looked in the shops a\nbit we got to Brook Street, Bond Street. It was a brass plate on a\ndoor next to a shop--a very grand place, where they sold bonnets and\nhats--all very bright and smart, and no tickets on them to tell you\nthe price. We rang a bell and a boy opened the door and we asked for Mr\nRosenbaum. The boy was not polite; he did not ask us in. So then Dicky\ngave him his visiting card; it was one of Father’s really, but the\nname is the same, Mr Richard Bastable, and we others wrote our names\nunderneath. I happened to have a piece of pink chalk in my pocket and we\nwrote them with that.\n\nThen the boy shut the door in our faces and we waited on the step. But\npresently he came down and asked our business. So Dicky said--\n\n‘Money advanced, young shaver! and don’t be all day about it!’\n\nAnd then he made us wait again, till I was quite stiff in my legs, but\nAlice liked it because of looking at the hats and bonnets, and at last\nthe door opened, and the boy said--\n\n‘Mr Rosenbaum will see you,’ so we wiped our feet on the mat, which said\nso, and we went up stairs with soft carpets and into a room. It was a\nbeautiful room. I wished then we had put on our best things, or at least\nwashed a little. But it was too late now.\n\nThe room had velvet curtains and a soft, soft carpet, and it was full\nof the most splendid things. Black and gold cabinets, and china, and\nstatues, and pictures. There was a picture of a cabbage and a pheasant\nand a dead hare that was just like life, and I would have given worlds\nto have it for my own. The fur was so natural I should never have been\ntired of looking at it; but Alice liked the one of the girl with\nthe broken jug best. Then besides the pictures there were clocks and\ncandlesticks and vases, and gilt looking-glasses, and boxes of cigars\nand scent and things littered all over the chairs and tables. It was a\nwonderful place, and in the middle of all the splendour was a little old\ngentleman with a very long black coat and a very long white beard and a\nhookey nose--like a falcon. And he put on a pair of gold spectacles and\nlooked at us as if he knew exactly how much our clothes were worth.\n\nAnd then, while we elder ones were thinking how to begin, for we had\nall said ‘Good morning’ as we came in, of course, H. O. began before we\ncould stop him. He said:\n\n‘Are you the G. B.?’\n\n‘The _what_?’ said the little old gentleman.\n\n‘The G. B.,’ said H. O., and I winked at him to shut up, but he didn’t\nsee me, and the G. B. did. He waved his hand at _me_ to shut up, so I\nhad to, and H. O. went on--‘It stands for Generous Benefactor.’\n\nThe old gentleman frowned. Then he said, ‘Your Father sent you here, I\nsuppose?’\n\n‘No he didn’t,’ said Dicky. ‘Why did you think so?’\n\nThe old gentleman held out the card, and I explained that we took that\nbecause Father’s name happens to be the same as Dicky’s.\n\n‘Doesn’t he know you’ve come?’\n\n‘No,’ said Alice, ‘we shan’t tell him till we’ve got the partnership,\nbecause his own business worries him a good deal and we don’t want to\nbother him with ours till it’s settled, and then we shall give him half\nour share.’\n\nThe old gentleman took off his spectacles and rumpled his hair with his\nhands, then he said, ‘Then what _did_ you come for?’\n\n‘We saw your advertisement,’ Dicky said, ‘and we want a hundred pounds\non our note of hand, and my sister came so that there should be both\nkinds of us; and we want it to buy a partnership with in the lucrative\nbusiness for sale of useful patent. No personal attendance necessary.’\n\n‘I don’t think I quite follow you,’ said the G. B. ‘But one thing I\nshould like settled before entering more fully into the matter: why did\nyou call me Generous Benefactor?’\n\n‘Well, you see,’ said Alice, smiling at him to show she wasn’t\nfrightened, though I know really she was, awfully, ‘we thought it was so\n_very_ kind of you to try to find out the poor people who want money and\nto help them and lend them your money.’\n\n‘Hum!’ said the G. B. ‘Sit down.’\n\nHe cleared the clocks and vases and candlesticks off some of the chairs,\nand we sat down. The chairs were velvety, with gilt legs. It was like a\nking’s palace.\n\n‘Now,’ he said, ‘you ought to be at school, instead of thinking about\nmoney. Why aren’t you?’\n\nWe told him that we should go to school again when Father could manage\nit, but meantime we wanted to do something to restore the fallen\nfortunes of the House of Bastable. And we said we thought the lucrative\npatent would be a very good thing. He asked a lot of questions, and we\ntold him everything we didn’t think Father would mind our telling, and\nat last he said--\n\n‘You wish to borrow money. When will you repay it?’\n\n‘As soon as we’ve got it, of course,’ Dicky said.\n\nThen the G. B. said to Oswald, ‘You seem the eldest,’ but I explained to\nhim that it was Dicky’s idea, so my being eldest didn’t matter. Then he\nsaid to Dicky--‘You are a minor, I presume?’\n\nDicky said he wasn’t yet, but he had thought of being a mining engineer\nsome day, and going to Klondike.\n\n‘Minor, not miner,’ said the G. B. ‘I mean you’re not of age?’\n\n‘I shall be in ten years, though,’ said Dicky. ‘Then you might repudiate\nthe loan,’ said the G. B., and Dicky said ‘What?’\n\nOf course he ought to have said ‘I beg your pardon. I didn’t quite catch\nwhat you said’--that is what Oswald would have said. It is more polite\nthan ‘What.’\n\n‘Repudiate the loan,’ the G. B repeated. ‘I mean you might say you would\nnot pay me back the money, and the law could not compel you to do so.’\n\n‘Oh, well, if you think we’re such sneaks,’ said Dicky, and he got\nup off his chair. But the G. B. said, ‘Sit down, sit down; I was only\njoking.’\n\nThen he talked some more, and at last he said--‘I don’t advise you to\nenter into that partnership. It’s a swindle. Many advertisements are.\nAnd I have not a hundred pounds by me to-day to lend you. But I will\nlend you a pound, and you can spend it as you like. And when you are\ntwenty-one you shall pay me back.’\n\n‘I shall pay you back long before that,’ said Dicky. ‘Thanks, awfully!\nAnd what about the note of hand?’\n\n‘Oh,’ said the G. B., ‘I’ll trust to your honour. Between gentlemen, you\nknow--and ladies’--he made a beautiful bow to Alice--‘a word is as good\nas a bond.’\n\nThen he took out a sovereign, and held it in his hand while he talked\nto us. He gave us a lot of good advice about not going into business\ntoo young, and about doing our lessons--just swatting a bit, on our own\nhook, so as not to be put in a low form when we went back to school. And\nall the time he was stroking the sovereign and looking at it as if he\nthought it very beautiful. And so it was, for it was a new one. Then at\nlast he held it out to Dicky, and when Dicky put out his hand for it the\nG. B. suddenly put the sovereign back in his pocket.\n\n‘No,’ he said, ‘I won’t give you the sovereign. I’ll give you fifteen\nshillings, and this nice bottle of scent. It’s worth far more than the\nfive shillings I’m charging you for it. And, when you can, you shall pay\nme back the pound, and sixty per cent interest--sixty per cent, sixty\nper cent.’\n\n‘What’s that?’ said H. O.\n\nThe G. B. said he’d tell us that when we paid back the sovereign, but\nsixty per cent was nothing to be afraid of. He gave Dicky the money. And\nthe boy was made to call a cab, and the G. B. put us in and shook hands\nwith us all, and asked Alice to give him a kiss, so she did, and H. O.\nwould do it too, though his face was dirtier than ever. The G. B. paid\nthe cabman and told him what station to go to, and so we went home.\n\nThat evening Father had a letter by the seven-o’clock post. And when\nhe had read it he came up into the nursery. He did not look quite so\nunhappy as usual, but he looked grave.\n\n‘You’ve been to Mr Rosenbaum’s,’ he said.\n\nSo we told him all about it. It took a long time, and Father sat in the\narmchair. It was jolly. He doesn’t often come and talk to us now. He has\nto spend all his time thinking about his business. And when we’d told\nhim all about it he said--\n\n‘You haven’t done any harm this time, children; rather good than harm,\nindeed. Mr Rosenbaum has written me a very kind letter.’\n\n‘Is he a friend of yours, Father?’ Oswald asked. ‘He is an\nacquaintance,’ said my father, frowning a little, ‘we have done some\nbusiness together. And this letter--’ he stopped and then said: ‘No;\nyou didn’t do any harm to-day; but I want you for the future not to do\nanything so serious as to try to buy a partnership without consulting\nme, that’s all. I don’t want to interfere with your plays and pleasures;\nbut you will consult me about business matters, won’t you?’\n\nOf course we said we should be delighted, but then Alice, who was\nsitting on his knee, said, ‘We didn’t like to bother you.’\n\nFather said, ‘I haven’t much time to be with you, for my business takes\nmost of my time. It is an anxious business--but I can’t bear to think of\nyour being left all alone like this.’\n\nHe looked so sad we all said we liked being alone. And then he looked\nsadder than ever.\n\nThen Alice said, ‘We don’t mean that exactly, Father. It is rather\nlonely sometimes, since Mother died.’\n\nThen we were all quiet a little while. Father stayed with us till we\nwent to bed, and when he said good night he looked quite cheerful. So we\ntold him so, and he said--\n\n‘Well, the fact is, that letter took a weight off my mind.’ I can’t\nthink what he meant--but I am sure the G. B. would be pleased if he\ncould know he had taken a weight off somebody’s mind. He is that sort of\nman, I think.\n\nWe gave the scent to Dora. It is not quite such good scent as we thought\nit would be, but we had fifteen shillings--and they were all good, so is\nthe G. B.\n\nAnd until those fifteen shillings were spent we felt almost as jolly as\nthough our fortunes had been properly restored. You do not notice your\ngeneral fortune so much, as long as you have money in your pocket. This\nis why so many children with regular pocket-money have never felt\nit their duty to seek for treasure. So, perhaps, our not having\npocket-money was a blessing in disguise. But the disguise was quite\nimpenetrable, like the villains’ in the books; and it seemed still more\nso when the fifteen shillings were all spent. Then at last the others\nagreed to let Oswald try his way of seeking for treasure, but they were\nnot at all keen about it, and many a boy less firm than Oswald would\nhave chucked the whole thing. But Oswald knew that a hero must rely on\nhimself alone. So he stuck to it, and presently the others saw their\nduty, and backed him up.\n\n\n\nCHAPTER 10. LORD TOTTENHAM\n\nOswald is a boy of firm and unswerving character, and he had never\nwavered from his first idea. He felt quite certain that the books were\nright, and that the best way to restore fallen fortunes was to rescue an\nold gentleman in distress. Then he brings you up as his own son: but\nif you preferred to go on being your own father’s son I expect the old\ngentleman would make it up to you some other way. In the books the least\nthing does it--you put up the railway carriage window--or you pick up\nhis purse when he drops it--or you say a hymn when he suddenly asks you\nto, and then your fortune is made.\n\nThe others, as I said, were very slack about it, and did not seem to\ncare much about trying the rescue. They said there wasn’t any deadly\nperil, and we should have to make one before we could rescue the old\ngentleman from it, but Oswald didn’t see that that mattered. However, he\nthought he would try some of the easier ways first, by himself.\n\nSo he waited about the station, pulling up railway carriage windows for\nold gentlemen who looked likely--but nothing happened, and at last the\nporters said he was a nuisance. So that was no go. No one ever asked him\nto say a hymn, though he had learned a nice short one, beginning ‘New\nevery morning’--and when an old gentleman did drop a two-shilling piece\njust by Ellis’s the hairdresser’s, and Oswald picked it up, and was\njust thinking what he should say when he returned it, the old gentleman\ncaught him by the collar and called him a young thief. It would have\nbeen very unpleasant for Oswald if he hadn’t happened to be a very\nbrave boy, and knew the policeman on that beat very well indeed. So the\npoliceman backed him up, and the old gentleman said he was sorry, and\noffered Oswald sixpence. Oswald refused it with polite disdain, and\nnothing more happened at all.\n\nWhen Oswald had tried by himself and it had not come off, he said to the\nothers, ‘We’re wasting our time, not trying to rescue the old gentleman\nin deadly peril. Come--buck up! Do let’s do something!’\n\nIt was dinner-time, and Pincher was going round getting the bits off\nthe plates. There were plenty because it was cold-mutton day. And Alice\nsaid--\n\n‘It’s only fair to try Oswald’s way--he has tried all the things the\nothers thought of. Why couldn’t we rescue Lord Tottenham?’\n\nLord Tottenham is the old gentleman who walks over the Heath every day\nin a paper collar at three o’clock--and when he gets halfway, if there\nis no one about, he changes his collar and throws the dirty one into the\nfurze-bushes.\n\nDicky said, ‘Lord Tottenham’s all right--but where’s the deadly peril?’\n\nAnd we couldn’t think of any. There are no highwaymen on Blackheath now,\nI am sorry to say. And though Oswald said half of us could be highwaymen\nand the other half rescue party, Dora kept on saying it would be wrong\nto be a highwayman--and so we had to give that up.\n\nThen Alice said, ‘What about Pincher?’\n\nAnd we all saw at once that it could be done.\n\nPincher is very well bred, and he does know one or two things, though we\nnever could teach him to beg. But if you tell him to hold on--he will do\nit, even if you only say ‘Seize him!’ in a whisper.\n\nSo we arranged it all. Dora said she wouldn’t play; she said she thought\nit was wrong, and she knew it was silly--so we left her out, and she\nwent and sat in the dining-room with a goody-book, so as to be able to\nsay she didn’t have anything to do with it, if we got into a row over\nit.\n\nAlice and H. O. were to hide in the furze-bushes just by where Lord\nTottenham changes his collar, and they were to whisper, ‘Seize him!’ to\nPincher; and then when Pincher had seized Lord Tottenham we were to\ngo and rescue him from his deadly peril. And he would say, ‘How can I\nreward you, my noble young preservers?’ and it would be all right.\n\nSo we went up to the Heath. We were afraid of being late. Oswald told\nthe others what Procrastination was--so they got to the furze-bushes a\nlittle after two o’clock, and it was rather cold. Alice and H. O. and\nPincher hid, but Pincher did not like it any more than they did, and as\nwe three walked up and down we heard him whining. And Alice kept saying,\n‘I _am_ so cold! Isn’t he coming yet?’ And H. O. wanted to come out\nand jump about to warm himself. But we told him he must learn to be\na Spartan boy, and that he ought to be very thankful he hadn’t got a\nbeastly fox eating his inside all the time. H. O. is our little brother,\nand we are not going to let it be our fault if he grows up a milksop.\nBesides, it was not really cold. It was his knees--he wears socks. So\nthey stayed where they were. And at last, when even the other three who\nwere walking about were beginning to feel rather chilly, we saw Lord\nTottenham’s big black cloak coming along, flapping in the wind like a\ngreat bird. So we said to Alice--\n\n‘Hist! he approaches. You’ll know when to set Pincher on by hearing Lord\nTottenham talking to himself--he always does while he is taking off his\ncollar.’\n\nThen we three walked slowly away whistling to show we were not thinking\nof anything. Our lips were rather cold, but we managed to do it.\n\nLord Tottenham came striding along, talking to himself. People call him\nthe mad Protectionist. I don’t know what it means--but I don’t think\npeople ought to call a Lord such names.\n\nAs he passed us he said, ‘Ruin of the country, sir! Fatal error, fatal\nerror!’ And then we looked back and saw he was getting quite near where\nPincher was, and Alice and H. O. We walked on--so that he shouldn’t\nthink we were looking--and in a minute we heard Pincher’s bark, and then\nnothing for a bit; and then we looked round, and sure enough good old\nPincher had got Lord Tottenham by the trouser leg and was holding on\nlike billy-ho, so we started to run.\n\nLord Tottenham had got his collar half off--it was sticking out sideways\nunder his ear--and he was shouting, ‘Help, help, murder!’ exactly as if\nsome one had explained to him beforehand what he was to do. Pincher was\ngrowling and snarling and holding on. When we got to him I stopped and\nsaid--\n\n‘Dicky, we must rescue this good old man.’\n\nLord Tottenham roared in his fury, ‘Good old man be--’ something or\nothered. ‘Call the dog off.’\n\nSo Oswald said, ‘It is a dangerous task--but who would hesitate to do an\nact of true bravery?’\n\nAnd all the while Pincher was worrying and snarling, and Lord Tottenham\nshouting to us to get the dog away. He was dancing about in the road\nwith Pincher hanging on like grim death; and his collar flapping about,\nwhere it was undone.\n\nThen Noel said, ‘Haste, ere yet it be too late.’ So I said to Lord\nTottenham--\n\n‘Stand still, aged sir, and I will endeavour to alleviate your\ndistress.’\n\nHe stood still, and I stooped down and caught hold of Pincher and\nwhispered, ‘Drop it, sir; drop it!’\n\nSo then Pincher dropped it, and Lord Tottenham fastened his collar\nagain--he never does change it if there’s any one looking--and he said--\n\n‘I’m much obliged, I’m sure. Nasty vicious brute! Here’s something to\ndrink my health.’\n\nBut Dicky explained that we are teetotallers, and do not drink people’s\nhealths. So Lord Tottenham said, ‘Well, I’m much obliged any way. And\nnow I come to look at you--of course, you’re not young ruffians, but\ngentlemen’s sons, eh? Still, you won’t be above taking a tip from an old\nboy--I wasn’t when I was your age,’ and he pulled out half a sovereign.\n\nIt was very silly; but now we’d done it I felt it would be beastly mean\nto take the old boy’s chink after putting him in such a funk. He didn’t\nsay anything about bringing us up as his own sons--so I didn’t know what\nto do. I let Pincher go, and was just going to say he was very welcome,\nand we’d rather not have the money, which seemed the best way out of it,\nwhen that beastly dog spoiled the whole show. Directly I let him go he\nbegan to jump about at us and bark for joy, and try to lick our faces.\nHe was so proud of what he’d done. Lord Tottenham opened his eyes and he\njust said, ‘The dog seems to know you.’\n\nAnd then Oswald saw it was all up, and he said, ‘Good morning,’ and\ntried to get away. But Lord Tottenham said--\n\n‘Not so fast!’ And he caught Noel by the collar. Noel gave a howl, and\nAlice ran out from the bushes. Noel is her favourite. I’m sure I don’t\nknow why. Lord Tottenham looked at her, and he said--\n\n‘So there are more of you!’ And then H. O. came out.\n\n‘Do you complete the party?’ Lord Tottenham asked him. And H. O. said\nthere were only five of us this time.\n\nLord Tottenham turned sharp off and began to walk away, holding Noel by\nthe collar. We caught up with him, and asked him where he was going, and\nhe said, ‘To the Police Station.’ So then I said quite politely, ‘Well,\ndon’t take Noel; he’s not strong, and he easily gets upset. Besides, it\nwasn’t his doing. If you want to take any one take me--it was my very\nown idea.’\n\nDicky behaved very well. He said, ‘If you take Oswald I’ll go too, but\ndon’t take Noel; he’s such a delicate little chap.’\n\nLord Tottenham stopped, and he said, ‘You should have thought of that\nbefore.’ Noel was howling all the time, and his face was very white, and\nAlice said--\n\n‘Oh, do let Noel go, dear, good, kind Lord Tottenham; he’ll faint if you\ndon’t, I know he will, he does sometimes. Oh, I wish we’d never done it!\nDora said it was wrong.’\n\n‘Dora displayed considerable common sense,’ said Lord Tottenham, and he\nlet Noel go. And Alice put her arm round Noel and tried to cheer him up,\nbut he was all trembly, and as white as paper.\n\nThen Lord Tottenham said--\n\n‘Will you give me your word of honour not to try to escape?’\n\nSo we said we would.\n\n‘Then follow me,’ he said, and led the way to a bench. We all followed,\nand Pincher too, with his tail between his legs--he knew something was\nwrong. Then Lord Tottenham sat down, and he made Oswald and Dicky and\nH. O. stand in front of him, but he let Alice and Noel sit down. And he\nsaid--\n\n‘You set your dog on me, and you tried to make me believe you were\nsaving me from it. And you would have taken my half-sovereign. Such\nconduct is most--No--you shall tell me what it is, sir, and speak the\ntruth.’\n\nSo I had to say it was most ungentlemanly, but I said I hadn’t been\ngoing to take the half-sovereign.\n\n‘Then what did you do it for?’ he asked. ‘The truth, mind.’\n\nSo I said, ‘I see now it was very silly, and Dora said it was wrong,\nbut it didn’t seem so till we did it. We wanted to restore the fallen\nfortunes of our house, and in the books if you rescue an old gentleman\nfrom deadly peril, he brings you up as his own son--or if you prefer\nto be your father’s son, he starts you in business, so that you end in\nwealthy affluence; and there wasn’t any deadly peril, so we made Pincher\ninto one--and so--’ I was so ashamed I couldn’t go on, for it did seem\nan awfully mean thing. Lord Tottenham said--\n\n‘A very nice way to make your fortune--by deceit and trickery. I have a\nhorror of dogs. If I’d been a weak man the shock might have killed me.\nWhat do you think of yourselves, eh?’\n\nWe were all crying except Oswald, and the others say he was; and Lord\nTottenham went on--‘Well, well, I see you’re sorry. Let this be a lesson\nto you; and we’ll say no more about it. I’m an old man now, but I was\nyoung once.’\n\nThen Alice slid along the bench close to him, and put her hand on his\narm: her fingers were pink through the holes in her woolly gloves, and\nsaid, ‘I think you’re very good to forgive us, and we are really very,\nvery sorry. But we wanted to be like the children in the books--only\nwe never have the chances they have. Everything they do turns out all\nright. But we _are_ sorry, very, very. And I know Oswald wasn’t going to\ntake the half-sovereign. Directly you said that about a tip from an old\nboy I began to feel bad inside, and I whispered to H. O. that I wished\nwe hadn’t.’\n\nThen Lord Tottenham stood up, and he looked like the Death of Nelson,\nfor he is clean shaved and it is a good face, and he said--\n\n‘Always remember never to do a dishonourable thing, for money or for\nanything else in the world.’\n\nAnd we promised we would remember. Then he took off his hat, and we took\noff ours, and he went away, and we went home. I never felt so cheap in\nall my life! Dora said, ‘I told you so,’ but we didn’t mind even that so\nmuch, though it was indeed hard to bear. It was what Lord Tottenham had\nsaid about ungentlemanly. We didn’t go on to the Heath for a week after\nthat; but at last we all went, and we waited for him by the bench. When\nhe came along Alice said, ‘Please, Lord Tottenham, we have not been on\nthe Heath for a week, to be a punishment because you let us off. And we\nhave brought you a present each if you will take them to show you are\nwilling to make it up.’\n\nHe sat down on the bench, and we gave him our presents. Oswald gave him\na sixpenny compass--he bought it with my own money on purpose to give\nhim. Oswald always buys useful presents. The needle would not move after\nI’d had it a day or two, but Lord Tottenham used to be an admiral, so\nhe will be able to make that go all right. Alice had made him a\nshaving-case, with a rose worked on it. And H. O. gave him his\nknife--the same one he once cut all the buttons off his best suit with.\nDicky gave him his prize, Naval Heroes, because it was the best thing he\nhad, and Noel gave him a piece of poetry he had made himself--\n\n    When sin and shame bow down the brow\n    Then people feel just like we do now.\n    We are so sorry with grief and pain\n    We never will be so ungentlemanly again.\n\nLord Tottenham seemed very pleased. He thanked us, and talked to us for\na bit, and when he said good-bye he said--\n\n‘All’s fair weather now, mates,’ and shook hands.\n\nAnd whenever we meet him he nods to us, and if the girls are with us\nhe takes off his hat, so he can’t really be going on thinking us\nungentlemanly now.\n\n\n\nCHAPTER 11. CASTILIAN AMOROSO\n\nOne day when we suddenly found that we had half a crown we decided that\nwe really ought to try Dicky’s way of restoring our fallen fortunes\nwhile yet the deed was in our power. Because it might easily have\nhappened to us never to have half a crown again. So we decided to dally\nno longer with being journalists and bandits and things like them, but\nto send for sample and instructions how to earn two pounds a week each\nin our spare time. We had seen the advertisement in the paper, and we\nhad always wanted to do it, but we had never had the money to spare\nbefore, somehow. The advertisement says: ‘Any lady or gentleman\ncan easily earn two pounds a week in their spare time. Sample and\ninstructions, two shillings. Packed free from observation.’ A good deal\nof the half-crown was Dora’s. It came from her godmother; but she said\nshe would not mind letting Dicky have it if he would pay her back before\nChristmas, and if we were sure it was right to try to make our fortune\nthat way. Of course that was quite easy, because out of two pounds a\nweek in your spare time you can easily pay all your debts, and have\nalmost as much left as you began with; and as to the right we told her\nto dry up.\n\nDicky had always thought that this was really the best way to restore\nour fallen fortunes, and we were glad that now he had a chance of trying\nbecause of course we wanted the two pounds a week each, and besides, we\nwere rather tired of Dicky’s always saying, when our ways didn’t turn\nout well, ‘Why don’t you try the sample and instructions about our spare\ntime?’\n\nWhen we found out about our half-crown we got the paper. Noel was\nplaying admirals in it, but he had made the cocked hat without tearing\nthe paper, and we found the advertisement, and it said just the same as\never. So we got a two-shilling postal order and a stamp, and what was\nleft of the money it was agreed we would spend in ginger-beer to drink\nsuccess to trade.\n\nWe got some nice paper out of Father’s study, and Dicky wrote the\nletter, and we put in the money and put on the stamp, and made H. O.\npost it. Then we drank the ginger-beer, and then we waited for the\nsample and instructions. It seemed a long time coming, and the postman\ngot quite tired of us running out and stopping him in the street to ask\nif it had come.\n\nBut on the third morning it came. It was quite a large parcel, and\nit was packed, as the advertisement said it would be, ‘free from\nobservation.’ That means it was in a box; and inside the box was some\nstiff browny cardboard, crinkled like the galvanized iron on the tops of\nchicken-houses, and inside that was a lot of paper, some of it printed\nand some scrappy, and in the very middle of it all a bottle, not\nvery large, and black, and sealed on the top of the cork with yellow\nsealing-wax.\n\nWe looked at it as it lay on the nursery table, and while all the others\ngrabbed at the papers to see what the printing said, Oswald went to look\nfor the corkscrew, so as to see what was inside the bottle. He found\nthe corkscrew in the dresser drawer--it always gets there, though it is\nsupposed to be in the sideboard drawer in the dining-room--and when he\ngot back the others had read most of the printed papers.\n\n‘I don’t think it’s much good, and I don’t think it’s quite nice to sell\nwine,’ Dora said ‘and besides, it’s not easy to suddenly begin to sell\nthings when you aren’t used to it.’\n\n‘I don’t know,’ said Alice; ‘I believe I could.’ They all looked rather\ndown in the mouth, though, and Oswald asked how you were to make your\ntwo pounds a week.\n\n‘Why, you’ve got to get people to taste that stuff in the bottle. It’s\nsherry--Castilian Amoroso its name is--and then you get them to buy it,\nand then you write to the people and tell them the other people want the\nwine, and then for every dozen you sell you get two shillings from the\nwine people, so if you sell twenty dozen a week you get your two pounds.\nI don’t think we shall sell as much as that,’ said Dicky.\n\n‘We might not the first week,’ Alice said, ‘but when people found out\nhow nice it was, they would want more and more. And if we only got ten\nshillings a week it would be something to begin with, wouldn’t it?’\n\nOswald said he should jolly well think it would, and then Dicky took the\ncork out with the corkscrew. The cork broke a good deal, and some of\nthe bits went into the bottle. Dora got the medicine glass that has\nthe teaspoons and tablespoons marked on it, and we agreed to have a\nteaspoonful each, to see what it was like.\n\n‘No one must have more than that,’ Dora said, ‘however nice it is.’\n\nDora behaved rather as if it were her bottle. I suppose it was, because\nshe had lent the money for it.\n\nThen she measured out the teaspoonful, and she had first go, because of\nbeing the eldest. We asked at once what it was like, but Dora could not\nspeak just then.\n\nThen she said, ‘It’s like the tonic Noel had in the spring; but perhaps\nsherry ought to be like that.’\n\nThen it was Oswald’s turn. He thought it was very burny; but he said\nnothing. He wanted to see first what the others would say.\n\nDicky said his was simply beastly, and Alice said Noel could taste next\nif he liked.\n\nNoel said it was the golden wine of the gods, but he had to put his\nhandkerchief up to his mouth all the same, and I saw the face he made.\n\nThen H. O. had his, and he spat it out in the fire, which was very rude\nand nasty, and we told him so.\n\nThen it was Alice’s turn. She said, ‘Only half a teaspoonful for me,\nDora. We mustn’t use it all up.’ And she tasted it and said nothing.\n\nThen Dicky said: ‘Look here, I chuck this. I’m not going to hawk round\nsuch beastly stuff. Any one who likes can have the bottle. Quis?’\n\nAnd Alice got out ‘Ego’ before the rest of us. Then she said, ‘I know\nwhat’s the matter with it. It wants sugar.’\n\nAnd at once we all saw that that was all there was the matter with the\nstuff. So we got two lumps of sugar and crushed it on the floor with one\nof the big wooden bricks till it was powdery, and mixed it with some of\nthe wine up to the tablespoon mark, and it was quite different, and not\nnearly so nasty.\n\n‘You see it’s all right when you get used to it,’ Dicky said. I think he\nwas sorry he had said ‘Quis?’ in such a hurry.\n\n‘Of course,’ Alice said, ‘it’s rather dusty. We must crush the sugar\ncarefully in clean paper before we put it in the bottle.’\n\nDora said she was afraid it would be cheating to make one bottle nicer\nthan what people would get when they ordered a dozen bottles, but Alice\nsaid Dora always made a fuss about everything, and really it would be\nquite honest.\n\n‘You see,’ she said, ‘I shall just tell them, quite truthfully, what\nwe have done to it, and when their dozens come they can do it for\nthemselves.’\n\nSo then we crushed eight more lumps, very cleanly and carefully between\nnewspapers, and shook it up well in the bottle, and corked it up with a\nscrew of paper, brown and not news, for fear of the poisonous printing\nink getting wet and dripping down into the wine and killing people. We\nmade Pincher have a taste, and he sneezed for ever so long, and after\nthat he used to go under the sofa whenever we showed him the bottle.\n\nThen we asked Alice who she would try and sell it to. She said: ‘I shall\nask everybody who comes to the house. And while we are doing that, we\ncan be thinking of outside people to take it to. We must be careful:\nthere’s not much more than half of it left, even counting the sugar.’\n\nWe did not wish to tell Eliza--I don’t know why. And she opened the door\nvery quickly that day, so that the Taxes and a man who came to our house\nby mistake for next door got away before Alice had a chance to try them\nwith the Castilian Amoroso. But about five Eliza slipped out for half an\nhour to see a friend who was making her a hat for Sunday, and while\nshe was gone there was a knock. Alice went, and we looked over the\nbanisters. When she opened the door, she said at once, ‘Will you walk\nin, please?’ The person at the door said, ‘I called to see your Pa,\nmiss. Is he at home?’\n\nAlice said again, ‘Will you walk in, please?’\n\nThen the person--it sounded like a man--said, ‘He is in, then?’\n\nBut Alice only kept on saying, ‘Will you walk in, please?’ so at last\nthe man did, rubbing his boots very loudly on the mat.\n\nThen Alice shut the front door, and we saw that it was the butcher, with\nan envelope in his hand. He was not dressed in blue, like when he is\ncutting up the sheep and things in the shop, and he wore knickerbockers.\nAlice says he came on a bicycle. She led the way into the dining-room,\nwhere the Castilian Amoroso bottle and the medicine glass were standing\non the table all ready.\n\nThe others stayed on the stairs, but Oswald crept down and looked\nthrough the door-crack.\n\n‘Please sit down,’ said Alice quite calmly, though she told me\nafterwards I had no idea how silly she felt. And the butcher sat down.\nThen Alice stood quite still and said nothing, but she fiddled with\nthe medicine glass and put the screw of brown paper straight in the\nCastilian bottle.\n\n‘Will you tell your Pa I’d like a word with him?’ the butcher said, when\nhe got tired of saying nothing.\n\n‘He’ll be in very soon, I think,’ Alice said.\n\nAnd then she stood still again and said nothing. It was beginning to\nlook very idiotic of her, and H. O. laughed. I went back and cuffed him\nfor it quite quietly, and I don’t think the butcher heard.\n\nBut Alice did, and it roused her from her stupor. She spoke suddenly,\nvery fast indeed--so fast that I knew she had made up what she was going\nto say before. She had got most of it out of the circular.\n\nShe said, ‘I want to call your attention to a sample of sherry wine I\nhave here. It is called Castilian something or other, and at the price\nit is unequalled for flavour and bouquet.’\n\nThe butcher said, ‘Well--I never!’\n\nAnd Alice went on, ‘Would you like to taste it?’\n\n‘Thank you very much, I’m sure, miss,’ said the butcher.\n\nAlice poured some out.\n\nThe butcher tasted a very little. He licked his lips, and we thought\nhe was going to say how good it was. But he did not. He put down the\nmedicine glass with nearly all the stuff left in it (we put it back in\nthe bottle afterwards to save waste) and said, ‘Excuse me, miss, but\nisn’t it a little sweet?--for sherry I mean?’\n\n‘The _Real_ isn’t,’ said Alice. ‘If you order a dozen it will come quite\ndifferent to that--we like it best with sugar. I wish you _would_ order\nsome.’ The butcher asked why.\n\nAlice did not speak for a minute, and then she said--\n\n‘I don’t mind telling _you_: you are in business yourself, aren’t\nyou? We are trying to get people to buy it, because we shall have two\nshillings for every dozen we can make any one buy. It’s called a purr\nsomething.’\n\n‘A percentage. Yes, I see,’ said the butcher, looking at the hole in the\ncarpet.\n\n‘You see there are reasons,’ Alice went on, ‘why we want to make our\nfortunes as quickly as we can.’\n\n‘Quite so,’ said the butcher, and he looked at the place where the paper\nis coming off the wall.\n\n‘And this seems a good way,’ Alice went on. ‘We paid two shillings for\nthe sample and instructions, and it says you can make two pounds a week\neasily in your leisure time.’\n\n‘I’m sure I hope you may, miss,’ said the butcher. And Alice said again\nwould he buy some?\n\n‘Sherry is my favourite wine,’ he said. Alice asked him to have some\nmore to drink.\n\n‘No, thank you, miss,’ he said; ‘it’s my favourite wine, but it doesn’t\nagree with me; not the least bit. But I’ve an uncle drinks it. Suppose I\nordered him half a dozen for a Christmas present? Well, miss, here’s the\nshilling commission, anyway,’ and he pulled out a handful of money and\ngave her the shilling.\n\n‘But I thought the wine people paid that,’ Alice said.\n\nBut the butcher said not on half-dozens they didn’t. Then he said he\ndidn’t think he’d wait any longer for Father--but would Alice ask Father\nto write him?\n\nAlice offered him the sherry again, but he said something about ‘Not\nfor worlds!’--and then she let him out and came back to us with the\nshilling, and said, ‘How’s that?’\n\nAnd we said ‘A1.’\n\nAnd all the evening we talked of our fortune that we had begun to make.\n\nNobody came next day, but the day after a lady came to ask for money to\nbuild an orphanage for the children of dead sailors. And we saw her. I\nwent in with Alice. And when we had explained to her that we had only\na shilling and we wanted it for something else, Alice suddenly said,\n‘Would you like some wine?’\n\nAnd the lady said, ‘Thank you very much,’ but she looked surprised.\n\nShe was not a young lady, and she had a mantle with beads, and the beads\nhad come off in places--leaving a browny braid showing, and she had\nprinted papers about the dead sailors in a sealskin bag, and the\nseal had come off in places, leaving the skin bare. We gave her a\ntablespoonful of the wine in a proper wine-glass out of the sideboard,\nbecause she was a lady. And when she had tasted it she got up in a very\ngreat hurry, and shook out her dress and snapped her bag shut, and said,\n‘You naughty, wicked children! What do you mean by playing a trick like\nthis? You ought to be ashamed of yourselves! I shall write to your Mamma\nabout it. You dreadful little girl!--you might have poisoned me. But\nyour Mamma...’\n\nThen Alice said, ‘I’m very sorry; the butcher liked it, only he said it\nwas sweet. And please don’t write to Mother. It makes Father so unhappy\nwhen letters come for her!’--and Alice was very near crying.\n\n‘What do you mean, you silly child?’ said the lady, looking quite\nbright and interested. ‘Why doesn’t your Father like your Mother to have\nletters--eh?’\n\nAnd Alice said, ‘OH, you...!’ and began to cry, and bolted out of the\nroom.\n\nThen I said, ‘Our Mother is dead, and will you please go away now?’\n\nThe lady looked at me a minute, and then she looked quite different, and\nshe said, ‘I’m very sorry. I didn’t know. Never mind about the wine. I\ndaresay your little sister meant it kindly.’ And she looked round the\nroom just like the butcher had done. Then she said again, ‘I didn’t\nknow--I’m very sorry...’\n\nSo I said, ‘Don’t mention it,’ and shook hands with her, and let her\nout. Of course we couldn’t have asked her to buy the wine after what\nshe’d said. But I think she was not a bad sort of person. I do like\na person to say they’re sorry when they ought to be--especially a\ngrown-up. They do it so seldom. I suppose that’s why we think so much of\nit.\n\nBut Alice and I didn’t feel jolly for ever so long afterwards. And when\nI went back into the dining-room I saw how different it was from when\nMother was here, and we are different, and Father is different, and\nnothing is like it was. I am glad I am not made to think about it every\nday.\n\nI went and found Alice, and told her what the lady had said, and when\nshe had finished crying we put away the bottle and said we would not try\nto sell any more to people who came. And we did not tell the others--we\nonly said the lady did not buy any--but we went up on the Heath, and\nsome soldiers went by and there was a Punch-and-judy show, and when we\ncame back we were better.\n\nThe bottle got quite dusty where we had put it, and perhaps the dust of\nages would have laid thick and heavy on it, only a clergyman called when\nwe were all out. He was not our own clergyman--Mr Bristow is our own\nclergyman, and we all love him, and we would not try to sell sherry\nto people we like, and make two pounds a week out of them in our spare\ntime. It was another clergyman, just a stray one; and he asked Eliza if\nthe dear children would not like to come to his little Sunday school. We\nalways spend Sunday afternoons with Father. But as he had left the name\nof his vicarage with Eliza, and asked her to tell us to come, we thought\nwe would go and call on him, just to explain about Sunday afternoons,\nand we thought we might as well take the sherry with us.\n\n‘I won’t go unless you all go too,’ Alice said, ‘and I won’t do the\ntalking.’\n\nDora said she thought we had much better not go; but we said ‘Rot!’ and\nit ended in her coming with us, and I am glad she did.\n\nOswald said he would do the talking if the others liked, and he learned\nup what to say from the printed papers.\n\nWe went to the Vicarage early on Saturday afternoon, and rang at the\nbell. It is a new red house with no trees in the garden, only very\nyellow mould and gravel. It was all very neat and dry. Just before we\nrang the bell we heard some one inside call ‘Jane! Jane!’ and we thought\nwe would not be Jane for anything. It was the sound of the voice that\ncalled that made us sorry for her.\n\nThe door was opened by a very neat servant in black, with a white apron;\nwe saw her tying the strings as she came along the hall, through the\ndifferent-coloured glass in the door. Her face was red, and I think she\nwas Jane.\n\nWe asked if we could see Mr Mallow.\n\nThe servant said Mr Mallow was very busy with his sermon just then, but\nshe would see.\n\nBut Oswald said, ‘It’s all right. He asked us to come.’\n\nSo she let us all in and shut the front door, and showed us into a very\ntidy room with a bookcase full of a lot of books covered in black cotton\nwith white labels, and some dull pictures, and a harmonium. And Mr\nMallow was writing at a desk with drawers, copying something out of a\nbook. He was stout and short, and wore spectacles.\n\nHe covered his writing up when we went in--I didn’t know why. He looked\nrather cross, and we heard Jane or somebody being scolded outside by the\nvoice. I hope it wasn’t for letting us in, but I have had doubts.\n\n‘Well,’ said the clergyman, ‘what is all this about?’\n\n‘You asked us to call,’ Dora said, ‘about your little Sunday school. We\nare the Bastables of Lewisham Road.’\n\n‘Oh--ah, yes,’ he said; ‘and shall I expect you all to-morrow?’\n\nHe took up his pen and fiddled with it, and he did not ask us to sit\ndown. But some of us did.\n\n‘We always spend Sunday afternoon with Father,’ said Dora; ‘but we\nwished to thank you for being so kind as to ask us.’\n\n‘And we wished to ask you something else!’ said Oswald; and he made\na sign to Alice to get the sherry ready in the glass. She did--behind\nOswald’s back while he was speaking.\n\n‘My time is limited,’ said Mr Mallow, looking at his watch; ‘but\nstill--’ Then he muttered something about the fold, and went on: ‘Tell\nme what is troubling you, my little man, and I will try to give you any\nhelp in my power. What is it you want?’\n\nThen Oswald quickly took the glass from Alice, and held it out to him,\nand said, ‘I want your opinion on that.’\n\n‘On _that_,’ he said. ‘What is it?’\n\n‘It is a shipment,’ Oswald said; ‘but it’s quite enough for you to\ntaste.’ Alice had filled the glass half-full; I suppose she was too\nexcited to measure properly.\n\n‘A shipment?’ said the clergyman, taking the glass in his hand.\n\n‘Yes,’ Oswald went On; ‘an exceptional opportunity. Full-bodied and\nnutty.’\n\n‘It really does taste rather like one kind of Brazil-nut.’ Alice put her\noar in as usual.\n\nThe Vicar looked from Alice to Oswald, and back again, and Oswald went\non with what he had learned from the printing. The clergyman held the\nglass at half-arm’s-length, stiffly, as if he had caught cold.\n\n‘It is of a quality never before offered at the price. Old Delicate\nAmoro--what’s its name--’\n\n‘Amorolio,’ said H. O.\n\n‘Amoroso,’ said Oswald. ‘H. O., you just shut up--Castilian\nAmoroso--it’s a true after-dinner wine, stimulating and yet...’\n\n‘_Wine_?’ said Mr Mallow, holding the glass further off. ‘Do you\n_know_,’ he went on, making his voice very thick and strong (I expect he\ndoes it like that in church), ‘have you never been _taught_ that it is\nthe drinking of _wine_ and _spirits_--yes, and _beer_, which makes half\nthe homes in England full of _wretched_ little children, and _degraded_,\n_miserable_ parents?’\n\n‘Not if you put sugar in it,’ said Alice firmly; ‘eight lumps and shake\nthe bottle. We have each had more than a teaspoonful of it, and we were\nnot ill at all. It was something else that upset H. O. Most likely all\nthose acorns he got out of the Park.’\n\nThe clergyman seemed to be speechless with conflicting emotions, and\njust then the door opened and a lady came in. She had a white cap with\nlace, and an ugly violet flower in it, and she was tall, and looked\nvery strong, though thin. And I do believe she had been listening at the\ndoor.\n\n‘But why,’ the Vicar was saying, ‘why did you bring this dreadful fluid,\nthis curse of our country, to _me_ to taste?’\n\n‘Because we thought you might buy some,’ said Dora, who never sees when\na game is up. ‘In books the parson loves his bottle of old port; and new\nsherry is just as good--with sugar--for people who like sherry. And if\nyou would order a dozen of the wine, then we should get two shillings.’\n\nThe lady said (and it _was_ the voice), ‘Good gracious! Nasty, sordid\nlittle things! Haven’t they any one to teach them better?’\n\nAnd Dora got up and said, ‘No, we are not those things you say; but we\nare sorry we came here to be called names. We want to make our fortune\njust as much as Mr Mallow does--only no one would listen to us if we\npreached, so it’s no use our copying out sermons like him.’\n\nAnd I think that was smart of Dora, even if it was rather rude.\n\nThen I said perhaps we had better go, and the lady said, ‘I should think\nso!’\n\nBut when we were going to wrap up the bottle and glass the clergyman\nsaid, ‘No; you can leave that,’ and we were so upset we did, though it\nwasn’t his after all.\n\nWe walked home very fast and not saying much, and the girls went up to\ntheir rooms. When I went to tell them tea was ready, and there was\na teacake, Dora was crying like anything and Alice hugging her. I am\nafraid there is a great deal of crying in this chapter, but I can’t help\nit. Girls will sometimes; I suppose it is their nature, and we ought to\nbe sorry for their affliction.\n\n‘It’s no good,’ Dora was saying, ‘you all hate me, and you think I’m\na prig and a busybody, but I do try to do right--oh, I do! Oswald, go\naway; don’t come here making fun of me!’\n\nSo I said, ‘I’m not making fun, Sissy; don’t cry, old girl.’\n\nMother taught me to call her Sissy when we were very little and before\nthe others came, but I don’t often somehow, now we are old. I patted her\non the back, and she put her head against my sleeve, holding on to Alice\nall the time, and she went on. She was in that laughy-cryey state when\npeople say things they wouldn’t say at other times.\n\n‘Oh dear, oh dear--I do try, I do. And when Mother died she said, “Dora,\ntake care of the others, and teach them to be good, and keep them out of\ntrouble and make them happy.” She said, “Take care of them for me, Dora\ndear.” And I have tried, and all of you hate me for it; and to-day I let\nyou do this, though I knew all the time it was silly.’\n\nI hope you will not think I was a muff but I kissed Dora for some time.\nBecause girls like it. And I will never say again that she comes the\ngood elder sister too much. And I have put all this in though I do hate\ntelling about it, because I own I have been hard on Dora, but I never\nwill be again. She is a good old sort; of course we never knew before\nabout what Mother told her, or we wouldn’t have ragged her as we did. We\ndid not tell the little ones, but I got Alice to speak to Dicky, and we\nthree can sit on the others if requisite.\n\nThis made us forget all about the sherry; but about eight o’clock there\nwas a knock, and Eliza went, and we saw it was poor Jane, if her name\nwas Jane, from the Vicarage. She handed in a brown-paper parcel and a\nletter. And three minutes later Father called us into his study.\n\nOn the table was the brown-paper parcel, open, with our bottle and glass\non it, and Father had a letter in his hand. He Pointed to the bottle and\nsighed, and said, ‘What have you been doing now?’ The letter in his hand\nwas covered with little black writing, all over the four large pages.\n\nSo Dicky spoke up, and he told Father the whole thing, as far as he knew\nit, for Alice and I had not told about the dead sailors’ lady.\n\nAnd when he had done, Alice said, ‘Has Mr Mallow written to you to say\nhe will buy a dozen of the sherry after all? It is really not half bad\nwith sugar in it.’\n\nFather said no, he didn’t think clergymen could afford such expensive\nwine; and he said _he_ would like to taste it. So we gave him what there\nwas left, for we had decided coming home that we would give up trying\nfor the two pounds a week in our spare time.\n\nFather tasted it, and then he acted just as H. O. had done when he had\nhis teaspoonful, but of course we did not say anything. Then he laughed\ntill I thought he would never stop.\n\nI think it was the sherry, because I am sure I have read somewhere about\n‘wine that maketh glad the heart of man’. He had only a very little,\nwhich shows that it was a good after-dinner wine, stimulating, and yet\n...I forget the rest.\n\nBut when he had done laughing he said, ‘It’s all right, kids. Only don’t\ndo it again. The wine trade is overcrowded; and besides, I thought you\npromised to consult me before going into business?’\n\n‘Before buying one I thought you meant,’ said Dicky. ‘This was only on\ncommission.’ And Father laughed again. I am glad we got the Castilian\nAmoroso, because it did really cheer Father up, and you cannot always do\nthat, however hard you try, even if you make jokes, or give him a comic\npaper.\n\n\n\nCHAPTER 12. THE NOBLENESS OF OSWALD\n\nThe part about his nobleness only comes at the end, but you would\nnot understand it unless you knew how it began. It began, like nearly\neverything about that time, with treasure-seeking.\n\nOf course as soon as we had promised to consult my Father about business\nmatters we all gave up wanting to go into business. I don’t know how it\nis, but having to consult about a thing with grown-up people, even\nthe bravest and the best, seems to make the thing not worth doing\nafterwards.\n\nWe don’t mind Albert’s uncle chipping in sometimes when the thing’s\ngoing on, but we are glad he never asked us to promise to consult him\nabout anything. Yet Oswald saw that my Father was quite right; and I\ndaresay if we had had that hundred pounds we should have spent it on the\nshare in that lucrative business for the sale of useful patent, and then\nfound out afterwards that we should have done better to spend the money\nin some other way. My Father says so, and he ought to know. We had\nseveral ideas about that time, but having so little chink always stood\nin the way.\n\nThis was the case with H. O.’s idea of setting up a coconut-shy on this\nside of the Heath, where there are none generally. We had no sticks\nor wooden balls, and the greengrocer said he could not book so many as\ntwelve dozen coconuts without Mr Bastable’s written order. And as we did\nnot wish to consult my Father it was decided to drop it. And when Alice\ndressed up Pincher in some of the dolls’ clothes and we made up our\nminds to take him round with an organ as soon as we had taught him to\ndance, we were stopped at once by Dicky’s remembering how he had once\nheard that an organ cost seven hundred pounds. Of course this was\nthe big church kind, but even the ones on three legs can’t be got for\none-and-sevenpence, which was all we had when we first thought of it. So\nwe gave that up too.\n\nIt was a wet day, I remember, and mutton hash for dinner--very tough\nwith pale gravy with lumps in it. I think the others would have left a\ngood deal on the sides of their plates, although they know better, only\nOswald said it was a savoury stew made of the red deer that Edward shot.\nSo then we were the Children of the New Forest, and the mutton tasted\nmuch better. No one in the New Forest minds venison being tough and the\ngravy pale.\n\nThen after dinner we let the girls have a dolls’ tea-party, on condition\nthey didn’t expect us boys to wash up; and it was when we were drinking\nthe last of the liquorice water out of the little cups that Dicky said--\n\n‘This reminds me.’\n\nSo we said, ‘What of?’\n\nDicky answered us at once, though his mouth was full of bread with\nliquorice stuck in it to look like cake. You should not speak with your\nmouth full, even to your own relations, and you shouldn’t wipe your\nmouth on the back of your hand, but on your handkerchief, if you have\none. Dicky did not do this. He said--\n\n‘Why, you remember when we first began about treasure-seeking, I said\nI had thought of something, only I could not tell you because I hadn’t\nfinished thinking about it.’\n\nWe said ‘Yes.’\n\n‘Well, this liquorice water--’\n\n‘Tea,’ said Alice softly.\n\n‘Well, tea then--made me think.’ He was going on to say what it made him\nthink, but Noel interrupted and cried out, ‘I say; let’s finish off this\nold tea-party and have a council of war.’\n\nSo we got out the flags and the wooden sword and the drum, and Oswald\nbeat it while the girls washed up, till Eliza came up to say she had the\njumping toothache, and the noise went through her like a knife. So of\ncourse Oswald left off at once. When you are polite to Oswald he never\nrefuses to grant your requests.\n\nWhen we were all dressed up we sat down round the camp fire, and Dicky\nbegan again.\n\n‘Every one in the world wants money. Some people get it. The people who\nget it are the ones who see things. I have seen one thing.’\n\nDicky stopped and smoked the pipe of peace. It is the pipe we did\nbubbles with in the summer, and somehow it has not got broken yet.\nWe put tea-leaves in it for the pipe of peace, but the girls are not\nallowed to have any. It is not right to let girls smoke. They get to\nthink too much of themselves if you let them do everything the same as\nmen. Oswald said, ‘Out with it.’\n\n‘I see that glass bottles only cost a penny. H. O., if you dare to\nsnigger I’ll send you round selling old bottles, and you shan’t have any\nsweets except out of the money you get for them. And the same with you,\nNoel.’\n\n‘Noel wasn’t sniggering,’ said Alice in a hurry; ‘it is only his taking\nso much interest in what you were saying makes him look like that. Be\nquiet, H. O., and don’t you make faces, either. Do go on, Dicky dear.’\n\nSo Dicky went on.\n\n‘There must be hundreds of millions of bottles of medicines sold every\nyear. Because all the different medicines say, “Thousands of cures\ndaily,” and if you only take that as two thousand, which it must be, at\nleast, it mounts up. And the people who sell them must make a great deal\nof money by them because they are nearly always two-and-ninepence\nthe bottle, and three-and-six for one nearly double the size. Now the\nbottles, as I was saying, don’t cost anything like that.’\n\n‘It’s the medicine costs the money,’ said Dora; ‘look how expensive\njujubes are at the chemist’s, and peppermints too.’\n\n‘That’s only because they’re nice,’ Dicky explained; ‘nasty things are\nnot so dear. Look what a lot of brimstone you get for a penny, and the\nsame with alum. We would not put the nice kinds of chemist’s things in\nour medicine.’\n\nThen he went on to tell us that when we had invented our medicine we\nwould write and tell the editor about it, and he would put it in\nthe paper, and then people would send their two-and-ninepence and\nthree-and-six for the bottle nearly double the size, and then when the\nmedicine had cured them they would write to the paper and their letters\nwould be printed, saying how they had been suffering for years, and\nnever thought to get about again, but thanks to the blessing of our\nointment--’\n\nDora interrupted and said, ‘Not ointment--it’s so messy.’ And Alice\nthought so too. And Dicky said he did not mean it, he was quite decided\nto let it be in bottles. So now it was all settled, and we did not\nsee at the time that this would be a sort of going into business, but\nafterwards when Albert’s uncle showed us we saw it, and we were sorry.\nWe only had to invent the medicine. You might think that was easy,\nbecause of the number of them you see every day in the paper, but it is\nmuch harder than you think. First we had to decide what sort of illness\nwe should like to cure, and a ‘heated discussion ensued’, like in\nParliament.\n\nDora wanted it to be something to make the complexion of dazzling\nfairness, but we remembered how her face came all red and rough when\nshe used the Rosabella soap that was advertised to make the darkest\ncomplexion fair as the lily, and she agreed that perhaps it was better\nnot. Noel wanted to make the medicine first and then find out what\nit would cure, but Dicky thought not, because there are so many more\nmedicines than there are things the matter with us, so it would be\neasier to choose the disease first. Oswald would have liked wounds.\nI still think it was a good idea, but Dicky said, ‘Who has wounds,\nespecially now there aren’t any wars? We shouldn’t sell a bottle a day!’\nSo Oswald gave in because he knows what manners are, and it was Dicky’s\nidea. H. O. wanted a cure for the uncomfortable feeling that they give\nyou powders for, but we explained to him that grown-up people do not\nhave this feeling, however much they eat, and he agreed. Dicky said\nhe did not care a straw what the loathsome disease was, as long as we\nhurried up and settled on something. Then Alice said--\n\n‘It ought to be something very common, and only one thing. Not the pains\nin the back and all the hundreds of things the people have in somebody’s\nsyrup. What’s the commonest thing of all?’\n\nAnd at once we said, ‘Colds.’\n\nSo that was settled.\n\nThen we wrote a label to go on the bottle. When it was written it would\nnot go on the vinegar bottle that we had got, but we knew it would go\nsmall when it was printed. It was like this:\n\n                 BASTABLE’S\n           CERTAIN CURE FOR COLDS\nCoughs, Asthma, Shortness of Breath, and all infections of the Chest\n\n     One dose gives immediate relief\n   It will cure your cold in one bottle\n     Especially the larger size at 3s. 6d.\n       Order at once of the Makers\n       To prevent disappointment\n\n               Makers:\n\n     D., O., R., A., N., and H. O. BASTABLE\n             150, Lewisham Road, S.E.\n\n    (A halfpenny for all bottles returned)\n\n             ------------\n\nOf course the next thing was for one of us to catch a cold and try what\ncured it; we all wanted to be the one, but it was Dicky’s idea, and he\nsaid he was not going to be done out of it, so we let him. It was only\nfair. He left off his undershirt that very day, and next morning he\nstood in a draught in his nightgown for quite a long time. And we damped\nhis day-shirt with the nail-brush before he put it on. But all was vain.\nThey always tell you that these things will give you cold, but we found\nit was not so.\n\nSo then we all went over to the Park, and Dicky went right into the\nwater with his boots on, and stood there as long as he could bear it,\nfor it was rather cold, and we stood and cheered him on. He walked home\nin his wet clothes, which they say is a sure thing, but it was no go,\nthough his boots were quite spoiled. And three days after Noel began to\ncough and sneeze.\n\nSo then Dicky said it was not fair.\n\n‘I can’t help it,’ Noel said. ‘You should have caught it yourself, then\nit wouldn’t have come to me.’\n\nAnd Alice said she had known all along Noel oughtn’t to have stood about\non the bank cheering in the cold.\n\nNoel had to go to bed, and then we began to make the medicines; we were\nsorry he was out of it, but he had the fun of taking the things.\n\nWe made a great many medicines. Alice made herb tea. She got sage and\nthyme and savory and marjoram and boiled them all up together with salt\nand water, but she _would_ put parsley in too. Oswald is sure parsley is\nnot a herb. It is only put on the cold meat and you are not supposed to\neat it. It kills parrots to eat parsley, I believe. I expect it was the\nparsley that disagreed so with Noel. The medicine did not seem to do the\ncough any good.\n\nOswald got a pennyworth of alum, because it is so cheap, and some\nturpentine which every one knows is good for colds, and a little sugar\nand an aniseed ball. These were mixed in a bottle with water, but Eliza\nthrew it away and said it was nasty rubbish, and I hadn’t any money to\nget more things with.\n\nDora made him some gruel, and he said it did his chest good; but of\ncourse that was no use, because you cannot put gruel in bottles and say\nit is medicine. It would not be honest, and besides nobody would believe\nyou.\n\nDick mixed up lemon-juice and sugar and a little of the juice of the red\nflannel that Noel’s throat was done up in. It comes out beautifully\nin hot water. Noel took this and he liked it. Noel’s own idea was\nliquorice-water, and we let him have it, but it is too plain and black\nto sell in bottles at the proper price.\n\nNoel liked H. O.’s medicine the best, which was silly of him, because it\nwas only peppermints melted in hot water, and a little cobalt to make\nit look blue. It was all right, because H. O.’s paint-box is the French\nkind, with Couleurs non Veneneuses on it. This means you may suck your\nbrushes if you want to, or even your paints if you are a very little\nboy.\n\nIt was rather jolly while Noel had that cold. He had a fire in his\nbedroom which opens out of Dicky’s and Oswald’s, and the girls used to\nread aloud to Noel all day; they will not read aloud to you when you are\nwell. Father was away at Liverpool on business, and Albert’s uncle was\nat Hastings. We were rather glad of this, because we wished to give\nall the medicines a fair trial, and grown-ups are but too fond of\ninterfering. As if we should have given him anything poisonous!\n\nHis cold went on--it was bad in his head, but it was not one of the kind\nwhen he has to have poultices and can’t sit up in bed. But when it had\nbeen in his head nearly a week, Oswald happened to tumble over Alice on\nthe stairs. When we got up she was crying.\n\n‘Don’t cry silly!’ said Oswald; ‘you know I didn’t hurt you.’ I was very\nsorry if I had hurt her, but you ought not to sit on the stairs in the\ndark and let other people tumble over you. You ought to remember how\nbeastly it is for them if they do hurt you.\n\n‘Oh, it’s not that, Oswald,’ Alice said. ‘Don’t be a pig! I am so\nmiserable. Do be kind to me.’\n\nSo Oswald thumped her on the back and told her to shut up.\n\n‘It’s about Noel,’ she said. ‘I’m sure he’s very ill; and playing about\nwith medicines is all very well, but I know he’s ill, and Eliza won’t\nsend for the doctor: she says it’s only a cold. And I know the doctor’s\nbills are awful. I heard Father telling Aunt Emily so in the summer. But\nhe _is_ ill, and perhaps he’ll die or something.’\n\nThen she began to cry again. Oswald thumped her again, because he knows\nhow a good brother ought to behave, and said, ‘Cheer up.’ If we had been\nin a book Oswald would have embraced his little sister tenderly, and\nmingled his tears with hers.\n\nThen Oswald said, ‘Why not write to Father?’\n\nAnd she cried more and said, ‘I’ve lost the paper with the address. H.\nO. had it to draw on the back of, and I can’t find it now; I’ve looked\neverywhere. I’ll tell you what I’m going to do. No I won’t. But I’m\ngoing out. Don’t tell the others. And I say, Oswald, do pretend I’m in\nif Eliza asks. Promise.’\n\n‘Tell me what you’re going to do,’ I said. But she said ‘No’; and there\nwas a good reason why not. So I said I wouldn’t promise if it came to\nthat. Of course I meant to all right. But it did seem mean of her not to\ntell me.\n\nSo Alice went out by the side door while Eliza was setting tea, and she\nwas a long time gone; she was not in to tea. When Eliza asked Oswald\nwhere she was he said he did not know, but perhaps she was tidying\nher corner drawer. Girls often do this, and it takes a long time. Noel\ncoughed a good bit after tea, and asked for Alice.\n\nOswald told him she was doing something and it was a secret. Oswald did\nnot tell any lies even to save his sister. When Alice came back she was\nvery quiet, but she whispered to Oswald that it was all right. When\nit was rather late Eliza said she was going out to post a letter. This\nalways takes her an hour, because she _will_ go to the post-office\nacross the Heath instead of the pillar-box, because once a boy dropped\nfusees in our pillar-box and burnt the letters. It was not any of us;\nEliza told us about it. And when there was a knock at the door a long\ntime after we thought it was Eliza come back, and that she had forgotten\nthe back-door key. We made H. O. go down to open the door, because it\nis his place to run about: his legs are younger than ours. And we heard\nboots on the stairs besides H. O.’s, and we listened spellbound till the\ndoor opened, and it was Albert’s uncle. He looked very tired.\n\n‘I am glad you’ve come,’ Oswald said. ‘Alice began to think Noel--’\n\nAlice stopped me, and her face was very red, her nose was shiny too,\nwith having cried so much before tea.\n\nShe said, ‘I only said I thought Noel ought to have the doctor. Don’t\nyou think he ought?’ She got hold of Albert’s uncle and held on to him.\n\n‘Let’s have a look at you, young man,’ said Albert’s uncle, and he sat\ndown on the edge of the bed. It is a rather shaky bed, the bar that\nkeeps it steady underneath got broken when we were playing burglars last\nwinter. It was our crowbar. He began to feel Noel’s pulse, and went on\ntalking.\n\n‘It was revealed to the Arab physician as he made merry in his tents on\nthe wild plains of Hastings that the Presence had a cold in its head. So\nhe immediately seated himself on the magic carpet, and bade it bear him\nhither, only pausing in the flight to purchase a few sweetmeats in the\nbazaar.’\n\nHe pulled out a jolly lot of chocolate and some butterscotch, and grapes\nfor Noel. When we had all said thank you, he went on.\n\n‘The physician’s are the words of wisdom: it’s high time this kid was\nasleep. I have spoken. Ye have my leave to depart.’\n\nSo we bunked, and Dora and Albert’s uncle made Noel comfortable for the\nnight.\n\nThen they came to the nursery which we had gone down to, and he sat down\nin the Guy Fawkes chair and said, ‘Now then.’\n\nAlice said, ‘You may tell them what I did. I daresay they’ll all be in a\nwax, but I don’t care.’\n\n‘I think you were very wise,’ said Albert’s uncle, pulling her close to\nhim to sit on his knee. ‘I am very glad you telegraphed.’\n\nSo then Oswald understood what Alice’s secret was. She had gone out and\nsent a telegram to Albert’s uncle at Hastings. But Oswald thought she\nmight have told him. Afterwards she told me what she had put in the\ntelegram. It was, ‘Come home. We have given Noel a cold, and I think we\nare killing him.’ With the address it came to tenpence-halfpenny.\n\nThen Albert’s uncle began to ask questions, and it all came out,\nhow Dicky had tried to catch the cold, but the cold had gone to Noel\ninstead, and about the medicines and all. Albert’s uncle looked very\nserious.\n\n‘Look here,’ he said, ‘You’re old enough not to play the fool like this.\nHealth is the best thing you’ve got; you ought to know better than to\nrisk it. You might have killed your little brother with your precious\nmedicines. You’ve had a lucky escape, certainly. But poor Noel!’\n\n‘Oh, do you think he’s going to die?’ Alice asked that, and she was\ncrying again.\n\n‘No, no,’ said Albert’s uncle; ‘but look here. Do you see how silly\nyou’ve been? And I thought you promised your Father--’ And then he gave\nus a long talking-to. He can make you feel most awfully small. At last\nhe stopped, and we said we were very sorry, and he said, ‘You know I\npromised to take you all to the pantomime?’\n\nSo we said, ‘Yes,’ and knew but too well that now he wasn’t going to.\nThen he went on--\n\n‘Well, I will take you if you like, or I will take Noel to the sea for a\nweek to cure his cold. Which is it to be?’\n\nOf course he knew we should say, ‘Take Noel’ and we did; but Dicky told\nme afterwards he thought it was hard on H. O.\n\nAlbert’s uncle stayed till Eliza came in, and then he said good night in\na way that showed us that all was forgiven and forgotten.\n\nAnd we went to bed. It must have been the middle of the night when\nOswald woke up suddenly, and there was Alice with her teeth chattering,\nshaking him to wake him.\n\n‘Oh, Oswald!’ she said, ‘I am so unhappy. Suppose I should die in the\nnight!’\n\nOswald told her to go to bed and not gas. But she said, ‘I must tell\nyou; I wish I’d told Albert’s uncle. I’m a thief, and if I die to-night\nI know where thieves go to.’ So Oswald saw it was no good and he sat\nup in bed and said--‘Go ahead.’ So Alice stood shivering and said--‘I\nhadn’t enough money for the telegram, so I took the bad sixpence out of\nthe exchequer. And I paid for it with that and the fivepence I had. And\nI wouldn’t tell you, because if you’d stopped me doing it I couldn’t\nhave borne it; and if you’d helped me you’d have been a thief too. Oh,\nwhat shall I do?’\n\nOswald thought a minute, and then he said--\n\n‘You’d better have told me. But I think it will be all right if we pay\nit back. Go to bed. Cross with you? No, stupid! Only another time you’d\nbetter not keep secrets.’\n\nSo she kissed Oswald, and he let her, and she went back to bed.\n\nThe next day Albert’s uncle took Noel away, before Oswald had time to\npersuade Alice that we ought to tell him about the sixpence. Alice was\nvery unhappy, but not so much as in the night: you can be very miserable\nin the night if you have done anything wrong and you happen to be awake.\nI know this for a fact.\n\nNone of us had any money except Eliza, and she wouldn’t give us any\nunless we said what for; and of course we could not do that because of\nthe honour of the family. And Oswald was anxious to get the sixpence to\ngive to the telegraph people because he feared that the badness of that\nsixpence might have been found out, and that the police might come for\nAlice at any moment. I don’t think I ever had such an unhappy day. Of\ncourse we could have written to Albert’s uncle, but it would have taken\na long time, and every moment of delay added to Alice’s danger. We\nthought and thought, but we couldn’t think of any way to get that\nsixpence. It seems a small sum, but you see Alice’s liberty depended\non it. It was quite late in the afternoon when I met Mrs Leslie on the\nParade. She had a brown fur coat and a lot of yellow flowers in her\nhands. She stopped to speak to me, and asked me how the Poet was. I told\nher he had a cold, and I wondered whether she would lend me sixpence if\nI asked her, but I could not make up my mind how to begin to say it. It\nis a hard thing to say--much harder than you would think. She talked to\nme for a bit, and then she suddenly got into a cab, and said--\n\n‘I’d no idea it was so late,’ and told the man where to go. And just as\nshe started she shoved the yellow flowers through the window and said,\n‘For the sick poet, with my love,’ and was driven off.\n\nGentle reader, I will not conceal from you what Oswald did. He knew all\nabout not disgracing the family, and he did not like doing what I am\ngoing to say: and they were really Noel’s flowers, only he could not\nhave sent them to Hastings, and Oswald knew he would say ‘Yes’ if Oswald\nasked him. Oswald sacrificed his family pride because of his little\nsister’s danger. I do not say he was a noble boy--I just tell you what\nhe did, and you can decide for yourself about the nobleness.\n\nHe put on his oldest clothes--they’re much older than any you would\nthink he had if you saw him when he was tidy--and he took those yellow\nchrysanthemums and he walked with them to Greenwich Station and waited\nfor the trains bringing people from London. He sold those flowers in\npenny bunches and got tenpence. Then he went to the telegraph office at\nLewisham, and said to the lady there:\n\n‘A little girl gave you a bad sixpence yesterday. Here are six good\npennies.’\n\nThe lady said she had not noticed it, and never mind, but Oswald knew\nthat ‘Honesty is the best Policy’, and he refused to take back the\npennies. So at last she said she should put them in the plate on Sunday.\nShe is a very nice lady. I like the way she does her hair.\n\nThen Oswald went home to Alice and told her, and she hugged him, and\nsaid he was a dear, good, kind boy, and he said ‘Oh, it’s all right.’\n\nWe bought peppermint bullseyes with the fourpence I had over, and the\nothers wanted to know where we got the money, but we would not tell.\n\nOnly afterwards when Noel came home we told him, because they were his\nflowers, and he said it was quite right. He made some poetry about it. I\nonly remember one bit of it.\n\n    The noble youth of high degree\n    Consents to play a menial part,\n    All for his sister Alice’s sake,\n    Who was so dear to his faithful heart.\n\nBut Oswald himself has never bragged about it. We got no treasure out of\nthis, unless you count the peppermint bullseyes.\n\n\n\nCHAPTER 13. THE ROBBER AND THE BURGLAR\n\nA day or two after Noel came back from Hastings there was snow; it was\njolly. And we cleared it off the path. A man to do it is sixpence at\nleast, and you should always save when you can. A penny saved is a penny\nearned. And then we thought it would be nice to clear it off the top of\nthe portico, where it lies so thick, and the edges as if they had been\ncut with a knife. And just as we had got out of the landing-window on\nto the portico, the Water Rates came up the path with his book that he\ntears the thing out of that says how much you have got to pay, and the\nlittle ink-bottle hung on to his buttonhole in case you should pay him.\nFather says the Water Rates is a sensible man, and knows it is always\nwell to be prepared for whatever happens, however unlikely. Alice said\nafterwards that she rather liked the Water Rates, really, and Noel said\nhe had a face like a good vizier, or the man who rewards the honest boy\nfor restoring the purse, but we did not think about these things at\nthe time, and as the Water Rates came up the steps, we shovelled down\na great square slab of snow like an avalanche--and it fell right on\nhis head. Two of us thought of it at the same moment, so it was quite a\nlarge avalanche. And when the Water Rates had shaken himself he rang the\nbell. It was Saturday, and Father was at home. We know now that it is\nvery wrong and ungentlemanly to shovel snow off porticoes on to the\nWater Rates, or any other person, and we hope he did not catch a cold,\nand we are very sorry. We apologized to the Water Rates when Father told\nus to. We were all sent to bed for it.\n\nWe all deserved the punishment, because the others would have shovelled\ndown snow just as we did if they’d thought of it--only they are not\nso quick at thinking of things as we are. And even quite wrong things\nsometimes lead to adventures; as every one knows who has ever read about\npirates or highwaymen.\n\nEliza hates us to be sent to bed early, because it means her having to\nbring meals up, and it means lighting the fire in Noel’s room ever so\nmuch earlier than usual. He had to have a fire because he still had a\nbit of a cold. But this particular day we got Eliza into a good temper\nby giving her a horrid brooch with pretending amethysts in it, that an\naunt once gave to Alice, so Eliza brought up an extra scuttle of coals,\nand when the greengrocer came with the potatoes (he is always late on\nSaturdays) she got some chestnuts from him. So that when we heard Father\ngo out after his dinner, there was a jolly fire in Noel’s room, and\nwe were able to go in and be Red Indians in blankets most comfortably.\nEliza had gone out; she says she gets things cheaper on Saturday\nnights. She has a great friend, who sells fish at a shop, and he is\nvery generous, and lets her have herrings for less than half the natural\nprice.\n\nSo we were all alone in the house; Pincher was out with Eliza, and we\ntalked about robbers. And Dora thought it would be a dreadful trade, but\nDicky said--\n\n‘I think it would be very interesting. And you would only rob rich\npeople, and be very generous to the poor and needy, like Claude Duval.’\nDora said, ‘It is wrong to be a robber.’\n\n‘Yes,’ said Alice, ‘you would never know a happy hour. Think of trying\nto sleep with the stolen jewels under your bed, and remembering all the\nquantities of policemen and detectives that there are in the world!’\n\n‘There are ways of being robbers that are not wrong,’ said Noel; ‘if you\ncan rob a robber it is a right act.’\n\n‘But you can’t,’ said Dora; ‘he is too clever, and besides, it’s wrong\nanyway.’\n\n‘Yes you can, and it isn’t; and murdering him with boiling oil is a\nright act, too, so there!’ said Noel. ‘What about Ali Baba? Now then!’\nAnd we felt it was a score for Noel.\n\n‘What would you do if there _was_ a robber?’ said Alice.\n\nH. O. said he would kill him with boiling oil; but Alice explained that\nshe meant a real robber--now--this minute--in the house.\n\nOswald and Dicky did not say; but Noel said he thought it would only be\nfair to ask the robber quite politely and quietly to go away, and then\nif he didn’t you could deal with him.\n\nNow what I am going to tell you is a very strange and wonderful thing,\nand I hope you will be able to believe it. I should not, if a boy told\nme, unless I knew him to be a man of honour, and perhaps not then unless\nhe gave his sacred word. But it is true, all the same, and it only shows\nthat the days of romance and daring deeds are not yet at an end.\n\nAlice was just asking Noel _how_ he would deal with the robber who\nwouldn’t go if he was asked politely and quietly, when we heard a noise\ndownstairs--quite a plain noise, not the kind of noise you fancy you\nhear. It was like somebody moving a chair. We held our breath and\nlistened and then came another noise, like some one poking a fire.\nNow, you remember there was no one _to_ poke a fire or move a chair\ndownstairs, because Eliza and Father were both out. They could not have\ncome in without our hearing them, because the front door is as hard to\nshut as the back one, and whichever you go in by you have to give a slam\nthat you can hear all down the street.\n\nH. O. and Alice and Dora caught hold of each other’s blankets and looked\nat Dicky and Oswald, and every one was quite pale. And Noel whispered--\n\n‘It’s ghosts, I know it is’--and then we listened again, but there was\nno more noise. Presently Dora said in a whisper--\n\n‘Whatever shall we do? Oh, whatever shall we do--what _shall_ we do?’\nAnd she kept on saying it till we had to tell her to shut up.\n\nO reader, have you ever been playing Red Indians in blankets round a\nbedroom fire in a house where you thought there was no one but you--and\nthen suddenly heard a noise like a chair, and a fire being poked,\ndownstairs? Unless you have you will not be able to imagine at all what\nit feels like. It was not like in books; our hair did not stand on end\nat all, and we never said ‘Hist!’ once, but our feet got very cold,\nthough we were in blankets by the fire, and the insides of Oswald’s\nhands got warm and wet, and his nose was cold like a dog’s, and his ears\nwere burning hot.\n\nThe girls said afterwards that they shivered with terror, and their\nteeth chattered, but we did not see or hear this at the time.\n\n‘Shall we open the window and call police?’ said Dora; and then Oswald\nsuddenly thought of something, and he breathed more freely and he said--\n\n‘I _know_ it’s not ghosts, and I don’t believe it’s robbers. I expect\nit’s a stray cat got in when the coals came this morning, and she’s\nbeen hiding in the cellar, and now she’s moving about. Let’s go down and\nsee.’\n\nThe girls wouldn’t, of course; but I could see that they breathed more\nfreely too. But Dicky said, ‘All right; I will if you will.’\n\nH. O. said, ‘Do you think it’s _really_ a cat?’ So we said he had better\nstay with the girls. And of course after that we had to let him and\nAlice both come. Dora said if we took Noel down with his cold, she would\nscream ‘Fire!’ and ‘Murder!’ and she didn’t mind if the whole street\nheard.\n\nSo Noel agreed to be getting his clothes on, and the rest of us said we\nwould go down and look for the cat.\n\nNow Oswald _said_ that about the cat, and it made it easier to go down,\nbut in his inside he did not feel at all sure that it might not be\nrobbers after all. Of course, we had often talked about robbers before,\nbut it is very different when you sit in a room and listen and listen\nand listen; and Oswald felt somehow that it would be easier to go down\nand see what it was, than to wait, and listen, and wait, and wait, and\nlisten, and wait, and then perhaps to hear _it_, whatever it was, come\ncreeping slowly up the stairs as softly as _it_ could with _its_ boots\noff, and the stairs creaking, towards the room where we were with the\ndoor open in case of Eliza coming back suddenly, and all dark on the\nlandings. And then it would have been just as bad, and it would have\nlasted longer, and you would have known you were a coward besides. Dicky\nsays he felt all these same things. Many people would say we were young\nheroes to go down as we did; so I have tried to explain, because no\nyoung hero wishes to have more credit than he deserves.\n\nThe landing gas was turned down low--just a blue bead--and we four went\nout very softly, wrapped in our blankets, and we stood on the top of the\nstairs a good long time before we began to go down. And we listened and\nlistened till our ears buzzed.\n\nAnd Oswald whispered to Dicky, and Dicky went into our room and fetched\nthe large toy pistol that is a foot long, and that has the trigger\nbroken, and I took it because I am the eldest; and I don’t think either\nof us thought it was the cat now. But Alice and H. O. did. Dicky got the\npoker out of Noel’s room, and told Dora it was to settle the cat with\nwhen we caught her.\n\nThen Oswald whispered, ‘Let’s play at burglars; Dicky and I are armed\nto the teeth, we will go first. You keep a flight behind us, and be\na reinforcement if we are attacked. Or you can retreat and defend the\nwomen and children in the fortress, if you’d rather.’\n\nBut they said they would be a reinforcement.\n\nOswald’s teeth chattered a little when he spoke. It was not with\nanything else except cold.\n\nSo Dicky and Oswald crept down, and when we got to the bottom of the\nstairs, we saw Father’s study door just ajar, and the crack of light.\nAnd Oswald was so pleased to see the light, knowing that burglars prefer\nthe dark, or at any rate the dark lantern, that he felt really sure it\n_was_ the cat after all, and then he thought it would be fun to make\nthe others upstairs think it was really a robber. So he cocked the\npistol--you can cock it, but it doesn’t go off--and he said, ‘Come on,\nDick!’ and he rushed at the study door and burst into the room, crying,\n‘Surrender! you are discovered! Surrender, or I fire! Throw up your\nhands!’\n\nAnd, as he finished saying it, he saw before him, standing on the study\nhearthrug, a Real Robber. There was no mistake about it. Oswald was\nsure it was a robber, because it had a screwdriver in its hands, and was\nstanding near the cupboard door that H. O. broke the lock off; and there\nwere gimlets and screws and things on the floor. There is nothing in\nthat cupboard but old ledgers and magazines and the tool chest, but of\ncourse, a robber could not know that beforehand.\n\nWhen Oswald saw that there really was a robber, and that he was so\nheavily armed with the screwdriver, he did not feel comfortable. But he\nkept the pistol pointed at the robber, and--you will hardly believe it,\nbut it is true--the robber threw down the screwdriver clattering on the\nother tools, and he _did_ throw up his hands, and said--\n\n‘I surrender; don’t shoot me! How many of you are there?’\n\nSo Dicky said, ‘You are outnumbered. Are you armed?’\n\nAnd the robber said, ‘No, not in the least.’\n\nAnd Oswald said, still pointing the pistol, and feeling very strong and\nbrave and as if he was in a book, ‘Turn out your pockets.’\n\nThe robber did: and while he turned them out, we looked at him. He was\nof the middle height, and clad in a black frock-coat and grey trousers.\nHis boots were a little gone at the sides, and his shirt-cuffs were\na bit frayed, but otherwise he was of gentlemanly demeanour. He had a\nthin, wrinkled face, with big, light eyes that sparkled, and then looked\nsoft very queerly, and a short beard. In his youth it must have been of\na fair golden colour, but now it was tinged with grey. Oswald was sorry\nfor him, especially when he saw that one of his pockets had a large hole\nin it, and that he had nothing in his pockets but letters and string and\nthree boxes of matches, and a pipe and a handkerchief and a thin tobacco\npouch and two pennies. We made him put all the things on the table, and\nthen he said--\n\n‘Well, you’ve caught me; what are you going to do with me? Police?’\n\nAlice and H. O. had come down to be reinforcements, when they heard a\nshout, and when Alice saw that it was a Real Robber, and that he had\nsurrendered, she clapped her hands and said, ‘Bravo, boys!’ and so did\nH. O. And now she said, ‘If he gives his word of honour not to escape,\nI shouldn’t call the police: it seems a pity. Wait till Father comes\nhome.’\n\nThe robber agreed to this, and gave his word of honour, and asked if he\nmight put on a pipe, and we said ‘Yes,’ and he sat in Father’s armchair\nand warmed his boots, which steamed, and I sent H. O. and Alice to\nput on some clothes and tell the others, and bring down Dicky’s and my\nknickerbockers, and the rest of the chestnuts.\n\nAnd they all came, and we sat round the fire, and it was jolly. The\nrobber was very friendly, and talked to us a great deal.\n\n‘I wasn’t always in this low way of business,’ he said, when Noel said\nsomething about the things he had turned out of his pockets. ‘It’s\na great come-down to a man like me. But, if I must be caught, it’s\nsomething to be caught by brave young heroes like you. My stars! How you\ndid bolt into the room,--“Surrender, and up with your hands!” You might\nhave been born and bred to the thief-catching.’\n\nOswald is sorry if it was mean, but he could not own up just then that\nhe did not think there was any one in the study when he did that brave\nif rash act. He has told since.\n\n‘And what made you think there was any one in the house?’ the robber\nasked, when he had thrown his head back, and laughed for quite half a\nminute. So we told him. And he applauded our valour, and Alice and H.\nO. explained that they would have said ‘Surrender,’ too, only they were\nreinforcements. The robber ate some of the chestnuts--and we sat and\nwondered when Father would come home, and what he would say to us for\nour intrepid conduct. And the robber told us of all the things he had\ndone before he began to break into houses. Dicky picked up the tools\nfrom the floor, and suddenly he said--\n\n‘Why, this is Father’s screwdriver and his gimlets, and all! Well, I do\ncall it jolly cheek to pick a man’s locks with his own tools!’\n\n‘True, true,’ said the robber. ‘It is cheek, of the jolliest! But you\nsee I’ve come down in the world. I was a highway robber once, but\nhorses are so expensive to hire--five shillings an hour, you know--and\nI couldn’t afford to keep them. The highwayman business isn’t what it\nwas.’\n\n‘What about a bike?’ said H. O.\n\nBut the robber thought cycles were low--and besides you couldn’t go\nacross country with them when occasion arose, as you could with a trusty\nsteed. And he talked of highwaymen as if he knew just how we liked\nhearing it.\n\nThen he told us how he had been a pirate captain--and how he had sailed\nover waves mountains high, and gained rich prizes--and how he _did_\nbegin to think that here he had found a profession to his mind.\n\n‘I don’t say there are no ups and downs in it,’ he said, ‘especially\nin stormy weather. But what a trade! And a sword at your side, and the\nJolly Roger flying at the peak, and a prize in sight. And all the black\nmouths of your guns pointed at the laden trader--and the wind in your\nfavour, and your trusty crew ready to live and die for you! Oh--but it’s\na grand life!’\n\nI did feel so sorry for him. He used such nice words, and he had a\ngentleman’s voice.\n\n‘I’m sure you weren’t brought up to be a pirate,’ said Dora. She had\ndressed even to her collar--and made Noel do it too--but the rest of us\nwere in blankets with just a few odd things put on anyhow underneath.\n\nThe robber frowned and sighed.\n\n‘No,’ he said, ‘I was brought up to the law. I was at Balliol, bless\nyour hearts, and that’s true anyway.’ He sighed again, and looked hard\nat the fire.\n\n‘That was my Father’s college,’ H. O. was beginning, but Dicky\nsaid--‘Why did you leave off being a pirate?’\n\n‘A pirate?’ he said, as if he had not been thinking of such things.\n\n‘Oh, yes; why I gave it up because--because I could not get over the\ndreadful sea-sickness.’\n\n‘Nelson was sea-sick,’ said Oswald.\n\n‘Ah,’ said the robber; ‘but I hadn’t his luck or his pluck, or\nsomething. He stuck to it and won Trafalgar, didn’t he? “Kiss me,\nHardy”--and all that, eh? _I_ couldn’t stick to it--I had to resign. And\nnobody kissed _me_.’\n\nI saw by his understanding about Nelson that he was really a man who had\nbeen to a good school as well as to Balliol.\n\nThen we asked him, ‘And what did you do then?’\n\nAnd Alice asked if he was ever a coiner, and we told him how we had\nthought we’d caught the desperate gang next door, and he was very much\ninterested and said he was glad he had never taken to coining.\n\n‘Besides, the coins are so ugly nowadays,’ he said, ‘no one could really\nfind any pleasure in making them. And it’s a hole-and-corner business\nat the best, isn’t it?--and it must be a very thirsty one--with the hot\nmetal and furnaces and things.’\n\nAnd again he looked at the fire.\n\nOswald forgot for a minute that the interesting stranger was a robber,\nand asked him if he wouldn’t have a drink. Oswald has heard Father do\nthis to his friends, so he knows it is the right thing. The robber said\nhe didn’t mind if he did. And that is right, too.\n\nAnd Dora went and got a bottle of Father’s ale--the Light Sparkling\nFamily--and a glass, and we gave it to the robber. Dora said she would\nbe responsible.\n\nThen when he had had a drink he told us about bandits, but he said it\nwas so bad in wet weather. Bandits’ caves were hardly ever properly\nweathertight. And bush-ranging was the same.\n\n‘As a matter of fact,’ he said, ‘I was bush-ranging this afternoon,\namong the furze-bushes on the Heath, but I had no luck. I stopped the\nLord Mayor in his gilt coach, with all his footmen in plush and gold\nlace, smart as cockatoos. But it was no go. The Lord Mayor hadn’t a\nstiver in his pockets. One of the footmen had six new pennies: the Lord\nMayor always pays his servants’ wages in new pennies. I spent fourpence\nof that in bread and cheese, that on the table’s the tuppence. Ah, it’s\na poor trade!’ And then he filled his pipe again.\n\nWe had turned out the gas, so that Father should have a jolly good\nsurprise when he did come home, and we sat and talked as pleasant as\ncould be. I never liked a new man better than I liked that robber. And I\nfelt so sorry for him. He told us he had been a war-correspondent and\nan editor, in happier days, as well as a horse-stealer and a colonel of\ndragoons.\n\nAnd quite suddenly, just as we were telling him about Lord Tottenham and\nour being highwaymen ourselves, he put up his hand and said ‘Shish!’ and\nwe were quiet and listened.\n\nThere was a scrape, scrape, scraping noise; it came from downstairs.\n\n‘They’re filing something,’ whispered the robber, ‘here--shut up, give\nme that pistol, and the poker. There is a burglar now, and no mistake.’\n\n‘It’s only a toy one and it won’t go off,’ I said, ‘but you can cock\nit.’\n\nThen we heard a snap. ‘There goes the window bar,’ said the robber\nsoftly. ‘Jove! what an adventure! You kids stay here, I’ll tackle it.’\n\nBut Dicky and I said we should come. So he let us go as far as the\nbottom of the kitchen stairs, and we took the tongs and shovel with us.\nThere was a light in the kitchen; a very little light. It is curious we\nnever thought, any of us, that this might be a plant of our robber’s to\nget away. We never thought of doubting his word of honour. And we were\nright.\n\nThat noble robber dashed the kitchen door open, and rushed in with the\nbig toy pistol in one hand and the poker in the other, shouting out just\nlike Oswald had done--\n\n‘Surrender! You are discovered! Surrender, or I’ll fire! Throw up your\nhands!’ And Dicky and I rattled the tongs and shovel so that he might\nknow there were more of us, all bristling with weapons.\n\nAnd we heard a husky voice in the kitchen saying--\n\n‘All right, governor! Stow that scent sprinkler. I’ll give in. Blowed if\nI ain’t pretty well sick of the job, anyway.’\n\nThen we went in. Our robber was standing in the grandest manner with his\nlegs very wide apart, and the pistol pointing at the cowering burglar.\nThe burglar was a large man who did not mean to have a beard, I think,\nbut he had got some of one, and a red comforter, and a fur cap, and his\nface was red and his voice was thick. How different from our own robber!\nThe burglar had a dark lantern, and he was standing by the plate-basket.\nWhen we had lit the gas we all thought he was very like what a burglar\nought to be.\n\nHe did not look as if he could ever have been a pirate or a highwayman,\nor anything really dashing or noble, and he scowled and shuffled his\nfeet and said: ‘Well, go on: why don’t yer fetch the pleece?’\n\n‘Upon my word, I don’t know,’ said our robber, rubbing his chin.\n‘Oswald, why don’t we fetch the police?’\n\nIt is not every robber that I would stand Christian names from, I can\ntell you but just then I didn’t think of that. I just said--‘Do you mean\nI’m to fetch one?’\n\nOur robber looked at the burglar and said nothing.\n\nThen the burglar began to speak very fast, and to look different ways\nwith his hard, shiny little eyes.\n\n‘Lookee ‘ere, governor,’ he said, ‘I was stony broke, so help me, I\nwas. And blessed if I’ve nicked a haporth of your little lot. You know\nyourself there ain’t much to tempt a bloke,’ he shook the plate-basket\nas if he was angry with it, and the yellowy spoons and forks rattled. ‘I\nwas just a-looking through this ‘ere Bank-ollerday show, when you come.\nLet me off, sir. Come now, I’ve got kids of my own at home, strike me\nif I ain’t--same as yours--I’ve got a nipper just about ‘is size, and\nwhat’ll come of them if I’m lagged? I ain’t been in it long, sir, and I\nain’t ‘andy at it.’\n\n‘No,’ said our robber; ‘you certainly are not.’ Alice and the others\nhad come down by now to see what was happening. Alice told me afterwards\nthey thought it really was the cat this time.\n\n‘No, I ain’t ‘andy, as you say, sir, and if you let me off this once\nI’ll chuck the whole blooming bizz; rake my civvy, I will. Don’t be hard\non a cove, mister; think of the missis and the kids. I’ve got one just\nthe cut of little missy there bless ‘er pretty ‘eart.’\n\n‘Your family certainly fits your circumstances very nicely,’ said our\nrobber. Then Alice said--\n\n‘Oh, do let him go! If he’s got a little girl like me, whatever will she\ndo? Suppose it was Father!’\n\n‘I don’t think he’s got a little girl like you, my dear,’ said our\nrobber, ‘and I think he’ll be safer under lock and key.’\n\n‘You ask yer Father to let me go, miss,’ said the burglar; ‘’e won’t\n‘ave the ‘art to refuse you.’\n\n‘If I do,’ said Alice, ‘will you promise never to come back?’\n\n‘Not me, miss,’ the burglar said very earnestly, and he looked at the\nplate-basket again, as if that alone would be enough to keep him away,\nour robber said afterwards.\n\n‘And will you be good and not rob any more?’ said Alice.\n\n‘I’ll turn over a noo leaf, miss, so help me.’\n\nThen Alice said--‘Oh, do let him go! I’m sure he’ll be good.’\n\nBut our robber said no, it wouldn’t be right; we must wait till Father\ncame home. Then H. O. said, very suddenly and plainly:\n\n‘I don’t think it’s at all fair, when you’re a robber yourself.’\n\nThe minute he’d said it the burglar said, ‘Kidded, by gum!’--and then\nour robber made a step towards him to catch hold of him, and before you\nhad time to think ‘Hullo!’ the burglar knocked the pistol up with one\nhand and knocked our robber down with the other, and was off out of\nthe window like a shot, though Oswald and Dicky did try to stop him by\nholding on to his legs.\n\nAnd that burglar had the cheek to put his head in at the window and say,\n‘I’ll give yer love to the kids and the missis’--and he was off like\nwinking, and there were Alice and Dora trying to pick up our robber, and\nasking him whether he was hurt, and where. He wasn’t hurt at all, except\na lump at the back of his head. And he got up, and we dusted the kitchen\nfloor off him. Eliza is a dirty girl.\n\nThen he said, ‘Let’s put up the shutters. It never rains but it pours.\nNow you’ve had two burglars I daresay you’ll have twenty.’ So we put up\nthe shutters, which Eliza has strict orders to do before she goes out,\nonly she never does, and we went back to Father’s study, and the robber\nsaid, ‘What a night we are having!’ and put his boots back in the fender\nto go on steaming, and then we all talked at once. It was the most\nwonderful adventure we ever had, though it wasn’t treasure-seeking--at\nleast not ours. I suppose it was the burglar’s treasure-seeking, but\nhe didn’t get much--and our robber said he didn’t believe a word about\nthose kids that were so like Alice and me.\n\nAnd then there was the click of the gate, and we said, ‘Here’s Father,’\nand the robber said, ‘And now for the police.’\n\nThen we all jumped up. We did like him so much, and it seemed so unfair\nthat he should be sent to prison, and the horrid, lumping big burglar\nnot.\n\nAnd Alice said, ‘Oh, _no_--run! Dicky will let you out at the back door.\nOh, do go, go _now_.’\n\nAnd we all said, ‘Yes, _go_,’ and pulled him towards the door, and gave\nhim his hat and stick and the things out of his pockets.\n\nBut Father’s latchkey was in the door, and it was too late.\n\nFather came in quickly, purring with the cold, and began to say, ‘It’s\nall right, Foulkes, I’ve got--’ And then he stopped short and stared\nat us. Then he said, in the voice we all hate, ‘Children, what is the\nmeaning of all this?’ And for a minute nobody spoke.\n\nThen my Father said, ‘Foulkes, I must really apologize for these very\nnaughty--’ And then our robber rubbed his hands and laughed, and cried\nout:\n\n‘You’re mistaken, my dear sir, I’m not Foulkes; I’m a robber, captured\nby these young people in the most gallant manner. “Hands up, surrender,\nor I fire,” and all the rest of it. My word, Bastable, but you’ve got\nsome kids worth having! I wish my Denny had their pluck.’\n\nThen we began to understand, and it was like being knocked down, it was\nso sudden. And our robber told us he wasn’t a robber after all. He was\nonly an old college friend of my Father’s, and he had come after dinner,\nwhen Father was just trying to mend the lock H. O. had broken, to ask\nFather to get him a letter to a doctor about his little boy Denny, who\nwas ill. And Father had gone over the Heath to Vanbrugh Park to see some\nrich people he knows and get the letter. And he had left Mr Foulkes to\nwait till he came back, because it was important to know at once whether\nFather could get the letter, and if he couldn’t Mr Foulkes would have\nhad to try some one else directly.\n\nWe were dumb with amazement.\n\nOur robber told my Father about the other burglar, and said he was\nsorry he’d let him escape, but my Father said, ‘Oh, it’s all right: poor\nbeggar; if he really had kids at home: you never can tell--forgive us\nour debts, don’t you know; but tell me about the first business. It must\nhave been moderately entertaining.’\n\nThen our robber told my Father how I had rushed into the room with a\npistol, crying out... but you know all about that. And he laid it on\nso thick and fat about plucky young-uns, and chips of old blocks, and\nthings like that, that I felt I was purple with shame, even under the\nblanket. So I swallowed that thing that tries to prevent you speaking\nwhen you ought to, and I said, ‘Look here, Father, I didn’t really think\nthere was any one in the study. We thought it was a cat at first, and\nthen I thought there was no one there, and I was just larking. And when\nI said surrender and all that, it was just the game, don’t you know?’\n\nThen our robber said, ‘Yes, old chap; but when you found there really\n_was_ someone there, you dropped the pistol and bunked, didn’t you, eh?’\n\nAnd I said, ‘No; I thought, “Hullo! here’s a robber! Well, it’s all up,\nI suppose, but I may as well hold on and see what happens.”’\n\nAnd I was glad I’d owned up, for Father slapped me on the back, and\nsaid I was a young brick, and our robber said I was no funk anyway, and\nthough I got very hot under the blanket I liked it, and I explained that\nthe others would have done the same if they had thought of it.\n\nThen Father got up some more beer, and laughed about Dora’s\nresponsibility, and he got out a box of figs he had bought for us, only\nhe hadn’t given it to us because of the Water Rates, and Eliza came in\nand brought up the bread and cheese, and what there was left of the\nneck of mutton--cold wreck of mutton, Father called it--and we had a\nfeast--like a picnic--all sitting anywhere, and eating with our fingers.\nIt was prime. We sat up till past twelve o’clock, and I never felt so\npleased to think I was not born a girl. It was hard on the others; they\nwould have done just the same if they’d thought of it. But it does make\nyou feel jolly when your pater says you’re a young brick!\n\nWhen Mr Foulkes was going, he said to Alice, ‘Good-bye, Hardy.’\n\nAnd Alice understood, of course, and kissed him as hard as she could.\n\nAnd she said, ‘I wanted to, when you said no one kissed you when you\nleft off being a pirate.’ And he said, ‘I know you did, my dear.’ And\nDora kissed him too, and said, ‘I suppose none of these tales were\ntrue?’\n\nAnd our robber just said, ‘I tried to play the part properly, my dear.’\n\nAnd he jolly well did play it, and no mistake. We have often seen him\nsince, and his boy Denny, and his girl Daisy, but that comes in another\nstory.\n\nAnd if any of you kids who read this ever had two such adventures in one\nnight you can just write and tell me. That’s all.\n\n\n\nCHAPTER 14. THE DIVINING-ROD\n\nYou have no idea how uncomfortable the house was on the day when we\nsought for gold with the divining-rod. It was like a spring-cleaning in\nthe winter-time. All the carpets were up, because Father had told Eliza\nto make the place decent as there was a gentleman coming to dinner the\nnext day. So she got in a charwoman, and they slopped water about, and\nleft brooms and brushes on the stairs for people to tumble over. H. O.\ngot a big bump on his head in that way, and when he said it was too bad,\nEliza said he should keep in the nursery then, and not be where he’d no\nbusiness. We bandaged his head with a towel, and then he stopped crying\nand played at being England’s wounded hero dying in the cockpit, while\nevery man was doing his duty, as the hero had told them to, and Alice\nwas Hardy, and I was the doctor, and the others were the crew. Playing\nat Hardy made us think of our own dear robber, and we wished he was\nthere, and wondered if we should ever see him any more.\n\nWe were rather astonished at Father’s having anyone to dinner, because\nnow he never seems to think of anything but business. Before Mother died\npeople often came to dinner, and Father’s business did not take up so\nmuch of his time and was not the bother it is now. And we used to see\nwho could go furthest down in our nightgowns and get nice things to\neat, without being seen, out of the dishes as they came out of the\ndining-room. Eliza can’t cook very nice things. She told Father she was\na good plain cook, but he says it was a fancy portrait. We stayed in the\nnursery till the charwoman came in and told us to be off--she was going\nto make one job of it, and have our carpet up as well as all the\nothers, now the man was here to beat them. It came up, and it was very\ndusty--and under it we found my threepenny-bit that I lost ages ago,\nwhich shows what Eliza is. H. O. had got tired of being the wounded\nhero, and Dicky was so tired of doing nothing that Dora said she knew\nhe’d begin to tease Noel in a minute; then of course Dicky said he\nwasn’t going to tease anybody--he was going out to the Heath. He said\nhe’d heard that nagging women drove a man from his home, and now he\nfound it was quite true. Oswald always tries to be a peacemaker, so he\ntold Dicky to shut up and not make an ass of himself. And Alice said,\n‘Well, Dora began’--And Dora tossed her chin up and said it wasn’t any\nbusiness of Oswald’s any way, and no one asked Alice’s opinion. So we\nall felt very uncomfortable till Noel said, ‘Don’t let’s quarrel about\nnothing. You know let dogs delight--and I made up another piece while\nyou were talking--\n\n    Quarrelling is an evil thing,\n    It fills with gall life’s cup;\n    For when once you begin\n    It takes such a long time to make it up.’\n\nWe all laughed then and stopped jawing at each other. Noel is very funny\nwith his poetry. But that piece happened to come out quite true. You\nbegin to quarrel and then you can’t stop; often, long before the others\nare ready to cry and make it up, I see how silly it is, and I want to\nlaugh; but it doesn’t do to say so--for it only makes the others crosser\nthan they were before. I wonder why that is?\n\nAlice said Noel ought to be poet laureate, and she actually went out\nin the cold and got some laurel leaves--the spotted kind--out of\nthe garden, and Dora made a crown and we put it on him. He was quite\npleased; but the leaves made a mess, and Eliza said, ‘Don’t.’ I believe\nthat’s a word grown-ups use more than any other. Then suddenly Alice\nthought of that old idea of hers for finding treasure, and she said--‘Do\nlet’s try the divining-rod.’\n\nSo Oswald said, ‘Fair priestess, we do greatly desire to find gold\nbeneath our land, therefore we pray thee practise with the divining-rod,\nand tell us where we can find it.’\n\n‘Do ye desire to fashion of it helms and hauberks?’ said Alice.\n\n‘Yes,’ said Noel; ‘and chains and ouches.’\n\n‘I bet you don’t know what an “ouch” is,’ said Dicky.\n\n‘Yes I do, so there!’ said Noel. ‘It’s a carcanet. I looked it out in\nthe dicker, now then!’ We asked him what a carcanet was, but he wouldn’t\nsay.\n\n‘And we want to make fair goblets of the gold,’ said Oswald.\n\n‘Yes, to drink coconut milk out of,’ said H. O.\n\n‘And we desire to build fair palaces of it,’ said Dicky.\n\n‘And to buy things,’ said Dora; ‘a great many things. New Sunday frocks\nand hats and kid gloves and--’\n\nShe would have gone on for ever so long only we reminded her that we\nhadn’t found the gold yet.\n\nBy this Alice had put on the nursery tablecloth, which is green, and\ntied the old blue and yellow antimacassar over her head, and she said--\n\n‘If your intentions are correct, fear nothing and follow me.’\n\nAnd she went down into the hall. We all followed chanting ‘Heroes.’ It\nis a gloomy thing the girls learnt at the High School, and we always use\nit when we want a priestly chant.\n\nAlice stopped short by the hat-stand, and held up her hands as well as\nshe could for the tablecloth, and said--\n\n‘Now, great altar of the golden idol, yield me the divining-rod that I\nmay use it for the good of the suffering people.’\n\nThe umbrella-stand was the altar of the golden idol, and it yielded her\nthe old school umbrella. She carried it between her palms.\n\n‘Now,’ she said, ‘I shall sing the magic chant. You mustn’t say\nanything, but just follow wherever I go--like follow my leader, you\nknow--and when there is gold underneath the magic rod will twist in the\nhand of the priestess like a live thing that seeks to be free. Then you\nwill dig, and the golden treasure will be revealed. H. O., if you make\nthat clatter with your boots they’ll come and tell us not to. Now come\non all of you.’\n\nSo she went upstairs and down and into every room. We followed her\non tiptoe, and Alice sang as she went. What she sang is not out of a\nbook--Noel made it up while she was dressing up for the priestess.\n\n    Ashen rod cold\n    That here I hold,\n    Teach me where to find the gold.\n\nWhen we came to where Eliza was, she said, ‘Get along with you’; but\nDora said it was only a game, and we wouldn’t touch anything, and our\nboots were quite clean, and Eliza might as well let us. So she did.\n\nIt was all right for the priestess, but it was a little dull for the\nrest of us, because she wouldn’t let us sing, too; so we said we’d had\nenough of it, and if she couldn’t find the gold we’d leave off and play\nsomething else. The priestess said, ‘All right, wait a minute,’ and went\non singing. Then we all followed her back into the nursery, where the\ncarpet was up and the boards smelt of soft soap. Then she said, ‘It\nmoves, it moves! Once more the choral hymn!’ So we sang ‘Heroes’ again,\nand in the middle the umbrella dropped from her hands.\n\n‘The magic rod has spoken,’ said Alice; ‘dig here, and that with courage\nand despatch.’ We didn’t quite see how to dig, but we all began to\nscratch on the floor with our hands, but the priestess said, ‘Don’t\nbe so silly! It’s the place where they come to do the gas. The board’s\nloose. Dig an you value your lives, for ere sundown the dragon who\nguards this spoil will return in his fiery fury and make you his\nunresisting prey.’\n\nSo we dug--that is, we got the loose board up. And Alice threw up her\narms and cried--\n\n‘See the rich treasure--the gold in thick layers, with silver and\ndiamonds stuck in it!’\n\n‘Like currants in cake,’ said H. O.\n\n‘It’s a lovely treasure,’ said Dicky yawning. ‘Let’s come back and carry\nit away another day.’\n\nBut Alice was kneeling by the hole.\n\n‘Let me feast my eyes on the golden splendour,’ she said, ‘hidden these\nlong centuries from the human eye. Behold how the magic rod has led\nus to treasures more--Oswald, don’t push so!--more bright than ever\nmonarch--I say, there _is_ something down there, really. I saw it\nshine!’\n\nWe thought she was kidding, but when she began to try to get into the\nhole, which was much too small, we saw she meant it, so I said, ‘Let’s\nhave a squint,’ and I looked, but I couldn’t see anything, even when I\nlay down on my stomach. The others lay down on their stomachs too and\ntried to see, all but Noel, who stood and looked at us and said we were\nthe great serpents come down to drink at the magic pool. He wanted to be\nthe knight and slay the great serpents with his good sword--he even drew\nthe umbrella ready--but Alice said, ‘All right, we will in a minute. But\nnow--I’m sure I saw it; do get a match, Noel, there’s a dear.’\n\n‘What did you see?’ asked Noel, beginning to go for the matches very\nslowly.\n\n‘Something bright, away in the corner under the board against the beam.’\n\n‘Perhaps it was a rat’s eye,’ Noel said, ‘or a snake’s,’ and we did\nnot put our heads quite so close to the hole till he came back with the\nmatches.\n\nThen I struck a match, and Alice cried, ‘There it is!’ And there it was,\nand it was a half-sovereign, partly dusty and partly bright. We think\nperhaps a mouse, disturbed by the carpets being taken up, may have\nbrushed the dust of years from part of the half-sovereign with his tail.\nWe can’t imagine how it came there, only Dora thinks she remembers once\nwhen H. O. was very little Mother gave him some money to hold, and he\ndropped it, and it rolled all over the floor. So we think perhaps this\nwas part of it. We were very glad. H. O. wanted to go out at once and\nbuy a mask he had seen for fourpence. It had been a shilling mask, but\nnow it was going very cheap because Guy Fawkes’ Day was over, and it was\na little cracked at the top. But Dora said, ‘I don’t know that it’s our\nmoney. Let’s wait and ask Father.’\n\nBut H. O. did not care about waiting, and I felt for him. Dora is rather\nlike grown-ups in that way; she does not seem to understand that when\nyou want a thing you do want it, and that you don’t wish to wait, even a\nminute.\n\nSo we went and asked Albert-next-door’s uncle. He was pegging away at\none of the rotten novels he has to write to make his living, but he said\nwe weren’t interrupting him at all.\n\n‘My hero’s folly has involved him in a difficulty,’ he said. ‘It is his\nown fault. I will leave him to meditate on the incredible fatuity--the\nhare-brained recklessness--which have brought him to this pass. It will\nbe a lesson to him. I, meantime, will give myself unreservedly to the\npleasures of your conversation.’\n\nThat’s one thing I like Albert’s uncle for. He always talks like a book,\nand yet you can always understand what he means. I think he is more like\nus, inside of his mind, than most grown-up people are. He can pretend\nbeautifully. I never met anyone else so good at it, except our robber,\nand we began it, with him. But it was Albert’s uncle who first taught\nus how to make people talk like books when you’re playing things, and he\nmade us learn to tell a story straight from the beginning, not starting\nin the middle like most people do. So now Oswald remembered what he had\nbeen told, as he generally does, and began at the beginning, but when he\ncame to where Alice said she was the priestess, Albert’s uncle said--\n\n‘Let the priestess herself set forth the tale in fitting speech.’\n\nSo Alice said, ‘O high priest of the great idol, the humblest of thy\nslaves took the school umbrella for a divining-rod, and sang the song of\ninver--what’s-it’s-name?’\n\n‘Invocation perhaps?’ said Albert’s uncle. ‘Yes; and then I went about\nand about and the others got tired, so the divining-rod fell on a\ncertain spot, and I said, “Dig”, and we dug--it was where the loose\nboard is for the gas men--and then there really and truly was a\nhalf-sovereign lying under the boards, and here it is.’\n\nAlbert’s uncle took it and looked at it.\n\n‘The great high priest will bite it to see if it’s good,’ he said, and\nhe did. ‘I congratulate you,’ he went on; ‘you are indeed among those\nfavoured by the Immortals. First you find half-crowns in the garden, and\nnow this. The high priest advises you to tell your Father, and ask if\nyou may keep it. My hero has become penitent, but impatient. I must pull\nhim out of this scrape. Ye have my leave to depart.’\n\nOf course we know from Kipling that that means, ‘You’d better bunk, and\nbe sharp about it,’ so we came away. I do like Albert’s uncle.\n\nI shall be like that when I’m a man. He gave us our Jungle books, and he\nis awfully clever, though he does have to write grown-up tales.\n\nWe told Father about it that night. He was very kind. He said we\nmight certainly have the half-sovereign, and he hoped we should enjoy\nourselves with our treasure-trove.\n\nThen he said, ‘Your dear Mother’s Indian Uncle is coming to dinner here\nto-morrow night. So will you not drag the furniture about overhead,\nplease, more than you’re absolutely obliged; and H. O. might wear\nslippers or something. I can always distinguish the note of H. O.’s\nboots.’\n\nWe said we would be very quiet, and Father went on--\n\n‘This Indian Uncle is not used to children, and he is coming to talk\nbusiness with me. It is really important that he should be quiet. Do you\nthink, Dora, that perhaps bed at six for H. O. and Noel--’\n\nBut H. O. said, ‘Father, I really and truly won’t make a noise. I’ll\nstand on my head all the evening sooner than disturb the Indian Uncle\nwith my boots.’\n\nAnd Alice said Noel never made a row anyhow. So Father laughed and\nsaid, ‘All right.’ And he said we might do as we liked with the\nhalf-sovereign. ‘Only for goodness’ sake don’t try to go in for business\nwith it,’ he said. ‘It’s always a mistake to go into business with an\ninsufficient capital.’\n\nWe talked it over all that evening, and we decided that as we were not\nto go into business with our half-sovereign it was no use not spending\nit at once, and so we might as well have a right royal feast. The next\nday we went out and bought the things. We got figs, and almonds and\nraisins, and a real raw rabbit, and Eliza promised to cook it for us\nif we would wait till tomorrow, because of the Indian Uncle coming to\ndinner. She was very busy cooking nice things for him to eat. We got the\nrabbit because we are so tired of beef and mutton, and Father hasn’t\na bill at the poultry shop. And we got some flowers to go on the\ndinner-table for Father’s party. And we got hardbake and raspberry noyau\nand peppermint rock and oranges and a coconut, with other nice things.\nWe put it all in the top long drawer. It is H. O.’s play drawer, and we\nmade him turn his things out and put them in Father’s old portmanteau.\nH. O. is getting old enough now to learn to be unselfish, and besides,\nhis drawer wanted tidying very badly. Then we all vowed by the honour of\nthe ancient House of Bastable that we would not touch any of the\nfeast till Dora gave the word next day. And we gave H. O. some of the\nhardbake, to make it easier for him to keep his vow. The next day was\nthe most rememorable day in all our lives, but we didn’t know that then.\nBut that is another story. I think that is such a useful way to know\nwhen you can’t think how to end up a chapter. I learnt it from another\nwriter named Kipling. I’ve mentioned him before, I believe, but he\ndeserves it!\n\n\n\nCHAPTER 15. ‘LO, THE POOR INDIAN!’\n\nIt was all very well for Father to ask us not to make a row because the\nIndian Uncle was coming to talk business, but my young brother’s boots\nare not the only things that make a noise. We took his boots away and\nmade him wear Dora’s bath slippers, which are soft and woolly, and\nhardly any soles to them; and of course we wanted to see the Uncle,\nso we looked over the banisters when he came, and we were as quiet\nas mice--but when Eliza had let him in she went straight down to the\nkitchen and made the most awful row you ever heard, it sounded like the\nDay of judgement, or all the saucepans and crockery in the house being\nkicked about the floor, but she told me afterwards it was only the\ntea-tray and one or two cups and saucers, that she had knocked over in\nher flurry. We heard the Uncle say, ‘God bless my soul!’ and then\nhe went into Father’s study and the door was shut--we didn’t see him\nproperly at all that time.\n\nI don’t believe the dinner was very nice. Something got burned I’m\nsure--for we smelt it. It was an extra smell, besides the mutton.\n\nI know that got burned. Eliza wouldn’t have any of us in the kitchen\nexcept Dora--till dinner was over. Then we got what was left of the\ndessert, and had it on the stairs--just round the corner where they\ncan’t see you from the hall, unless the first landing gas is lighted.\nSuddenly the study door opened and the Uncle came out and went and felt\nin his greatcoat pocket. It was his cigar-case he wanted. We saw that\nafterwards. We got a much better view of him then. He didn’t look like\nan Indian but just like a kind of brown, big Englishman, and of course\nhe didn’t see us, but we heard him mutter to himself--\n\n‘Shocking bad dinner! Eh!--what?’\n\nWhen he went back to the study he didn’t shut the door properly. That\ndoor has always been a little tiresome since the day we took the lock\noff to get out the pencil sharpener H. O. had shoved into the keyhole.\nWe didn’t listen--really and truly--but the Indian Uncle has a very big\nvoice, and Father was not going to be beaten by a poor Indian in talking\nor anything else--so he spoke up too, like a man, and I heard him say it\nwas a very good business, and only wanted a little capital--and he said\nit as if it was an imposition he had learned, and he hated having to\nsay it. The Uncle said, ‘Pooh, pooh!’ to that, and then he said he\nwas afraid that what that same business wanted was not capital but\nmanagement. Then I heard my Father say, ‘It is not a pleasant subject:\nI am sorry I introduced it. Suppose we change it, sir. Let me fill your\nglass.’ Then the poor Indian said something about vintage--and that\na poor, broken-down man like he was couldn’t be too careful. And then\nFather said, ‘Well, whisky then,’ and afterwards they talked about\nNative Races and Imperial something or other and it got very dull.\n\nSo then Oswald remembered that you must not hear what people do not\nintend you to hear--even if you are not listening and he said, ‘We ought\nnot to stay here any longer. Perhaps they would not like us to hear--’\n\nAlice said, ‘Oh, do you think it could possibly matter?’ and went and\nshut the study door softly but quite tight. So it was no use staying\nthere any longer, and we went to the nursery.\n\nThen Noel said, ‘Now I understand. Of course my Father is making a\nbanquet for the Indian, because he is a poor, broken-down man. We might\nhave known that from “Lo, the poor Indian!” you know.’\n\nWe all agreed with him, and we were glad to have the thing explained,\nbecause we had not understood before what Father wanted to have people\nto dinner for--and not let us come in.\n\n‘Poor people are very proud,’ said Alice, ‘and I expect Father thought\nthe Indian would be ashamed, if all of us children knew how poor he\nwas.’\n\nThen Dora said, ‘Poverty is no disgrace. We should honour honest\nPoverty.’\n\nAnd we all agreed that that was so.\n\n‘I wish his dinner had not been so nasty,’ Dora said, while Oswald put\nlumps of coal on the fire with his fingers, so as not to make a noise.\nHe is a very thoughtful boy, and he did not wipe his fingers on his\ntrouser leg as perhaps Noel or H. O. would have done, but he just rubbed\nthem on Dora’s handkerchief while she was talking.\n\n‘I am afraid the dinner was horrid.’ Dora went on. ‘The table looked\nvery nice with the flowers we got. I set it myself, and Eliza made me\nborrow the silver spoons and forks from Albert-next-door’s Mother.’\n\n‘I hope the poor Indian is honest,’ said Dicky gloomily, ‘when you are a\npoor, broken-down man silver spoons must be a great temptation.’\n\nOswald told him not to talk such tommy-rot because the Indian was a\nrelation, so of course he couldn’t do anything dishonourable. And Dora\nsaid it was all right any way, because she had washed up the spoons and\nforks herself and counted them, and they were all there, and she had\nput them into their wash-leather bag, and taken them back to\nAlbert-next-door’s Mother.\n\n‘And the brussels sprouts were all wet and swimmy,’ she went on, ‘and\nthe potatoes looked grey--and there were bits of black in the gravy--and\nthe mutton was bluey-red and soft in the middle. I saw it when it came\nout. The apple-pie looked very nice--but it wasn’t quite done in the\napply part. The other thing that was burnt--you must have smelt it, was\nthe soup.’\n\n‘It is a pity,’ said Oswald; ‘I don’t suppose he gets a good dinner\nevery day.’\n\n‘No more do we,’ said H. O., ‘but we shall to-morrow.’\n\nI thought of all the things we had bought with our half-sovereign--the\nrabbit and the sweets and the almonds and raisins and figs and the\ncoconut: and I thought of the nasty mutton and things, and while I was\nthinking about it all Alice said--\n\n‘Let’s ask the poor Indian to come to dinner with _us_ to-morrow.’ I\nshould have said it myself if she had given me time.\n\nWe got the little ones to go to bed by promising to put a note on their\ndressing-table saying what had happened, so that they might know the\nfirst thing in the morning, or in the middle of the night if they\nhappened to wake up, and then we elders arranged everything.\n\nI waited by the back door, and when the Uncle was beginning to go Dicky\nwas to drop a marble down between the banisters for a signal, so that I\ncould run round and meet the Uncle as he came out.\n\nThis seems like deceit, but if you are a thoughtful and considerate boy\nyou will understand that we could not go down and say to the Uncle in\nthe hall under Father’s eye, ‘Father has given you a beastly, nasty\ndinner, but if you will come to dinner with us tomorrow, we will show\nyou our idea of good things to eat.’ You will see, if you think it over,\nthat this would not have been at all polite to Father.\n\nSo when the Uncle left, Father saw him to the door and let him out, and\nthen went back to the study, looking very sad, Dora says.\n\nAs the poor Indian came down our steps he saw me there at the gate.\n\nI did not mind his being poor, and I said, ‘Good evening, Uncle,’ just\nas politely as though he had been about to ascend into one of the gilded\nchariots of the rich and affluent, instead of having to walk to the\nstation a quarter of a mile in the mud, unless he had the money for a\ntram fare.\n\n‘Good evening, Uncle.’ I said it again, for he stood staring at me.\nI don’t suppose he was used to politeness from boys--some boys are\nanything but--especially to the Aged Poor.\n\nSo I said, ‘Good evening, Uncle,’ yet once again. Then he said--\n\n‘Time you were in bed, young man. Eh!--what?’\n\nThen I saw I must speak plainly with him, man to man. So I did. I said--\n\n‘You’ve been dining with my Father, and we couldn’t help hearing you\nsay the dinner was shocking. So we thought as you’re an Indian, perhaps\nyou’re very poor’--I didn’t like to tell him we had heard the dreadful\ntruth from his own lips, so I went on, ‘because of “Lo, the poor\nIndian”--you know--and you can’t get a good dinner every day. And we are\nvery sorry if you’re poor; and won’t you come and have dinner with\nus to-morrow--with us children, I mean? It’s a very, very good\ndinner--rabbit, and hardbake, and coconut--and you needn’t mind us\nknowing you’re poor, because we know honourable poverty is no disgrace,\nand--’ I could have gone on much longer, but he interrupted me to\nsay--‘Upon my word! And what’s your name, eh?’\n\n‘Oswald Bastable,’ I said; and I do hope you people who are reading this\nstory have not guessed before that I was Oswald all the time.\n\n‘Oswald Bastable, eh? Bless my soul!’ said the poor Indian. ‘Yes, I’ll\ndine with you, Mr Oswald Bastable, with all the pleasure in life. Very\nkind and cordial invitation, I’m sure. Good night, sir. At one o’clock,\nI presume?’\n\n‘Yes, at one,’ I said. ‘Good night, sir.’\n\nThen I went in and told the others, and we wrote a paper and put it on\nthe boy’s dressing-table, and it said--\n\n‘The poor Indian is coming at one. He seemed very grateful to me for my\nkindness.’\n\nWe did not tell Father that the Uncle was coming to dinner with us,\nfor the polite reason that I have explained before. But we had to tell\nEliza; so we said a friend was coming to dinner and we wanted everything\nvery nice. I think she thought it was Albert-next-door, but she was in\na good temper that day, and she agreed to cook the rabbit and to make a\npudding with currants in it. And when one o’clock came the Indian Uncle\ncame too. I let him in and helped him off with his greatcoat, which was\nall furry inside, and took him straight to the nursery. We were to have\ndinner there as usual, for we had decided from the first that he would\nenjoy himself more if he was not made a stranger of. We agreed to treat\nhim as one of ourselves, because if we were too polite, he might think\nit was our pride because he was poor.\n\nHe shook hands with us all and asked our ages, and what schools we went\nto, and shook his head when we said we were having a holiday just now. I\nfelt rather uncomfortable--I always do when they talk about schools--and\nI couldn’t think of anything to say to show him we meant to treat him\nas one of ourselves. I did ask if he played cricket. He said he had not\nplayed lately. And then no one said anything till dinner came in. We had\nall washed our faces and hands and brushed our hair before he came in,\nand we all looked very nice, especially Oswald, who had had his hair\ncut that very morning. When Eliza had brought in the rabbit and gone\nout again, we looked at each other in silent despair, like in books.\nIt seemed as if it were going to be just a dull dinner like the one the\npoor Indian had had the night before; only, of course, the things to\neat would be nicer. Dicky kicked Oswald under the table to make him say\nsomething--and he had his new boots on, too!--but Oswald did not kick\nback; then the Uncle asked--\n\n‘Do you carve, sir, or shall I?’\n\nSuddenly Alice said--\n\n‘Would you like grown-up dinner, Uncle, or play-dinner?’\n\nHe did not hesitate a moment, but said, ‘Play-dinner, by all means.\nEh!--what?’ and then we knew it was all right.\n\nSo we at once showed the Uncle how to be a dauntless hunter. The rabbit\nwas the deer we had slain in the green forest with our trusty yew bows,\nand we toasted the joints of it, when the Uncle had carved it, on bits\nof firewood sharpened to a point. The Uncle’s piece got a little burnt,\nbut he said it was delicious, and he said game was always nicer when you\nhad killed it yourself. When Eliza had taken away the rabbit bones and\nbrought in the pudding, we waited till she had gone out and shut the\ndoor, and then we put the dish down on the floor and slew the pudding in\nthe dish in the good old-fashioned way. It was a wild boar at bay, and\nvery hard indeed to kill, even with forks. The Uncle was very fierce\nindeed with the pudding, and jumped and howled when he speared it, but\nwhen it came to his turn to be helped, he said, ‘No, thank you; think of\nmy liver. Eh!--what?’\n\nBut he had some almonds and raisins--when we had climbed to the top of\nthe chest of drawers to pluck them from the boughs of the great trees;\nand he had a fig from the cargo that the rich merchants brought in their\nship--the long drawer was the ship--and the rest of us had the sweets\nand the coconut. It was a very glorious and beautiful feast, and when it\nwas over we said we hoped it was better than the dinner last night. And\nhe said:\n\n‘I never enjoyed a dinner more.’ He was too polite to say what he really\nthought about Father’s dinner. And we saw that though he might be poor,\nhe was a true gentleman.\n\nHe smoked a cigar while we finished up what there was left to eat, and\ntold us about tiger shooting and about elephants. We asked him about\nwigwams, and wampum, and mocassins, and beavers, but he did not seem\nto know, or else he was shy about talking of the wonders of his native\nland.\n\nWe liked him very much indeed, and when he was going at last, Alice\nnudged me, and I said--‘There’s one and threepence farthing left out\nof our half-sovereign. Will you take it, please, because we do like you\nvery much indeed, and we don’t want it, really; and we would rather you\nhad it.’ And I put the money into his hand.\n\n‘I’ll take the threepenny-bit,’ he said, turning the money over and\nlooking at it, ‘but I couldn’t rob you of the rest. By the way, where\ndid you get the money for this most royal spread--half a sovereign you\nsaid--eh, what?’\n\nWe told him all about the different ways we had looked for treasure, and\nwhen we had been telling some time he sat down, to listen better and at\nlast we told him how Alice had played at divining-rod, and how it really\nhad found a half-sovereign.\n\nThen he said he would like to see her do it again. But we explained that\nthe rod would only show gold and silver, and that we were quite sure\nthere was no more gold in the house, because we happened to have looked\nvery carefully.\n\n‘Well, silver, then,’ said he; ‘let’s hide the plate-basket, and little\nAlice shall make the divining-rod find it. Eh!--what?’\n\n‘There isn’t any silver in the plate-basket now,’ Dora said. ‘Eliza\nasked me to borrow the silver spoons and forks for your dinner last\nnight from Albert-next-door’s Mother. Father never notices, but she\nthought it would be nicer for you. Our own silver went to have the dents\ntaken out; and I don’t think Father could afford to pay the man for\ndoing it, for the silver hasn’t come back.’\n\n‘Bless my soul!’ said the Uncle again, looking at the hole in the big\nchair that we burnt when we had Guy Fawkes’ Day indoors. ‘And how much\npocket-money do you get? Eh!--what?’\n\n‘We don’t have any now,’ said Alice; ‘but indeed we don’t want the other\nshilling. We’d much rather you had it, wouldn’t we?’\n\nAnd the rest of us said, ‘Yes.’ The Uncle wouldn’t take it, but he asked\na lot of questions, and at last he went away. And when he went he said--\n\n‘Well, youngsters, I’ve enjoyed myself very much. I shan’t forget your\nkind hospitality. Perhaps the poor Indian may be in a position to ask\nyou all to dinner some day.’\n\nOswald said if he ever could we should like to come very much, but he\nwas not to trouble to get such a nice dinner as ours, because we could\ndo very well with cold mutton and rice pudding. We do not like these\nthings, but Oswald knows how to behave. Then the poor Indian went away.\n\nWe had not got any treasure by this party, but we had had a very good\ntime, and I am sure the Uncle enjoyed himself.\n\nWe were so sorry he was gone that we could none of us eat much tea;\nbut we did not mind, because we had pleased the poor Indian and enjoyed\nourselves too. Besides, as Dora said, ‘A contented mind is a continual\nfeast,’ so it did not matter about not wanting tea.\n\nOnly H. O. did not seem to think a continual feast was a contented mind,\nand Eliza gave him a powder in what was left of the red-currant jelly\nFather had for the nasty dinner.\n\nBut the rest of us were quite well, and I think it must have been the\ncoconut with H. O. We hoped nothing had disagreed with the Uncle, but we\nnever knew.\n\n\n\nCHAPTER 16. THE END OF THE TREASURE-SEEKING\n\nNow it is coming near the end of our treasure-seeking, and the end was\nso wonderful that now nothing is like it used to be. It is like as\nif our fortunes had been in an earthquake, and after those, you know,\neverything comes out wrong-way up.\n\nThe day after the Uncle speared the pudding with us opened in gloom and\nsadness. But you never know. It was destined to be a day when things\nhappened. Yet no sign of this appeared in the early morning. Then all\nwas misery and upsetness. None of us felt quite well; I don’t know why:\nand Father had one of his awful colds, so Dora persuaded him not to go\nto London, but to stay cosy and warm in the study, and she made him some\ngruel. She makes it better than Eliza does; Eliza’s gruel is all little\nlumps, and when you suck them it is dry oatmeal inside.\n\nWe kept as quiet as we could, and I made H. O. do some lessons, like the\nG. B. had advised us to. But it was very dull. There are some days\nwhen you seem to have got to the end of all the things that could ever\npossibly happen to you, and you feel you will spend all the rest of your\nlife doing dull things just the same way. Days like this are generally\nwet days. But, as I said, you never know.\n\nThen Dicky said if things went on like this he should run away to sea,\nand Alice said she thought it would be rather nice to go into a convent.\nH. O. was a little disagreeable because of the powder Eliza had given\nhim, so he tried to read two books at once, one with each eye, just\nbecause Noel wanted one of the books, which was very selfish of him, so\nit only made his headache worse. H. O. is getting old enough to learn by\nexperience that it is wrong to be selfish, and when he complained about\nhis head Oswald told him whose fault it was, because I am older than\nhe is, and it is my duty to show him where he is wrong. But he began to\ncry, and then Oswald had to cheer him up because of Father wanting to be\nquiet. So Oswald said--\n\n‘They’ll eat H. O. if you don’t look out!’ And Dora said Oswald was too\nbad.\n\nOf course Oswald was not going to interfere again, so he went to look\nout of the window and see the trams go by, and by and by H. O. came and\nlooked out too, and Oswald, who knows when to be generous and forgiving,\ngave him a piece of blue pencil and two nibs, as good as new, to keep.\n\nAs they were looking out at the rain splashing on the stones in the\nstreet they saw a four-wheeled cab come lumbering up from the way the\nstation is. Oswald called out--\n\n‘Here comes the coach of the Fairy Godmother. It’ll stop here, you see\nif it doesn’t!’\n\nSo they all came to the window to look. Oswald had only said that about\nstopping and he was stricken with wonder and amaze when the cab really\ndid stop. It had boxes on the top and knobby parcels sticking out of\nthe window, and it was something like going away to the seaside and\nsomething like the gentleman who takes things about in a carriage with\nthe wooden shutters up, to sell to the drapers’ shops. The cabman got\ndown, and some one inside handed out ever so many parcels of different\nshapes and sizes, and the cabman stood holding them in his arms and\ngrinning over them.\n\nDora said, ‘It is a pity some one doesn’t tell him this isn’t the\nhouse.’ And then from inside the cab some one put out a foot feeling for\nthe step, like a tortoise’s foot coming out from under his shell\nwhen you are holding him off the ground, and then a leg came and more\nparcels, and then Noel cried--\n\n‘It’s the poor Indian!’\n\nAnd it was.\n\nEliza opened the door, and we were all leaning over the banisters.\nFather heard the noise of parcels and boxes in the hall, and he came out\nwithout remembering how bad his cold was. If you do that yourself when\nyou have a cold they call you careless and naughty. Then we heard the\npoor Indian say to Father--\n\n‘I say, Dick, I dined with your kids yesterday--as I daresay they’ve\ntold you. Jolliest little cubs I ever saw! Why didn’t you let me see\nthem the other night? The eldest is the image of poor Janey--and as to\nyoung Oswald, he’s a man! If he’s not a man, I’m a nigger! Eh!--what?\nAnd Dick, I say, I shouldn’t wonder if I could find a friend to put a\nbit into that business of yours--eh?’\n\nThen he and Father went into the study and the door was shut--and we\nwent down and looked at the parcels. Some were done up in old, dirty\nnewspapers, and tied with bits of rag, and some were in brown paper and\nstring from the shops, and there were boxes. We wondered if the Uncle\nhad come to stay and this was his luggage, or whether it was to sell.\nSome of it smelt of spices, like merchandise--and one bundle Alice felt\ncertain was a bale. We heard a hand on the knob of the study door after\na bit, and Alice said--\n\n‘Fly!’ and we all got away but H. O., and the Uncle caught him by the\nleg as he was trying to get upstairs after us.\n\n‘Peeping at the baggage, eh?’ said the Uncle, and the rest of us came\ndown because it would have been dishonourable to leave H. O. alone in a\nscrape, and we wanted to see what was in the parcels.\n\n‘I didn’t touch,’ said H. O. ‘Are you coming to stay? I hope you are.’\n\n‘No harm done if you did touch,’ said the good, kind, Indian man to all\nof us. ‘For all these parcels are _for you_.’\n\nI have several times told you about our being dumb with amazement and\nterror and joy, and things like that, but I never remember us being\ndumber than we were when he said this.\n\nThe Indian Uncle went on: ‘I told an old friend of mine what a\npleasant dinner I had with you, and about the threepenny-bit, and the\ndivining-rod, and all that, and he sent all these odds and ends as\npresents for you. Some of the things came from India.’\n\n‘Have you come from India, Uncle?’ Noel asked; and when he said ‘Yes’\nwe were all very much surprised, for we never thought of his being that\nsort of Indian. We thought he was the Red kind, and of course his not\nbeing accounted for his ignorance of beavers and things.\n\nHe got Eliza to help, and we took all the parcels into the nursery and\nhe undid them and undid them and undid them, till the papers lay thick\non the floor. Father came too and sat in the Guy Fawkes chair. I cannot\nbegin to tell you all the things that kind friend of Uncle’s had sent\nus. He must be a very agreeable person.\n\nThere were toys for the kids and model engines for Dick and me, and a\nlot of books, and Japanese china tea-sets for the girls, red and white\nand gold--there were sweets by the pound and by the box--and long yards\nand yards of soft silk from India, to make frocks for the girls--and a\nreal Indian sword for Oswald and a book of Japanese pictures for Noel,\nand some ivory chess men for Dicky: the castles of the chessmen are\nelephant-and-castles. There is a railway station called that; I never\nknew what it meant before. The brown paper and string parcels had boxes\nof games in them--and big cases of preserved fruits and things. And the\nshabby old newspaper parcels and the boxes had the Indian things in. I\nnever saw so many beautiful things before. There were carved fans\nand silver bangles and strings of amber beads, and necklaces of uncut\ngems--turquoises and garnets, the Uncle said they were--and shawls and\nscarves of silk, and cabinets of brown and gold, and ivory boxes and\nsilver trays, and brass things. The Uncle kept saying, ‘This is for you,\nyoung man,’ or ‘Little Alice will like this fan,’ or ‘Miss Dora would\nlook well in this green silk, I think. Eh!--what?’\n\nAnd Father looked on as if it was a dream, till the Uncle suddenly gave\nhim an ivory paper-knife and a box of cigars, and said, ‘My old friend\nsent you these, Dick; he’s an old friend of yours too, he says.’ And he\nwinked at my Father, for H. O. and I saw him. And my Father winked back,\nthough he has always told us not to.\n\nThat was a wonderful day. It was a treasure, and no mistake! I never saw\nsuch heaps and heaps of presents, like things out of a fairy-tale--and\neven Eliza had a shawl. Perhaps she deserved it, for she did cook the\nrabbit and the pudding; and Oswald says it is not her fault if her nose\nturns up and she does not brush her hair. I do not think Eliza likes\nbrushing things. It is the same with the carpets. But Oswald tries to\nmake allowances even for people who do not wash their ears.\n\nThe Indian Uncle came to see us often after that, and his friend always\nsent us something. Once he tipped us a sovereign each--the Uncle brought\nit; and once he sent us money to go to the Crystal Palace, and the Uncle\ntook us; and another time to a circus; and when Christmas was near the\nUncle said--\n\n‘You remember when I dined with you, some time ago, you promised to dine\nwith me some day, if I could ever afford to give a dinner-party. Well,\nI’m going to have one--a Christmas party. Not on Christmas Day, because\nevery one goes home then--but on the day after. Cold mutton and rice\npudding. You’ll come? Eh!--what?’\n\nWe said we should be delighted, if Father had no objection, because that\nis the proper thing to say, and the poor Indian, I mean the Uncle, said,\n‘No, your Father won’t object--he’s coming too, bless your soul!’\n\nWe all got Christmas presents for the Uncle. The girls made him a\nhandkerchief case and a comb bag, out of some of the pieces of silk he\nhad given them. I got him a knife with three blades; H. O. got a siren\nwhistle, a very strong one, and Dicky joined with me in the knife, and\nNoel would give the Indian ivory box that Uncle’s friend had sent on the\nwonderful Fairy Cab day. He said it was the very nicest thing he had,\nand he was sure Uncle wouldn’t mind his not having bought it with his\nown money.\n\nI think Father’s business must have got better--perhaps Uncle’s friend\nput money in it and that did it good, like feeding the starving. Anyway\nwe all had new suits, and the girls had the green silk from India made\ninto frocks, and on Boxing Day we went in two cabs--Father and the girls\nin one, and us boys in the other.\n\nWe wondered very much where the Indian Uncle lived, because we had not\nbeen told. And we thought when the cab began to go up the hill towards\nthe Heath that perhaps the Uncle lived in one of the poky little houses\nup at the top of Greenwich. But the cab went right over the Heath and in\nat some big gates, and through a shrubbery all white with frost like\na fairy forest, because it was Christmas time. And at last we stopped\nbefore one of those jolly, big, ugly red houses with a lot of windows,\nthat are so comfortable inside, and on the steps was the Indian Uncle,\nlooking very big and grand, in a blue cloth coat and yellow sealskin\nwaistcoat, with a bunch of seals hanging from it.\n\n‘I wonder whether he has taken a place as butler here?’ said Dicky.\n\n‘A poor, broken-down man--’\n\nNoel thought it was very likely, because he knew that in these big\nhouses there were always thousands of stately butlers.\n\nThe Uncle came down the steps and opened the cab door himself, which I\ndon’t think butlers would expect to have to do. And he took us in. It\nwas a lovely hall, with bear and tiger skins on the floor, and a big\nclock with the faces of the sun and moon dodging out when it was day or\nnight, and Father Time with a scythe coming out at the hours, and the\nname on it was ‘Flint. Ashford. 1776’; and there was a fox eating a\nstuffed duck in a glass case, and horns of stags and other animals over\nthe doors.\n\n‘We’ll just come into my study first,’ said the Uncle, ‘and wish each\nother a Merry Christmas.’ So then we knew he wasn’t the butler, but it\nmust be his own house, for only the master of the house has a study.\n\nHis study was not much like Father’s. It had hardly any books, but\nswords and guns and newspapers and a great many boots, and boxes half\nunpacked, with more Indian things bulging out of them.\n\nWe gave him our presents and he was awfully pleased. Then he gave us his\nChristmas presents. You must be tired of hearing about presents, but\nI must remark that all the Uncle’s presents were watches; there was a\nwatch for each of us, with our names engraved inside, all silver except\nH. O.’s, and that was a Waterbury, ‘To match his boots,’ the Uncle said.\nI don’t know what he meant.\n\nThen the Uncle looked at Father, and Father said, ‘You tell them, sir.’\n\nSo the Uncle coughed and stood up and made a speech. He said--\n\n‘Ladies and gentlemen, we are met together to discuss an important\nsubject which has for some weeks engrossed the attention of the\nhonourable member opposite and myself.’\n\nI said, ‘Hear, hear,’ and Alice whispered, ‘What happened to the\nguinea-pig?’ Of course you know the answer to that.\n\nThe Uncle went on--\n\n‘I am going to live in this house, and as it’s rather big for me, your\nFather has agreed that he and you shall come and live with me. And so,\nif you’re agreeable, we’re all going to live here together, and, please\nGod, it’ll be a happy home for us all. Eh!--what?’\n\nHe blew his nose and kissed us all round. As it was Christmas I did\nnot mind, though I am much too old for it on other dates. Then he said,\n‘Thank you all very much for your presents; but I’ve got a present here\nI value more than anything else I have.’\n\nI thought it was not quite polite of him to say so, till I saw that\nwhat he valued so much was a threepenny-bit on his watch-chain, and, of\ncourse, I saw it must be the one we had given him.\n\nHe said, ‘You children gave me that when you thought I was the poor\nIndian, and I’ll keep it as long as I live. And I’ve asked some friends\nto help us to be jolly, for this is our house-warming. Eh!--what?’\n\nThen he shook Father by the hand, and they blew their noses; and then\nFather said, ‘Your Uncle has been most kind--most--’\n\nBut Uncle interrupted by saying, ‘Now, Dick, no nonsense!’ Then H. O.\nsaid, ‘Then you’re not poor at all?’ as if he were very disappointed.\nThe Uncle replied, ‘I have enough for my simple wants, thank you, H.\nO.; and your Father’s business will provide him with enough for yours.\nEh!--what?’\n\nThen we all went down and looked at the fox thoroughly, and made the\nUncle take the glass off so that we could see it all round and then the\nUncle took us all over the house, which is the most comfortable one I\nhave ever been in. There is a beautiful portrait of Mother in Father’s\nsitting-room. The Uncle must be very rich indeed. This ending is like\nwhat happens in Dickens’s books; but I think it was much jollier to\nhappen like a book, and it shows what a nice man the Uncle is, the way\nhe did it all.\n\nThink how flat it would have been if the Uncle had said, when we first\noffered him the one and threepence farthing, ‘Oh, I don’t want your\ndirty one and three-pence! I’m very rich indeed.’ Instead of which he\nsaved up the news of his wealth till Christmas, and then told us all\nin one glorious burst. Besides, I can’t help it if it is like Dickens,\nbecause it happens this way. Real life is often something like books.\n\nPresently, when we had seen the house, we were taken into the\ndrawing-room, and there was Mrs Leslie, who gave us the shillings and\nwished us good hunting, and Lord Tottenham, and Albert-next-door’s\nUncle--and Albert-next-door, and his Mother (I’m not very fond of her),\nand best of all our own Robber and his two kids, and our Robber had a\nnew suit on. The Uncle told us he had asked the people who had been kind\nto us, and Noel said, ‘Where is my noble editor that I wrote the poetry\nto?’\n\nThe Uncle said he had not had the courage to ask a strange editor to\ndinner; but Lord Tottenham was an old friend of Uncle’s, and he had\nintroduced Uncle to Mrs Leslie, and that was how he had the pride and\npleasure of welcoming her to our house-warming. And he made her a bow\nlike you see on a Christmas card.\n\nThen Alice asked, ‘What about Mr Rosenbaum? He was kind; it would have\nbeen a pleasant surprise for him.’\n\nBut everybody laughed, and Uncle said--\n\n‘Your father has paid him the sovereign he lent you. I don’t think he\ncould have borne another pleasant surprise.’\n\nAnd I said there was the butcher, and he was really kind; but they only\nlaughed, and Father said you could not ask all your business friends to\na private dinner.\n\nThen it was dinner-time, and we thought of Uncle’s talk about cold\nmutton and rice. But it was a beautiful dinner, and I never saw such a\ndessert! We had ours on plates to take away into another sitting-room,\nwhich was much jollier than sitting round the table with the grown-ups.\nBut the Robber’s kids stayed with their Father. They were very shy and\nfrightened, and said hardly anything, but looked all about with very\nbright eyes. H. O. thought they were like white mice; but afterwards we\ngot to know them very well, and in the end they were not so mousy. And\nthere is a good deal of interesting stuff to tell about them; but I\nshall put all that in another book, for there is no room for it in this\none. We played desert islands all the afternoon and drank Uncle’s health\nin ginger wine. It was H. O. that upset his over Alice’s green silk\ndress, and she never even rowed him. Brothers ought not to have\nfavourites, and Oswald would never be so mean as to have a favourite\nsister, or, if he had, wild horses should not make him tell who it was.\n\nAnd now we are to go on living in the big house on the Heath, and it is\nvery jolly.\n\nMrs Leslie often comes to see us, and our own Robber and\nAlbert-next-door’s uncle. The Indian Uncle likes him because he has been\nin India too and is brown; but our Uncle does not like Albert-next-door.\nHe says he is a muff. And I am to go to Rugby, and so are Noel and H.\nO., and perhaps to Balliol afterwards. Balliol is my Father’s college.\nIt has two separate coats of arms, which many other colleges are not\nallowed. Noel is going to be a poet and Dicky wants to go into Father’s\nbusiness.\n\nThe Uncle is a real good old sort; and just think, we should never have\nfound him if we hadn’t made up our minds to be Treasure Seekers! Noel\nmade a poem about it--\n\n    Lo! the poor Indian from lands afar,\n    Comes where the treasure seekers are;\n    We looked for treasure, but we find\n    The best treasure of all is the Uncle good and kind.\n\nI thought it was rather rot, but Alice would show it to the Uncle, and\nhe liked it very much. He kissed Alice and he smacked Noel on the back,\nand he said, ‘I don’t think I’ve done so badly either, if you come\nto that, though I was never a regular professional treasure seeker.\nEh!--what?’\n\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      302,
      342,
      1
    ],
    [
      "chapter.title",
      12709,
      12740,
      2
    ],
    [
      "chapter.title",
      25008,
      25035,
      3
    ],
    [
      "chapter.title",
      44481,
      44504,
      4
    ],
    [
      "chapter.title",
      56023,
      56057,
      5
    ],
    [
      "chapter.title",
      67111,
      67137,
      6
    ],
    [
      "chapter.title",
      81185,
      81209,
      7
    ],
    [
      "chapter.title",
      96642,
      96666,
      8
    ],
    [
      "chapter.title",
      115824,
      115844,
      9
    ],
    [
      "chapter.title",
      134327,
      134353,
      10
    ],
    [
      "chapter.title",
      148154,
      148183,
      11
    ],
    [
      "chapter.title",
      173466,
      173501,
      12
    ],
    [
      "chapter.title",
      196692,
      196730,
      13
    ],
    [
      "chapter.title",
      225995,
      226023,
      14
    ],
    [
      "chapter.title",
      240985,
      241019,
      15
    ],
    [
      "chapter.title",
      256909,
      256952,
      16
    ]
  ]
}