{
  "content": "The Tale of Squirrel Nutkin\nBeatrix Potter\n\nA STORY FOR NORAH\n\nBOOK 1.\n\nThis is a Tale about a tail--a tail that belonged to a little red\nsquirrel, and his name was Nutkin.\n\nHe had a brother called Twinkleberry, and a great many cousins: they lived\nin a wood at the edge of a lake.\n\n\n\nIn the middle of the lake there is an island covered with trees and nut\nbushes; and amongst those trees stands a hollow oak-tree, which is the\nhouse of an owl who is called Old Brown.\n\n\n\nOne autumn when the nuts were ripe, and the leaves on the hazel bushes\nwere golden and green--Nutkin and Twinkleberry and all the other little\nsquirrels came out of the wood, and down to the edge of the lake.\n\n\n\nThey made little rafts out of twigs, and they paddled away over the water\nto Owl Island to gather nuts.\n\nEach squirrel had a little sack and a large oar, and spread out his tail\nfor a sail.\n\n\n\nThey also took with them an offering of three fat mice as a present for\nOld Brown, and put them down upon his door-step.\n\nThen Twinkleberry and the other little squirrels each made a low bow, and\nsaid politely--\n\n\"Old Mr. Brown, will you favour us with permission to gather nuts upon\nyour island?\"\n\n\n\nBut Nutkin was excessively impertinent in his manners. He bobbed up and\ndown like a little red _cherry_, singing--\n\n    \"Riddle me, riddle me, rot-tot-tote!\n     A little wee man, in a red red coat!\n     A staff in his hand, and a stone in his throat;\n     If you'll tell me this riddle, I'll give you a groat.\"\n\nNow this riddle is as old as the hills; Mr. Brown paid no attention\nwhatever to Nutkin.\n\nHe shut his eyes obstinately and went to sleep.\n\n\n\nThe squirrels filled their little sacks with nuts, and sailed away home in\nthe evening.\n\n\n\nBut next morning they all came back again to Owl Island; and Twinkleberry\nand the others brought a fine fat mole, and laid it on the stone in front\nof Old Brown's doorway, and said--\n\n\"Mr. Brown, will you favour us with your gracious permission to gather\nsome more nuts?\"\n\n\n\nBut Nutkin, who had no respect, began to dance up and down, tickling old\nMr. Brown with a _nettle_ and singing--\n\n    \"Old Mr. B! Riddle-me-ree!\n     Hitty Pitty within the wall,\n     Hitty Pitty without the wall;\n     If you touch Hitty Pitty,\n     Hitty Pitty will bite you!\"\n\nMr. Brown woke up suddenly and carried the mole into his house.\n\n\n\nHe shut the door in Nutkin's face. Presently a little thread of blue\n_smoke_ from a wood fire came up from the top of the tree, and Nutkin\npeeped through the key-hole and sang--\n\n    \"A house full, a hole full!\n     And you cannot gather a bowl-full!\"\n\n\n\n\n\nThe squirrels searched for nuts all over the island and filled their\nlittle sacks.\n\nBut Nutkin gathered oak-apples--yellow and scarlet--and sat upon a\nbeech-stump playing marbles, and watching the door of old Mr. Brown.\n\n\n\nOn the third day the squirrels got up very early and went fishing; they\ncaught seven fat minnows as a present for Old Brown.\n\nThey paddled over the lake and landed under a crooked chestnut tree on Owl\nIsland.\n\n\n\nTwinkleberry and six other little squirrels each carried a fat minnow; but\nNutkin, who had no nice manners, brought no present at all. He ran in\nfront, singing--\n\n    \"The man in the wilderness said to me,\n    'How many strawberries grow in the sea?'\n     I answered him as I thought good--\n     'As many red herrings as grow in the wood.'\"\n\nBut old Mr. Brown took no interest in riddles--not even when the answer\nwas provided for him.\n\n\n\nOn the fourth day the squirrels brought a present of six fat beetles,\nwhich were as good as plums in _plum-pudding_ for Old Brown. Each beetle\nwas wrapped up carefully in a dock-leaf, fastened with a pine-needle pin.\n\nBut Nutkin sang as rudely as ever--\n\n     \"Old Mr. B! riddle-me-ree\n      Flour of England, fruit of Spain,\n      Met together in a shower of rain;\n      Put in a bag tied round with a string,\n    If you'll tell me this riddle, I'll give you a ring!\"\n\n\nWhich was ridiculous of Nutkin, because he had not got any ring to give to\nOld Brown.\n\n\n\nThe other squirrels hunted up and down the nut bushes; but Nutkin\ngathered robin's pincushions off a briar bush, and stuck them full of\npine-needle pins.\n\n\n\nOn the fifth day the squirrels brought a present of wild honey; it was so\nsweet and sticky that they licked their fingers as they put it down upon\nthe stone. They had stolen it out of a bumble _bees'_ nest on the tippitty\ntop of the hill.\n\nBut Nutkin skipped up and down, singing--\n\n    \"Hum-a-bum! buzz! buzz! Hum-a-bum buzz!\n      As I went over Tipple-tine\n      I met a flock of bonny swine;\n    Some yellow-nacked, some yellow backed!\n      They were the very bonniest swine\n      That e'er went over Tipple-tine.\"\n\n\n\nOld Mr. Brown turned up his eyes in disgust at the impertinence of Nutkin.\n\nBut he ate up the honey!\n\n\n\nThe squirrels filled their little sacks with nuts.\n\nBut Nutkin sat upon a big flat rock, and played ninepins with a crab apple\nand green fir-cones.\n\n\n\nOn the sixth day, which was Saturday, the squirrels came again for the\nlast time; they brought a new-laid _egg_ in a little rush basket as a last\nparting present for Old Brown.\n\nBut Nutkin ran in front laughing, and shouting--\n\n    \"Humpty Dumpty lies in the beck,\n     With a white counterpane round his neck,\n     Forty doctors and forty wrights,\n     Cannot put Humpty Dumpty to rights!\"\n\n\n\nNow old Mr. Brown took an interest in eggs; he opened one eye and shut it\nagain. But still he did not speak.\n\n\n\nNutkin became more and more impertinent--\n\n      \"Old Mr. B! Old Mr. B!\n    Hickamore, Hackamore, on the King's kitchen door;\n    All the King's horses, and all the King's men,\n    Couldn't drive Hickamore, Hackamore,\n    Off the King's kitchen door.\"\n\nNutkin danced up and down like a _sunbeam_; but still Old Brown said\nnothing at all.\n\n\n\nNutkin began again--\n\n    \"Arthur O'Bower has broken his band,\n     He comes roaring up the land!\n     The King of Scots with all his power,\n     Cannot turn Arthur of the Bower!\"\n\nNutkin made a whirring noise to sound like the _wind_, and he took a\nrunning jump right onto the head of Old Brown!...\n\nThen all at once there was a flutterment and a scufflement and a loud\n\"Squeak!\"\n\nThe other squirrels scuttered away into the bushes.\n\n\n\nWhen they came back very cautiously, peeping round the tree--there was Old\nBrown sitting on his door-step, quite still, with his eyes closed, as if\nnothing had happened.\n\n       *       *       *       *       *\n\n_But Nutkin was in his waistcoat pocket!_\n\n\n\nThis looks like the end of the story; but it isn't.\n\n\n\nOld Brown carried Nutkin into his house, and held him up by the tail,\nintending to skin him; but Nutkin pulled so very hard that his tail broke\nin two, and he dashed up the staircase and escaped out of the attic\nwindow.\n\n\n\nAnd to this day, if you meet Nutkin up a tree and ask him a riddle, he\nwill throw sticks at you, and stamp his feet and scold, and shout--\n\n\"Cuck-cuck-cuck-cur-r-r-cuck-k-k!\"\n\n\nTHE END\n\n\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}