{
  "content": "The Tapestry Room\nMrs. Molesworth\n\n['DUDU']\n\n          'What tale did Iseult to the children say,\n           Under the hollies, that bright winter's day?'\n                                     MATTHEW ARNOLD\n\n\n\n\nTO\nH.R.H. VITTORIO EMANUELE\nPRINCE OF NAPLES\nCROWN PRINCE OF ITALY\nONE OF THE KINDLIEST OF MY YOUNG READERS\n\n          MAISON DU CHANOINE,\n             _October_ 1879.\n\n\n\n\nCHAPTER I. MADEMOISELLE JEANNE.\n\n          \"Maitre Corbeau, sur un arbre perché.\"\n                               LA FONTAINE.\n\n\nIt was so cold. Ah, so very cold! So thought the old raven as he hobbled\nup and down the terrace walk at the back of the house--the walk that was\nso pleasant in summer, with its pretty view of the lower garden, gay\nwith the bright, stiffly-arranged flowerbeds, so pleasantly warm and yet\nshady with the old trees overhead, where the raven's second cousins, the\nrooks, managed their affairs, not without a good deal of chatter about\nit, it must be confessed. \"Silly creatures,\" the raven was in the habit\nof calling them with contempt--all to himself, of course, for no one\nunderstood the different tones of his croaking, even though he was a\nFrench raven and had received the best of educations. But to-day he was\ntoo depressed in spirit by the cold to think of his relations or their\nbehaviour at all. He just hopped or hobbled--I hardly know which you\nwould call it--slowly and solemnly up and down the long walk, where the\nsnow lay so thick that at each hop it came ever so far up his black\nclaws, which annoyed him very much, I assure you, and made him wish more\nthan ever that summer was back again.\n\nPoor old fellow! he was not usually of a discontented disposition; but\nto-day, it must be allowed, he was in the right about the cold. It was\n_very_ cold.\n\nSeveral others beside the raven were thinking so--the three chickens who\nlived in a queer little house in one corner of the yard thought so, and\nhuddled the closer together, as they settled themselves for the night.\nFor though it was only half-past three in the afternoon, they thought it\nwas no use sitting up any longer on such a make-believe of a day, when\nnot the least little ray of sunshine had succeeded in creeping through\nthe leaden-grey sky. And the tortoise _would_ have thought so too if he\ncould, but he was too sleepy to think at all, as he \"cruddled\" himself\ninto his shell in the corner of the laurel hedge, and dreamt of the nice\nhot days that were past.\n\nAnd upstairs, inside the old house, somebody else was thinking so too--a\nlittle somebody who seemed to be doing her best to make herself,\nparticularly her nose, colder still, for she was pressing it hard on to\nthe icy window-pane and staring out on to the deserted, snow-covered\ngarden, and thinking how cold it was, and wishing it was summer time\nagain, and fancying how it would feel to be a raven like old \"Dudu,\" all\nat once, in the mixed-up, dancing-about way that \"thinking\" was\ngenerally done in the funny little brain of Mademoiselle Jeanne.\n\nInside the room it was getting dark, and the white snow outside seemed\nto make it darker.\n\n\"Mademoiselle Jeanne,\" said a voice belonging to a servant who just then\nopened the door; \"Mademoiselle Jeanne, what are you doing at the window?\nYou will catch cold.\"\n\nJeanne gave a little start when she heard herself spoken to. She had\nbeen all alone in the room for some time, with not a sound about her.\nShe turned slowly from the window and came near the fire.\n\n\"If I did catch cold, it would not be bad,\" she said. \"I would stay in\nbed, and you, Marcelline, would make me nice things to eat, and nobody\nwould say, 'Don't do that, Mademoiselle.' It would be charming.\"\n\nMarcelline was Jeanne's old nurse, and she had been her mother's nurse\ntoo. She was really rather old, how old nobody seemed exactly to know,\nbut Jeanne thought her _very_ old, and asked her once if she had not\nbeen her grandmother's nurse too. Any one else but Marcelline would have\nbeen offended at such a question; but Marcelline was not like any one\nelse, and she never was offended at anything. She was so old that for\nmany years no one had seen much difference in her--she had reached a\nsort of settled oldness, like an arm-chair which may once have been\ncovered with bright-coloured silk, but which, with time and wear, has\ngot to have an all-over-old look which never seems to get any worse. Not\nthat Marcelline was dull or grey to look at--she was bright and cheery,\nand when she had a new clean cap on, all beautifully frilled and crimped\nround her face, Jeanne used to tell her that she was beautiful, quite\nbeautiful, and that if she was _very_ good and always did exactly what\nJeanne asked her, she--Jeanne--would have her to be nurse to her\nchildren when she had grown up to be a lady, married to some very nice\ngentleman.\n\nAnd when Jeanne chattered like that, Marcelline used to smile; she never\nsaid anything, she just smiled. Sometimes Jeanne liked to see her\nsmile; sometimes it would make her impatient, and she would say, \"Why do\nyou smile like that, Marcelline? _Speak!_ When I speak I like you to\nspeak too.\"\n\nBut all she could get Marcelline to answer would be, \"Well,\nMademoiselle, it is very well what you say.\"\n\nThis evening--or perhaps I should say afternoon, for whatever hour the\nchickens' timepiece made it, it was only half-past three by the great\nbig clock that stood at the end of the long passage by Jeanne's room\ndoor;--this afternoon Jeanne was not quite as lively as she sometimes\nwas. She sat down on the floor in front of the fire and stared into it.\nIt was pretty to look at just then, for the wood was burning redly, and\nat the tiniest touch a whole bevy of lovely sparks would fly out like\nbees from a hive, or a covey of birds, or better still, like a thousand\nimprisoned fairies escaping at some magic touch. Of all things, Jeanne\nloved to give this magic touch. There was no poker, but she managed just\nas well with a stick of unburnt wood, or sometimes, when she was _quite_\nsure Marcelline was not looking, with the toe of her little shoe. Just\nnow it was Marcelline who set the fairy sparks free by moving the logs a\nlittle and putting on a fresh one behind.\n\n\"How pretty they are, are they not, Marcelline?\" said Jeanne.\n\nMarcelline did not speak, and when Jeanne looked up at her, she saw by\nthe light of the fire that she was smiling. Jeanne held up her\nforefinger.\n\n\"Naughty Marcelline,\" she said; \"you are not to smile. You are to\n_speak_. I want you to speak very much, for it is so dull, and I have\nnothing to do. I want you to tell me stories, Marcelline. Do you hear,\nyou naughty little thing?\"\n\n\"And what am I to tell you stories about then, Mademoiselle? You have\ngot all out of my old head long ago; and when the grain is all ground\nwhat can the miller do?\"\n\n\"Get some more, of course,\" said Jeanne. \"Why, _I_ could make stories if\nI tried, I daresay, and I am only seven, and you who are a hundred--are\nyou _quite_ a hundred, Marcelline?\"\n\nMarcelline shook her head.\n\n\"Not _quite_, Mademoiselle,\" she said.\n\n\"Well, never mind, you are old enough to make stories, any way. Tell me\nmore about the country where you lived when you were little as I; the\ncountry you will never tell me the name of. Oh, I do like that one about\nthe Golden Princess shut up in the castle by the sea! I like stories\nabout princesses best of all. I do wish I were a princess; next to my\nbest wish of all, I wish to be a princess. Marcelline, do you hear? I\nwant you to tell me a story.\"\n\nStill Marcelline did not reply. She in her turn was looking into the\nfire. Suddenly she spoke.\n\n\"One, two, three,\" she said. \"Quick, now, Mademoiselle, quick, quick.\nWish a wish before that last spark is gone. Quick, Mademoiselle.\"\n\n\"Oh dear, what shall I wish?\" exclaimed Jeanne. \"When you tell me to be\nquick it all goes out of my head; but I know now. I wish----\"\n\n\"Hush, Mademoiselle,\" said Marcelline, quickly again. \"You must not say\nit aloud. Never mind, it is all right. You have wished it before the\nspark is gone. It will come true, Mademoiselle.\"\n\nJeanne's bright dark eyes glanced up at Marcelline with an expression of\nmingled curiosity and respect.\n\n\"How do you know it will come true?\" she said.\n\nMarcelline's old eyes, nearly as bright and dark still as Jeanne's own,\nhad a half-mischievous look in them as she replied, solemnly shaking her\nhead,\n\n\"I know, Mademoiselle, and that is all I can say. And when the time\ncomes for your wish to be granted, you will see if I am not right.\"\n\n\"Shall I?\" said Jeanne, half impressed, half rebellious. \"Do the fairies\ntell you things, Marcelline? Not that I believe there are any\nfairies--not now, any way.\"\n\n\"Don't say that, Mademoiselle,\" said Marcelline. \"In that country I have\ntold you of no one ever said such a thing as that.\"\n\n\"Why didn't they? Did they really _see_ fairies there?\" asked Jeanne,\nlowering her voice a little.\n\n\"Perhaps,\" said Marcelline; but that was all she _would_ say, and Jeanne\ncouldn't get her to tell her any fairy stories, and had to content\nherself with making them for herself instead out of the queer shapes of\nthe burning wood of the fire.\n\nShe was so busy with these fancies that she did not hear the stopping of\nthe click-click of Marcelline's knitting needles, nor did she hear the\nold nurse get up from her chair and go out of the room. A few minutes\nbefore, the _facteur_ had rung at the great wooden gates of the\ncourtyard--a rather rare event, for in those days letters came only\ntwice a week--but this, too, little Jeanne had not heard. She must have\ngrown drowsy with the quiet and the heat of the fire, for she quite\nstarted when the door again opened, and Marcelline's voice told her that\nher mother wanted her to go down to the salon, she had something to say\nto her.\n\n\"O Marcelline,\" said Jeanne, rubbing her eyes, \"I didn't know you had\ngone away. What does mamma want? O Marcelline, I am so sleepy, I would\nlike to go to bed.\"\n\n\"To go to bed, Mademoiselle, and not yet five o'clock! Oh no, you will\nwake up nicely by the time you get down to the salon.\"\n\n\"I am so tired, Marcelline,\" persisted Jeanne. \"These winter days it is\nso dull. I don't mind in summer, for then I can play in the garden with\nDudu and the tortoise, and all the creatures. But in winter it is so\ndull. I would not be tired if I had a little friend to play with me.\"\n\n\"Keep up your heart, Mademoiselle. Stranger things have happened than\nthat you should have some one to play with.\"\n\n\"What do you mean, Marcelline?\" said Jeanne, curiously. \"Do you know\nsomething, Marcelline? Tell me, do. Did you know what my wish was?\" she\nadded, eagerly.\n\n\"I know, Mademoiselle, that Madame will be waiting for you in the\nsalon. We can talk about your wish later; when I am putting you to bed.\"\n\nShe would say no more, but smoothed Jeanne's soft dark hair, never very\nuntidy it must be owned, for it was always neatly plaited in two tails\nthat hung down her back, as was then the fashion for little girls of\nJeanne's age and country, and bade her again not to delay going\ndownstairs.\n\nJeanne set off. In that great rambling old house it was really quite a\njourney from her room to her mother's salon. There was the long corridor\nto pass, at one end of which were Jeanne's quarters, at the other a room\nwhich had had for her since her babyhood a mingled fascination and awe.\nIt was hung with tapestry, very old, and in some parts faded, but still\ndistinct. As Jeanne passed by the door of this room, she noticed that it\nwas open, and the gleam of the faint moonlight on the snow-covered\ngarden outside attracted her.\n\n\"I can see the terrace ever so much better from the tapestry room\nwindow,\" she said to herself. \"I wonder what Dudu is doing, poor old\nfellow. Oh, how cold he must be! I suppose Grignan is asleep in a hole\nin the hedge, and the chickens will be all right any way. I have not\nseen Houpet all day.\"\n\n\"Houpet\" was Jeanne's favourite of the three chickens. He had come by\nhis name on account of a wonderful tuft of feathers on the top of his\nhead, which stuck straight up and then waved down again, something like\na little umbrella. No doubt he was a very rare and wonderful chicken,\nand if I were clever about chickens I would be able to tell you all his\nremarkable points. But that I cannot do. I can only say he was the\nqueerest-looking creature that ever pecked about a poultry-yard, and how\nit came to pass that Jeanne admired him so, I cannot tell you either.\n\n\"Poor Houpet!\" she repeated, as she ran across the tapestry room to the\nuncurtained window; \"I am sure he must have been very sad without me all\nday. He has such a loving heart. The others are nice too, but not half\nso loving. And Grignan has no heart at all; I suppose tortoises never\nhave; only he is very comical, which is nearly as nice. As for Dudu, I\nreally cannot say, he is so stuck up, as if he knew better than any one\nelse. Ah, there he is, the old fellow! Well, Dudu,\" she called out, as\nif the raven could have heard her so far off and through the closely\nshut window; \"well, Dudu, how are you to-day, my dear sir? How do you\nlike the snow and the cold?\"\n\nDudu calmly continued his promenade up and down the terrace. Jeanne\ncould clearly distinguish his black shape against the white ground.\n\n\"I am going downstairs to see mamma, Dudu,\" she went on. \"I love mamma\nvery much, but I wish she wasn't my mother at all, but my sister. I wish\nshe was turned into a little girl to play with me, and that papa was\nturned into a little boy. How funny he would look with his white hair,\nwouldn't he, Dudu? Oh, you stupid Dudu, why won't you speak to me? I\nwish you would come up here; there's a beautiful castle and garden in\nthe tapestry, where you would have two peacocks to play with;\" for just\nat that moment the moon, passing from under a cloud, lighted up one side\nof the tapestry, which, as Jeanne said, represented a garden with\nvarious curious occupants. And as the wavering brightness caught the\ngrotesque figures in turn, it really seemed to the little girl as if\nthey moved. Half pleased, half startled at the fancy, she clapped her\nhands.\n\n\"Dudu, Dudu,\" she cried, \"the peacocks want you to come; they're\nbeginning to jump about;\" and almost as she said the words a loud croak\nfrom the raven sounded in her ears, and turning round, there, to her\namazement, she saw Dudu standing on the ledge of the window outside,\nhis bright eyes shining, his black wings flapping, just as if he would\nsay,\n\n\"Let me in, Mademoiselle, let me in. Why do you mock me by calling me if\nyou won't let me in?\"\n\nCompletely startled by this time, Jeanne turned and fled.\n\n\"He must be a fairy,\" she said by herself; \"I'll never make fun of Dudu\nany more--_never_. He must be a fairy, or how else could he have got up\nfrom the terrace on to the window-sill all in a minute? And I don't\nthink a raven fairy would be nice at all; he'd be a sort of an imp, I\nexpect. I wouldn't mind now if Houpet was a fairy, he's so gentle and\nloving; but Dudu would be a sort of ogre fairy, he's so black and\nsolemn. Oh dear, how he startled me! How did he get up there? I'm very\nglad _I_ don't sleep in the tapestry room.\"\n\nBut when she got down to the brightly-lighted salon her cheeks were so\npale and her eyes so startled-looking that her mother was quite\nconcerned, and eagerly asked what was the matter.\n\n\"Nothing,\" said Jeanne at first, after the manner of little girls, and\nboys too, when they do not want to be cross-questioned; but after a\nwhile she confessed that she had run into the tapestry room on her way\ndown, and that the moonlight made the figures look as if they were\nmoving--and--and--that Dudu came and stood on the window-sill and\ncroaked at her.\n\n\"Dudu stood on the window-sill outside the tapestry room!\" repeated her\nfather; \"impossible, my child! Why, Dudu could not by any conceivable\nmeans get up there; you might as well say you saw the tortoise there\ntoo.\"\n\n\"If I had called him perhaps he _would_ have come too; I believe Dudu\nand he are great friends,\" thought Jeanne to herself, for her mind was\nin a queer state of confusion, and she would not have felt very much\nastounded at anything. But aloud she only repeated, \"I'm sure he was\nthere, dear papa.\"\n\nAnd to satisfy her, her kind father, though he was not so young as he\nhad been, and the bad weather made him very rheumatic, mounted upstairs\nto the tapestry room, and carefully examined the window inside and out.\n\n\"Nothing of the kind to be seen, my little girl,\" was his report.\n\"Master Dudu was hobbling about in the snow on his favourite terrace\nwalk as usual. I hope the servants give him a little meat in this cold\nweather, by the by. I must speak to Eugène about it. What you fancied\nwas Dudu, my little Jeanne,\" he continued, \"must have been a branch of\nthe ivy blown across the window. In the moonlight, and with the\nreflections of the snow, things take queer shapes.\"\n\n\"But there is no wind, and the ivy doesn't grow so high up, and the ivy\ncould not have _croaked_,\" thought Jeanne to herself again, though she\nwas far too well brought up a little French girl to contradict her\nfather by saying so.\n\n\"Perhaps so, dear papa,\" was all she said.\n\nBut her parents still looked a little uneasy.\n\n\"She cannot be quite well,\" said her mother. \"She must be feverish. I\nmust tell Marcelline to make her a little tisane when she goes to bed.\"\n\n\"Ah, bah!\" said Jeanne's white-headed papa. \"What we were speaking of\nwill be a much better cure than tisane. She needs companionship of her\nown age.\"\n\nJeanne pricked up her ears at this, and glanced at her mother\ninquiringly. Instantly there started into her mind Marcelline's prophecy\nabout her wish.\n\n\"The naughty little Marcelline!\" she thought to herself. \"She has been\ntricking me. I believe she knew something was going to happen. Mamma, my\ndear mamma!\" she cried, eagerly but respectfully, \"have you something to\ntell me? Have you had letters, mamma, from the country, where the\nlittle cousin lives?\"\n\nJeanne's mother softly stroked the cheeks, red enough now, of her\nexcited little daughter.\n\n\"Yes, my child,\" she replied. \"I have had a letter. It was for that I\nsent for you--to tell you about it. I have a letter from the grandfather\nof Hugh, with whom he has lived since his parents died, and he accepts\nmy invitation. Hugh is to come to live with us, as his mother would have\nwished. His grandfather can spare him, for he has other grandchildren,\nand we need him, do we not, my Jeanne? My little girl needs a little\nbrother--and I loved his mother so much,\" she added in a lower voice.\n\nJeanne could not speak. Her face was glowing with excitement, her breath\ncame quick and short, almost, it seemed, as if she were going to cry.\n\"O, mamma!\" was all she could say--\"O mamma!\" but her mother understood\nher.\n\n\"And when will he come?\" asked Jeanne next.\n\n\"Soon, I hope. In a few days; but it depends on the weather greatly. The\nsnow has stopped the diligences in several places, they say; but his\ngrandfather writes that he would like Hugh to come soon, as he himself\nhas to leave home.\"\n\n\"And will he be always with us? Will he do lessons with me, mamma, and\ngo to the château with us in summer, and always be with us?\"\n\n\"I hope so. For a long time at least. And he will do lessons with you at\nfirst--though when he gets big he will need more teachers, of course.\"\n\n\"He is a year older than I, mamma.\"\n\n\"Yes, he is eight.\"\n\n\"And, mamma,\" added Jeanne, after some consideration, \"what room will he\nhave?\"\n\n\"The tapestry room,\" said her mother. \"It is the warmest, and Hugh is\nrather delicate, and may feel it cold here. And the tapestry room is not\nfar from yours, my little Jeanne, so you can keep your toys and books\ntogether. There is only one thing I do not quite understand in the\nletter,\" went on Jeanne's mother, turning to her husband as she always\ndid in any difficulty--he was so much older and wiser than she, she used\nto say. \"Hugh's grandfather says Hugh has begged leave to bring a pet\nwith him, and he hopes I will not mind. What can it be? I cannot read\nthe other word.\"\n\n\"A little dog probably,\" said Jeanne's father, putting on his spectacles\nas he took the letter from his wife, \"a pet--gu--ga--and then comes\nanother word beginning with 'p.' It almost looks like 'pig,' but it\ncould not be a pet pig. No, I cannot read it either; we must wait to see\ntill he comes.\"\n\n       *       *       *       *       *\n\nAs Marcelline was preparing to put Jeanne to bed that night, the little\ngirl suddenly put her arms round her nurse's neck, and drew down her old\nface till it was on a level with her own.\n\n\"Look in my face, Marcelline,\" she said. \"Now look in my face and\nconfess. Now, didn't you know that mamma had got a letter to-night and\nwhat it said, and was not that how you knew my wish would come true?\"\n\nMarcelline smiled.\n\n\"That was one way I knew, Mademoiselle,\" she said.\n\n\"Well, it shows I'm right not to believe in fairies any way. I really\ndid think at first that the fairies had told you something, but----\"\nsuddenly she stopped as the remembrance of her adventure in the tapestry\nroom returned to her mind. \"Dudu may be a fairy, whether Marcelline has\nanything to do with fairies or not,\" she reflected. It was better\ncertainly to approach such subjects respectfully. \"Marcelline,\" she\nadded, after a little silence, \"there is only one thing I don't like. I\nwish the little cousin were not going to sleep in the tapestry room.\"\n\n\"Not in the tapestry room, Mademoiselle?\" exclaimed Marcelline, \"why, it\nis the best room in the house! You, who are so fond of stories,\nMademoiselle--why there are stories without end on the walls of the\ntapestry room; particularly on a moonlight night.\"\n\n\"_Are_ there?\" said Jeanne. \"I wonder then if the little cousin will be\nable to find them out. If he does he must tell them to me. Are they\nfairy stories, Marcelline?\"\n\nBut old Marcelline only smiled.\n\n\n\n\nCHAPTER II. PRINCE CHÉRI.\n\n          \"I'll take my guinea-pig always to church.\"\n                                         CHILD WORLD.\n\n\nIf it were cold just then in the thick-walled, well-warmed old house,\nwhich was Jeanne's home, you may fancy _how_ cold it was in the rumbling\ndiligence, which in those days was the only way of travelling in France.\nAnd for a little boy whose experience of long journeys was small, this\none was really rather trying. But Jeanne's cousin Hugh was a very\npatient little boy. His life, since his parents' death, had not been a\n_very_ happy one, and he had learnt to bear troubles without\ncomplaining. And now that he was on his way to the kind cousins his\nmother had so often told him of, the cousins who had been so kind to\n_her_, before she had any home of her own, his heart was so full of\nhappiness that, even if the journey had been twice as cold and\nuncomfortable, he would not have thought himself to be pitied.\n\nIt was a pale little face, however, which looked out of the diligence\nwindow at the different places where it stopped, and a rather timid\nvoice which asked in the pretty broken French he had not quite forgotten\nsince the days that his mother taught him her own language, for a little\nmilk for his \"pet.\" The pet, which had travelled on his knees all the\nway from England--comfortably nestled up in hay and cotton wool in its\ncage, which looked something like a big mouse-trap--much better off in\nits way certainly than its poor little master. But it was a great\ncomfort to him: the sight of its funny little nose poking out between\nthe bars of its cage made Hugh feel ever so much less lonely, and when\nhe had secured a little milk for his guinea-pig he did not seem to mind\nhalf so much about anything for himself.\n\nStill it was a long and weary journey, and poor Hugh felt very glad when\nhe was wakened up from the uncomfortable dose, which was all in the way\nof sleep he could manage, to be told that at last they had arrived. This\nwas the town where his friends lived, and a \"monsieur,\" the conductor\nadded, was inquiring for him--Jeanne's father's valet it was, who had\nbeen sent to meet him and take him safe to the old house, where an eager\nlittle heart was counting the minutes till he came.\n\nThey looked at each other curiously when at last they met. Jeanne's eyes\nwere sparkling and her cheeks burning, and her whole little person in a\nflutter of joyful excitement, and yet she couldn't speak. Now that the\nlittle cousin was there, actually standing before her, she could not\nspeak. How was it? He was not _quite_ what she had expected; he looked\npaler and quieter than any boys she had seen, and--was he not glad to\nsee her?--glad to have come?--she asked herself with a little misgiving.\nShe looked at him again--his blue eyes were very sweet and gentle, and,\ntired though he was, Jeanne could see that he was trying to smile and\nlook pleased. But he was _very_ tired and very shy. That was all that\nwas the matter. And his shyness made Jeanne feel shy too.\n\n\"Are you very tired, my cousin?\" she said at last.\n\n\"Not very, thank you,\" said Hugh. \"I am rather tired, but I am not very\nhungry,\" he added, glancing at a side-table where a little supper had\nbeen laid out for him. \"I am not very hungry, but I think Nibble is.\nMight I have a little milk for Nibble, please?\"\n\nAs he spoke he held up for Jeanne to see the small box he was carrying,\nand she gave a little scream of pleasure when, through the bars, she\ncaught sight of the guinea-pig's soft nose, poking out, saying as\nplainly almost as if he had spoken, \"I want my supper; please to see at\nonce about my supper, little girl.\"\n\n\"Neeble,\" cried Jeanne, \"O my cousin, is Neeble your pet? Why, he is a\n'cochon de Barbarie!' O the dear little fellow! We could not--at least\npapa and mamma could not--read what he was. And have you brought him all\nthe way, my cousin, and do you love him very much? Marcelline,\nMarcelline, oh, do give us some milk for the cochon de Barbarie--oh,\nsee, Marcelline, how sweet he is!\"\n\nOnce set free, her tongue ran on so fast that sometimes Hugh had\ndifficulty to understand her. But the ice was broken any way, and when,\nan hour or two later, Jeanne's mother told her she might take Hugh up to\nshow him his room, the two trotted off, hand-in-hand, as if they had\nbeen close companions for years.\n\n\"I hope you will like your room, chéri,\" said Jeanne, with a tiny tone\nof patronising. \"It is not very far from mine, and mamma says we can\nkeep all our toys and books together in my big cupboard in the passage.\"\n\nHugh looked at Jeanne for a moment without speaking. \"What was that name\nyou called me just now, Jeanne?\" he asked, after a little pause.\n\nJeanne thought for a minute.\n\n\"'Mon cousin,' was it that?\" she said. \"Oh no, I remember, it was\n'chéri.' I _cannot_ say your name--I have tried all these days. I cannot\nsay it better than 'Ee-ou,' which is not pretty.\"\n\nShe screwed her rosy little mouth into the funniest shape as she tried\nto manage \"Hugh.\" Hugh could hardly help laughing.\n\n\"Never mind,\" he said. \"I like 'chéri' ever so much better. I like it\nbetter than 'mon cousin' or any name, because, do you know,\" he added,\ndropping his voice a little, \"I remember now, though I had forgotten\ntill you said it--that was the name mamma called me by.\"\n\n\"Chéri!\" repeated Jeanne, stopping half-way up the staircase to throw\nher arms round Hugh's neck at the greatest risk to the equilibrium of\nthe whole party, including the guinea-pig--\"_Chéri!_ I shall always call\nyou so, then. You shall be my Prince Chéri. Don't you love fairy\nstories, mon cousin?\"\n\n\"_Awfully_,\" said Hugh, from the bottom of his soul.\n\n['ISN'T IT A FUNNY ROOM, CHÉRI?']\n\n\"I knew you would,\" said Jeanne triumphantly. \"And oh, so do I!\nMarcelline says, Chéri, that the tapestry room--that's the room you're\ngoing to have--is full of fairy stories. I wonder if you'll find out\nany of them. You must tell me if you do.\"\n\n\"The tapestry room?\" repeated Hugh; \"I don't think I ever saw a tapestry\nroom. Oh,\" he added, as a sudden recollection struck him, \"is it like\nwhat that queen long ago worked about the battles and all that? I mean\nall about William the Conqueror.\"\n\n\"No,\" said Jeanne, \"it's quite different from that work. I've seen that,\nso I know. It isn't pretty at all. It's just long strips of linen with\nqueer-shaped horses and things worked on. Not _at all_ pretty. And I\nthink the pictures on the walls of your room _are_ pretty. Here it is.\nIsn't it a funny room, Chéri?\"\n\nShe opened the door of the tapestry room as she spoke, for while\nchattering they had mounted the staircase and made their way along the\ncorridor. Hugh followed his little cousin into the room, and stood\ngazing round him with curious surprise and pleasure. The walls were well\nlighted up, for Marcelline had carried a lamp upstairs and set it down\non the table, and a bright fire was burning in the wide old-fashioned\nhearth.\n\n\"Jeanne,\" said Hugh, after a minute's silence, \"Jeanne, it is very\nfunny, but, do you know, I am _sure_ I have seen this room before. I\nseem to know the pictures on the walls. Oh, _how_ nice they are! I\ndidn't think that was what tapestry meant. Oh, how glad I am this is to\nbe my room--is yours like this too, Jeanne?\"\n\nJeanne shook her head.\n\n\"Oh no, Chéri,\" she said. \"My room has a nice paper--roses and things\nlike that running up and down. I am very glad my room is not like this.\nI don't think I should like to see all these funny creatures in the\nnight. You don't know how queer they look in the moonlight. They quite\nfrightened me once.\"\n\nHugh opened his blue eyes very wide.\n\n\"_Frightened_ you?\" he said. \"I should never be frightened at them. They\nare so nice and funny. Just look at those peacocks, Jeanne. They are\nlovely.\"\n\nJeanne still shook her head.\n\n\"I don't think so,\" she said. \"I can't bear those peacocks. But I'm very\nglad _you_ like them, Chéri.\"\n\n\"I wish it was moonlight to-night,\" continued Hugh. \"I don't think I\nshould go to sleep at all. I would lie awake watching all the pictures.\nI dare say they look rather nice in the firelight too, but still not\n_so_ nice as in the moonlight.\"\n\n\"No, Monsieur,\" said Marcelline, who had followed the children into the\nroom. \"A moonlight night is the time to see them best. It makes the\ncolours look quite fresh again. Mademoiselle Jeanne has never looked at\nthe tapestry properly by moonlight, or she would like it better.\"\n\n\"I shouldn't mind with Chéri,\" said Jeanne. \"You must call me some night\nwhen it's very pretty, Chéri, and we'll look at it together.\"\n\nMarcelline smiled and seemed pleased, which was rather funny. Most\nnurses would have begun scolding Jeanne for dreaming of such a thing as\nrunning about the house in the middle of the night to admire the\nmoonlight on tapestry or on anything else. But then Marcelline certainly\nwas rather a funny person.\n\n\"And the cochon de Barbarie, where is he to sleep, Monsieur?\" she said\nto Hugh.\n\nHugh looked rather distressed.\n\n\"I don't know,\" he said. \"At home he slept in his little house on a sort\nof balcony there was outside my window. But there isn't any balcony\nhere--besides, it's so _very_ cold, and he's quite strange, you know.\"\n\nHe looked at Marcelline, appealingly.\n\n\"I daresay, while it is so cold, Madame would not mind if we put him in\nthe cupboard in the passage,\" she said; but Jeanne interrupted her.\n\n\"Oh no,\" she said. \"He would be far better in the chickens' house. It's\nnice and warm, I know, and his cage can be in one corner. He wouldn't be\nnearly so lonely, and to-morrow I'll tell Houpet and the others that\nthey must be very kind to him. Houpet always does what I tell him.\"\n\n\"Who is Houpet?\" said Hugh.\n\n\"He's my pet chicken,\" replied Jeanne. \"They're all pets, of course, but\nhe's the most of a pet of all. He lives in the chicken-house with the\ntwo other little chickens. O Chéri,\" she added, glancing round, and\nseeing that Marcelline had left the room, \"do let us run out and peep at\nHoupet for a minute. We can go through the tonnelle, and the chickens'\nhouse is close by.\"\n\nShe darted off as she spoke, and Hugh, nothing loth, his precious Nibble\nstill in his arms, followed her. They ran down the long corridor, on to\nwhich opened both the tapestry room and Jeanne's room at the other end,\nthrough a small sort of anteroom, and then--for though they were\n_upstairs_, the garden being built in terraces was at this part of the\nhouse on a level with the first floor--then straight out into what\nlittle Jeanne called \"the tonnelle.\"\n\nHugh stood still and gazed about him with delight and astonishment.\n\n\"O Jeanne,\" he exclaimed, \"how pretty it is! oh, how very pretty!\"\n\nJeanne stopped short in her progress along the tonnelle.\n\n\"What's pretty?\" she said in a matter-of-fact tone. \"Do you mean the\ngarden with the snow?\"\n\n\"No, no, that's pretty too, but I mean the trees. Look up, Jeanne, do.\"\n\nThere was no moonlight, but the light from the windows streamed out to\nwhere the children stood, and shone upon the beautiful icicles on the\nbranches above their heads. For the tonnelle was a kind of arbour--a\nlong covered passage made by trees at each side, whose boughs had been\ntrained to meet and interlace overhead. And now, with their fairy\ntracery of snow and frost, the effect of the numberless little branches\nforming a sparkling roof was pretty and fanciful in the extreme. Jeanne\nlooked up as she was told.\n\n\"Yes,\" she said, \"it's pretty. If it was moonlight it would be prettier\nstill, for then we could see right along the tonnelle to the end.\"\n\n\"I don't think that _would_ be prettier,\" said Hugh; \"the dark at the\nend makes it look so nice--like as if it was a fairy door into some\nqueer place--a magic cavern, or some place like that.\"\n\n\"So it does,\" said Jeanne. \"What nice fancies you have, Chéri! But I\nwish you could see the tonnelle in summer. It _is_ pretty then, with all\nthe leaves on. But we must run quick, or else Marcelline will be calling\nus before we have got to the chicken-house.\"\n\nOff she set again, and Hugh after her, though not so fast, for Jeanne\nknew every step of the way, and poor Hugh had never been in the garden\nbefore. It was not very far to go, however--the chickens' house was in a\nlittle courtyard just a few steps from the tonnelle, and guided by\nJeanne's voice in front as much as by the faint glimpses of her figure,\ndark against the snow, Hugh soon found himself safe beside her at the\ndoor of the chickens' house. Jeanne felt about till she got hold of the\nlatch, which she lifted, and was going to push open the door and enter\nwhen Hugh stopped her.\n\n\"Jeanne,\" he said, \"it's _quite_ dark. We can't possibly see the\nchickens. Hadn't we better wait till to-morrow, and put Nibble in the\ncupboard, as Marcelline said, for to-night?\"\n\n\"Oh no,\" said Jeanne. \"It doesn't matter a bit that it's dark.\" She\nopened the door as she spoke, and gently pulled Hugh in after her.\n\"Look,\" she went on, \"there is a very, very little light from the\nkitchen window after all, when the door is opened. Look, Chéri, up in\nthat corner sleep Houpet and the others. Put the cochon de Barbarie down\nhere--so--that will do. He will be quite safe here, and you feel it is\nnot cold.\"\n\n\"And are there no rats, or naughty dogs about--nothing like that?\" asked\nHugh rather anxiously.\n\n\"Of course not,\" replied Jeanne. \"Do you think I'd leave Houpet here if\nthere were? I'll call to Houpet now, and tell him to be kind to the\nlittle cochon.\"\n\n\"But Houpet's asleep, and, besides, how would he know what you say?\"\nobjected Hugh.\n\nFor all answer Jeanne gave a sort of little whistle--half whistle, half\ncoo it was. \"Houpet, Houpet,\" she called softly, \"we've brought a little\ncochon de Barbarie to sleep in your house. You must be very kind to\nhim--do you hear, Houpet dear? and in the morning you must fly down and\npeep in at his cage and tell him you're very glad to see him.\"\n\nA faint, a very faint little rustle was heard up above in the corner\nwhere Jeanne had tried to persuade her cousin that the chickens were to\nbe _seen_, and delighted at this evidence that any way they were to be\n_heard_, she turned to him triumphantly.\n\n\"That's Houpet,\" she said. \"Dear little fellow, he's too sleepy to\ncrow--he just gives a little wriggle to show that he's heard me. Now put\ndown the cage, Chéri--oh, you have put it down--and let's run in again.\nYour pet will be quite safe, you see, but if we're not quick, Marcelline\nwill be running out to look for us.\"\n\nShe felt about for Hugh's hand, and having got it, turned to go. But she\nstopped to put her head in again for a moment at the door.\n\n\"Houpet, dear,\" she said, \"don't let Dudu come into your house. If he\ntries to, you must fly at him and scold him and peck him.\"\n\n\"Who is Dudu?\" said Hugh, as they were running back to the house\ntogether along the snowy garden path.\n\n\"He is----\" began Jeanne. \"Hush,\" she went on, in a lower voice, \"there\nhe is! I do believe he heard what I said, and he's angry.\" For right\nbefore them on the path stood the old raven, on one leg as usual, though\nthis it was too dark to see clearly. And, as Jeanne spoke, he gave a\nsharp, sudden croak, which made both the children jump, and then\ndeliberately hopped away.\n\n\"He's a raven!\" said Hugh with surprise. \"Why, what funny pets you have,\nJeanne!\"\n\nJeanne laughed.\n\n\"Dudu isn't my pet,\" she said. \"I don't like him. To tell you the truth,\nChéri, I'm rather frightened of him. I think he's a sort of a fairy.\"\n\nHugh looked much impressed, but not at all surprised.\n\n\"Do you really, Jeanne?\" he said.\n\n\"Yes,\" she said, \"I do. And I'm not _sure_ but that Grignan is too. At\nleast I think Grignan is enchanted, and that Dudu is the spiteful fairy\nthat did it. Grignan is the tortoise, you know.\"\n\n\"Yes,\" said Hugh, \"you told me about him. I do wonder if what you think\nis true,\" he added reflectively. \"We must try to find out, Jeanne.\"\n\n\"But we mustn't offend Dudu,\" said Jeanne. \"He might, you know, turn\n_us_ into something--two little mice, perhaps--that wouldn't be very\nnice, would it, Chéri?\"\n\n\"I don't know,\" Hugh replied. \"I wouldn't mind for a little, if he would\nturn us back again. We could get into such funny places and see such\nfunny things--couldn't we, Jeanne?\"\n\nThey both laughed merrily at the idea, and were still laughing when they\nran against Marcelline at the door which they had left open at the end\nof the tonnelle.\n\n\"My children!\" she exclaimed. \"Monsieur Chéri and Mademoiselle Jeanne!\nWhere have you been? And in the snow too! Who would have thought it?\"\n\nHer tone was anxious, but not cross. She hurried them in to the warm\nfire, however, and carefully examined their feet to make sure that their\nshoes and stockings were not wet.\n\n\"Marcelline is very kind,\" said Hugh, fixing his soft blue eyes on the\nold nurse in surprise. \"At home, grandmamma's maid would have scolded me\ndreadfully if I had run out in the snow.\"\n\n\"Yes,\" said Jeanne, flinging her arms round the old nurse's neck, and\ngiving her a kiss first on one cheek then on the other; \"she is very\nkind. Nice little old Marcelline.\"\n\n\"Perhaps,\" said Hugh, meditatively, \"she remembers that when she was a\nlittle girl she liked to do things like that herself.\"\n\n\"I don't believe you ever were a little girl, were you, Marcelline?\"\nsaid Jeanne. \"I believe you were always a little old woman like what you\nare now.\"\n\nMarcelline laughed, but did not speak.\n\n\"Ask Dudu,\" she said at last. \"If he is a fairy, he should know.\"\n\nJeanne pricked up her ears at this.\n\n\"Marcelline,\" she said solemnly, \"I believe you do know something about\nDudu. Oh, _do_ tell us, dear Marcelline.\"\n\nBut nothing more was to be got out of the old nurse.\n\nWhen the children were undressed, Jeanne begged leave to run into Hugh's\nroom with him to tuck him into bed, and make him feel at home the first\nnight. There was no lamp in the room, but the firelight danced curiously\non the quaint figures on the walls.\n\n\"You're sure you're not frightened, Chéri?\" said little Jeanne in a\nmotherly way, as she was leaving the room.\n\n\"Frightened! what is there to be frightened at?\" said Hugh.\n\n\"The funny figures,\" said Jeanne. \"Those peacocks look just as if they\nwere going to jump out at you.\"\n\n\"I think they look very nice,\" said Hugh. \"I am sure I shall have nice\ndreams. I shall make the peacocks give a party some night, Jeanne, and\nwe'll invite Dudu and Grignan, and Houpet and the two little hens, and\nNibble, of course, and we'll make them all tell stories.\"\n\nJeanne clapped her hands.\n\n\"Oh, what fun!\" she exclaimed. \"And you'll ask me and let me hear the\nstories, won't you, Chéri?\"\n\n\"_Of course_,\" said Hugh. So Jeanne skipped off in the highest spirits.\n\n\n\n\nCHAPTER III. ON A MOONLIGHT NIGHT.\n\n          \"O moon! in the night I have seen you sailing,\n           And shining so round and low.\"\n                                     CHILD NATURE.\n\n\n\"And what did you dream, Chéri?\" inquired Jeanne the next morning in a\nconfidential and mysterious tone.\n\nHugh hesitated.\n\n\"I don't know,\" he said at last. \"At least----\" he stopped and hesitated\nagain.\n\nThe two children were having their \"little breakfast,\" consisting of two\ngreat big cups of nice hot milky coffee and two big slices of bread,\nwith the sweet fresh butter for which the country where Jeanne's home\nwas is famed. They were alone in Jeanne's room, and Marcelline had drawn\na little table close to the fire for them, for this morning it seemed\ncolder than ever; fresh snow had fallen during the night, and out in\nthe garden nothing was to be seen but smoothly-rounded white mounds of\nvarying sizes and heights, and up in the sky the dull blue-grey curtain\nof snow-cloud made one draw back shivering from the window, feeling as\nif the sun had gone off in a sulky fit and would _never_ come back\nagain.\n\nBut inside, close by the brightly-blazing wood fire, Jeanne and Hugh\nfound themselves \"very well,\" as the little girl called it, very well\nindeed. And the hot coffee was very nice, much nicer, Hugh thought, than\nthe very weak tea which his grandmother's maid used to give him for\nbreakfast at home. He stirred it round and round slowly with his spoon,\nstaring into his cup, while he repeated, in answer to little Jeanne's\nquestion about what he had dreamt, \"No, I don't know.\"\n\n\"But you did dream _something_,\" said Jeanne rather impatiently. \"Can't\nyou tell me about it? I thought you were going to have all sorts of\nfunny things to tell me. You said you would have a party of the peacocks\nand all the pets, and make them tell stories.\"\n\n\"Yes,\" said Hugh slowly. \"But I couldn't make them--I must wait till\nthey come. I think I did dream some funny things last night, but I can't\nremember. There seemed to be a lot of chattering, and once I thought I\nsaw the raven standing at the end of the bed, but that time I wasn't\ndreaming. I'm sure I wasn't; but I was very sleepy, and I couldn't hear\nwhat he said. He seemed to want me to do something or other, and then he\nnodded his head to where the peacocks are, and do you know, Jeanne, I\nthought they nodded too. Wasn't that funny? But I daresay it was only\nthe firelight--the fire had burnt low, and then it bobbed up again all\nof a sudden.\"\n\n\"And what more?\" asked Jeanne eagerly. \"O Chéri, I think that's\nwonderful! Do tell me some more.\"\n\n\"I don't think I remember any more,\" said Hugh. \"After that I went to\nsleep, and then it was all a muddle. There were the chickens and Nibble\nand the tortoise all running about, and Dudu seemed to be talking to me\nall the time. But it was just a muddle; you know how dreams go\nsometimes. And when I woke up the fire was quite out and it was all\ndark. And then I saw the light of Marcelline's candle through the hinge\nof the door, and she came to tell me it was time to get up.\"\n\n\"Oh dear,\" said Jeanne, \"I do hope you'll dream some more to-night.\"\n\n\"I daresay I shan't dream at all,\" said Hugh. \"Some nights I go to\nsleep, and it's morning in one minute. I don't like that much, because\nit's nice to wake up and feel how cosy it is in bed.\"\n\n\"But, Chéri,\" pursued Jeanne after a few moments' silence, and a few\nmore bites at her bread and butter, \"there's one thing I don't\nunderstand. It's about Dudu. You said it wasn't a dream, you were sure.\nDo you think he was really there, at the foot of the bed? It might have\nbeen the firelight that made you think you saw the peacocks nodding, but\nit couldn't have been the firelight that made you think you saw Dudu.\"\n\n\"No,\" said Hugh, \"I can't understand it either. If it was a dream it was\na very queer one, for I never felt more awake in my life. I'll tell you\nwhat, Jeanne, the next time I think I see Dudu like that I'll run and\ntell you.\"\n\n\"Yes, do,\" said Jeanne, \"though I don't know that it would be much good.\nDudu's dreadfully tricky.\"\n\nShe had not told Hugh of the trick the raven had played her, though why\nshe had not done so she could hardly have explained. Perhaps she was a\nlittle ashamed of having been so frightened; perhaps she was still a\nlittle afraid of Dudu; and most of all, I think, she had a great\ncuriosity to find out more about the mysterious bird, and thought it\nbest to leave Hugh to face his own adventures.\n\n\"If Dudu thinks I've told Chéri all about his funny ways,\" she thought,\n\"perhaps he'll be angry and not do any more queer things.\"\n\nThe snow was still, as I said, thick on the ground, thicker, indeed,\nthan the day before. But the children managed to amuse themselves very\nwell. Marcelline would not hear of their going out, not even as far as\nthe chickens' house, but she fetched Nibble to pay them a visit in the\nafternoon, and they had great fun with him.\n\n\"He looks very happy, doesn't he, Chéri?\" said Jeanne. \"I am sure Houpet\nhas been kind to him. What a pity pets can't speak, isn't it? they could\ntell us such nice funny things.\"\n\n\"Yes,\" said Hugh, \"I've often thought that, and I often have thought\nNibble could speak if he liked.\"\n\n\"_Houpet_ could, I'm quite sure,\" said Jeanne, \"and I believe Dudu and\nhe do speak to each other. You should just see them sometimes. Why,\nthere they are!\" she added, going close up to the window near which she\nhad been standing. \"Do come here, Chéri, quick, but come very quietly.\"\n\nHugh came forward and looked out. There were the four birds, making the\nquaintest group you could fancy. Houpet with his waving tuft of feathers\nwas perched on the top rung of a short garden ladder, his two little\nhens as usual close beside him. And down below on the path stood the\nraven, on one leg of course, his queer black head very much on one side,\nas he surveyed the little group above him.\n\n\"Silly young people,\" he seemed to be saying to himself; but Houpet was\nnot to be put down so. With a shrill, clear crow he descended from his\nperch, stepped close up to Dudu, looked him in the face, and then\nquietly marched off, followed by his two companions. The children\nwatched this little scene with the greatest interest.\n\n\"They _do_ look as if they were talking to each other,\" said Hugh. \"I\nwonder what it's about.\"\n\n\"Perhaps it's about the party,\" said Jeanne; \"the party you said you'd\ngive to the peacocks on the wall, and all the pets.\"\n\n\"Perhaps,\" said Hugh. \"I am sure there must be beautiful big rooms in\nthat castle with the lots of steps up to it, where the peacocks stand.\nDon't you think it would be nice to get inside that castle and see what\nit's like?\"\n\n\"Oh, wouldn't it!\" said Jeanne, clapping her hands. \"How I do wish we\ncould! You might tell Dudu to take us, Chéri. Perhaps it's a fairy\npalace really, though it only looks like a picture, and if Dudu's a\nfairy, he might know about it.\"\n\n\"I'll ask him if I get a chance,\" said Hugh. \"Good morning, Monsieur\nDudu,\" he went on, bowing politely from the window to the raven, who had\ncocked his head in another direction, and seemed now to be looking up at\nthe two children with the same supercilious stare he had bestowed upon\nthe cock and hens. \"Good morning, Monsieur Dudu; I hope you won't catch\ncold with this snowy weather. It's best to be very polite to him, you\nsee,\" added Hugh, turning to Jeanne; \"for if he took offence we should\nget no fun out of him.\"\n\n\"Oh yes,\" said Jeanne, \"it is much best to be very polite to him. Look\nat him now, Chéri; _doesn't_ he look as if he knew what we were saying?\"\n\nFor Dudu was eyeing them unmistakably by this time, his head more on one\nside than ever, and his lame leg stuck out in the air like a\nwalking-stick.\n\n\"That's _just_ how he stood at the foot of the bed, on the wood part,\nyou know,\" said Hugh, in a whisper.\n\n\"And weren't you frightened, Chéri?\" said Jeanne. \"I always think Dudu\nlooks not at all like a good fairy, when he cocks his head on one side\nand sticks his claw out like that. I quite believe then that he's a\nwicked enchanter. O Chéri,\" she went on, catching hold of Hugh, \"what\n_should_ we do if he was to turn us into two little frogs or toads?\"\n\n\"We should have to live in the water, and eat nasty little worms and\nflies, I suppose,\" said Hugh gravely.\n\n\"And that sort of thick green stuff that grows at the top of dirty\nponds; fancy having that for soup,\" said Jeanne pathetically. \"O Chéri,\nwe must indeed be very polite to Dudu, and take _great_ pains not to\noffend him; and if he comes to you in the night, you must be sure to\ncall me at once.\"\n\nBut the following night and several nights after that went by, and\nnothing was heard or seen of Monsieur Dudu. The weather got a little\nmilder; that is to say, the snow gradually melted away, and the children\nwere allowed to go out into the garden and visit their pets. Nibble\nseemed quite at home in his new quarters, and was now permitted to run\nabout the chicken-house at his own sweet will; and Jeanne greatly\ncommended Houpet for his kindness to the little stranger, which\ncommendation the chicken received in very good part, particularly when\nit took the shape of all the tit-bits left on the children's plates.\n\n\"See how tame he is,\" said Jeanne one day when she had persuaded the\nlittle cock to peck some crumbs out of her hand; \"isn't he a darling,\nChéri, with his _dear_ little tuft of feathers on the top of his head?\"\n\n\"He's awfully funny-looking,\" said Hugh, consideringly; \"do you really\nthink he's very pretty, Jeanne?\"\n\n\"Of course I do,\" said Jeanne, indignantly; \"all my pets are pretty, but\nHoupet's the prettiest of all.\"\n\n\"He's prettier than Grignan, certainly,\" said Hugh, giving an amiable\nlittle push to the tortoise, who happened to be lying at his feet; \"but\nI like Grignan, he's so comical.\"\n\n\"I think Grignan must know a great deal,\" said Jeanne, \"he's so solemn.\"\n\n\"So is Dudu,\" said Hugh. \"By the by, Jeanne,\" he went on, but stopped\nsuddenly.\n\n\"What?\" said Jeanne.\n\n\"It just came into my head while we were talking that I must have\ndreamt of Dudu again last night; but now I try to remember it, it has\nall gone out of my head.\"\n\n\"_What_ a pity,\" said Jeanne; \"do try to remember. Was it that he came\nand stood at the foot of the bed again, like the last time? You promised\nto call me if he did.\"\n\n\"No, I don't think he did. I have more a sort of feeling that he and the\npeacocks on the wall were whispering to each other--something about\nus--you and me, Jeanne--it was, I think.\"\n\n\"Perhaps they were going to give a party, and were planning about\ninviting us,\" suggested Jeanne.\n\n\"I don't know,\" said Hugh; \"it's no good my trying to think. It's just a\nsleepy feeling of having heard something. I can't remember anything\nelse, and the more I think, the less I remember.\"\n\n\"Well, you must be sure to tell me if you do hear anything more. I was\nawake ever so long in the night, ever so long; but I didn't mind, there\nwas such nice moonlight.\"\n\n\"Moonlight, was there?\" said Hugh; \"I didn't know that. I'll try to keep\nawake to-night, because Marcelline says the figures on the walls are so\npretty when it's moonlight.\"\n\n\"And if Dudu comes, or you see anything funny, you'll promise to call\nme?\" said Jeanne.\n\nHugh nodded his head. There was not much fear of his forgetting his\npromise. Jeanne reminded him of it at intervals all that day, and when\nthe children kissed each other for good-night she whispered again,\n\"Remember to call me, Chéri.\"\n\nChéri went to sleep with the best possible intentions as to\n\"remembering.\" He had, first of all, intended not to go to sleep at all,\nfor his last glance out of the window before going to bed showed him\nMonsieur Dudu on the terrace path, enjoying the moonlight apparently,\nbut, Hugh strongly suspected, bent on mischief, for his head was very\nmuch on one side and his claw very much stuck out, in the way which\nJeanne declared made him look like a very impish raven indeed.\n\n\"I wonder what Marcelline meant about the moonlight,\" thought Hugh to\nhimself as he lay down. \"I hardly see the figures on the wall at all.\nThe moon must be going behind a cloud. I wonder if it will be brighter\nin the middle of the night. I don't see that I need stay awake all the\nnight to see. I can easily wake again. I'll just take a little sleep\nfirst.\"\n\nAnd the little sleep turned out such a long one, that when poor Hugh\nopened his eyes, lo and behold! it was to-morrow morning--there was\nMarcelline standing beside the bed, telling him it was time to get up,\nhe would be late for his tutor if he did not dress himself at once.\n\n\"Oh dear,\" exclaimed Hugh, \"what a pity! I meant to stay awake all night\nto watch the moonlight.\"\n\nMarcelline smiled what Jeanne called her funny smile.\n\n\"You would find it very difficult to do that, I think, my little\nMonsieur,\" she said. \"However, you did not miss much last night. The\nclouds came over so that the moon had no chance. Perhaps it will be\nclearer to-night.\"\n\nWith this hope Hugh had to be satisfied, and to satisfy also his little\ncousin, who was at first quite disappointed that he had nothing\nwonderful to tell her.\n\n\"To-night,\" she said, \"_I_ shall stay awake all night, and if the\nmoonlight is very nice and bright I shall come and wake _you_, you\nsleepy Chéri. I do _so_ want to go up those steps and into the castle\nwhere the peacocks are standing at the door.\"\n\n\"So do I,\" said Hugh, rather mortified; \"but if one goes to sleep,\nwhose fault is it? I am sure you will go to sleep too, if you try to\nkeep awake. There's _nothing_ makes people go to sleep so fast as trying\nto keep awake.\"\n\n\"Well, don't try then,\" said Jeanne, \"and see what comes then.\"\n\nAnd when night came, Hugh, partly perhaps because he was particularly\nsleepy--the day had been so much finer that the children had had some\nsplendid runs up and down the long terrace walk in the garden, and the\nunusual exercise had made both of them very ready for bed when the time\ncame--took Jeanne's advice, tucked himself up snugly and went off to\nsleep without thinking of the moonlight, or the peacocks, or Dudu, or\nanything. He slept so soundly, that when he awoke he thought it was\nmorning, and brighter morning than had hitherto greeted him since he\ncame to Jeanne's home.\n\n\"Dear me!\" he said to himself, rubbing his eyes, \"it must be very late;\nit looks just as if summer had come,\" for the whole room was flooded\nwith light--such beautiful light--bright and clear, and yet soft. No\nwonder that Hugh rubbed his eyes in bewilderment--it was not till he sat\nup in bed and looked well about him, quite awake now, that he saw that\nafter all it was moonlight, not sunshine, which was illumining the old\ntapestry room and everything which it contained in this wonderful way.\n\n\"Oh, how pretty it is!\" thought Hugh. \"No wonder Marcelline told us that\nwe should see the tapestry in the moonlight. I never could have thought\nit would have looked so pretty. Why, even the peacocks' tails seem to\nhave got all sorts of new colours.\"\n\nHe leant forward to examine them better. They were standing--just as\nusual--one on each side of the flight of steps leading up to the castle.\nBut as Hugh gazed at them it certainly seemed to him--could it be his\nfancy only?--no, it _must_ be true--that their long tails grew longer\nand swept the ground more majestically--then that suddenly--fluff! a\nsort of little wind seemed to rustle for an instant, and fluff! again,\nthe two peacocks had spread their tails, and now stood with them proudly\nreared fan-like, at their backs, just like the real living birds that\nHugh had often admired in his grandfather's garden. Hugh was too much\namazed to rub his eyes again--he could do nothing but stare, and stare\nhe did with all his might, but for a moment or two there was nothing\nelse to be seen. The peacocks stood still--so still that Hugh now\nbegan to doubt whether they had not always stood, tails spread, just as\nhe saw them now, and whether these same tails having ever drooped on the\nground was not altogether his fancy. A good deal puzzled, and a little\ndisappointed, he was turning away to look at another part of the\npictured walls, when again a slight flutter of movement caught his eyes.\nWhat was about to happen this time?\n\n[Illustration:--\"IT WAS DUDU!\"]\n\n\"Perhaps they are going to furl their tails again,\" thought Hugh; but\nno. One on each side of the castle door, the peacocks solemnly advanced\na few steps, then stood still--quite still--but yet with a certain\nwaiting look about them as if they were expecting some one or something.\nThey were not kept waiting long. The door of the castle opened slowly,\nvery slowly, the peacocks stepped still a little farther forward, and\nout of the door of the castle--the castle into which little Jeanne had\nso longed to enter--who, what, who _do_ you think came forth? It was\nDudu!\n\nA small black figure, black from head to foot, head very much cocked on\none side, foot--claw I should say--stuck out like a walking-stick; he\nstood between the peacocks, right in Hugh's view, just in front of the\ndoor which had closed behind him, at the top of the high flight of\nsteps. He stood still with an air of great dignity, which seemed to say,\n\"Here you see me for the first time in my rightful character--monarch of\nall I survey.\" And somehow Hugh felt that this unspoken address was\ndirected to _him_. Then, quietly and dignifiedly still, the raven\nturned, first to the right, then to the left, and gravely bowed to the\ntwo attendant peacocks, who each in turn saluted him respectfully and\nwithdrew a little farther back, on which Dudu began a very slow and\nimposing progress down the steps. How he succeeded in making it so\nimposing was the puzzle, for after all, his descent was undoubtedly a\nseries of hops, but all the same it was very majestic, and Hugh felt\ngreatly impressed, and watched him with bated breath.\n\n\"One, two, three, four,\" said Hugh to himself, half unconsciously\ncounting each step as the raven advanced, \"what a lot of steps! Five,\nsix, seven,\" up to twenty-three Hugh counted on. And \"what is he going\nto do now?\" he added, as Dudu, arrived at the foot of the stairs, looked\ncalmly about him for a minute or two, as if considering his next\nmovements. Then--how he managed it Hugh could not tell--he suddenly\nstepped out of the tapestry landscape, and in another moment was\nperched in his old place at the foot of Hugh's bed.\n\nHe looked at Hugh for an instant or two, gravely and scrutinisingly,\nthen bowed politely. Hugh, who was half sitting up in bed, bowed too,\nbut without speaking. He remembered Jeanne's charges to be very polite\nto the raven, and thought it better to take no liberties with him, but\nto wait patiently till he heard what Monsieur Dudu had to say. For\nsomehow it seemed to him a matter of course that the raven _could_\nspeak--he was not the very least surprised when at last Dudu cleared his\nthroat pompously and began--\n\n\"You have been expecting me, have you not?\"\n\nHugh hesitated.\n\n\"I don't know exactly. I'm not quite sure. Yes, I think I thought\nperhaps you'd come. But oh! if you please, Monsieur Dudu,\" he exclaimed,\nsuddenly starting up, \"do let me go and call Jeanne. I promised her I\nwould if you came, or if I saw anything funny. Do let me go. I won't be\na minute.\"\n\nBut the raven cocked his head on one side and looked at Hugh rather\nsternly.\n\n\"No,\" he said. \"You cannot go for Jeanne. I do not wish it at present.\"\n\nHugh felt rather angry. Why should Dudu lay down the law to him in this\nway?\n\n\"But I promised,\" he began.\n\n\"People should not promise what they are not sure of being able to\nperform,\" he said sententiously. \"Besides, even if you did go to get\nJeanne, she couldn't come. She is ever so far away.\"\n\n\"Away!\" repeated Hugh in amazement, \"away! Little Jeanne gone away. Oh\nno, you must be joking Du--, I beg your pardon, Monsieur Dudu.\"\n\n\"Not at all,\" said Dudu. \"She _is_ away, and farther away than you or\nshe has any notion of, even though if you went into her room you would\nsee her little rosy face lying on the pillow. _She_ is away.\"\n\nHugh still looked puzzled, though rather less so.\n\n\"You mean that her thinking is away, I suppose,\" he said. \"But I could\nwake her.\"\n\nAgain the raven cocked his head on one side.\n\n\"No,\" he said. \"You must be content to do my way at present. Now, tell\nme what it is you want. Why did you wish me to come to see you?\"\n\n\"I wanted--at least I thought, and Jeanne said so,\" began Hugh. \"We\nthought perhaps you were a fairy, Monsieur Dudu, and that you could take\nus into the castle in the tapestry. It looked so bright and real a few\nminutes ago,\" he added, turning to the wall, which was now only faintly\nillumined by the moonlight, and looked no different from what Hugh had\noften seen it in the daytime. \"What has become of the beautiful light,\nMonsieur Dudu? And the peacocks? They have shut up their tails\nagain----\"\n\n\"Never mind,\" said the raven. \"So you want to see the castle, do you?\"\nhe added.\n\n\"Yes,\" said Hugh; \"but not so much as Jeanne. It was she wanted it most.\nShe wants dreadfully to see it. _I_ thought,\" he added, rather timidly,\n\"_I_ thought we might play at giving a party in the castle, and inviting\nHoupet, you know, and Nibble.\"\n\n\"_Only_,\" observed the raven, drily, \"there is one little objection to\nthat. _Generally_--I may be mistaken, of course, my notions are very\nold-fashioned, I daresay--but, _generally_, people give parties in their\nown houses, don't they?\"\n\nAnd as he spoke he looked straight at Hugh, cocking his head on one side\nmore than ever.\n\n\n\n\nCHAPTER IV. THE FOREST OF THE RAINBOWS.\n\n          \"Rose and amethyst, gold and grey.\"\n                                   \"ONCE.\"\n\n\nHugh felt rather offended. It was natural that he should do so, I think.\nAt least I am sure that in his place I too should have felt hurt. He had\nsaid nothing to make the raven speak in that disagreeably sarcastic way.\n\n\"I wish Jeanne were here,\" he said to himself; \"she would think of\nsomething to put him down a little.\"\n\nBut aloud he said nothing, so, great was his surprise, when the raven\ncoolly remarked in answer to his unspoken thoughts,\n\n\"So Jeanne could put me down, you think? I confess, I don't agree with\nyou. However, never mind about that. We shall be very good friends in\ntime. And now, how about visiting the castle?\"\n\n\"I should like to go,\" replied Hugh, thinking it wiser, all things\nconsidered, to get over his offended feelings. \"I should like to see\nthe castle very much, though I should have liked Jeanne to be with me;\nbut still,\" he went on, reflecting that Jeanne would be extremely\ndisappointed if he did not make the most of his present opportunity,\nsuch as it was, \"if you will be so kind as to show me the way, Monsieur\nDudu, I'd like to go, and then, any way, I can tell Jeanne all about\nit.\"\n\n\"I cannot exactly show you the way,\" said the raven, \"I am only the\nguardian on this side. But if you will attend to what I say, you will\nget on very well. Here, in the first place, is a pair of wall-climbers\nto put on your feet.\"\n\nHe held out his claw, on the end of which hung, by a narrow ribbon, two\nround little cushions about the size of a macaroon biscuit. Hugh took\nthem, and examined them curiously. They were soft and elastic, what Hugh\nin his own words would have described as \"blobby.\" They seemed to be\nmade of some stuff like indiarubber, and were just the colour of his\nskin.\n\n\"What funny things!\" said Hugh.\n\n\"They are made after the pattern of the fly's wall-climbers,\" remarked\nthe raven. \"Put them on--tie them on, that is to say, so that they will\nbe just in the middle of your foot, underneath of course. That's right;\nnow jump out of bed and follow me,\" and before Hugh knew what he was\ndoing he found himself walking with the greatest ease straight up the\nwall to where the long flight of steps to the tapestry castle began. On\nthe lowest steps the raven stopped a moment.\n\n\"Shall I take them off now?\" asked Hugh. \"I don't need them to walk up\nsteps with.\"\n\n\"Take them off?\" said the raven; \"oh dear no. When you don't need them\nthey won't incommode you, and they'll be all ready for the next time.\nBesides, though it mayn't seem so to you, these steps are not so easy to\nget up as you think. At least they wouldn't be without the\nwall-climbers.\"\n\n_With_ them, however, nothing could have been easier. Hugh found himself\nin no time at the top of the flight of steps in front of the door from\nwhich the raven had come out. The peacocks, now he was close to them,\nseemed to him larger than ordinary peacocks, but the brilliant colours\nof their feathers, which he had noticed in the bright moonlight, had\ndisappeared. It was light enough for him to distinguish their figures,\nbut that was all.\n\n\"I must leave you now,\" said the raven; \"but you will get on very well.\nOnly remember these two things--don't be impatient, and don't take off\nyour wall-climbers; and if you are very much at a loss about anything,\ncall me.\"\n\n\"How shall I call you?\" asked Hugh.\n\n\"Whistle softly three times. Now, I think it is time to light up.\nPeacocks.\"\n\nThe peacocks, one on each side of the door, came forward solemnly,\nsaluting the raven with the greatest respect.\n\n\"Ring,\" said the raven, and to Hugh's surprise each peacock lifted up a\nclaw, and taking hold of a bell-rope, of which there were two, one on\neach side of the door, pulled them vigorously. No sound ensued, but at\nthe instant there burst forth the same soft yet brilliant light which\nhad so delighted Hugh when he first awoke, and which he now discovered\nto come not from the moon, still shining in gently at the window of the\ntapestry room down below, but from those of the castle at whose door he\nwas standing. He had never before noticed how many windows it had.\nJeanne and he had only remarked the door at the top of the steps, but\nnow the light which flowed out from above him was so clear and brilliant\nthat it seemed as if the whole castle must be transparent. Hugh stood\nin eager expectation of what was to happen next, and was on the point of\nspeaking to the raven, standing, as he thought, beside him, when a\nsudden sound made him turn round. It was that of the castle door\nopening, and at the same moment the two peacocks, coming forward, pushed\nhim gently, one at each side, so that Hugh found himself obliged to\nenter. He was by no means unwilling to do so, but he gave one last look\nround for his conductor. He was gone.\n\nFor about half a second Hugh felt a little frightened and bewildered.\n\n\"I wish Dudu had come with me,\" he said. But almost before he had time\nto think the wish, what he saw before him so absorbed his attention that\nhe forgot everything else.\n\nIt was a long, long passage, high in the roof, though narrow of course\nin comparison with its length, but wide enough for Hugh--for Hugh and\nJeanne hand-in-hand even--to walk along with perfect comfort and great\nsatisfaction, for oh, it was so prettily lighted up! You have, I\ndaresay, children, often admired in London or Paris, or some great town,\nthe rows of gas lamps lighting up at night miles of some very long\nstreet. Fancy those lights infinitely brighter and clearer, and yet\nsofter than any lamps you ever saw, and each one of a different colour,\nfrom the richest crimson to the softest pale blue, and you will have\nsome idea how pretty the long corridor before him looked to Hugh. He\nstepped along delightedly, as well he might. \"Why, this of itself is\nworth staying awake ever so many nights to see,\" he said to himself;\n\"only I do wish Jeanne were with me.\"\n\nWhere did the corridor lead to? He ran on and on for some time without\nthinking much about this, so interested was he in observing the lamps\nand the pretty way in which the tints were arranged; but after a while\nhe began to find it a little monotonous, especially when he noticed that\nat long intervals the colours repeated themselves, the succession of\nshades beginning again from time to time.\n\n\"I shall learn them by heart if I go on here much longer,\" thought Hugh.\n\"I think I'll sit down a little to rest. Not that I feel tired of\nwalking, but I may as well sit down a little.\"\n\nHe did so--on the ground, there was nothing else to sit on--and then a\nvery queer thing happened. The lamps took to moving instead of him, so\nthat when he looked up at them the impression was just the same as when\nhe himself had been running along. The colours succeeded each other in\nthe same order, and Hugh began to wonder whether his eyes were not\ndeceiving him in some queer way.\n\n\"Anyhow, I'll run on a little farther,\" he said to himself, \"and if I\ndon't come to the end of this passage soon, I'll run back again to the\nother end. It feels just as if I had got inside a kaleidoscope.\"\n\nHe hastened on, and was beginning really to think of turning back again\nand running the other way, when, all of a sudden--everything in this\nqueer tapestry world he had got into seemed to happen all of a sudden--a\nlittle bell was heard to ring, clear and silvery, but not very loud, and\nin another instant--oh dear!--all the pretty coloured lamps were\nextinguished, and poor Hugh was left standing all in the dark. Where he\nwas he did not know, what to do he did not know; had he not been eight\nyears old on his last birthday I almost think he would have begun to\ncry. He felt, too, all of a sudden so cold, even though before he had\ngot out of bed he had taken the precaution to put on his red flannel\ndressing-gown, and till now had felt quite pleasantly warm. It was only\nfor half a moment, however, that the idea of crying came over him.\n\n\"I'm very glad poor little Jeanne isn't here,\" he said to himself by way\nof keeping up his own courage; \"she _would_ have been afraid. But as I'm\na boy it doesn't matter. I'll just try to find my way all the same. I\nsuppose it's some trick of that Dudu's.\"\n\nHe felt his way along bravely for a few minutes, and more bravely still\nwas forcing back his tears, when a sound caught his ears. It was a\ncock's crow, sharp and shrill, but yet sounding as if outside the place\nwhere he was. Still it greatly encouraged Hugh, who continued to make\nhis way on in the dark, much pleased to find that the farther he got the\nnearer and clearer sounded the crow, repeated every few seconds. And at\nlast he found himself at the end of the passage--he knew it must be so,\nfor in front of him the way was barred, and _quite_ close to him now\napparently, sounded the cock's shrill call. He pushed and pulled--for\nsome time in vain. If there were a door at this end of the passage, as\nsurely there must be--who would make a passage and hang it so\nbeautifully with lamps if it were to lead to nowhere?--it was a door of\nwhich the handle was very difficult to find.\n\n\"Oh dear!\" exclaimed Hugh, half in despair, \"what shall I do?\"\n\n\"Kurroo--kurroorulloo,\" sounded the cock's crow. \"Try again,\" it seemed\nto say, encouragingly. And at last Hugh's hand came in contact with a\nlittle round knob, and as he touched it, all at once everything about\nhim was lighted up again with the same clear, lovely light coming from\nthe thousands of lamps down the long corridor behind him. But Hugh never\nturned to look at them--what he saw in front of him was so delightful\nand surprising.\n\nThe door had opened, Hugh found himself standing at the top of two or\nthree steps, which apparently were the back approach to the strange long\npassage which he had entered from the tapestry room. Outside it was\nlight too, but not with the wonderful bright radiance that had streamed\nout from the castle at the other side. Here it was just very soft, very\nclear moonlight. There were trees before him--almost it seemed as if he\nwere standing at the entrance of a forest. But, strange to say, they\nwere not winter trees, such as he had left behind him in the garden of\nJeanne's house--bare and leafless, or if covered at all, covered only\nwith their Christmas dress of snow and icicles--these trees were clothed\nwith the loveliest foliage, fresh and green and feathery, which no\nwinter's storms or nipping frosts had ever come near to blight. And in\nthe little space between the door where Hugh stood and these wonderful\ntrees was drawn up, as if awaiting him, the prettiest, queerest, most\ndelicious little carriage that ever was seen. It was open; the cushions\nwith which it was lined were of rose-coloured plush--not velvet, I\nthink; at least if they _were_ velvet, it was of some marvellous kind\nthat couldn't he rubbed the wrong way, that felt exquisitely smooth and\nsoft whichever way you stroked it; the body of the carriage was shaped\nsomething like a cockle-shell; you could lie back in it so beautifully\nwithout cricking or straining your neck or shoulders in the least; and\nthere was just room for two. One of these two was already comfortably\nsettled--shall I tell you who it was now, or shall I keep it for a\ntit-bit at the end when I have quite finished about the carriage? Yes,\nthat will be better. For the funniest things about the carriage have to\nbe told yet. Up on the box, in the coachman's place, you understand,\nholding with an air of the utmost importance in one claw a pair of\nyellow silk reins, his tufted head surmounted by a gold-laced livery\nhat, which, however, must have had a hole in the middle to let the tuft\nthrough, for there it was in all its glory waving over the hat like a\ndragoon's plume, sat, or stood rather, Houpet; while, standing behind,\nholding on each with one claw to the back of the carriage, like real\nfootmen, were the two other chickens. They, too, had gold-laced hats and\nan air of solemn propriety, not _quite_ so majestic as Houpet's, for in\ntheir case the imposing tuft was wanting, but still very fine of its\nkind. And who do you think were the horses? for there were two--or, to\nspeak more correctly, there were no horses at all, but in the place\nwhere they should have been were harnessed, tandem-fashion, not abreast,\nNibble the guinea-pig and Grignan the tortoise! Nibble next to the\ncarriage, Grignan, of all creatures in the world, as leader.\n\nOn sight of them Hugh began to laugh, so that he forgot to look more\nclosely at the person in the carriage, whose face he had not yet seen,\nas it was turned the other way. But the sound of his laughing was too\ninfectious to be resisted--the small figure began to shake all over, and\nat last could contain itself no longer. With a shout of merriment little\nJeanne, for it was she, sprang out of the carriage and threw her arms\nround Hugh's neck.\n\n\"O Chéri,\" she said, \"I _couldn't_ keep quiet any longer, though I\nwanted to hide my face till you had got into the carriage, and then\nsurprise you. But it was so nice to hear you laugh--I _couldn't_ keep\nstill.\"\n\nHugh felt too utterly astonished to reply. He just stared at Jeanne as\nif he could not believe his own eyes. And Jeanne did not look surprised\nat all! That, to Hugh, was the most surprising part of the whole.\n\n\"Jeanne!\" he exclaimed, \"you here! Why, Dudu told me you were ever so\nfar away.\"\n\n\"And so I am,\" replied Jeanne, laughing again, \"and so are you, Chéri.\nYou have no idea how far away you are--miles, and miles, and miles, only\nin this country they don't have milestones. It's all quite different.\"\n\n\"How do you mean?\" asked Hugh. \"How do you know all about it? You have\nnever been here before, have you? I couldn't quite understand Dudu--_he_\nmeant, I think, that it was only your thinking part or your fancying\npart, that was away.\"\n\nJeanne laughed again, Hugh felt a little impatient.\n\n\"_Jeanne_,\" he said, \"do leave off laughing and speak to me. What is\nthis place? and how did you come here? and have you ever been here\nbefore?\"\n\n\"Yes,\" said Jeanne, \"I think so; but I don't know how I came. And I\ndon't want to do anything but laugh and have fun. Never mind how we\ncame. It's a beautiful country, any way, and did you _ever_ see anything\nso sweet as the little carriage they've sent for us, and wasn't it nice\nto see Houpet and all the others?\"\n\n\"Yes,\" said Hugh, \"very. But whom do you mean by 'they,' Jeanne?\"\n\n\"Oh dear, dear!\" exclaimed Jeanne, \"what a terrible boy you are. Do\nleave off asking questions, and let us have fun. Look, there are Grignan\nand the little cochon quite eager to be off. Now, do jump in--we shall\nhave such fun.\"\n\nHugh got in, willingly enough, though still he would have preferred to\nhave some explanation from Jeanne of all the strange things that were\nhappening.\n\n\"_Isn't_ it nice?\" said Jeanne, when they had both nestled down among\nthe delicious soft cushions of the carriage.\n\n\"Yes,\" said Hugh, \"it's very nice _now_, but it wasn't very nice when I\nwas all alone in the dark in that long passage. As you seem to know all\nabout everything, Jeanne, I suppose you know about that.\"\n\nHe spoke rather, just a very little, grumpily, but Jeanne, rather to his\nsurprise, did not laugh at him this time. Instead, she looked up in his\nface earnestly, with a strange deep look in her eyes.\n\n\"I think very often we have to find our way in the dark,\" she said\ndreamily. \"I think I remember about that. But,\" she went on, with a\ncomplete change of voice, her eyes dancing merrily as if they had never\nlooked grave in their life, \"it's not dark now, Chéri, and it's going to\nbe ever so bright. Just look at the lovely moon through the trees. Do\nlet us go now. Gee-up, gee-up, crack your whip, Houpet, and make them\ngallop as fast as you can.\"\n\nOff they set--they went nice and fast certainly, but not so fast but\nthat the children could admire the beautiful feathery foliage as they\npassed. They drove through the forest--for the trees that Hugh had so\nadmired were those of a forest--on and on, swiftly but yet smoothly;\nnever in his life had Hugh felt any motion so delightful.\n\n\"_What_ a good coachman Houpet is!\" exclaimed Hugh. \"I never should have\nthought he could drive so well. How does he know the road, Jeanne?\"\n\n\"There isn't any road, so he doesn't need to know it,\" said Jeanne.\n\"Look before you, Chéri. You see there is no road. It makes itself as we\ngo, so we can't go wrong.\"\n\nHugh looked straight before him. It was as Jeanne had said. The trees\ngrew thick and close in front, only dividing--melting away like a\nmist--as the quaint little carriage approached them.\n\nHugh looked at them with fresh surprise.\n\n\"Are they not real trees?\" he said.\n\n\"Of course they are,\" said Jeanne. \"Now they're beginning to change;\nthat shows we are getting to the middle of the forest. Look, look,\nChéri!\"\n\nHugh \"looked\" with all his eyes. What Jeanne called \"changing\" was a\nvery wonderful process. The trees, which hitherto had been of a very\nbright, delicate green, began gradually to pale in colour, becoming\nfirst greenish-yellow, then canary colour, then down to the purest\nwhite. And from white they grew into silver, sparkling like innumerable\ndiamonds, and then slowly altered into a sort of silver-grey, gradually\nrising into grey-blue, then into a more purple-blue, till they reached\nthe richest corn-flower shade. Then began another series of lessening\nshades, which again, passing through a boundary line of gold, rose by\nindescribable degrees to deep yet brilliant crimson. It would be\nimpossible to name all the variations through which they passed. I use\nthe names of the colours and shades which are familiar to you,\nchildren, but the very naming any shade gives an unfair idea of the\nmarvellous delicacy with which one tint melted into another,--as well\ntry to divide and mark off the hues of a dove's breast, or of the sky at\nsunset. And all the time the trees themselves were of the same form and\nfoliage as at first, the leaves--or fronds I feel inclined to call them,\nfor they were more like very, very delicate ferns or ferny grass than\nleaves--with which each branch was luxuriantly clothed, seeming to bathe\nthemselves in each new colour as the petals of a flower welcome a flood\nof brilliant sunshine.\n\n\"Oh, how pretty!\" said Hugh, with a deep sigh of pleasure. \"It is like\nthe lamps, only much prettier. I think, Jeanne, this must be the country\nof pretty colours.\"\n\n\"This forest is called the Forest of the Rainbows. I know _that_,\" said\nJeanne. \"But I don't think they call this the country of pretty colours,\nChéri. You see it is the country of so many pretty things. If we lived\nin it always, we should never see the end of the beautiful things there\nare. Only----\"\n\n\"Only what?\" asked Hugh.\n\n\"I don't think it would be a good plan to live in it _always_. Just\nsometimes is best, I think. Either the things wouldn't be so pretty, or\nour eyes wouldn't see them so well after a while. But see, Chéri, the\ntrees are growing common-coloured again, and Houpet is stopping. We must\nhave got to the end of the Forest of the Rainbows.\"\n\n\"And where shall we be going to now?\" asked Hugh. \"Must we get out, do\nyou think, Jeanne? Oh, listen, I hear the sound of water! Do you hear\nit, Jeanne? There must be a river near here. I wish the moonlight was a\nlittle brighter. Now that the trees don't shine, it seems quite dull.\nBut oh, how plainly I hear the water. Listen, Jeanne, don't you hear it\ntoo?\"\n\n\"Yes,\" said Jeanne. \"It must be----\" but before she had time to say more\nthey suddenly came out of the enchanted forest; in an instant every\ntrace of the feathery trees had disappeared. Houpet pulled up his\nsteeds, the two chickens got down from behind, and stood one on each\nside of the carriage door, waiting apparently for their master and\nmistress to descend. And plainer and nearer than before came the sound\nof fast-rushing water.\n\n\"You see we are to get down,\" said Hugh.\n\n\"Yes,\" said Jeanne again, looking round her a little timidly. \"Chéri, do\nyou know, I feel just a very, very little bit frightened. It is such a\nqueer place, and I don't know what we should do. Don't you think we'd\nbetter ask Houpet to take us back again?\"\n\n\"Oh no,\" said Hugh. \"I'm sure we'll be all right. You said you wanted to\nhave some fun, Jeanne, and you seemed to know all about it. You needn't\nbe frightened with _me_, Jeanne.\"\n\n\"No, of course not,\" said Jeanne, quite brightly again; \"but let us\nstand up a minute, Hugh, before we get out of the carriage, and look all\nabout us. _Isn't_ it a queer place?\"\n\n\"It\" was a wide, far-stretching plain, over which the moonlight shone\nsoftly. Far or near not a shrub or tree was to be seen, yet it was not\nlike a desert, for the ground was entirely covered with most beautiful\nmoss, so fresh and green, even by the moonlight, that it was difficult\nto believe the hot sunshine had ever glared upon it. And here and there,\nall over this great plain--all over it, at least, as far as the children\ncould see--rose suddenly from the ground innumerable jets of water, not\nso much like fountains as like little waterfalls turned the wrong way;\nthey rushed upwards with such surprising force and noise, and fell to\nthe earth again in numberless tiny threads much more gently and softly\nthan they left it.\n\n\"It seems as if somebody must be shooting them up with a gun, doesn't\nit?\" said Hugh. \"I never saw such queer fountains.\"\n\n\"Let's go and look at them close,\" said Jeanne, preparing to get down.\nBut before she could do so, Houpet gave a shrill, rather peremptory\ncrow, and Jeanne stopped short in surprise.\n\n\"What do you want, Houpet?\" she said.\n\nBy way of reply, Houpet hopped down from his box, and in some\nwonderfully clever way of his own, before the children could see what he\nwas about, had unharnessed Nibble and Grignan. Then the three arranged\nthemselves in a little procession, and drew up a few steps from the side\nof the carriage where still stood the chicken-footmen. Though they could\nnot speak, there was no mistaking their meaning.\n\n\"They're going to show us the way,\" said Hugh; and as he spoke he jumped\nout of the carriage, and Jeanne after him.\n\n[ONWARDS QUIETLY STEPPED THE LITTLE PROCESSION.]\n\n\n\n\nCHAPTER V. FROG-LAND.\n\n          \"They have a pretty island,\n             Whereon at night they rest;\n           They have a sparkling lakelet,\n             And float upon its breast.\"\n                          THE TWO SWANS.\n\n\nOnwards quietly stepped the little procession, Houpet first, his tuft\nwaving as usual, with a comfortable air of importance and satisfaction;\nthen Nibble and Grignan abreast--hand-in-hand, I was going to have said;\nnext Hugh and Jeanne; with the two attendant chickens behind bringing up\nthe rear.\n\n\"I wonder where they are going to take us to,\" said Hugh in a low voice.\nSomehow the soft light; the strange loneliness of the great plain,\nwhere, now that they were accustomed to it, the rushing of the\nnumberless water-springs seemed to be but one single, steady sound; the\nsolemn behaviour of their curious guides, altogether, had subdued the\nchildren's spirits. Jeanne said no more about \"having fun,\" yet she did\nnot seem the least frightened or depressed; she was only quiet and\nserious.\n\n\"Where _do_ you think they are going to take us to?\" repeated Hugh.\n\n\"I don't know--at least I'm not sure,\" said Jeanne; \"but, Chéri, isn't\nit a good thing that Houpet and the others are with us to show us the\nway, for though the ground looks so pretty it is quite boggy here and\nthere. I notice that Houpet never goes quite close to the fountains, and\njust when I went the least bit near one a minute ago my feet began to\nslip down.\"\n\n\"I haven't felt it like that at all,\" said Hugh. \"Perhaps it's because\nof my wall-climbers. Dudu gave me a pair of wall-climbers like the\nflies', you know, Jeanne.\"\n\n\"Did he?\" said Jeanne, not at all surprised, and as if wall-climbers\nwere no more uncommon than goloshes. \"He didn't give me any, but then I\ncame a different way from you. I think every one comes a different way\nto this country, do you know, Chéri?\"\n\n\"And very likely Dudu thought I could carry you if there was anywhere\nyou couldn't climb,\" said Hugh, importantly. \"I'm sure I----\" he stopped\nabruptly, for a sudden crow from Houpet had brought all the party to a\nstandstill. At first the children could not make out why their guide had\nstopped here--there was nothing to be seen. But pressing forward a few\nsteps to where Houpet stood, Hugh saw, imbedded in the moss at his feet,\na stone with a ring in it, just like those which one reads of in the\n_Arabian Nights_. Houpet stood at the edge of the stone eyeing it\ngravely, and somehow he managed to make Hugh understand that he was to\nlift it. Nothing loth, but rather doubtful as to whether he would be\nstrong enough, the boy leant forward to reach the ring, first\nwhispering, however, to Jeanne,\n\n\"It's getting like a quite real fairy tale, isn't it, Jeanne?\"\n\nJeanne nodded, but looked rather anxious.\n\n\"I'm _afraid_ you can't lift it, Chéri,\" she said. \"I think I'd better\nstand behind and pull _you_--the ring isn't big enough for us both to\nput our hands in it.\"\n\nHugh made no objection to her proposal, so Jeanne put her arms round his\nwaist, and when he gave a great pug to the ring she gave a great pug to\nhim. The first time it was no use, the stone did not move in the least.\n\n\"Try again,\" said Hugh, and try again they did. But no--the second try\nsucceeded no better than the first--and the children looked at each\nother in perplexity. Suddenly there was a movement among the animals,\nwho had all been standing round watching the children's attempts; Jeanne\nfelt a sort of little pecking tug at her skirts--how it came about I\ncannot say, but I think I forgot to tell you that, unlike Hugh in his\nred flannel dressing gown, _she_ was arrayed for their adventures in her\nbest Sunday pelisse, trimmed with fur--and, looking round, lo and\nbehold! there was Houpet holding on to her with his beak, then came\nNibble, his two front paws embracing Houpet's feathered body, Grignan\nbehind him again, clutching with his mouth at Nibble's fur, and the two\nchickens at the end holding on to Grignan and each other in some\nindescribable and marvellous way. It was, for all the world, as if they\nwere preparing for the finish-up part of the game of \"oranges and\nlemons,\" or for that of \"fox and geese!\"\n\nThe sight was so comical that it was all the children could do to keep\ntheir gravity, they succeeded in doing so, however, fearing that it\nmight hurt the animals' feelings to seem to make fun of their well-meant\nefforts.\n\n\"Not that _they_ can be any use,\" whispered Hugh, \"but it's very\ngood-natured of them all the same.\"\n\n\"I am not so sure that they can't be of any use,\" returned Jeanne.\n\"Think of how well Houpet drove.\"\n\n\"Here goes, then,\" said Hugh. \"One, two, _three_;\" and with \"three\" he\ngave a tremendous tug--a much more tremendous tug than was required,\nfor, to his surprise, the stone yielded at once without the slightest\nresistance, and back they all fell, one on the top of the other, Hugh,\nJeanne, Houpet, Nibble, Grignan, and the two chickens! But none of them\nwere any the worse, and with the greatest eagerness to see what was to\nbe seen where the stone had been, up jumped Hugh and Jeanne and ran\nforward to the spot.\n\n\"There should be,\" said Jeanne, half out of breath--\"there _should_ be a\nlittle staircase for us to go down, if it is like the stories in the\n_Arabian Nights_.\"\n\nAnd, wonderful to relate, so there was! The children could hardly\nbelieve their eyes, when below them they saw the most tempting little\nspiral staircase of white stone or marble steps, with a neat little\nbrass balustrade at one side. It looked quite light all the way down,\nthough of course they could distinguish nothing at the bottom, as the\ncorkscrew twists of the staircase entirely filled up the space.\n\nHoupet hopped forward and stood at the top of the steps crowing softly.\n\n\"He means that we're to go down,\" said Hugh. \"Shall we?\"\n\n\"Of course,\" said Jeanne. \"I'm not a bit afraid. We won't have any fun\nif we don't go on.\"\n\n\"Well then,\" said Hugh, \"I'll go first as I'm a boy, just _in case_, you\nknow, Jeanne, of our meeting anything disagreeable.\"\n\nSo down he went, Jeanne following close after.\n\n\"I suppose Houpet and the others will come after us,\" said Jeanne,\nrather anxiously. But just as she uttered the words a rather shrill crow\nmade both Hugh and her stop short and look up to the top. They saw\nHoupet and the others standing round the edge of the hole. Houpet gave\nanother crow, in which the two chickens joined him, and then suddenly\nthe stone was shut down--the two children found themselves alone in this\nstrange place, leading to they knew not where! Jeanne gave a little\ncry--Hugh, too, for a moment was rather startled, but he soon recovered\nhimself.\n\n\"Jeanne,\" he said, \"it must be all right. I don't think we need be\nfrightened. See, it is quite light! The light comes up from below--down\nthere it must be quite bright and cheerful. Give me your hand--if we go\ndown sideways--so--we can hold each other's hands all the way.\"\n\nSo, in a rather queer fashion, they clambered down the long staircase.\nBy the time they got to its end they were really quite tired of turning\nround and round so many times. But now the view before them was so\npleasant that they forgot all their troubles.\n\nThey had found a little door at the foot of the stair, which opened\neasily. They passed through it, and there lay before them a beautiful\nexpanse of water surrounded by hills; the door which had closed behind\nthem seemed on this side to have been cut out of the turf of the hill,\nand was all but invisible. It was light, as Hugh had said, but not with\nthe light of either sun or moon; a soft radiance was over everything,\nbut whence it came they could not tell. The hills on each side of the\nwater, which was more like a calmly flowing river than a lake, prevented\ntheir seeing very far, but close to the shore by which they stood a\nlittle boat was moored--a little boat with seats for two, and one light\npair of oars.\n\n\"Oh, how lovely!\" said Jeanne. \"It is even nicer than the carriage. Get\nin, Hugh, and let us row down the river. The boat must be on purpose for\nus.\"\n\nThey were soon settled in it, and Hugh, though he had only rowed once or\ntwice before in his life, found it very easy and pleasant, and they went\nover the water swiftly and smoothly. After a while the hills approached\nmore nearly, gradually the broad river dwindled to a mere stream, so\nnarrow and small at last, that even their tiny boat could go no farther.\nHugh was forced to leave off rowing.\n\n\"I suppose we are meant to go on shore here,\" he said. \"The boat won't\ngo any farther, any way.\"\n\nJeanne was peering forward: just before them the brook, or what still\nremained of it, almost disappeared in a narrow little gorge between the\nhills.\n\n\"Chéri,\" said she, \"I shouldn't wonder if the stream gets wider again on\nthe other side of this little narrow place. Don't you think we'd better\ntry to pull the boat through, and then we might get into it again?\"\n\n\"Perhaps,\" said Hugh. \"We may try.\" So out the children got--Jeanne\npulled in front, Hugh pushed behind. It was so very light that there was\nno difficulty as to its weight; only the gorge was so narrow that at\nlast the boat stuck fast.\n\n\"We'd better leave it and clamber through ourselves,\" said Hugh.\n\n\"But, O Chéri, we can't!\" cried Jeanne. \"From where I am I can see that\nthe water gets wider again a little farther on. And the rocks come quite\nsharp down to the side. There is nowhere we could clamber on to, and I\ndare say the water is very deep. There are lots of little streams\ntrickling into it from the rocks, and the boat could go quite well if we\ncould but get it a little farther.\"\n\n\"But we can't,\" said Hugh; \"it just won't go.\"\n\n\"Oh dear,\" said Jeanne, \"we'll have to go back. But how should we find\nthe door in the hillside to go up the stair; or if we did get up, how\nshould we push away the stone? And even then, there would be the forest\nto go through, and perhaps we couldn't find our way among the trees as\nHoupet did. O Chéri, what shall we do?\"\n\nHugh stood still and considered.\n\n\"I think,\" he said at last, \"I think the time's come for whistling.\"\n\nAnd before Jeanne could ask him what he meant, he gave three clear,\nshort whistles, and then waited to see the effect.\n\nIt was a most unexpected one. Hugh had anticipated nothing else than the\nsudden appearance, somehow and somewhere, of Monsieur Dudu himself, as\nlarge as life--possibly, in this queer country of surprises, where they\nfound themselves, a little larger! When and how he would appear Hugh was\nperfectly at a loss to imagine--he might fly down from the sky; he\nmight spring up from the water; he might just suddenly stand before them\nwithout their having any idea how he had come. Hugh laughed to himself\nat the thought of Jeanne's astonishment, and after all it was Jeanne who\nfirst drew his attention to what was really happening.\n\n\"Hark, Chéri, hark!\" she cried, \"what a queer noise! What can it be?\"\n\nHugh's attention had been so taken up in staring about in every\ndirection for the raven that he had not noticed the sound which Jeanne\nhad heard, and which now increased every moment.\n\nIt was a soft, swishy sound--as if innumerable little boats were making\ntheir way through water, or as if innumerable little fairies were\nbathing themselves, only every instant it came nearer and nearer, till\nat last, on every side of the boat in which the children were still\nstanding, came creeping up from below lots and lots and _lots_ of small,\nbright green frogs, who clambered over the sides and arranged themselves\nin lines along the edges in the most methodical and orderly manner.\nJeanne gave a scream of horror, and darted across the boat to where Hugh\nwas standing.\n\n\"O Chéri,\" she cried, \"why did you whistle? It's all that naughty Dudu.\nHe's going to turn us into frogs too, I do believe, because he thinks I\nlaughed at him. Oh dear, oh dear, what shall we do?\"\n\nChéri himself, though not quite so frightened as Jeanne, was not much\npleased with the result of his summons to the raven.\n\n\"It does look like a shabby trick,\" he said; \"but still I do not think\nthe creatures mean to do us any harm. And I don't feel myself being\nturned into a frog yet; do you, Jeanne?\"\n\n\"I don't know,\" said Jeanne, a very little comforted; \"I don't know what\nit would feel like to be turned into a frog; I've always been a little\ngirl, and so I can't tell. I feel rather creepy and chilly, but perhaps\nit's only with seeing the frogs. What funny red eyes they've got. What\ncan they be going to do?\"\n\nShe forgot her fears in the interest of watching them; Hugh, too, stared\nwith all his eyes at the frogs, who, arranged in regular lines round the\nedge of the boat, began working away industriously at something which,\nfor a minute or two, the children could not make out. At last Jeanne\ncalled out eagerly,\n\n\"They are throwing over little lines, Chéri--lots and lots of little\nlines. There must be frogs down below waiting to catch them.\"\n\nSo it was; each frog threw over several threads which he seemed to\nunwind from his body; these threads were caught by something invisible\ndown below, and twisted round and round several times, till at last they\nbecame as firm and strong as a fine twine. And when, apparently, the\nfrogs considered that they had made cables enough, they settled\nthemselves down, each firmly on his two hind legs, still holding by the\nrope with their front ones, and then--in another moment--to the\nchildren's great delight, they felt the boat beginning to move. It moved\non smoothly--almost as smoothly as when on the water--there were no jogs\nor tugs, as might have been the case if it had been pulled by two or\nthree coarse, strong ropes, for all the hundreds of tiny cables pulling\ntogether made one even force.\n\n\"Why, how clever they are!\" cried Jeanne. \"We go as smoothly as if we\nwere on wheels. Nice little frogs. I am sure we are very much obliged to\nthem--aren't we, Chéri?\"\n\n\"And to Dudu,\" observed Hugh.\n\nJeanne shrugged her shoulders. She was not over and above sure of Dudu\neven now.\n\nThe boat moved along for some time; the pass between the hills was dark\nand gloomy, and though the water got wider, as Jeanne had seen, it would\nnot for some distance have been possible for the children to row. After\na time it suddenly grew much lighter; they came out from the narrow pass\nand found themselves but a few yards from a sheet of still water with\ntrees all round it--a sort of mountain lake it seemed, silent and\nsolitary, and reflecting back from its calm bosom the soft, silvery,\neven radiance which since they came out from the door on the hillside\nhad been the children's only light.\n\nAnd in the middle of this lake lay a little island--a perfect nest of\ntrees, whose long drooping branches hung down into the water.\n\n\"Oh, do let us row on to the island,\" said Jeanne eagerly, for by this\ntime the frogs had drawn them to the edge of the lake; there could no\nlonger be any difficulty in rowing for themselves.\n\n\"First, any way, we must thank the frogs,\" said Hugh, standing up. He\nwould have taken off his cap if he had had one on; as it was, he could\nonly bow politely.\n\nAs he did so, each frog turned round so as to face him, and each gave a\nlittle bob of the head, which, though not very graceful, was evidently\nmeant as an acknowledgment of Hugh's courtesy.\n\n\"They are very polite frogs,\" whispered Hugh. \"Jeanne, do stand up and\nbow to them too.\"\n\nJeanne, who all this time had been sitting with her feet tucked up under\nher, showed no inclination to move.\n\n\"I don't like to stand up,\" she said, \"for fear the frogs should run up\nmy legs. But I can thank them just as well sitting down. Frogs,\" she\nadded, \"frogs, I am very much obliged to you, and I hope you will excuse\nmy not standing up.\"\n\nThe frogs bowed again, which was very considerate of them; then suddenly\nthere seemed a movement among them, those at the end of the boat drew\nback a little, and a frog, whom the children had not hitherto specially\nobserved, came forward and stood in front of the others. He was bigger,\nhis colour was a brighter green, and his eyes more brilliantly red. He\nstood up on his hind legs and bowed politely. Then, after clearing his\nthroat, of which there was much need, for even with this precaution it\nsounded very croaky, he addressed the children.\n\n\"Monsieur and Mademoiselle,\" he began, \"are very welcome to what we have\ndone for them--the small service we have rendered. Monsieur and\nMademoiselle, I and my companions\"--\"He should say, 'My companions and\nI,'\" whispered Jeanne--\"are well brought up frogs. We know our place in\nsociety. We disapprove of newfangled notions. We are frogs--we desire to\nbe nothing else, and we are deeply sensible of the honour Monsieur and\nMademoiselle have done us by this visit.\"\n\n\"He really speaks very nicely,\" said Jeanne in a whisper.\n\n\"Before Monsieur and Mademoiselle bid us farewell--before they leave our\nshores,\" continued the frog with a wave of his \"top legs,\" as Jeanne\nafterwards called them, \"we should desire to give them what, without\npresumption, I may call a treat. Monsieur and Mademoiselle are,\ndoubtless, aware that in our humble way we are artists. Our\nweakness--our strength I should rather say--is music. Our croaking\nconcerts are renowned far and wide, and by a most fortunate coincidence\none is about to take place, to celebrate the farewell--the departure to\nother regions--of a songster whose family fame for many ages has been\nrenowned. Monsieur and Mademoiselle, to-night is to be heard for the\nfirst time in this century the 'Song of the Swan.'\"\n\n\"The song of the swan,\" repeated Hugh, rather puzzled; \"I didn't know\nswans ever sang. I thought it was just an old saying that they sing once\nonly--when they are dying.\"\n\nThe frog bowed.\n\n\"Just so,\" he said; \"it is the truth. And, therefore, the extreme\ndifficulty of assisting at so unique a performance. It is but\nseldom--not above half-a-dozen times in the recollection of the oldest\nof my venerated cousins, the toads, that such an opportunity has\noccurred--and as to whether human ears have _ever_ before been regaled\nwith what you are about to enjoy, you must allow me, Monsieur and\nMademoiselle, with all deference to your race, for whom naturally we\ncherish the highest respect, to express a doubt.\"\n\n\"It's a little difficult to understand quite what he means, isn't it,\nChéri?\" whispered Jeanne. \"But, of course, we mustn't say so. It might\nhurt his feelings.\"\n\n\"Yes,\" agreed Hugh, \"it might. But we must say something polite.\"\n\n\"You say it,\" said Jeanne. \"I really daren't stand up, and it's not so\neasy to make a speech sitting down.\"\n\n\"Monsieur Frog, we are very much obliged to you,\" began Hugh. \"Please\ntell all the other frogs so too. We would like very much to hear the\nconcert. When does it begin, and where will it be?\"\n\n\"All round the lake the performers will be stationed,\" replied the frog\npompously. \"The chief artist occupies the island which you see from\nhere. If you move forward a little--to about half-way between the shore\nand the island--you will, I think, be excellently placed. But first,\"\nseeing that Hugh was preparing to take up the oars, \"first, you will\nallow us, Monsieur and Mademoiselle, to offer you a little\ncollation--some slight refreshment after all the fatigues of your\njourney to our shores.\"\n\n\"Oh dear! oh dear!\" whispered Jeanne in a terrible fright; \"please say\n'No, thank you,' Chéri. I _know_ they'll be bringing us that horrid\ngreen stuff for soup.\"\n\n\"Thank you very much,\" said Hugh; \"you are very kind indeed, Monsieur\nFrog, only, really, we're not hungry.\"\n\n\"A little refreshment--a mere nothing,\" said the frog, waving his hands\nin an elegantly persuasive manner. \"Tadpoles\"--in a brisk, authoritative\ntone--\"tadpoles, refreshments for our guests.\"\n\nJeanne shivered, but nevertheless could not help watching with\ncuriosity. Scores of little tadpoles came hopping up the sides of the\nboat, each dozen or so of them carrying among them large water-lily\nleaves, on each of which curious and dainty-looking little cakes and\nbonbons were arranged. The first that was presented to Jeanne contained\nneat little biscuits about the size of a half-crown piece, of a tempting\nrich brown colour.\n\n\"Flag-flour cakes,\" said the frog. \"We roast and grind the flour in our\nown mills. You will find them good.\"\n\nJeanne took one and found it very good. She would have taken another,\nbut already a second tray-ful or leaf-ful was before her, with\npinky-looking balls.\n\n\"Those are made from the sugar of water-brambles,\" remarked the frog,\nwith a self-satisfied smile. \"No doubt you are surprised at the delicacy\nand refinement of our tastes. Many human beings are under the deplorable\nmistake of supposing we live on slimy water and dirty insects--ha, ha,\nha! whereas our cuisine is astounding in variety and delicacy of\nmaterial and flavour. If it were not too late in the season, I wish you\ncould have tasted our mushroom pâtés and minnows' eggs vols-au-vent.\"\n\n\"Thank you,\" said Hugh, \"what we have had is very nice indeed.\"\n\n\"I _couldn't_ eat minnows' eggs,\" whispered Jeanne, looking rather\ndoubtfully at the succession of leaf trays that continued to appear. She\nnibbled away at some of the least extraordinary-looking cakes, which the\nfrog informed her were made from the pith of rushes roasted and ground\ndown, and then flavoured with essence of marsh marigold, and found them\nnearly as nice as macaroons. Then, having eaten quite as much as they\nwanted, the tadpoles handed to each a leaf of the purest water, which\nthey drank with great satisfaction.\n\n\"Now,\" said Hugh, \"we're quite ready for the concert. Shall I row out to\nthe middle of the lake, Monsieur Frog?\"\n\n\"Midway between the shore and the island,\" said the frog; \"that will be\nthe best position;\" and, as by this time all the frogs that had been\nsitting round the edge of the boat had disappeared, Hugh took the oars\nand paddled away.\n\n\n\n\nCHAPTER VI. THE SONG OF THE SWAN.\n\n                  \"----If I were on that shore,\n          I should live there and not die, but sing evermore.\"\n                                             JEAN INGELOW.\n\n\n\"About here will do, I should think--eh, Monsieur Frog?\" said Hugh,\nresting on his oars half-way to the island. But there was no answer. The\nfrog had disappeared.\n\n\"What a queer way all these creatures behave, don't they, Jeanne?\" he\nsaid. \"First Dudu, then Houpet and the others. They go off all of a\nsudden in the oddest way.\"\n\n\"I suppose they have to go when we don't need them any more,\" said\nJeanne. \"I daresay they are obliged to.\"\n\n\"Who obliges them?\" said Hugh.\n\n\"Oh, I don't know! The fairies, I suppose,\" said Jeanne.\n\n\"Was it the fairies you meant when you kept saying 'they'?\" asked Hugh.\n\n\"I don't know--perhaps--it's no use asking me,\" said Jeanne. \"Fairies,\nor dream-spirits, or something like that. Never mind who they are if\nthey give us nice things. I am sure the frogs have been _very_ kind,\nhaven't they?\"\n\n\"Yes; you won't be so afraid of them now, will you, Jeanne?\"\n\n\"Oh, I don't know. I daresay I shall be, for they're quite different\nfrom _our_ frogs. Ours aren't so bright green, and their eyes aren't\nred, and they can't _talk_. Oh no, our frogs are quite different from\n_theirs_, Chéri,\" she added with profound conviction.\n\n\"Just like our trees and everything else, I suppose,\" said Hugh.\n\"Certainly this is a funny country. But hush, Jeanne! I believe the\nconcert's going to begin.\"\n\nThey sat perfectly still to listen, but for a minute or two the sound\nwhich had caught Hugh's attention was not repeated. Everything about\nthem was silent, except that now and then a soft faint breeze seemed to\nflutter across the water, slightly rippling its surface as it passed.\nThe strange, even light which had shone over all the scene ever since\nthe children had stepped out at the hillside door had now grown paler:\nit was not now bright enough to distinguish more than can be seen by an\nautumn twilight. The air was fresh and clear, though not the least cold;\nthe drooping forms of the low-hanging branches of the island trees gave\nthe children a melancholy feeling when they glanced in that direction.\n\n\"I don't like this very much,\" said Jeanne. \"It makes me sad, and I\nwanted to have fun.\"\n\n\"It must be sad for the poor swan if it's going to die,\" said Hugh. \"But\nI don't mind this sort of sad feeling. I think it's rather nice. Ah!\nJeanne, listen, there it is again. They must be going to begin.\"\n\n\"It\" was a low sort of \"call\" which seemed to run round the shores of\nthe lake like a preliminary note, and then completely died away.\nInstantly began from all sides the most curious music that Hugh and\nJeanne had ever heard. It was croaking, but croaking in unison and\nregular time, and harsh as it was, there was a very strange charm about\nit--quite impossible to describe. It sounded pathetic at times, and at\ntimes monotonous, and yet inspiriting, like the beating of a drum; and\nthe children listened to it with actual enjoyment. It went on for a good\nwhile, and then stopped as suddenly as it had begun; and then again,\nafter some minutes of perfect silence, it recommenced in a low and\nregular chant--if such a word can be used for croaking--a steady,\nregular croak, croak, as if an immense number of harsh-sounding\ninstruments were giving forth one note in such precise tune and measure\nthat the harshness was softened and lost by the union of sound. It grew\nlower and lower, seeming almost to be about to die altogether away,\nwhen, from another direction--from the tree-shaded island in the centre\nof the lake--rose, low and faint at first, gathering strange strength as\nit mounted ever higher and higher, the song of the swan.\n\nThe children listened breathlessly and in perfect silence to the\nwonderful notes which fell on their ears--notes which no words of mine\ncould describe, for in themselves they were words, telling of suffering\nand sorrow, of beautiful things and sad things, of strange fantastic\ndreams, of sunshine and flowers and summer days, of icy winds from the\nsnow-clad hills, and days of dreariness and solitude. Each and all came\nin their turn; but, at the last, all melted, all grew rather, into one\nmagnificent song of bliss and triumph, of joyful tenderness and\nbrilliant hope, too pure and perfect to be imagined but in a dream. And\nas the last clear mellow notes fell on the children's ears, a sound of\nwings seemed to come with them, and gazing ever more intently towards\nthe island they saw rising upwards the pure white snow-like\nbird--upwards and upwards, ever higher, till at last, with the sound of\nits own joyous song, it faded and melted into the opal radiance of the\ncalm sky above.\n\nFor long the children gazed after it--a spot of light seemed to linger\nfor some time in the sky just where it had disappeared--almost, to their\nfancy, as if the white swan was resting there, again to return to earth.\nBut it was not so. Slowly, like the light of a dying star, the\nbrightness faded; there was no longer a trace of the swan's radiant\nflight; again a soft low breeze, like a farewell sigh, fluttered across\nthe lake, and the children withdrew their eyes from the sky and looked\nat each other.\n\n\"Jeanne!\" said Hugh.\n\n\"Chéri!\" said Jeanne.\n\n\"What was it? Was it not an angel, and not a swan?\"\n\nJeanne shook her little head in perplexity.\n\n\"I don't know,\" she said. \"It was wonderful. Did you hear all it told,\nChéri?\"\n\n\"Yes,\" said Hugh. \"But no one could ever tell it again, Jeanne. It is a\nsecret for us.\"\n\n\"And for the frogs,\" added Jeanne.\n\n\"And for the frogs,\" said Hugh.\n\n\"But,\" said Jeanne, \"I thought the swan was going to die. _That_ was not\ndying.\"\n\n\"Yes,\" said the queer croaking voice of the frog, suddenly reappearing\non the edge of the boat; \"yes, my children,\" he repeated, with a strange\nsolemnity, \"for such as the swan that _is_ dying. And now once more--for\nyou will never see me again, nor revisit this country--once again, my\nchildren, I bid you farewell.\"\n\nHe waved his hands in adieu, and hopped away.\n\n\"Chéri,\" said Jeanne, after a short silence, \"I feel rather sad, and a\nvery little sleepy. Do you think I might lie down a little--it is not\nthe least cold--and take a tiny sleep? You might go to sleep too, if you\nlike. I should think there will be time before we row back to the shore,\nonly I do not know how we shall get the boat through the narrow part if\nthe frogs have all gone. And no doubt Houpet and the others will be\nwondering why we are so long.\"\n\n\"We can whistle for Dudu again if we need,\" said Hugh. \"He helped us\nvery well the last time. I too am rather sleepy, Jeanne, but still I\nthink I had better not go _quite_ asleep. You lie down, and I'll just\npaddle on very slowly and softly for a little, and when you wake up\nwe'll fix whether we should whistle or not.\"\n\nJeanne seemed to fall asleep in a moment when she lay down. Hugh paddled\non quietly, as he had said, thinking dreamily of the queer things they\nhad seen and heard in this nameless country inside the tapestry door. He\ndid not feel troubled as to how they were to get back again; he had\ngreat faith in Dudu, and felt sure it would all come right. But\ngradually he too began to feel very sleepy; the dip of the oars and the\nsound of little Jeanne's regular breathing seemed to keep time together\nin a curious way. And at last the oars slipped from Hugh's hold; he lay\ndown beside Jeanne, letting the boat drift; he was so _very_ sleepy, he\ncould keep up no more.\n\nBut after a minute or two when, not _quite_ asleep, he lay listening to\nthe soft breathing of the little girl, it seemed to him he heard still\nthe gentle dip of the oars. The more he listened, the more sure he\nbecame that it was so, and at last his curiosity grew so great that it\nhalf overcame his drowsiness. He opened his eyes just enough to look up.\nYes, he was right, the boat was gliding steadily along, the oars were\ndoing their work, and who do you think were the rowers? Dudu on one\nside, Houpet on the other, rowing away as cleverly as if they had never\ndone anything else in their lives, steadying themselves on one claw,\nrowing with the other. Hugh did not feel the least surprised; he smiled\nsleepily, and turned over quite satisfied.\n\n\"They'll take us safe back,\" he said to himself: and that was all he\nthought about it.\n\n\"Good-night, Chéri, good-night,\" was the next thing he heard, or\nremembered hearing.\n\nHugh half sat up and rubbed his eyes.\n\nWhere was he?\n\nNot in the boat, there was no sound of oars, the light that met his gaze\nwas not that of the strange country where Jeanne and he had had all\nthese adventures, it was just clear ordinary moonlight; and as for where\nhe was, he was lying on the floor of the tapestry room close to the part\nof the wall where stood, or hung, the castle with the long flight of\nsteps, which Jeanne and he had so wished to enter. And from the other\nside of the tapestry--from inside the castle, one might almost say--came\nthe voice he had heard in his sleep, the voice which seemed to have\nawakened him.\n\n\"Good-night, Chéri,\" it said, \"good-night. I have gone home the other\nway.\"\n\n\"Jeanne, Jeanne, where are you? Wait!\" cried Hugh, starting to his feet.\nBut there was no reply.\n\nHugh looked all round. The room seemed just the same as usual, and if he\nhad looked out of the window, though this he did not know, he would have\nseen the old raven on the terrace marching about, and, in his usual\nphilosophical way, failing the sunshine, enjoying the moonlight; while\ndown in the chickens' house, in the corner of the yard, Houpet and his\nfriends were calmly roosting; fat little Nibble soundly sleeping in his\ncage, cuddled up in the hay; poor, placid Grignan reposing in his usual\ncorner under the laurel bush. All these things Hugh would have seen, and\nwould no doubt have wondered much at them. But though neither tired nor\ncold, he was still sleepy, very sleepy, so, after another stare all\nround, he decided that he would defer further inquiry till the morning,\nand in the meantime follow the advice of Jeanne's farewell \"good-night.\"\n\nAnd \"after all,\" he said to himself, as he climbed up into his\ncomfortable bed, \"after all, bed is very nice, even though that little\ncarriage was awfully jolly, and the boat almost better. What fun it will\nbe to talk about it all to-morrow morning with Jeanne.\"\n\nIt was rather queer when to-morrow morning came--when he woke to find it\nhad come, at least; it was rather queer to see everything looking just\nthe same as on other to-morrow mornings. Hugh had not time to think very\nmuch about it, for it had been Marcelline's knock at the door that had\nwakened him, and she told him it was rather later than usual. Hugh,\nhowever, was so eager to see Jeanne and talk over with her their\nwonderful adventures that he needed no hurrying. But, to his surprise,\nwhen he got to Jeanne's room, where as usual their \"little breakfast\"\nwas prepared for them on the table by the fire, Jeanne was seated on her\nlow chair, drinking her coffee in her every-day manner, not the least\ndifferent from what she always was, not in any particular hurry to see\nhim, nor, apparently, with anything particular to say.\n\n\"Well, Chéri,\" she said, merrily, \"you are rather late this morning.\nHave you slept well?\"\n\nHugh looked at her; there was no mischief in her face; she simply meant\nwhat she said. In his astonishment, Hugh rubbed his eyes and then stared\nat her again.\n\n\"Jeanne,\" he said, quite bewildered.\n\n\"Well, Chéri,\" she repeated, \"what is the matter? How funny you look!\"\nand in her turn Jeanne seemed surprised.\n\nHugh looked round; old Marcelline had left the room.\n\n\"Jeanne,\" he said, \"it is so queer to see you just the same as usual,\nwith nothing to say about it all.\"\n\n\"About all what?\" said Jeanne, seemingly more and more puzzled.\n\n\"About our adventures--the drive in the carriage, with Houpet as\ncoachman, and the stair down to the frog's country, and the frogs and\nthe boat, and the concert, and O Jeanne! the song of the swan.\"\n\nJeanne opened wide her eyes.\n\n\"Chéri!\" she said, \"you've been dreaming all these funny things.\"\n\nHugh was so hurt and disappointed that he nearly began to cry.\n\n\"O Jeanne,\" he said, \"it is very unkind to say that,\" and he turned away\nquite chilled and perplexed.\n\nJeanne ran after him and threw her arms round his neck.\n\n\"Chéri, Chéri,\" she said, \"I didn't mean to vex you, but I _don't_\nunderstand.\"\n\nHugh looked into her dark eyes with his earnest blue ones.\n\n\"Jeanne,\" he said, \"don't you remember _any_ of it--don't you remember\nthe trees changing their colours so prettily?--don't you remember the\nfrogs' banquet?\"\n\nJeanne stared at him so earnestly that she quite frowned.\n\n\"I think--I think,\" she said, and then she stopped. \"When you say that\nof the trees, I think I did see rainbow colours all turning into each\nother. I think, Chéri, part of me was there and part not; can there be\ntwo of me, I wonder? But please, Chéri, don't ask me any more. It\npuzzles me so, and then perhaps I may say something to vex you. Let us\nplay at our day games now, Chéri, and never mind about the other things.\nBut if you go anywhere else like that, ask the fairies to take me too,\nfor I always like to be with you, you know, Chéri.\"\n\nSo they kissed and made friends. But still it seemed very queer to Hugh.\nTill now Jeanne had always been eager to talk about the tapestry castle,\nand full of fancies about Dudu and Houpet and the rest of the animals,\nand anxious to hear Hugh's dreams. Now she seemed perfectly content with\nher every-day world, delighted with a new and beautiful china\ndinner-service which her godmother had sent her, and absorbed in cooking\nall manner of wonderful dishes for a grand dolls' feast, for which she\nwas sending invitations to all her dolls, young and old, ugly and\npretty, armless, footless, as were some, in the perfection of Parisian\ntoilettes as were others. For she had, like most only daughters, an\nimmense collection of dolls, though she was not as fond of them as many\nlittle girls.\n\n\"I thought you didn't much care for dolls. It was one of the things I\nliked you for at the first,\" said Hugh, in a slightly aggrieved tone of\nvoice. Lessons were over, and the children were busy at the important\nbusiness of cooking the feast. Hugh didn't mind the cooking; he had even\nsubmitted to a paper cap which Jeanne had constructed for him on the\nmodel of that of the \"chef\" downstairs; he found great consolation in\nthe beating up an egg which Marcelline had got for them as a great\ntreat, and immense satisfaction in watching the stewing, in one of\nJeanne's toy pans on the nursery fire, of a preparation of squashed\nprunes, powdered chocolate, and bread crumbs, which was to represent a\n\"ragout à la\"--I really do not remember what.\n\n\"I thought you didn't care for dolls, Jeanne,\" Hugh repeated. \"It would\nbe ever so much nicer to have all the animals at our feast. We could put\nthem on chairs all round the table. That _would_ be some fun.\"\n\n\"They wouldn't sit still one minute,\" said Jeanne. \"How funny you are to\nthink of such a thing, Chéri! Of course it would be fun if they _would_,\nbut fancy Dudu and Grignan helping themselves with knives and forks like\npeople.\"\n\nJeanne burst out laughing at the idea, and laughed so heartily that Hugh\ncould not help laughing too. But all the same he said to himself,\n\n\"I'm sure Dudu and the others _could_ sit at the table and behave like\nladies and gentlemen if they chose. How _very_ funny of Jeanne to forget\nabout all the clever things they did! But it is no use saying any more\nto her. It would only make us quarrel. There must be two Jeannes, or\nelse 'they,' whoever they are, make her forget on purpose.\"\n\nAnd as Hugh, for all his fancifulness, was a good deal of a philosopher,\nhe made up his mind to amuse himself happily with little Jeanne as she\nwas. The feast was a great success. The dolls behaved irreproachably,\nwith which their owner was rather inclined to twit Hugh, when, just at\nthe end of the banquet, greatly to his satisfaction, a certain\nMademoiselle Zéphyrine, a blonde with flaxen ringlets and turquoise\nblue eyes, suddenly toppled over, something having no doubt upset her\nequilibrium, and fell flat on her nose on the table.\n\n\"Ah!\" cried Jeanne, greatly concerned, \"my poor Zéphyrine has fainted,\"\nand, rushing forward to her assistance, worse results followed. Mesdames\nLili and Joséphine, two middle-aged ladies somewhat the worse for wear,\novercome by the distressing spectacle, _or_ by the sleeve of Jeanne's\ndress as she leant across them, fell off their chairs too--one, like\nZéphyrine, on to the table, the other on to the floor, dragging down\nwith her the plateful of ragout in front of her, while her friend's\nsudden descent upon the table completed the general knockings over and\nspillings which Zéphyrine had begun.\n\n\"Oh dear! oh dear!\" cried Jeanne; \"all the chocolate ragout is spilt,\nand the whipped-up egg is mixed with the orange-juice soup. Oh dear! oh\ndear! and I thought we should have had the whole feast to eat up\nourselves after the dolls had had enough.\"\n\n\"Yes,\" said Hugh, \"that's what comes of having stupid sticks of dolls at\nyour feasts. The _animals_ wouldn't have behaved like that.\"\n\nBut, seeing that poor Jeanne was really in tears at this unfortunate\ntermination of her entertainment, he left off teasing her, and having\nsucceeded in rescuing some remains of the good things, they sat down on\nthe floor together and ate them up very amicably.\n\n\"I don't think I _do_ care much for dolls,\" said Jeanne meditatively,\nwhen she had munched the last crumbs of the snipped-up almonds, which\nwere supposed to represent some very marvellous dish. (\"I like almonds\nterribly--don't you, Chéri?\") she added, as a parenthesis. \"No, I don't\ncare for dolls. You are quite right about them; they _are_ stupid, and\nyou can't make fancies about them, because their faces always have the\nsame silly look. I don't know what I like playing at best. O\nMarcelline!\" she exclaimed, as the old nurse just then came into the\nroom, \"O Marcelline! _do_ tell us a story; we are tired of playing.\"\n\n\"Does Monsieur Chéri, too, wish me tell him a story?\" asked Marcelline,\nlooking curiously at Hugh.\n\n\"Yes, of course,\" said Hugh. \"Why do you look at me that funny way,\nMarcelline?\"\n\n\"Why,\" said Marcelline, smiling, \"I was thinking only that perhaps\nMonsieur finds so many stories in the tapestry that he would no longer\ncare for my stupid little old tales.\"\n\nHugh did not answer. He was wondering to himself what Marcelline really\nmeant; whether she knew of the wonders concealed behind the tapestry, or\nwas only teasing him a little in the kind but queer way she sometimes\ndid.\n\n\"Marcelline,\" he said suddenly at last, \"I don't understand you.\"\n\n\"Do you understand yourself, my little Monsieur?\" said Marcelline. \"Do\nany of us understand ourselves? all the different selves that each of us\nis?\"\n\n\"No,\" said Hugh, \"I daresay we don't. It is very puzzling; it's all very\npuzzling.\"\n\n\"In the country where I lived when I was a little girl,\" began\nMarcelline, but Jeanne interrupted her.\n\n\"Have you never been there since, Marcelline?\" she asked.\n\nMarcelline smiled again her funny smile.\n\n\"Oh dear, yes,\" she said; \"often, very often. I should not have been\nnear so happy as I am if I had not often visited that country.\"\n\n\"Dear me,\" exclaimed Jeanne, \"how very queer! I had no idea of that. You\nhaven't been there for a great many years any way, Marcelline. I heard\nmamma telling a lady the other day that she never remembered your going\naway, not even for a day--never since she was born.\"\n\n\"Ah!\" said Marcelline, \"but, Mademoiselle, we don't always know what\neven those nearest us do. I might have gone to that country without your\nmamma knowing. Sometimes we are far away when those beside us think us\nclose to them.\"\n\n\"Yes,\" said Hugh, looking up suddenly, \"that is true, Marcelline.\"\n\nWhat she said made him remember Dudu's remark about Jeanne the night\nbefore, that she was far, far away, and he began to feel that Marcelline\nunderstood much that she seldom alluded to.\n\nBut Jeanne took it up differently. She jumped on to Marcelline's knee\nand pretended to beat her.\n\n\"You naughty little old woman,\" she said; \"you very naughty little old\nwoman, to say things like that to puzzle me--just what you know I don't\nlike. Go back to your own country, naughty old Marcelline; go back to\nyour fairyland, or wherever it was you came from, if you are going to\ntease poor little Jeanne so.\"\n\n\"_Tease_ you, Mademoiselle?\" Marcelline repeated.\n\n\"Yes, tease me,\" insisted Jeanne. \"You know I hate people to go on\nabout things I don't understand. Now you're to tell us a story at once,\ndo you hear, Marcelline?\"\n\nHugh said nothing, but he looked up in Marcelline's face with his grave\nblue eyes, and the old woman smiled again. She seemed as if she was\ngoing to speak, when just then a servant came upstairs to say that\nJeanne's mother wished the children to go downstairs to her for a\nlittle. Jeanne jumped up, delighted to welcome any change.\n\n\"You must keep the story for another day, Marcelline,\" she said, as she\nran out of the room.\n\n\"I am getting too old to tell stories,\" said Marcelline, half to\nherself, half to Hugh, who was following his cousin more slowly. He\nstopped for a moment.\n\n\"Too old?\" he repeated.\n\n\"Yes, Monsieur Chéri, too old,\" the nurse replied. \"The thoughts do not\ncome so quickly as they once did, and the words, too, hobble along like\nlamesters on crutches.\"\n\n\"But,\" said Hugh, half timidly, \"it is never--you would never, I mean,\nbe too old to visit that country, where there are so many stories to be\nfound?\"\n\n\"Perhaps not,\" said Marcelline, \"but even if I found them, I might not\nbe able to tell them. Go and look for them for yourself, Monsieur\nChéri; you have not half seen the tapestry castle yet.\"\n\nBut when Hugh would have asked her more she would not reply, only smiled\nand shook her head. So the boy went slowly downstairs after Jeanne,\nwondering what old Marcelline could mean, half puzzled and half pleased.\n\n\"Only,\" he said to himself, \"if I get into the castle, Jeanne really\nmust come with me, especially if it is to hear stories.\"\n\n\n\n\nCHAPTER VII WINGS AND CATS.\n\n          \"And all their cattish gestures plainly spoke\n           They thought the affair they'd come upon no joke.\"\n                                         CHARLES LAMB.\n\n\nSome days went on, and nothing more was said by the children about the\nadventures which had so puzzled poor Hugh. After a while he seemed to\nlose the wish to talk about them to little Jeanne; or rather, he began\nto feel as if he could not, that the words would not come, or that if\nthey did, they would not tell what he wanted. He thought about the\nstrange things he had seen very often, but it was as if he had read of\nthem rather than as if he had seen and heard them, or as if they had\nhappened to some one else. Whenever he saw Dudu and Houpet and the rest\nof the pets, he looked at them at first in a half dreamy way, wondering\nif they too were puzzled about it all, or if, being really fairies, they\ndid not find anything to puzzle them! The only person (for, after all,\nhe could often not prevent himself from looking upon all the animals as\npersons)--the only person who he somehow felt sure _did_ understand him,\nwas Marcelline, and this was a great satisfaction. She said nothing; she\nalmost never even smiled in what Jeanne called her \"funny\" way; but\nthere was just a very tiny little undersound in the tone of her voice\nsometimes, a little wee smile in her eyes more than on her lips, that\ntold Hugh that, fairy or no fairy, old Marcelline knew all about it, and\nit pleased him to think so.\n\nOne night when Hugh was warmly tucked up in bed Marcelline came in as\nusual before he went to sleep to put out his light.\n\n\"There's been no moonlight for a good while Marcelline, has there?\" he\nsaid.\n\n\"No, Monsieur, there has not,\" said Marcelline.\n\n\"Will it be coming back soon?\" asked Hugh.\n\n\"Do you like it so much, my child?\" said the old nurse. She had a funny\nway of sometimes answering a question by asking another.\n\n\"Yes,\" said Hugh. \"At least, of course when I'm fast asleep it doesn't\nmatter to me if it's moonlight or not. But you know what I like it for,\nMarcelline, and you said the other day that I hadn't half seen the\ntapestry castle, and I want very much to see it, Marcelline, only I'd\nlike Jeanne to be with me; for I don't think I could tell her well about\nthe fairy things if she hadn't been with me. She didn't seem to\nunderstand the words, and I don't think I could get the right ones to\ntell, do you know, Marcelline?\"\n\nHe half sat up in bed, resting his head on his elbow, which was leaning\non the pillow, and looking up in the old woman's face with his earnest\nblue eyes. Marcelline shook her head slowly.\n\n\"No,\" she said, \"you're right. The words wouldn't come, and if they did,\nit would be no use. You're older than Mademoiselle Jeanne, Monsieur\nHugh, and it's different for her. But it doesn't matter--the days bring\ntheir own pleasures and interests, which the moonlight wouldn't suit.\nYou wouldn't have cared for a dinner like what you have every day when\nyou were listening to the song of the swan?\"\n\n\"No, certainly not,\" said Hugh. \"I see you do understand, Marcelline,\nbetter than anybody. It must be as I said; there must be two of me, and\ntwo of Jeanne, and two of you, and----\"\n\n\"And two of everything,\" said Marcelline; \"and the great thing is to\nkeep each of the twos in its right place.\"\n\nShe smiled now, right out, and was turning away with the light in her\nhand, when Hugh called after her,\n\n\"_Will_ the moonlight nights come again soon, Marcelline? Do tell me.\nI'm sure you know.\"\n\n\"Have a little patience,\" said the old nurse, \"you shall be told. Never\nfear.\"\n\nAnd, a little inclined to be _im_patient, Hugh was nevertheless obliged\nto shut his eyes and go to sleep. There was no moonlight _that_ night\nany way.\n\nBut not many nights after there came a great surprise.\n\nCuriously enough Hugh had gone to sleep _that_ night without any thought\nof tapestry adventures. He and Jeanne had been very merry indeed; they\nhad been dressing up, and playing delightful tricks--such as tapping at\nthe salon door, and on being told to come in, making their appearance\nlike two very, very old peasants, hobbling along on sticks--Jeanne with\na cap and little knitted shawl of Marcelline's, Hugh with a blouse and\ncotton nightcap, so that Jeanne's mother quite jumped at first sight of\nthe quaint little figures. Then Jeanne dressed up like a fairy, and\npretended to turn Hugh into a guinea-pig, and they got Nibble up into\nthe nursery, and Hugh hid in a cupboard, and tried to make his voice\nsound as if it came from Nibble, and the effect of his ventriloquism was\nso comical that the children laughed till they actually rolled on the\nfloor. And they had hardly got over the laughing--though Marcelline did\nher best to make them sit still for half an hour or so before going to\nbed--when it was time to say good-night and compose themselves to sleep.\n\n\"I shan't be able to go to sleep for ever so long,\" said Hugh; \"I shall\nstay awake all the night, I believe.\"\n\n\"Oh no, you won't,\" said Marcelline, with a smile, as she went off with\nthe light.\n\nAnd strange to say, hardly had she shut the door when Hugh did fall\nasleep--soundly asleep. He knew no more about who he was, or where he\nwas, or anything--he just slept as soundly as a little top, without\ndreaming or starting in the least, for--dear me, I don't know for how\nlong!--any way it must have been for several hours, when--in the strange\nsudden way in which once or twice before it had happened to him to awake\nin this curious tapestry room, he opened his eyes as if startled by an\nelectric shock, and gazed out before him, as much awake as if he had\nnever been asleep in his life.\n\nWhat had awakened him, and what did he see? He could hardly have told\nwhat had awakened him but for what he _now_ saw and heard. A voice, a\nvery well-known little voice, was speaking to him. \"Chéri dear,\" it\nsaid, \"Chéri, I have come for you. And see what I have got for you.\" And\nthere before him stood little Jeanne--but Jeanne as he had never seen\nher before. She seemed all glistening and shining--her dress was of some\nkind of sparkling white, and round her waist was a lovely silver\ngirdle--her sleeves too were looped up with silver bands, and, prettiest\nof all, two snow-white wings were fastened to her shoulders. She looked\nlike a fairy queen, or like a silvery bird turned into a little girl.\nAnd in her hand she held another pair of wings exactly like her own.\n\nHugh gazed at her.\n\n\"Have you been dressing up?\" he said, \"and in the middle of the night?\noh how funny! But O, Jeanne, how pretty you look!\"\n\nJeanne laughed merrily. \"Come, get up quick, then,\" she said, \"and I'll\nmake you pretty too. Only I can't promise you a head-dress like mine,\nChéri.\"\n\nShe gave her head a little toss, which made Hugh look at it. And now he\nnoticed that on it she wore something very funny indeed, which at first,\nbeing black--for Jeanne's hair, you know, was black too--had not caught\nhis attention. At first he thought it was some kind of black silk hood\nor cap, such as he had seen worn by some of the peasants in Switzerland,\nbut looking again--no, it was nothing of the kind--the head-dress had a\nhead of its own, and as Hugh stared, it cocked it pertly on one side in\na way Hugh would have known again anywhere. Yes, it was Dudu, sitting on\nJeanne's smooth little head as comfortably as if he had always been\nintended to serve the purpose of a bonnet.\n\n\"Dudu!\" exclaimed Hugh.\n\n\"Of course,\" said Jeanne. \"You didn't suppose we could have gone without\nhim, Chéri.\"\n\n\"Gone where?\" said Hugh, quite sitting up in bed by this time, but still\na good deal puzzled.\n\n\"Up into the tapestry castle,\" said Jeanne, \"where we've been wishing so\nto go, though we had to wait for the moonlight, you know.\"\n\nThe word made Hugh glance towards the window, for, for the first time he\nbegan to wonder how it was his room was so bright. Yes, it was streaming\nin, in a beautiful flood, and the tapestry on the walls had taken again\nthe lovely tints which by daylight were no longer visible.\n\nHugh sprang out of bed. \"Are these for me?\" he said, touching the wings\nwhich Jeanne held.\n\n\"Certainly,\" she replied. \"Aren't they pretty? Much nicer than your\nwall-climbers, Chéri. I chose them. Turn round and let me put them on.\"\n\nShe slipped them over his head--they seemed to be fastened to a band,\nand in a moment they had fitted themselves perfectly into their place.\nThey were so light that Hugh was hardly conscious of them, and yet he\ncould move them about--backwards and forwards, swiftly or slowly, just\nas he chose--and as easily as he could move his arms. Hugh was extremely\npleased with them, but he looked at his little night-gown with sudden\ndismay.\n\n\"You said you'd make me look pretty too, Jeanne,\" he observed. \"I don't\ncare for myself--boys never care about being grandly dressed--but I\nshall look rather funny beside you, shan't I?\"\n\n\"Wait a minute,\" said Jeanne, \"you're not ready yet. I'm going to powder\nyou. Shut your eyes.\"\n\nHe did so, and therefore could not see what Jeanne did, but he felt a\nsort of soft puff fly all over him, and opening his eyes again at\nJeanne's bidding, saw, to his amazement, that he too was now dressed in\nthe same pretty shiny stuff as his little cousin. They looked just like\ntwo Christmas angels on the top of a frosted Twelfth Night cake.\n\n\"There now,\" said Jeanne, \"aren't you pleased? You don't know how nice\nyou look. Now, Dudu we're quite ready. Are we to fly up to the castle?\"\n\nDudu nodded his wise head. Jeanne took Hugh's hand, and without Hugh's\nquite knowing how it was managed, they all flew up the wall together,\nand found themselves standing on the castle terrace. There was no light\nstreaming out from the windows this time, and the peacocks were quite\nmotionless at their post.\n\n\"Are they asleep?\" said Hugh.\n\n\"Perhaps,\" said Dudu, speaking for the first time. \"They lead a\nmonotonous life, you see. But there is no occasion to disturb them.\"\n\nThey were standing just in front of the door, by which, the last time,\nHugh had entered the long lighted-up passage. As they stood waiting, the\ndoor slowly opened, but to Hugh's great surprise the inside was\nperfectly different. A very large white-painted hall was revealed to\nthem. The ceiling was arched, and looking up, it seemed so very high,\nthat it gave one more the feeling of being the sky than the roof of a\nhouse. This great hall was perfectly empty, but yet it did not feel\nchilly, and a faint pleasant perfume stole through it, as if not far off\nsweet-scented flowers and plants were growing.\n\nHugh and Jeanne stood hand-in-hand and looked around them. The door by\nwhich they had entered had closed noiselessly, and when they turned to\nsee the way by which they had come in, no sign of a door was there. In\nthe panels of white wood which formed the walls, it was somehow\nconcealed.\n\n\"How shall we ever get out again?\" said Hugh.\n\nBut Jeanne only laughed.\n\n\"We needn't trouble about that,\" she said. \"We got back all right the\nlast time. What I want to know is what are we to do next? I see no way\nout of this hall, and though it's rather nice, it's not very amusing.\nDudu, I wish you would sit still--you keep giving little juggles on my\nhead that are very uncomfortable, and make me feel as if I had a hat on\nthat was always tumbling off.\"\n\n\"I beg your pardon, Mademoiselle Jeanne,\" replied Dudu with great\ndignity. \"You really do say such foolish things sometimes that it is\nimpossible to restrain one's feelings altogether. No way out of this\nhall, do you say, when it is the entrance to everywhere?\"\n\n\"But how are we to get to everywhere, or anywhere?\" asked Jeanne.\n\n\"Really!\" said Dudu, as if quite out of patience. \"When you are running\nup and down the terrace, in your other life, you don't stand still at\none end and say, 'Dudu, how am I to get to the other?' You move your\nfeet, which were given you for the purpose. And in present\ncircumstances, instead of your feet, you naturally----\"\n\n\"Move our wings,\" cried Jeanne. \"Oh, of course. We're to fly. But you\nsee, Dudu, we're accustomed to having feet, and to running and walking\nwith them, but having wings is something new.\"\n\nDudu still looked rather contemptuous, and Hugh gave a little pull to\nJeanne's hand.\n\n\"Let's set off,\" he said.\n\n\"But where are we to go to?\" asked Jeanne.\n\nDudu gave a little croak. \"Really,\" he said again. \"What am I here for?\"\n\n\"Oh, to show us the way, of course,\" said Jeanne. \"You're going to steer\nus, I suppose, on the top of my head. Well, we're quite ready.\"\n\nOff they set. The flying this time was really quite a pleasure in\nitself, and the higher up they rose the easier and swifter it seemed to\nbecome. The hall was lighted from the roof--at least the light seemed to\ncome down from among the arches so high up that their form was only\nvaguely seen. But whether it was daylight or what, the children did not\nknow, and perhaps it did not occur to them to think. They just flew\nsoftly on, till suddenly Dudu veered to one side and stopped them in\nfront of a low carved door with a step before it just large enough for\nthem to stand on. They had not noticed this door before--the hall was so\nvery large and the door in comparison so small, and the step before it\nhad looked just like a little jutting-out ledge in the carving, till\nthey were close to it.\n\n\"Don't turn round,\" said Dudu, \"for fear it should make you giddy. Push\nthe door and go in at once.\"\n\nThe children did so. The door yielded, and then immediately--they were\nsuch well-behaved doors in the tapestry palace--closed behind them. And\nwhat the children now saw was a small winding stair, the lowest steps of\nwhich were close to their feet.\n\n\"Here,\" said Dudu, \"I will leave you. You can't go wrong.\"\n\nHe flew down from Jeanne's head as he spoke. Jeanne gave her head a\nlittle shake; she seemed not altogether sorry to be freed from her\nhead-dress, for a head-dress with _feelings_ is a somewhat uncomfortable\naffair.\n\n\"I don't mind you getting off my head, Dudu,\" she said. \"But you might\ntake a turn on Chéri's for a change. I think it's rather shabby of you\nto leave us already.\"\n\nHugh looked at Jeanne in surprise. He could not understand how it was\nthat Jeanne ventured to speak so coolly to the raven--she who in their\ndaylight life was so frightened of him that she would hardly go near him\nfor fear he should turn her into a mouse, or in some other way bewitch\nher!\n\n\"I think it's very good-natured of Monsieur Dudu to have come with us so\nfar,\" he said. \"We could never have got into the tapestry castle at all\nbut for him.\"\n\n\"No,\" said Dudu, \"that you certainly wouldn't.\" But he didn't seem\noffended. \"Good-bye,\" he said, \"and if you're in any trouble remember\nthe former arrangement. Whistle three times.\"\n\n\"Good-bye,\" said Hugh and Jeanne. But as they said it, their looks met\neach other in astonishment--there was no Dudu there--he had already\ndisappeared.\n\n\"What a queer way he has of going off all of a sudden,\" said Jeanne.\n\n\"And what are we to do now?\" said Hugh.\n\n\"Go up the stairs, of course, till we find where they lead to,\" said\nJeanne.\n\n\"It will be rather awkward with our wings,\" said Hugh. \"The stair is so\nvery narrow and twisting.\"\n\nJeanne made an exclamation.\n\n\"Wings!\" she said. \"Why, Chéri, your wings are gone!\"\n\n\"And so are yours!\" said Hugh.\n\nBoth the children stared at each other and turned round to look at their\nshoulders, as if they could hardly believe it.\n\n\"It's too bad,\" said Jeanne. \"It's all Dudu.\"\n\n\"Never mind,\" said Hugh. \"He wouldn't have taken them away if we had\nbeen going to need them again; and really, Jeanne, the more I think of\nit the more sure I am we could never have got up that stair with our\nwings on.\"\n\n\"Perhaps not,\" said Jeanne. \"Any way _I_ couldn't have got up it with\nDudu on my head. But let's go on, Chéri. Are you frightened? I'm not a\nbit.\"\n\n\"I'm not, either,\" said Hugh. \"Still, it's a very queer place. I wish\nDudu, or Houpet, or some of them, had come with us!\"\n\nThey set off on their climb up the steep spiral staircase. So narrow it\nwas, that going hand-in-hand was out of the question.\n\n\"It's worse than the staircase down to the frogs' country,\" said Jeanne.\n\nHugh looked at her triumphantly.\n\n\"There now, Jeanne, you _do_ remember,\" he said. \"I believe it was just\npretence your saying you thought I had dreamt it all.\"\n\n\"No,\" said Jeanne, \"it wasn't. You don't understand, Chéri. I'm\nmoonlight Jeanne, now--when we were having the dolls' feast I was\ndaylight Jeanne. And you know it's never moonlight in the day-time.\"\n\n\"Well, certainly, I _don't_ understand,\" said Hugh. \"And one thing\nparticularly--how is it that in the moon-time you remember about the\nday-time, if in the day you forget all about the other.\"\n\n\"I don't exactly forget,\" said Jeanne, \"but it spoils things to mix them\ntogether. And lots of things would be _quite_ spoilt if you took them\ninto the regular daylight. I fancy, too, one can see farther in the\nmoonlight--one can see more ways.\"\n\nShe was standing at the foot of the stair, a step or two higher than\nHugh, and the soft light, which still, in some mysterious way, seemed to\ncome down from above--though, looking up the spiral stair, its top\nseemed lost in gloom--fell on her pretty little face. Her hair had\nfallen back over her shoulders and lay dark on her pure white shiny\ndress; there was a look in her eyes which Hugh had never noticed before,\nas if she could see a long way off. Hugh looked at her earnestly.\n\n\"Jeanne,\" he said, \"you're a perfect puzzle. I do wonder whether you're\nhalf a fairy, or an angel, or a dream. I do hope you're not a dream when\nyou're in the moonlight. But, oh dear, I cannot understand.\"\n\n\"Do leave off trying to understand, Chéri,\" said Jeanne, \"and let us\namuse ourselves. I always love _you_, Chéri, whatever I am, don't I?\"\n\nShe turned towards him brightly, with such a merry smile on her face\nthat Hugh could not help smiling too.\n\n\"Do let us go on quickly,\" she said; \"I do so want to see where this\nstair goes to.\"\n\n\"Let me go first. I'm a boy, you know, and it's right I should go first\nin case of meeting anything that might frighten you,\" said Hugh.\n\nSo he stepped up in front of Jeanne, and they slowly made their way.\n\nIt was impossible to go fast. Never was there such a twisty little\nstair. Here and there, too, it got darker, so that they could only just\nfind their way, step by step. And it really seemed as if they had\nclimbed a very long way, when from above came faintly and softly the\nsound of a plaintive \"mew.\" \"Mew, mew,\" it said again, whoever the \"it\"\nwas, and then stopped.\n\nThe children looked at each other.\n\n\"Cats!\" they said at the same instant.\n\n\"It's just as well,\" said Hugh, \"that none of the animals did come with\nus, as so many of them are birds.\"\n\nAnother step or two and the mystery was explained. They had reached the\ntop of the turret stair; it led them into a little hall, all, like the\ngreat hall below, painted white. It looked perfectly pure and clean, as\nif it had only been painted the day before, and yet there was a\ncuriously _old_ look about it too, and a faint scent of dried rose\nleaves seemed to be in the air.\n\nThere was a door in this little hall, exactly opposite the top of the\nstair, and at each side of the door was an arm-chair, also all white,\nand with a white satin cushion instead of a seat. And on each of these\nchairs sat a most beautiful white cat. The only colour in the hall was\nthe flash of their green eyes, as they turned them full on the two\nchildren.\n\nJeanne crept a little closer to Hugh. But there was no reason for fear.\nThe cats were most amiably disposed.\n\n\"Mew!\" said the one on the right-hand chair.\n\n\"Mew!\" said the one on the left-hand chair.\n\nThen they looked at each other for a moment, and at last, seeming to\nhave made up their minds, each held out his right paw. Something in the\nway they did it reminded Hugh and Jeanne of Dudu when he stood on one\nleg, and stuck out the other like a walking-stick.\n\n\"Mew!\" they said again, both together this time. And then in a clear,\nthough rather mewey voice, the right-hand cat spoke to the children.\n\n\"Madame is expecting you,\" he said.\n\nThe children did not know what else to say, so they said, \"Thank you.\"\n\n\"She has been waiting a good while,\" said the left-hand cat.\n\n\"I'm very sorry to have kept her waiting,\" said Hugh, feeling Jeanne\nnudge him. \"I hope she has not been waiting very long?\"\n\n\"Oh no,\" said the right-hand cat, \"not long; not above three hundred\nyears.\"\n\nJeanne gave a start of astonishment.\n\n\"Three hundred----\" \"years,\" she was going to say, but the left-hand cat\ninterrupted her.\n\n\"You are not to be surprised,\" he said, very hastily, and Jeanne could\nnot quite make out if he was frightened or angry, or a little of both.\n\"You must not _think_ of being surprised. Nobody is ever surprised\nhere.\"\n\n\"No one is ever surprised here,\" repeated the right-hand cat. \"This is\nthe Castle of Whiteness, you know. You are sure you have nothing\ncoloured about you?\" he added, anxiously.\n\nInstinctively both the children put their hands up to their heads.\n\n\"Only our hair,\" they said.\n\n\"Mine's light-brown, you see,\" said Hugh.\n\n\"And mine's bl----\" Jeanne was saying, but the cats, both speaking\ntogether this time, stopped her with a squeal of horror.\n\n\"Oh, oh, oh!\" they said. \"Where are your manners? You must never mention\nsuch a word. Your hair, Mademoiselle, is _shadowy_. That is the proper\nexpression.\"\n\nJeanne was annoyed, and did not speak. Hugh felt himself bound to defend\nher from the charge of bad manners.\n\n\"You needn't be so sharp,\" he said to the cats; \"your eyes are as green\nas they can be.\"\n\n\"Green doesn't count,\" said the right-hand cat, coolly.\n\n\"And how were we to know that?\" said Hugh.\n\n\"I don't know,\" said the left-hand cat.\n\n\"Well, but can't you be sensible?\" said Hugh, who didn't feel inclined\nto give in to two cats.\n\n\"Perhaps we might be if we tried,\" said the right-hand cat. \"But----\"\n\nA sudden sound interrupted him. It was as if some one had moved a piece\nof furniture with squeaking castors.\n\n\"Madame's turning her wheel,\" said the left-hand cat. \"Now's the time.\"\n\nBoth cats got down from their chairs, and each, standing on their hind\nlegs, proceeded to open his side of the door between the chairs--or\n\"doors\" I should almost say, for it was a double-hinged one, opening in\nthe middle, and the funny thing about it was that one side opened\noutwards, and the other inwards, so that at first, unless you were\nstanding just exactly in the middle, you did not see very clearly into\nthe inside.\n\n\n\n\nCHAPTER VIII. \"THE BROWN BULL OF NORROWA.\"\n\n          \"Delicate, strong, and white,\n           Hurrah for the magic thread!\n           The warp and the woof come right.\"\n                                CHILD WORLD.\n\n\nThey were not to be surprised! Both the children remembered that, and\nyet it was a little difficult to avoid being so.\n\nAt first all they saw was just another white room, a small one, and with\na curious pointed window in one corner. But when the doors were fully\nopened there was more to be seen. In the first place, at the opposite\ncorner, was a second window exactly like the other, and in front of this\nwindow a spinning-wheel was placed, and before this spinning-wheel sat,\non a white chair, a white-haired lady.\n\nShe was spinning busily. She did not look up as the children came in.\nShe seemed quite absorbed in her work. So the children stood and gazed\nat her, and the cats stood quietly in front, the right-hand one before\nHugh, the left-hand one before Jeanne, not seeming, of course, the least\nsurprised. Whether I should call the white-haired lady an \"old\" lady or\nnot, I really do not know. No doubt she was old, as we count old, but\nyet, except for her hair, she did not look so. She was very small, and\nshe was dressed entirely in white, and her hands were the prettiest\nlittle things you ever saw. But as she did not look up, Hugh and Jeanne\ncould not at first judge of her face. They stood staring at her for some\nminutes without speaking. At last, as they were not allowed to be\nsurprised, and indeed felt afraid of being reproached with bad manners\nby the cats if they made any remarks at all, it began, especially for\nJeanne, to grow rather stupid.\n\nShe gave Hugh a little tug.\n\n\"Won't you speak to her?\" she whispered, very, _very_ softly.\n\nInstantly both cats lifted their right paws.\n\n\"You see,\" replied Hugh, looking at Jeanne reproachfully, \"they're\ngetting angry.\"\n\nOn this the cats wheeled right round and looked at the children.\n\n\"I don't care,\" said Jeanne, working herself up. \"I don't care. It's\nnot our fault. They said she was waiting for us, and they made us come\nin.\"\n\n\"'_She_ is the cat,' so I've been told,\" said a soft voice suddenly.\n\"And 'don't care;' something was once spun about 'don't care,' I think.\"\n\nImmediately the two cats threw themselves on the ground, apparently in\nan agony of grief.\n\n\"_She_ the cat,\" they cried. \"Oh, what presumption! And who said 'don't\ncare'? Oh dear! oh dear! who would have thought of such a thing?\"\n\nThe lady lifted her head, and looked at the cats and the children. There\nwas a curious expression on her face, as if she had just awakened. Her\neyes were very soft blue, softer and dreamier than Hugh's, and her\nmouth, even while it smiled, had a rather sad look. But the look of her\nwhole face was very--I can't find a very good word for it. It seemed to\nask you questions, and yet to know more about you than you did yourself.\nIt was impossible not to keep looking at her once you had begun.\n\n\"Hush, cats,\" were the next words she said. \"Don't be silly; it's nearly\nas bad as being surprised.\"\n\nImmediately the cats sat up in their places again, as quiet and\ndignified as if they had not been at all put about, and Jeanne glanced\nat Hugh as much as to say, \"Aren't you glad she has put them down a\nlittle?\"\n\nThen the lady looked over the cats to the children.\n\n\"It is quite ready,\" she said; \"the threads are all straight.\"\n\nWhat could they say? They had not the least idea what she meant, and\nthey were afraid of asking. Evidently the white lady was of the same\nopinion as the cats as to the rudeness of being surprised; very probably\nasking questions would be considered still ruder.\n\nJeanne was the first to pick up courage.\n\n\"Madame,\" she said, \"I don't mean to be rude, but I _am_ so thirsty.\nIt's with flying, I think, for we're not accustomed to it.\"\n\n\"Why did you not say so before?\" said the lady. \"I can give you anything\nyou want. It has all been ready a long time. Will you have snow water or\nmilk?\"\n\n\"Milk, please,\" said Jeanne.\n\nThe lady looked at the cats.\n\n\"Fetch it,\" she said quietly. The cats trotted off, they opened the door\nas before, but left it open this time, and in another moment they\nreturned, carrying between them a white china tray, on which were two\ncups of beautiful rich-looking milk. They handed them to the children,\nwho each took one and drank it with great satisfaction. Then the cats\ntook away the cups and tray, and returned and sat down as before.\n\nThe lady smiled at the children.\n\n\"Now,\" she said, \"are you ready?\"\n\nShe had been so kind about the milk that Hugh this time took courage.\n\n\"We are _very_ sorry,\" he said, \"but we really don't understand what it\nis you would like us to do.\"\n\n\"Do?\" said the lady. \"Why, you have nothing to do but to listen. Isn't\nthat what you came for? To hear some of the stories I spin?\"\n\nThe children opened their eyes--with pleasure it is to be supposed\nrather than surprise--for the white lady did not seem at all annoyed.\n\n\"Oh!\" said they, both at once. \"Is _that_ what you're spinning?\nStories!\"\n\n\"Of course,\" said the lady. \"Where did you think they all come\nfrom?--all the stories down there?\" She pointed downwards in the\ndirection of the stair and the great hall. \"Why, here I have been\nfor--no, it would frighten you to tell you how long, by your counting, I\nhave been up here at my spinning. I spin the round of the clock at this\nwindow, then I turn my wheel--to get the light, you see--and spin the\nround again at the other. If you saw the tangle it comes to me in! And\nthe threads I send down! It is not _often_ such little people as you\ncome up here themselves, but it does happen sometimes. And there is\nplenty ready for you--all ready for the wheel.\"\n\n\"How wonderful!\" said Hugh. \"And oh!\" he exclaimed, \"I suppose sometimes\nthe threads get twisted again when you have to send them down such a\nlong way, and that's how stories get muddled sometimes.\"\n\n\"Just so,\" said the white lady. \"My story threads need gentle handling,\nand sometimes people seize them roughly and tear and soil them, and then\nof course they are no longer pretty. But listen now. What will you have?\nThe first in the wheel is a very, very old fairy story. I span it for\nyour great-great-grandmothers; shall I spin it again for you?\"\n\n\"Oh, please,\" said both children at once.\n\n\"Then sit down on the floor and lean your heads against my knees,\" said\nthe lady. \"Shut your eyes and listen. That is all you have to do. Never\nmind the cats, they will be quite quiet.\"\n\n[STORY SPINNING.]\n\nHugh and Jeanne did as she told them. They leaned their heads, the\nsmooth black one of the little girl, the fair-haired curly one of the\nboy, on the lady's white robe. You can hardly imagine how soft and\npleasant it was to the touch. A half-sleepy feeling came over them; they\nshut their eyes and did not feel inclined to open them again. But they\ndid not really go to sleep; the fairy lady began to work the wheel, and\nthrough the soft whirr came the sound of a voice--whether it was the\nvoice of the lady or of the wheel they could not tell. And this was the\nold, old story the wheel spun for them.\n\n\"Listen, children,\" it began.\n\n\"We are listening,\" said Jeanne, rather testily. \"You needn't say that\nagain.\"\n\n\"Hush, Jeanne,\" said Hugh; \"you'll stop the story if you're not quiet.\"\n\n\"Listen, children,\" said the voice again. And Jeanne was quite quiet.\n\n\"Once on a time--a very long time ago--in a beautiful castle there lived\na beautiful Princess. She was young and sweet and very fair to see. And\nshe was the only child of her parents, who thought nothing too rare or\ntoo good for her. At her birth all the fairies had given her valuable\ngifts--no evil wishes had been breathed over her cradle. Only the fairy\nwho had endowed her with good sense and ready wit had dropped certain\nwords, which had left some anxiety in the minds of her parents.\n\n\"'She will need my gifts,' the fairy had said. 'If she uses them well,\nthey and these golden balls will stand her in good need.\n\n\"And as she kissed the baby she left by her pillow three lovely golden\nballs, at which, as soon as the little creature saw them, she smiled\nwith pleasure, and held out her tiny hands to catch them.\n\n\"They were of course balls of fairy make--they were small enough for the\nlittle Princess at first to hold in her baby hands, but as she grew they\ngrew, till, when she had reached her sixteenth year, they were the size\nof an orange. They were golden, but yet neither hard nor heavy, and\nnothing had power to dint or stain them. And all through her babyhood\nand childhood, and on into her girlhood, they were the Princess's\nfavourite toy. They were never away from her, and by the time she had\ngrown to be a tall and beautiful girl, with constant practice she had\nlearnt to catch them as cleverly as an Indian juggler. She could whiz\nthem all three in the air at a time, and never let one drop to the\nground. And all the people about grew used to seeing their pretty\nPrincess, as she wandered through the gardens and woods near the castle,\nthrowing her balls in the air as she walked, and catching them again\nwithout the slightest effort.\n\n\"And remembering the words of the fairy who had given them, naturally\nher father and mother were pleased to see her love for the magic gift,\nand every one about the palace was forbidden to laugh at her, or to say\nthat it was babyish for a tall Princess to play so much with a toy that\nhad amused her as an infant.\n\n\"She was not a silly Princess at all. She was clever at learning, and\nliked it, and she was sensible and quick-witted and very brave. So no\none was inclined to laugh at her pretty play, even if they had not been\nforbidden to do so. And she was so kind-hearted and merry, that if ever\nin her rambles she met any little children who stared at her balls with\nwondering eyes, she would make her ladies stop, while she threw the\nballs up in the air, higher and yet higher, ever catching them again as\nthey flew back, and laughed with pleasure to see the little creatures'\ndelight in her skill.\n\n\"She was such a happy Princess that the bright balls seemed like\nherself--ready to catch every ray of sunshine and make it prisoner. And\ntill she had reached her sixteenth year no cloud had come over her\nbrightness. About this time she noticed that the king, her father, began\nto look anxious and grave, and messengers often came in haste to see him\nfrom far-off parts of his kingdom. And once or twice she overheard words\ndropped which she could not understand, except that it was evident some\nmisfortune was at hand. But in their desire to save their daughter all\nsorrow, the king and queen had given orders that the trouble which had\ncome to the country was not to be told her; so the Princess could find\nout nothing even by questioning her ladies or her old nurse, who\nhitherto had never refused to tell her anything she wanted to know.\n\n\"One day when she was walking about the gardens, playing as usual with\nher golden balls, she came upon a young girl half hidden among the\nshrubs, crying bitterly. The Princess stopped at once to ask her what\nwas the matter, but the girl only shook her head and went on weeping,\nrefusing to answer.\n\n\"'I dare not tell you, Princess,' she said. 'I dare not. You are good\nand kind, and I do not blame you for my misfortunes. If you knew all,\nyou would pity me.'\n\n\"And that was all she would say.\n\n\"She was a pretty girl, about the same age and height as the Princess,\nand the Princess, after speaking to her, remembered that she had\nsometimes seen her before.\n\n\"'You are the daughter of the gardener, are you not?' she inquired.\n\n\"'Yes,' said the girl. 'My father is the king's gardener. But I have\nbeen away with my grandmother. They only sent for me yesterday to come\nhome--and--and--oh, I was to have been married next week to a young\nshepherd, who has loved me since my childhood!'\n\n\"And with this the girl burst into fresh weeping, but not another word\nwould she say.\n\n\"Just then the Princess's governess, who had been a little behind--for\nsometimes in playing with her balls the Princess ran on faster--came up\nto where the two young girls were talking together. When the governess\nsaw who the Princess's companion was she seemed uneasy.\n\n\"'What has she been saying to you, Princess?' she asked eagerly. 'It is\nthe gardener's daughter, I see.'\n\n\"'Yes,' said the Princess. 'She is the gardener's daughter, and she is\nin some great trouble. That is all I know, for she will tell me nothing\nbut that she was to have been married next week, and then she weeps. I\nwish I knew what her sorrow is, for, perhaps, I could be of use to her.\nI would give her all my money if it would do her any good,' and the\nPrincess looked ready to cry herself. But the girl only shook her head.\n'No Princess,' she said; 'it would do me no good. It is not your fault;\nbut oh, it is very hard on me!'\n\n\"The governess seemed very frightened and spoke sharply to the girl,\nreproving her for annoying the Princess with her distress. The Princess\nwas surprised, for all her ladies hitherto had, by the king and queen's\ndesire, encouraged her to be kind and sympathising to those in trouble,\nand to do all she could to console them. But as she had also been taught\nto be very obedient, she made no remonstrance when her governess desired\nher to leave the girl and return to the castle. But all that day the\nPrincess remained silent and depressed. It was the first time a shadow\nhad come near her happiness.\n\n\"The next morning when she awoke the sun was shining brilliantly. It was\na most lovely spring day. The Princess's happy spirits seemed all to\nhave returned. She said to herself that she would confide to the queen\nher mother her concern about the poor girl that she had seen, and no\ndoubt the queen would devise some way of helping her. And the thought\nmade her feel so light-hearted that she told her attendants to fetch her\na beautiful white dress trimmed with silver, which had been made for her\nbut the day before. To her surprise the maidens looked at each other in\nconfusion. At last one replied that the queen had not been pleased with\nthe dress and had sent it away, but that a still more beautiful one\ntrimmed with gold should be ready by that evening. The Princess was\nperplexed; she was not so silly as to care about the dress, but it\nseemed to her very strange that her mother should not admire what she\nhad thought so lovely a robe. But still more surprised was she at a\nmessage which was brought to her, as soon as she was dressed, from the\nking and queen, desiring her to remain in her own rooms the whole of\nthat day without going out, for a reason that should afterwards be\nexplained to her. She made no objection, as she was submissive and\nobedient to her parents' wishes, but she found it strange and sad to\nspend that beautiful spring day shut up in her rooms, more especially as\nin her favourite boudoir, a turret chamber which overlooked the castle\ncourtyard, she found the curtains drawn closely, as if it were night,\nand was told by her governess that this too was by the king's orders;\nthe Princess was requested not to look out of the windows. She grew at\nthis a little impatient.\n\n\"'I am willing to obey my parents,' she said, 'but I would fain they\ntrusted me, for I am no longer a child. Some misfortune is threatening\nus, I feel, and it is concealed from me, as if I could be happy or at\nrest if sorrow is hanging over my dear parents or the nation.'\n\n\"But no explanation was given to her, and all that day she sat in her\ndarkened chamber playing sadly with her golden balls and thinking deeply\nto herself about the mystery. And towards the middle of the day sounds\nof excitement reached her from the courtyard beneath. There seemed a\nrunning to and fro, a noise of horses and of heavy feet, and now and\nthen faint sounds of weeping.\n\n\"'Goes the king a hunting to-day?' she asked her ladies. 'And whose\nweeping is it I hear?'\n\n\"But the ladies only shook their heads without speaking.\n\n\"By the evening all seemed quiet. The Princess was desired to join her\nparents as usual, and the white and golden robe was brought to her to\nwear. She put it on with pleasure, and said to herself there could after\nall be no terrible misfortune at hand, for if so there would not be the\nsigns of rejoicing she observed as she passed through the palace. And\nnever had her parents been more tender and loving. They seemed to look\nat her as if never before they had known how they treasured her, and the\nPrincess was so touched by these proofs of their affection that she\ncould not make up her mind to trouble them by asking questions which\nthey might not wish to answer.\n\n\"The next day everything went on as usual in the palace, and it seemed\nto the Princess that there was a general feeling as if some great danger\nwas safely passed. But this happiness did not last long; about three\ndays later, again a messenger, dusty and wearied with riding fast and\nhard, made his appearance at the castle; and faces grew gloomy, and the\nking and queen were evidently overwhelmed with grief. Yet nothing was\ntold to the Princess.\n\n\"She wandered out about the gardens and castle grounds, playing as usual\nwith her balls, but wondering sadly what meant this mysterious trouble.\nAnd as she was passing the poultry-yard, she heard a sound which seemed\nto suit her thoughts--some one was crying sadly. The Princess turned to\nsee who it was. This time too it was a young girl about her own age, a\ngirl whom she knew very well by sight, for she was the daughter of the\nqueen's henwife, and the Princess had often seen her driving the flocks\nof turkeys or geese to their fields, or feeding the pretty cocks and\nhens which the queen took great pride in.\n\n\"'What is the matter, Bruna?' said the Princess, leaning over the gate.\n'Have the rats eaten any of the little chickens, or has your mother been\nscolding you for breaking some eggs?'\n\n\"'Neither, Princess,' said the girl among her sobs. 'The chickens are\nnever eaten, and my mother seldom scolds me. My trouble is far worse\nthan that, but I dare not tell it to you--to you of all people in the\nworld.'\n\n\"And the Princess's governess, who just then came up, looked again very\nfrightened and uneasy.\n\n\"'Princess, Princess,' she said, 'what a habit you are getting of\ntalking to all these foolish girls. Come back to the palace at once with\nme.'\n\n\"'I have often talked to Bruna before,' said the Princess gently, 'and\nI never was blamed for doing so. She is a pretty girl, and I have known\nher all my life. Some one said she was betrothed to one of my father's\nhuntsmen, and I would like to ask if it is true. Perhaps they are too\npoor to marry, and it may be for that she is weeping.'\n\n\"Bruna heard what the Princess said, and wept still more violently. 'Ah,\nyes, it is true!' she said, 'but never, never shall I now be married to\nhim.'\n\n\"But the Princess's governess would not let her wait to ask more. She\nhurried her back to the castle, and the Princess--more sure than ever\nthat some mysterious trouble was in question--could get no explanation.\n\n\"She did not see the king and queen that night, and the next morning a\nstrange thing happened--her white and golden robe was missing. And all\nthat her attendants could tell her was that it had been taken away by\nthe queen's orders.\n\n\"'Then,' said the Princess, 'there is some sad trouble afloat which is\nhidden from me.'\n\n\"And when she went to her turret room, and found, as before, that the\nwindows were all closed, so that she could not see out, she sat down and\ncried with distress and anxiety.\n\n\"And, again, about mid-day, the same confused noises were to be heard. A\nsound of horses and people moving about in the courtyard, a tramping of\nheavy feet, and through all a faint and smothered weeping. The Princess\ncould bear her anxiety no longer. She drew back the curtains, and\nunfastened the shutters, and leaned out. From her window she could\nclearly see the courtyard. It was, as she suspected, filled with people;\nrows of soldiers on horse-back lined the sides, and in front, on the\nsteps, the king and queen were standing looking at a strange object. It\nwas an enormous bull: never had the Princess seen such a bull. He was\ndark brown in colour, and pawed the ground in front of him impatiently,\nand on his back was seated a young girl whom the Princess gazed at with\nastonishment. She really thought for a moment it was herself, and that\nshe was dreaming! For the girl was dressed in the Princess's own white\nand golden robe, and her face could not be seen, for it was covered with\na thick veil, and numbers of women and servants standing about were\nweeping bitterly. And so, evidently, was the girl herself. Then the\ngreat bull gave another impatient toss, the girl seized his horns to\nkeep herself from falling, and off he set, with a terrible rush: and a\ngreat shout, half of fear, half of rejoicing, as seeing him go, rose\nfrom the people about.\n\n\"Just at this moment the Princess heard some one approaching her room.\nShe hastily drew the curtains, and sat down playing with her balls, as\nif she had seen nothing.\n\n\"She said not a word to any one, but she had her own thoughts, and that\nevening she was sent for to her father and mother, who, as usual,\nreceived her with caresses and every sign of the tenderest affection.\nAnd several days passed quietly, but still the Princess had her own\nthoughts.\n\n\"And one evening when she was sitting with her mother, suddenly the king\nentered the room in the greatest trouble, and not seeing the Princess,\nfor it was dusk, he exclaimed,\n\n\"'It has failed again. The monster is not to be deceived. He vows he\nwill not cease his ravages till he gets the real Princess, our beloved\ndaughter. He has appeared again, and is more infuriated than ever,\ntearing up trees by the roots, destroying the people's houses, tramping\nover their fields, and half killing all the country with terror. What is\nto be done? The people say they can endure it no longer. The girl Bruna\nwas found bruised and bleeding by the wayside a long way from this, and\nshe gives the same account as the gardener's daughter of the monster's\nrage at finding he had been deceived.'\n\n\"The queen had tried to prevent the king's relating all this, but he was\ntoo excited to notice her hints, and, indeed, after the first few words,\nthe Princess had heard enough. She started from her seat and came\nforward. And when he saw her, the king threw up his hands in despair.\nBut the Princess said quietly, 'Father, you must tell me the whole.'\n\n\"So they had to tell her the whole. For many weeks past the terrible\nmonster she had seen in the courtyard had been filling the country with\nfear. He had suddenly appeared at a distant part of the kingdom--having\ncome, it was said, from a country over the sea named 'Norrowa'--and had\nlaid it waste, for though he did not actually kill or devour, he tore\ndown trees, trampled crops, and terrified every one that came in his\nway, as the king had said. And when begged to have mercy and to return\nto his own country, he roared out with a voice between the voice of a\nman and the bellow of a bull, that he would leave them in peace once the\nking gave him his daughter in marriage.\n\n\"Messenger after messenger had been sent to the palace to entreat for\nassistance. Soldiers in numbers had been despatched to seize the monster\nand imprison him. But it was no use--he was not to be caught. Nothing\nwould content him but the promise of the Princess; and as it was of\ncourse plain that he was not a common bull, but a creature endowed with\nmagical power, the country-people's fear of him was unbounded. They\nthreatened to rise in revolution unless some means were found of ridding\nthem of their terrible visitor. Then the king called together the wisest\nof his counsellors, and finding force of no avail, they determined to\ntry cunning. The giving the Princess was not to be thought of, but a\npretty girl about her age and size--the gardener's daughter, the same\nwhom the Princess had found weeping over her fate--was chosen, dressed\nin one of her royal mistress's beautiful robes, and a message sent to\nthe bull that his request was to be granted. He came. All round, the\ncastle was protected by soldiers, though they well knew their power\nagainst him was nothing. The king and queen, feigning to weep over the\nloss of their daughter, themselves presented to him the false Princess.\n\n\"She was mounted on his back, and off he rushed with her--up hill, down\ndale, by rocky ground and smooth, across rivers and through forests he\nrushed, said the girl, faster and faster, till at last, as evening fell,\nhe came to a stand and spoke to her for the first time.\n\n\"'What time of day must it be by this, king's daughter?' he said.\n\n\"The girl considered for a moment. Then, forgetting her pretended\nposition, she replied thoughtlessly,\n\n\"'It must be getting late. About the time that my father gathers the\nflowers to adorn the king's and queen's supper table.'\n\n\"'Throw thee once, throw thee twice, throw thee _thrice_,' roared the\nbull, each time shaking the girl roughly, and the last time flinging her\noff his back. 'Shame on thee, gardener's daughter, and thou wouldst call\nthyself a true Princess.'\n\n\"And with that he left her bruised and frightened out of her wits on the\nground, and rushed off by himself whither she knew not. And it was not\ntill two days later that the unfortunate gardener's daughter found her\nway home, glad enough, one may be sure, to be again there in safety.\n\n\"In the meantime the ravages and terrors caused by the terrible bull had\nbegun again, and, as before, messengers came incessantly to the king\nentreating him to find some means of protecting his unfortunate\nsubjects. And the king and queen were half beside themselves with\nanxiety. Only one thing they were determined on--nothing must be told to\nthe Princess.\n\n\n\n\nCHAPTER IX. THE BROWN BULL--(_Continued_).\n\n                               \"And she\n          Told them an old-world history.\"\n                          MATTHEW ARNOLD.\n\n\n\"'She is so courageous,' said the queen, 'there is no knowing what she\nmight not do.'\n\n\"'She is so kind-hearted,' said the king; 'she might imagine it her duty\nto sacrifice herself to our people.'\n\n\"And the poor king and queen wept copiously at the mere thought, and all\nthe ladies and attendants of the Princess were ordered on no account to\nlet a breath of the terrible story be heard by her. Yet, after all, it\nso happened that her suspicions were aroused afresh by the sight this\ntime of the weeping Bruna. For nothing else could be suggested than\nagain to try to deceive the monster; and Bruna, a still prettier girl\nthan the gardener's daughter, was this time chosen to represent the\nPrincess. But all happened as before. The brown bull rushed off with\nhis prize, the whole day the unfortunate Bruna was shaken on his back,\nand again, as night began to fall, he stopped at the same spot.\n\n\"'What time must it be by this, king's daughter?' he asked.\n\n\"Foolish Bruna, thankful to have a moment's rest, answered hastily,\n\n\"'O brown bull, it must be getting late, and I am sorely tired. It must\nbe about the time that my mother takes all the eggs that have been laid\nin the day to the king's kitchen.'\n\n\"'Throw thee once, throw thee twice, throw thee _thrice_,' roared the\nbull, each time shaking the henwife's daughter roughly, at the end\nflinging her to the ground. 'Shame on thee, thou henwife's daughter, to\ncall thyself a true Princess.'\n\n\"And with that off he rushed, furious, and from that day the ravages and\nthe terrors began again, and Bruna found her way home, bruised and\nweeping, to tell her story.\n\n\"This was the tale now related to the Princess, and as she listened a\nstrange look of determination and courage came over her face.\n\n\"'There is but one thing to be done,' she said. 'It is childish to\nattempt to deceive a creature who is evidently not what he seems. Let me\ngo myself, my parents. Trust me to do my best. And, at worst, if I\nperish, it will be in a good cause. Better it should be so than that our\npeople should be driven from their homes, the whole country devastated,\nand all its happiness destroyed.'\n\n\"The king and queen had no answer to give but their tears. But the\nPrincess remained firm, and they found themselves obliged to do as she\ndirected. A messenger was sent to the monster to inform him, for the\nthird time, that his terms were to be agreed to, and the rest of the day\nwas spent in the palace in weeping and lamentation.\n\n\"Only, strange to say, the Princess shed no tears. She seemed as\ncheerful as usual; she played with her golden balls, and endeavoured to\ncomfort her sorrowful parents, and was so brave and hopeful that in\nspite of themselves the poor king and queen could not help feeling a\nlittle comforted.\n\n\"'It is a good sign that she has never left off playing with her balls,'\nthey said to each other. 'Who knows but what the fairy's prediction may\nbe true, and that in some way the balls may be the means of saving\nher?'\n\n\"'They and my wits,' said the Princess, laughing, for she had often been\ntold of the fairy's saying.\n\n\"And the king and queen and all the ladies and gentlemen of the court\nlooked at her in astonishment, admiring her courage, but marvelling at\nher having the spirit to laugh at such a moment.\n\n\"The next morning, at the usual time, the terrible visitor made his\nappearance. He came slowly up to the castle courtyard and stood at the\ngreat entrance, tossing his enormous head with impatience. But he was\nnot kept waiting long; the doors were flung open, and at the top of the\nflight of steps leading down from them appeared the young Princess, pale\nbut resolute, her fair hair floating over her shoulders, her golden\nballs flashing as she slowly walked down the steps, tossing them as she\nwent. And, unlike the false princesses, she was dressed entirely in\nblack, without a single jewel or ornament of any kind--nothing but her\nballs, and her hair caught the sunlight as she passed. There were no\nsoldiers this time, no crowd of weeping friends; the grief of the king\nand queen was now too real to be shown, and the Princess had asked that\nthere should be no one to see her go.\n\n\"The brown bull stood still as a lamb for her to mount, and then at a\ngentle pace he set off. The Princess had no need to catch hold of his\nhorns to keep herself from falling, his step was so even. And all along\nas she rode she threw her balls up softly in the air, catching them as\nthey fell. But the brown bull spoke not a word.\n\n\"On and on they went; the sun rose high in the heavens and poured down\non the girl's uncovered head the full heat of his rays. But just as she\nbegan to feel it painfully, they entered a forest, where the green shade\nof the summer trees made a pleasant shelter. And when they came out from\nthe forest again on the other side the sun was declining; before long he\nhad sunk below the horizon, evening was at hand. And as before, the\nbrown bull stopped.\n\n\"'King's daughter,' he said, in a voice so gentle, though deep, that the\nPrincess started with surprise, 'what hour must it be by this? Tell me,\nking's daughter, I pray.'\n\n\"'Brown bull,' replied the Princess, without a moment's hesitation, for\nthose who have nothing to conceal are fearless and ready; 'brown bull,\nit is getting late. By now must the king and queen, my father and\nmother, be sitting down to their solitary supper and thinking of me, for\nat this hour I was used to hasten to them, throwing my pretty balls\nas I went.'\n\n[THE BROWN BULL OF NORROWA.]\n\n\"'I thank thee, thou true Princess,' said the bull in the same tone, and\nhe hastened on.\n\n\"And ere long the night fell, and the poor Princess was so tired and\nsleepy, that without knowing it her pretty head drooped lower and lower,\nand at last she lay fast asleep on the bull's broad back, her fair head\nresting between his horns.\n\n\"She slept so soundly that she did not notice when he stopped, only she\nhad a strange dream. Some one lifted her gently and laid her on a couch,\nit seemed to her, and a kind voice whispered in her ear, 'Good-night, my\nfair Princess.'\n\n\"But it must have been a dream, she said to herself. How could a bull\nhave arms to lift her, or how could a rough, ferocious creature like him\nbe so gentle and kind? It must have been a dream, for when she awoke she\nsaw the great monster standing beside her on his four legs as usual; yet\nit was strange, for she found herself lying on a delicious mossy couch,\nand the softest and driest moss had been gathered together for a pillow,\nand beside her a cup of fresh milk and a cake of oaten bread were lying\nfor her breakfast. How had all this been done for her? she asked\nherself, as she ate with a very good appetite, for she had had no food\nsince the morning before. She began to think the bull not so bad after\nall, and to wonder if it was to Fairyland he was going to take her. And\nas she thought this to herself she threw her balls, which were lying\nbeside her, up into the air, and the morning sun caught their sparkle\nand seemed to send it dancing back again on to her bright fair hair. And\na sudden fancy seized her.\n\n\"'Catch,' she said to the bull, throwing a ball at him as she spoke. He\ntossed his head, and to her surprise the ball was caught on one of his\nhorns.\n\n\"'Catch,' she said again, and he had caught the second.\n\n\"'Catch,' a third time. The great creature caught it in his mouth like a\ndog, and brought it gently to the Princess and laid it at her feet. She\ntook it and half timidly stroked his head; and no one who had seen the\nsoft pathetic look which crept into his large round eyes would have\nbelieved in his being the cruel monster he had been described. He did\nnot speak, he seemed without the power to do so now, but by signs he\nmade the Princess understand it was time to continue their journey, and\nshe mounted his back as before.\n\n\"All that day the bull travelled on, but the Princess was now getting\naccustomed to her strange steed, and felt less tired and frightened. And\nwhen the sun grew hot the bull was sure to find a sheltered path, where\nthe trees shaded her from the glare, and when the road was rough he went\nthe more slowly, that she should not be shaken.\n\n\"Late in the evening the Princess heard a far-off rushing sound, that as\nthey went seemed to grow louder and louder.\n\n\"'What is that, brown bull?' she asked, feeling somehow a little\nfrightened.\n\n\"The brown bull raised his head and looked round him. Yes, the sun had\nsunk, he might speak. And in the same deep voice he answered,\n\n\"'The sea, king's daughter, the sea that is to bear you and me to my\ncountry of Norrowa.'\n\n\"'And how shall we cross it, brown bull?' she said.\n\n\"'Have no fear,' he replied. 'Lay down your head and shut your eyes, and\nno harm will come near you.'\n\n\"The Princess did as he bade her. She heard the roar of the waves come\nnearer and nearer, a cold wind blew over her face, and she felt at last\nthat her huge steed had plunged into the water, for it splashed on to\nher hand, which was hanging downwards, and then she heard him, with a\ngasp and a snort, strike out boldly. The Princess drew herself up on the\nbull's back as closely as she could; she had no wish to get wet. But she\nwas not frightened. She grew accustomed to the motion of her great\nsteed's swimming, and as she kept her eyes fast shut she did not see how\nnear she was to the water, and felt as if in a peaceful dream. And after\na while the feeling became reality, for she fell fast asleep and dreamt\nshe was in her little turret chamber, listening to the wind softly\nblowing through the casement.\n\n\"When she awoke she was alone. She was lying on a couch, but this time\nnot of moss, but of the richest and softest silk. She rubbed her eyes\nand looked about her. Was she in her father's castle? Had her youth and\nher courage softened the monster's heart, and made him carry her back\nagain to her happy home? For a moment she thought it must be so; but no,\nwhen she looked again, none of the rooms in her old home were so\nbeautiful as this one where she found herself. Not even her mother's\ngreat saloon, which she had always thought so magnificent, was to be\ncompared with it. It was not very large, but it was more like Fairyland\nthan anything she had ever dreamt of. The loveliest flowers were\ntrained against the walls, here and there fountains of delicately\nscented waters refreshed the air, the floor was covered with carpets of\nthe richest hues and the softest texture. There were birds singing among\nthe flowers, gold and silver fish sporting in the marble basins--it was\na perfect fairy's bower. The Princess sat up and looked about her. There\nwas no one to be seen, not a sound but the dropping of the fountains and\nthe soft chatter of the birds. The Princess admired it all exceedingly,\nbut she was very hungry, and as her long sleep had completely refreshed\nher, she felt no longer inclined to lie still. So she crossed the room\nto where a curtain was hanging, which she thought perhaps concealed a\ndoor. She drew aside the curtain, the door behind was already open; she\nfound herself in a second room, almost as beautiful as the first, and\nlighted in the same way with coloured lamps hanging from the roof. And\nto her great delight, before her was a table already laid for supper\nwith every kind of delicious fruit and bread, and cakes, and everything\nthat a young Princess could desire. She was so hungry that she at once\nsat down to the table, and then she perceived to her surprise that it\nwas laid for two!\n\n\"'Can the bull be coming to sup with me?' she said to herself, half\nlaughing at the idea. And she added aloud, 'Come if you like, Mr. Bull;\nI find your house very pretty, and I thank you for your hospitality.'\n\n\"And as she said the words, a voice which somehow seemed familiar to\nher, replied,\n\n\"'I thank you, gracious Princess, for your permission. Without it I\ncould not have entered your presence as I do now,' and looking up, she\nsaw, coming in by another door that she had not noticed, a most\nunexpected visitor.\n\n\"It was not the bull, it was a young Prince such as our pretty Princess,\nwho was not without her daydreams, like other young girls, had sometimes\npictured to herself as coming on a splendid horse, with his followers\naround him in gallant attire, to ask her of her parents. He was well\nmade and manly, with a bright and pleasant expression, and dressed, of\ncourse, to perfection. The Princess glanced at her plain black robe in\nvexation, and her fair face flushed.\n\n\"'I knew not,' she began. 'I thought I should see no one but the brown\nbull.'\n\n\"The Prince laughed merrily. He was in good spirits naturally, as any\none would be who, after being forced for ten years to wear a frightful\nand hideous disguise, and to behave like a rough and surly bull,\ninstead of like a well-born gentleman, should suddenly find himself in\nhis own pleasant person again.\n\n\"'I _was_ the bull,' he said, 'but you, Princess, have transformed me.\nHow can I ever show you my gratitude?'\n\n\"'You owe me none,' said the Princess gently. 'What I did was to save my\nparents and their people. If it has served you in good stead, that for\nme is reward enough. But,' she added, 'I wish I had brought some of my\npretty dresses with me. It must look so rude to you to have this ugly\nblack one.'\n\n\"The Prince begged her not to trouble herself about such a trifle--to\nhim she was beautiful as the day in whatever attire she happened to be.\nAnd then they ate their supper with a good appetite, though it seemed\nstrange to the Princess to be quite without attendants, sitting alone at\ntable with a young man whom she had never seen before.\n\n\"And after supper a new idea struck her.\n\n\"'Catch,' she said, drawing the first ball out of the little pocket in\nthe front of her dress, where she always carried her balls, and flinging\nit across the table to the Prince with her usual skill, not breaking a\nglass or bending a leaf of the flowers with which the dishes were\nadorned.\n\n\"In an instant the Prince had caught it, and as she sent off the second,\ncrying again 'Catch,' he returned her the first, leaving his hand free\nfor the third.\n\n\"'Yes,' said the Princess, after continuing this game for a little\nwhile. 'Yes, I see that you are a true Prince,' for strange to say, he\nwas as skilful at her game as she was herself.\n\n\"And they played with her balls for a long time throwing them higher and\nhigher without ever missing, and laughing with pleasure, like two merry\nchildren.\n\n\"Then suddenly the Prince started from his seat, and his face grew sad\nand grave.\n\n\"'I must go,' he said; 'my hour of liberty is over.'\n\n\"'Go?' said the Princess in surprise and distress, for she had found the\nPrince a very pleasant companion. 'You must go? and leave me alone\nhere?'\n\n\"She looked as if she were going to cry, and the Prince looked as if he\nwere going to cry too.\n\n\"'Alas, Princess!' he said, 'in my joy for the moment, I had almost\nforgotten my sad fate;' and then he went on to explain to her that for\nmany years past he had been under a fairy spell, the work of an evil\nfairy who had vowed to revenge herself on his parents for some fancied\ninsult to her. He had been forced to take the form of a bull and to\nspread terror wherever he went; and the power of this spell was to\ncontinue till he should meet with a beautiful Princess who of her own\nfree will would return with him to his country and treat him with\nfriendliness, both of which conditions had been now fulfilled.\n\n\"'Then all is right!' exclaimed the Princess joyfully. 'Why should you\nlook so sad?'\n\n\"'Alas! no,' repeated the Prince, 'the spell is but partly broken. I\nhave only power to regain my natural form for three hours every evening\nafter sunset. And for three years more must it be so. Then, if your\ngoodness continues so long, all will indeed be right. But during that\ntime it will be necessary for you to live alone, except for the three\nhours I can pass with you, in this enchanted palace of mine. No harm\nwill befall you, all your wants will be supplied by invisible hands; but\nfor a young and beautiful Princess like you, it will be a sad trial, and\none that I feel I have no right to ask your consent to.'\n\n\"'And can nothing be done?' said the Princess, 'nothing to shorten your\nendurance of the spell?'\n\n\"'Nothing,' said the Prince, sadly. 'Any effort to do so would only\ncause fearful troubles. I drop my hated skin at sunset, but three hours\nlater I must resume it.'\n\n\"He glanced towards the corner of the room where, though the Princess\nhad not before observed it, the brown bull's skin lay in a heap.\n\n\"'Hateful thing!' said the Princess, clenching her pretty hands, 'I\nwould like to burn it.'\n\n\"The Prince grew pale with fright. 'Hush! Princess,' he said. 'Never\nbreathe such words. Any rash act would have the most fearful\nconsequences.'\n\n\"'What?' said the Princess, curiously.\n\n\"The Prince came nearer her and said in a low voice, 'For _me_ they\nwould be such. In such a case I might too probably never see you more.'\n\n\"The Princess blushed. Considering that he had spent ten years as a\nbull, it seemed to her that the Prince's manners were really not to be\nfound fault with, and she promised him that she would consider the\nmatter over, and by the next evening tell him her decision.\n\n\"She felt rather inclined to cry when she found herself again quite\nalone in the great strange palace, for she was only sixteen, even though\nso brave and cheerful. But still she had nothing whatever to complain\nof. Not a wish was formed in her heart but it was at once fulfilled, for\nthis power was still the Prince's. She found, in what was evidently\nintended for her dressing-room, everything a young Princess could\npossibly desire in the shape of dresses, each more lovely than the\nothers; shoes of silk or satin, exquisitely embroidered to suit her\nvarious costumes; laces and shawls, ribbons and feathers, and jewels of\nevery conceivable kind in far greater abundance than so sensible a young\nlady found at all necessary. But believing all these pretty things to be\nprovided to please her by the Prince's desire, she endeavoured to amuse\nherself with them, and found it rather interesting for the first time in\nher life to have to choose for herself. Her breakfasts and dinners, and\neverything conceivable in the shape of delicate and delicious food,\nappeared whenever she wished for anything of the kind; invisible hands\nopened the windows and shut the doors, lighted the lamps when the\nevening closed in, arranged her long fair hair more skilfully than any\nmortal maid, and brushed it softly when at night she wished to have it\nunfastened. Books in every language to interest her, for the Princess\nhad been well taught, appeared on the tables, also materials for\npainting and for embroidery, in which she was very clever. Altogether it\nwas impossible to complain, and the next day passed pleasantly enough,\nthough it must be confessed the young Princess often found herself\ncounting the hours till it should be that of sunset.\n\n\"Punctual to the moment the Prince made his appearance, but to his\nguest's distress he seemed careworn and anxious.\n\n\"'Has some new misfortune threatened you?' she asked.\n\n\"'No,' replied the Prince, 'but I have to-day scarcely been able to\nendure my anxiety to learn your decision. Never in all these terrible\nyears has my suffering been greater, never have I so loathed the hideous\ndisguise in which I am compelled to live.'\n\n\"Tears filled the Princess's eyes. Had anything been wanting to decide\nher, the deep pity which she now felt for the unfortunate Prince would\nhave done so.\n\n\"'I _have_ decided!' she exclaimed. 'Three years will soon pass, and I\nshall be well able to amuse myself with all the charming things with\nwhich I am surrounded. Besides, I shall see you every day, and the\nlooking forward to that will help to cheer me.'\n\n\"It would be impossible to tell the Prince's delight. He became at once\nas gay and lively as the day before. The Princess and he had supper\ntogether, and amused themselves afterwards with the enchanted balls, and\nthe evening passed so quickly that the princess could hardly believe\nmore than one hour instead of three had gone, when he started up, saying\nhis time was over. It was sad to see him go, forced, through no fault of\nhis own, to return to his hated disguise; but still it was with a\nlightened heart that the poor brown bull went tramping about during the\nnext one-and-twenty hours.\n\n\"And on her side the Princess's lonely hours were cheered by the thought\nthat she was to be the means of freeing him from the power of the\nterrible spell, for all that she saw of him only served to increase her\nsympathy and respect.\n\n\"So time went on. The Princess got more and more accustomed to her\nstrange life, and every day more attached to the Prince, who on his side\ncould not do enough to prove to her his gratitude. For many weeks he\nnever failed to enter her presence the instant the sun had sunk below\nthe horizon, and the three hours they spent together made amends to both\nfor the loneliness of the rest of the day. And whenever the Princess\nfelt inclined to murmur, she renewed her patience and courage by the\nthought of how much harder to bear was the Prince's share of the trial.\nShe was allowed to remain in peaceful security, and to employ her time\nin pleasant and interesting ways; while he was forced to rove the world\nas a hateful monster, shunned by any of the human race whom he happened\nto meet, constantly exposed to fatigue and privation.\n\n\"Sometimes they spent a part of the evening in the beautiful gardens\nsurrounding the palace. There, one day, as sunset was approaching, the\nPrincess had betaken herself to wait the Prince's arrival, when a sad\nshock met her. It was past the usual hour of his coming. Several times\nshe had wandered up and down the path by which he generally approached\nthe castle, tossing her balls as she went, for more than once he had\nseen their glitter from a distance, and known by it that she was\nwaiting. But this evening she waited and watched in vain, and at last, a\nstrange anxiety seizing her, she turned towards the castle to see if\npossibly he had entered from the other side, and was hurrying back when\na low moan reached her ears, causing her heart for an instant almost to\nleave off beating with terror.\n\n\n\n\nCHAPTER X. THE END OF THE BROWN BULL.\n\n          \"'And happy they ever lived after'--\n            Yes, that was the end of the tale.\"\n\n\n\"The Princess collected her courage, and turned in the direction of the\nsound. It seemed to come from a little thicket of close-growing bushes\nnear which she had been passing. For a minute or two she could\ndistinguish nothing, but another moan guided her in the right direction,\nand there, to her horror and distress, she saw the poor Prince lying on\nthe ground, pale and death-like. At first she thought he was without\nconsciousness, but when she hastened up to him with a cry, he opened his\neyes.\n\n\"'Ah!' he said, faintly; 'I never thought I should have escaped alive.\nHow good of you to have come to seek for me, Princess; otherwise I might\nhave died here without seeing you again.'\n\n\"'But you must not die,' said the Princess, weeping; 'can nothing be\ndone for you?'\n\n\"He tried to sit up, and when the Princess had fetched him some water\nfrom one of the numerous springs in the garden, he seemed better. But\nhis right arm was badly injured.\n\n\"'How did it happen?' asked the Princess. 'I thought no mortal weapon\nhad power to hurt you. That has been my only consolation through these\nlonely days of waiting.'\n\n\"'You are right,' replied the Prince; 'as a bull nothing can injure me,\nbut in my own form I am in no way magically preserved. All day long I\nhave been chased by hunters, who saw in me, I suppose, a valuable prize.\nI was terrified of the hour of sunset arriving and finding me far from\nhome. I used my utmost endeavour to reach this in time, but, alas! I was\novercome with fatigue, from which no spell protects me. At the entrance\nto these gardens I saw the sun disappear, and I fell exhausted, just as\nan arrow struck my right arm at the moment of my transformation. All I\ncould do was to crawl in among these bushes, and here I have lain,\nthankful to escape from my persecutors, and most thankful to the happy\nthought, Princess, which brought you this way.'\n\n\"The Princess, her eyes still full of tears, helped him to the palace,\nwhere she bound up his arm and tended him carefully, for, young as she\nwas, she had learnt many useful acts of this kind in her father's\ncastle. The wound was not a very serious one; the Prince was suffering\nmore from exhaustion and fatigue.\n\n\"'If I could spend a day or two here in peace,' he said sadly, 'I should\nquickly recover. But, alas! that is impossible. I must submit to my\ncruel fate. But this night I must confine my wanderings to the forests\nin this neighbourhood, where, perhaps, I may be able to hide from the\nhuntsmen, who, no doubt, will be watching for me.'\n\n\"He sighed heavily, and the Princess's heart grew very sad.\n\n\"'I have little more than an hour left,' he said.\n\n\"'Yes,' said the Princess, 'sleep if you can; I will not disturb you.'\n\n\"And when she saw that he had fallen asleep she went into the other\nroom, where in a corner lay the bull's skin, which the Prince had\ndragged behind him from the spot where it had fallen off as the sun\nsank.\n\n\"The Princess looked at it with a fierce expression, very different to\nthe usual gentle look in her pretty eyes.\n\n\"'Hateful thing!' she said, giving it a kick with her little foot; 'I\nwonder how I could get rid of you. Even if the Prince did risk never\nseeing me again, I am not sure but that it would be better for him than\nto lead this dreadful life.'\n\n\"And as her fancy pictured her poor Prince forced in this monstrous\ndisguise to wander about all night tired and shelterless, her\nindignation rose beyond her control. She forgot where she was, she\nforgot the magic power that surrounded her, she forgot everything except\nher distress and anxiety.\n\n\"'Hateful thing!' she repeated, giving the skin another kick; 'I wish\nyou were burnt to cinders.'\n\n\"Hardly had she said the words when a sudden noise like a clap of\nthunder shook the air; a flash of lightning seemed to glance past her\nand alight on the skin, which in an instant shrivelled up to a cinder\nlike a burnt glove. Too startled at first to know whether she should\nrejoice or not, the Princess gazed at her work in bewilderment, when a\nvoice of anguish, but, alas! a well-known voice, made her turn round. It\nwas the Prince, hastening from the palace with an expression half of\nanger half of sorrowful reproach on his face.\n\n\"'O Princess, Princess,' he cried, 'what have you done? But a little\nmore patience and all might have been well. And now I know not if I\nshall ever see you again.'\n\n\"'O Prince, forgive me, I did not mean it,' sobbed the poor Princess. 'I\n_will_ see you again, and all shall yet be well.'\n\n\"'Seek for me across the hill of ice and the sea of glass,' said the\nPrince; but almost before the words had passed his lips a second\nthunderclap, louder and more terrific than the first, was heard. The\nPrincess sank half fainting on the ground. When she again opened her\neyes, Prince, palace, everything had disappeared. She was alone, quite\nalone, on a barren moorland, night coming on, and a cold cutting wind\nfreezing the blood in her veins. And she was clothed in the plain black\ndress with which she had made her strange journey riding on the brown\nbull.\n\n\"It must be a dream, she thought, a terrible dream, and she shut her\neyes again. But no, it was no dream, and soon her courage revived, and\nshe began to ask herself what she should do.\n\n\"'Seek me beyond the hill of ice and the sea of glass,' the Prince had\nsaid; and she rose up to begin her weary journey. As she rose her hand\ncame in contact with something hard in the folds of her dress; it was\nher golden balls. With the greatest delight she took them out of her\npocket and looked at them. They were as bright and beautiful as ever,\nand the fairy's prophecy returned to the Princess's mind.\n\n\"'With my balls and my ready wit I shall yet conquer the evil powers\nthat are against my poor Prince,' she said to herself cheerfully.\n'Courage! all will be well.\"\n\n\"But there were sore trials to go through in the first place. The\nPrincess set off on her journey. She had to walk many weary miles across\nthe moor, the cold wind blowing in her face, the rough ground pricking\nher tender feet. But she walked on and on till at last the morning broke\nand she saw a road before her, bordered on one side by a forest of\ntrees, for she had reached the extreme edge of the moor. She had gone\nbut a little way when she came to a small and miserable hovel, from\nwhich issued feeble sounds of distress. The Princess went up to the door\nand looked in--a very old woman sat huddled up in a corner weeping and\nlamenting herself.\n\n\"'What is the matter, my friend?' asked the Princess.\n\n\"'Matter enough,' replied the old woman. 'I cannot light my fire, and I\nam bitterly cold. Either the sticks are wet, or the strength has gone\nout of my poor old arms.'\n\n\"'Let me help you,' said the Princess. 'My arms are strong enough.'\n\n\"She took the sticks and arranged them cleverly in the fireplace, and\njust as she was choosing two of the driest to rub together to get a\nlight, one of her balls dropped out of her pocket. It fell on to the\npiled-up wood, and immediately a bright flame danced up the chimney. The\nPrincess picked up her ball and put it back in her pocket, cheered and\nencouraged by this proof of their magic power. The old woman came near\nto the fire, and stretched out her withered hands to the blaze.\n\n\"'What can I do for you, my pretty lady,' she said, 'in return for your\ngood nature?'\n\n\"'Give me a cup of milk to refresh me for my journey,' said the\nPrincess. 'And perhaps, too, you can tell me something about my journey.\nAre the hill of ice and the sea of glass anywhere in this\nneighbourhood?'\n\n\"The old woman smiled and nodded her head two or three times.\n\n\"'Seven days must you travel,' she said, 'before you see them. At the\nfoot of the hill of ice lies the sea of glass. No mortal foot unaided\nhas ever crossed the one or ascended the other. Here, take these\nshoes--with them you can safely walk over the sea of glass, and with\nthis staff you can mount the hill of ice,' and as she spoke she handed\nto the Princess a pair of curiously carved wooden shoes and a short\nsharp-pointed stick. The Princess took them gratefully, and would have\nthanked the old woman, whom she now knew to be a fairy, but she stopped\nher. \"'Think not,' she said, 'that your difficulties will be over when\nyou have reached the summit of the hill of ice. But all I can do for you\nmore is to give you this nut, which you must open in your moment of\nsorest perplexity.'\n\n\"And as the Princess held out her hand for the nut the old woman had\ndisappeared.\n\n\"But refreshed and encouraged the Princess left the cottage, carrying\nwith her her three gifts, and prepared to face all the perils of her\njourney with an undaunted heart.\n\n\"It would be impossible to describe all she went through during the\nseven days which passed before she reached the sea of glass. She saw\nsome strange and wonderful sights, for in those days the world was very\ndifferent from what it is now. She was often tired and hungry, thankful\nfor a cup of milk or crust of bread from those she happened to meet on\nthe way. But her courage never failed her, and at last, on the morning\nof the eighth day, she saw shining before her in the sunlight the great\nsilent sea of glass of which she had been told.\n\n\"It would have been hopeless to attempt to cross it without fairy aid,\nfor it was polished more brightly than any mirror, and so hard that no\nyoung Princess's bones could have borne a fall on its cruel surface. But\nwith the magic shoes there was less than no difficulty, for no sooner\nhad the Princess slipped her feet into them than they turned into\nskates, and very wonderful skates, for they possessed the power of\nenabling their wearer to glide along with the greatest swiftness. The\nPrincess had never skated in her life, and she was delighted.\n\n\"'Next to flying,' she said to herself, 'nothing could be pleasanter,'\nand she was almost sorry when her skim across the sea of glass was over,\nand she found herself at the foot of the hill of ice.\n\n\"She looked upwards with something like despair. It was a terrible\nascent to attempt, for the mountain was all but straight, so steep were\nits sides of hard, clear, sparkling ice. The Princess looked at her\nfeet, the magic shoes had already disappeared; she looked at the staff\nshe still held in her hand--how could a stick help her up such a\nmountain? and half impatiently, half hopelessly, she threw it from her.\nInstantly it stretched itself out, growing wider and wider, the notches\nin the wood expanding, till it had taken the shape of a roughly-made\nladder of irregular steps, hooked on to the ice by the sharp spike at\nits end, and the Princess, ashamed of her discouragement, mounted up the\nsteps without difficulty, and as she reached the top one, of itself the\nladder pushed up before her, so that she could mount straight up without\nhesitation.\n\n\"She stepped forward bravely. It took a long time, even though she had\nthe fairy aid, and by the time she reached the top of the hill night had\nfallen, and but for the light of the stars, she would not have known\nwhere to step. A long plain stretched before her--no trees or bushes\neven broke the wide expanse. There was no shelter of any kind, and the\nPrincess found herself obliged to walk on and on, for the wind was very\ncold, and she dared not let herself rest. This night and the next day\nwere the hardest part of all the journey, and seemed even more so,\nbecause the Princess had hoped that the sea of glass and the hill of ice\nwere to be the worst of her difficulties. More than once she was tempted\nto crack the nut, the last of the old woman's presents, but she\nrefrained, saying to herself she might yet be in greater need, and she\nwalked on and on, though nearly dead with cold and fatigue, till late in\nthe afternoon. Then at last, far before her still, she saw gleaming the\nlights of a city, and, encouraged by the sight, she gathered her courage\ntogether and pressed on, till, at the door of a little cottage at the\noutskirts of the town, she sank down with fatigue. An old woman, with a\nkind face, came out of the house and invited her to enter and rest.\n\n\"'You look sorely tired, my child,' she said. 'Have you travelled far?'\n\n\"'Ah yes!' replied the poor Princess, 'very far. I am nearly dead with\nfatigue;' and indeed she looked very miserable. Her beautiful fair hair\nwas all tumbled and soiled, her poor little feet were scratched and\nblistered, her black dress torn and draggled--she looked far more like a\nbeggar-maiden than like a princess. But yet, her pretty way of speaking\nand gentle manners showed she was not what she seemed, and when she had\nwashed her face and combed her hair, the old woman looked at her with\nadmiration.\n\n\"'Tis a pity you have not a better dress,' she said, 'for then you could\nhave gone with me to see the rejoicings in the town for the marriage of\nour Prince.'\n\n\"'Is your Prince to be married to-day?' asked the Princess.\n\n\"'No, not to-day--to-morrow,' said the old woman. 'But the strange thing\nis that it is not yet known who is to be his bride. The Prince has only\nlately returned to his home, for, for many years, he has been shut up by\na fairy spell in a beautiful palace in the north, and now that the spell\nis broken and he is restored to his parents, they are anxious to see him\nmarried. But he must still be under a spell of some kind, they say, for\nthough he has all that heart can wish, he is ever sad and silent, and as\nif he were thinking of something far away. And he has said that he will\nmarry no princess but one who can catch three golden balls at a time, as\nif young princesses were brought up to be jugglers! Nevertheless, all\nthe princesses far and wide have been practising their best at catching\nballs, and to-morrow the great feasts are to begin, and she who catches\nbest is to be chosen out of all the princesses as the bride of our\nPrince.'\n\n\"The poor Princess listened with a beating heart to the old woman's\ntalk. There could be no doubt as to who the Prince of this country was.\n\n\"'I have come but just in time,' she said to herself, and then she\nrose, and thanking her hostess for her kindness, said she must be going.\n\n\"'But where are you going, you poor child?' said the old woman. 'You\nlook far too tired to go farther and for two or three days all these\nrejoicings will make the country unpleasant for a young girl to travel\nthrough alone. Stay with me till you are rested.'\n\n\"The Princess thanked her with tears in her eyes for her kindness. 'I\nhave nothing to reward you with,' she said, 'but some day I may be able\nto do so' and then she thankfully accepted her offer.\n\n\"'And to-morrow,' said the old woman, 'you must smarten yourself up as\nwell as you can, and then we shall go out to see the gay doings.'\n\n\"But the Princess lay awake all night thinking what she should do to\nmake herself known to her faithful Prince.\n\n\"The next day the old woman went out early to hear all about the\nfestivities. She came back greatly excited.\n\n\"'Come quickly,' she said. 'The crowd is so great that no one will\nnotice your poor clothes. And, indeed, among all the pretty girls there\nwill be none prettier than you,' she added, looking admiringly at the\nPrincess, who had arranged her beautiful hair and brushed her soiled\ndress, and who looked sweeter than ever now that she was rested and\nrefreshed. 'There are three princesses who have come to the feast,' she\nwent on, 'the first from the south, the second from the east, the third\nfrom the west, each more beautiful than another, the people say. The\ntrial of the golden balls is to be in the great hall of the palace, and\na friend of mine has promised me a place at one of the windows which\noverlook it, so that we can see the whole;' and the Princess, feeling as\nif she were in a dream, rose up to accompany the old woman, her balls\nand her precious nut in her pocket.\n\n\"They made their way through the crowd and placed themselves at the\nwindow, as the old woman had said. The Princess looked down at the great\nhall below, all magnificently decorated and already filled with\nspectators. Suddenly the trumpet sounded, and the Prince in whose honour\nwas all the rejoicing entered. At sight of him--her own Prince indeed,\nbut looking so strangely pale and sad that she would hardly have\nrecognised him--the Princess could not restrain a little cry.\n\n\"'What is it?' said the old woman.\n\n\"'A passer-by trod on my foot,' said the Princess, fearful of attracting\nattention. And the old woman said no more, for at this moment another\nblast of trumpets announced the arrival of the princesses, who were to\nmake the trial of the balls. The first was tall and dark, with raven\ntresses and brilliant, flashing eyes. She was dressed in a robe of rich\nmaize colour, and as she took her place on the dais she looked round\nher, as if to say, 'Who can compete with me in beauty or in skill?' And\nshe was the Princess of the south.\n\n\"The second was also tall, and her hair was of a deep rich brown, and\nher eyes were sparkling and her cheeks rosy. She was dressed in bright\npink, and laughed as she came forward, as if sure of herself and her\nattractions. And she was the Princess of the east.\n\n\"The third moved slowly, and as if she cared little what was thought of\nher, so confident was she of her pre-eminence. She wore a blue robe, and\nher face was pale and her eyes cold, though beautiful. And her hair had\na reddish tinge, but yet she too was beautiful. And she was the Princess\nof the west.\n\n\"The Prince bowed low to each, but no smile lit up his grave face, and\nhis glance rested but an instant on each fair Princess as she\napproached.\n\n\"'Are these ladies all?' he asked, in a low voice, as if expecting yet\nmore. And when the answer came, 'Yes, these are all,' a still deeper\nmelancholy settled on his face, and he seemed indifferent to all about\nhim.\n\n\"Then the trial began. The Prince had three golden balls, one of which\nhe offered to each Princess. They took them, and each threw one back to\nhim. Then one after another, as quick as lightning, he threw all three\nto the yellow Princess. She caught them all and threw them back; again\nhe returned them, but the first only, reached her hand, the second and\nthird fell to the ground, and with another low bow the Prince turned\nfrom her, and her proud face grew scarlet with anger. The pink Princess\nfared no better. She was laughing so, as if to show her confidence, that\nshe missed the third ball, even at the first throw, and when the Prince\nturned also from her she laughed again, though this time her laughter\nwas not all mirth. Then the cold blue Princess came forward. She caught\nthe balls better, but at the third throw, one of them rising higher than\nthe others, she would not trouble herself to stretch her arm out\nfarther, so it fell to the ground, and as the Prince turned from her\nlikewise, a great silence came over the crowd.\n\n\"Suddenly a cry arose. 'A fourth Princess,' the people shouted, and the\nold woman up at the window was so eager to see the new-comer that she\ndid not notice that her companion had disappeared. She had watched the\nfailure of the two first Princesses, then seeing what was coming she had\nquietly made her way through the crowd to a hidden corner behind the\ngreat pillars of the hall. There, her hands trembling with eagerness,\nshe drew forth from the magic nut, which she had cracked with her pretty\nteeth, a wonderful fairy robe of spotless white. In an instant her black\ndress was thrown to her feet, and the white garment, which fitted her as\nif by magic, had taken its place. Never was Princess dressed in such a\nhurry, but never was toilette more successful. And as the cry arose of\n'A fourth Princess' she made her way up the hall. From one end to the\nother she came, rapidly making her way through the crowd, which cleared\nbefore her in surprise and admiration, for as she walked she threw\nbefore her, catching them ever as she went, her golden balls. Her fair\nhair floated on her shoulders, her white robe gleamed like snow, her\nsweet face, flushed with hope and eagerness, was like that of a happy\nchild, her eyes saw nothing but the one figure standing at the far end\nof the hall, the figure of the Prince, who, as the cry reached his\nears, started forward with a hope he hardly dared encourage, holding out\nhis hands as she came nearer and yet nearer in joyfulness of welcome.\n\n\"But she waved him back--then, taking her place where the other\nPrincesses had stood, she threw her balls, one, two, three; in an\ninstant they were caught by the Prince, and returned to her like flashes\nof lightning over and over again, never failing, never falling, as if\nattached by invisible cords, till at last a great cry arose from the\ncrowds, and the Prince led forward, full in the view of the people, his\nbeautiful bride, his true Princess.\n\n\"Then all her troubles were forgotten, and every one rejoiced, save\nperhaps the three unsuccessful Princesses, who consoled themselves by\nsaying there was magic in it, and so possibly there was. But there is\nmore than one kind of magic, and some kinds, it is to be hoped, the\nworld will never be without. And messengers were sent to summon to the\nwedding the father and mother of the Princess, who all this time had\nbeen in doubt and anxiety as to the fate of their dear child. And the\nkind old woman who had sheltered her in her poverty and distress was not\nforgotten.\"\n\nThe voice stopped--for a minute or two the children sat silent, not\nsure if they were to hear anything else. Strangely enough, as the story\nwent on, it seemed more and more as if it were Marcelline's voice that\nwas telling it, and at last Hugh looked up to see if it was still the\nwhite lady, whose knee his head was resting on. Jeanne too looked up at\nthe same moment, and both children gave a little cry of surprise. The\nwhite lady had disappeared, and it was indeed Marcelline who was in her\nplace. The white room, the white chairs, the white cats, the\nspinning-wheel, and the pointed windows, had all gone, and instead there\nwas old Marcelline with her knitting-needles gently clicking in a\nregular way, that somehow to Hugh seemed mixed up with his remembrance\nof the soft whirr of the wheel, her neatly frilled cap round her face,\nand her bright dark eyes smiling down at the children. Hugh felt so\nsorry and disappointed that he shut his eyes tight and tried to go on\ndreaming, if indeed dreaming it was. But it was no use. He leant his\nface against Marcelline's soft white apron and tried to fancy it the\nfairy lady's fairy robe; but it was no use. He had to sit up and look\nabout him.\n\n\"Well,\" said Marcelline, \"and didn't you like the story?\"\n\nHugh looked at Jeanne. It couldn't be a dream then--there _had_ been a\nstory, for if he had been asleep, of course he couldn't have heard it.\nHe said nothing, however--he waited to see what Jeanne would say. Jeanne\ntossed back her head impatiently.\n\n\"Of course I liked it,\" she said. \"It's a beautiful story. But,\nMarcelline, how did you turn into yourself--_was_ it you all the time?\nWhy didn't you leave us with the white lady?\"\n\nHugh was so pleased at what Jeanne said that he didn't mind a bit about\nMarcelline having taken the place of the white lady. Jeanne was the same\nas he was--that was all he cared about. He jumped up eagerly--they were\nin Jeanne's room, close to the fire, and both Jeanne and he had their\nlittle red flannel dressing-gowns on.\n\n\"How did these come here?\" he said, touching the sleeve of his own one.\n\n\"Yes,\" said Jeanne. \"And where are our wings, if you please, Mrs.\nMarcelline?\"\n\nMarcelline only smiled.\n\n\"I went to fetch you,\" she said, \"and of course I didn't want you to\ncatch cold on the way back.\"\n\nBut that was _all_ they could get her to say, and then she carried them\noff to bed, and they both slept soundly till morning.\n\n\n\n\nCHAPTER XI. DUDU'S OLD STORY.\n\n          \"It was not a story, however,\n           But just of old days that had been.\"\n                          CHILD NATURE.\n\n\nIt was queer, but so it was. The children said very little to each other\nthe next day of their new adventures. Only Hugh felt satisfied that this\ntime little Jeanne had forgotten nothing; daylight Jeanne and moonlight\nJeanne were the same. Yet he had a feeling that if he said much about\nit, if he persisted in trying to convince Jeanne that he had been right\nall through, he might spoil it all. It would be like seizing the fairy\nlady's cobweb threads roughly, and spoiling them, and finding you had\nnothing left. He felt now quite content to let it all be like a pretty\ndream which they both knew about, but which was not for everyday life.\n\nOnly one impression remained on his mind. He got the greatest wish to\nlearn to throw balls like the princess of the Brown Bull story, and for\nsome days every time they went out, he kept peering in at the toy-shop\nwindows to see if such a thing as golden balls was to be had. And at\nlast Jeanne asked him what he was always looking for, and then he told\nher.\n\nShe agreed with him that golden balls would be a very pretty play, but\nshe was afraid such a thing could not be found.\n\n\"They were fairy balls, you know, Chéri,\" she said, gravely.\n\n\"Yes,\" Hugh replied, \"he knew they were; he did not expect such balls as\nthey were, of course, but still he didn't see why they might not get\nsome sort of gold-looking balls. There were red and blue, and green ones\nin plenty. He didn't see why there should be no gold ones.\"\n\n\"Gold is so very dear,\" said Jeanne.\n\n\"Yes, real gold is, of course,\" said Hugh; \"but there are lots of things\nthat look like gold that can't be real gold--picture frames, and the\nedges of books, and lots of other things.\"\n\n\"Yes,\" said Jeanne, \"but still, I don't see that the stuff any of those\nare made of would do to make balls of.\"\n\nHowever, she joined Hugh in the search, and many a day when they were\nout they peeped together not only into the toy-shops, but into the\nwindows of the queer old curiosity shops, of which, in the ancient town\nwhich was Jeanne's home, there were many. And at last one day they told\nMarcelline what it was they were so anxious to find. She shook her head.\nThere was no such toy in _this_ country, she said, but she did not laugh\nat them, or seem to think them silly. And she advised them to be content\nwith the prettiest balls they _could_ get, which were of nice smooth\nbuff-coloured leather, very well made, and neither too soft nor too\nhard. And in the sunlight, said Jeanne, they really had rather a shiny,\ngoldy look.\n\nFor several days to come these balls were a great interest to the\nchildren. Early and late they were practising at them, and, with\npatience and perseverance, they before long arrived at a good deal of\nskill. Jeanne was the quicker in the first place, but Hugh was so\npatient that he soon equalled her, and then the interest grew still\ngreater.\n\n\"I really think, Chéri,\" said Jeanne, one evening, when they had been\nplaying for a good while, \"I really think our balls are _getting_ to be\nrather like fairy ones. Every day they go better and better.\"\n\n\"Perhaps it is our hands that are getting to be like fairy ones,\" said\nHugh. \"But it is growing too dark to see to play any more.\"\n\nThey were playing in the tapestry room, for Marcelline had told them\nthey would have more space there, as it was large, and Hugh's little bed\nin the corner did not take up much room. It was getting dusk, for the\ndays were not yet very long, though winter was almost over, and they had\nbeen playing a good while. As Hugh spoke he gave the last ball a final\nthrow high up in the air, higher than usual, for though Jeanne sprang\nforward to catch it, she missed it somehow. It dropped to the ground\nbehind her.\n\n\"O Chéri!\" she cried, reproachfully, \"that is the first time I have\nmissed. Oh dear, where can the ball have gone to?\"\n\nShe stooped down to look for it, and in a minute Hugh was down beside\nher. They felt all about, creeping on their hands and knees, but the\nmissing ball was not to be so easily found.\n\n['IS THIS A NEW PART OF THE HOUSE?']\n\n\"It must have got behind the tapestry,\" said Hugh, pulling back as he\nspoke, a corner of the hangings close to where he and Jeanne were,\nwhich seemed loose. And at the same moment both children gave a little\ncry of astonishment. Instead of the bare wall which they expected to\nsee, or to feel rather, behind the tapestry, a flight of steps met their\nview--a rather narrow flight of steps running straight upwards, without\ntwisting or turning, and lighted from above by a curious hanging lamp,\nhanging by long chains from a roof high up, which they could not see.\n\n\"Why, is this a new part of the house?\" cried Hugh. \"Jeanne, did you\nknow there were stairs behind the tapestry?\"\n\n\"No, of course not,\" said Jeanne. \"It must be a part of our house, I\nsuppose, but I never saw it before. Shall we go up, Chéri, and see where\nit takes us to? Perhaps it's another way to the white lady's turret, and\nshe'll tell us another story.\"\n\n\"No,\" said Hugh, \"I don't believe it leads to her turret, and I don't\nthink we could find our way there again. She seemed to mean we could\nnever go again, I think. But we may as well go up this stair, and see\nwhat we do find, Jeanne.\"\n\nAnd just at that moment a funny thing happened. They heard a little\nnoise, and looking up, there--hopping down the stair before them, step\nby step, as if some one had started it from the top, came the lost\nball, or what the children thought the lost ball, for with an\nexclamation Hugh darted forward to pick it up, and held it out to\nJeanne. But Jeanne looked at it with astonishment.\n\n\"Why, Chéri,\" she cried, \"it's turned into gold.\"\n\nSo it was, or at least into something which looked just like it.\n\n\"Chéri,\" Jeanne went on, her eyes dancing with excitement, \"I do believe\nthis is another way into Fairyland, or into some other queer place like\nwhat we've seen. Come on, quick.\"\n\nThe children seized hold of each other's hands, and hurried up the\nstair. The steps were easier to mount than those of the corkscrew\nstaircase up to the white lady's turret, and very soon the children\nfound themselves at the top of the first flight. There, looking upwards,\nthey could see the roof. It was a sort of cupola; the chains from which\nthe lamps hung were fastened to the centre, but the rest of the roof was\nof glass, and through it the children saw the sky, already quite dark,\nand with innumerable stars dotting its surface.\n\n\"Come on, Chéri,\" said Jeanne; \"I believe this stair leads out on to the\nroof of the house.\"\n\nSo it did. A door at the top opened as they ran up the last steps, and a\nfamiliar figure stepped out.\n\n\"Dudu!\" exclaimed Jeanne, in a tone of some disappointment.\n\n\"Did you not expect to see me?\" said the raven. \"Why, I thought it would\namuse you to come up here and see the stars.\"\n\n\"So it will,\" said Hugh, anxious to make up for Jeanne's abruptness.\n\"But, you see, we thought--at least we hoped--we should find some new\nadventures up here, especially when the ball hopped down the stairs, all\ngold.\"\n\n\"What did you expect?\" said Dudu, cocking his head. \"Fairies, I suppose,\nor enchanted princesses, or something of that kind. What creatures\nchildren are for wonders, to be sure.\"\n\n\"Now, Dudu,\" said Jeanne, \"you needn't talk that way. Whether we're fond\nof wonders or not, anyhow it's you that's given us them to be fond of.\nIt was you that sent us to the frogs' country, and all that, and it was\nyou that took us to hear the white lady's story. So you're not to laugh\nat us, and you must find us some more adventures, now you've brought us\nup here.\"\n\n\"Adventures don't grow on every tree, Mademoiselle Jeanne,\" remarked\nDudu.\n\n\"Well, _Dudus_ don't either,\" replied Jeanne; \"but as we've got _you_,\nyou see, it all depends on you to get us the adventures. I know you can,\nif you like.\"\n\nDudu shook his head.\n\n\"No,\" he said, \"there are many things I can't do. But come out on to the\nroof, we can talk there just as well.\"\n\nHe just turned towards the door by which he had entered, and it opened\nof itself. He hopped through, and the children followed him. They found\nthemselves, as Dudu had said, on the roof of the house, of a part of the\nhouse, that is to say. It seemed more like the roof of a little tower or\nturret.\n\nHugh and Jeanne stood for a moment or two in silence, looking up at the\nbrilliant show of stars overhead. It was not cold, the air seemed\npeculiarly fresh and sweet, as if it were purer and finer than that\nlower down.\n\n\"It's rather nice up here, eh?\" said Dudu.\n\n\"Yes, very,\" replied Hugh. \"We're very much obliged to you for bringing\nus up here. Aren't we, Jeanne?\"\n\n\"Yes,\" said Jeanne, \"not counting fairies and adventures that's to say,\nit's very nice up here.\"\n\n\"I often come up here at night,\" said Dudu. \"I wonder how many thousand\ntimes I've been up here.\"\n\n\"Are you so very old, Dudu?\" said Jeanne, \"as old as the white lady?\"\n\n\"I daresay,\" said Dudu, vaguely--he seemed to be thinking to himself.\n\"Yes,\" he continued, cocking his head on one side, \"I suppose I am what\n_you_ would call very old, though the white lady would consider me quite\na baby. Yes, I've seen queer things in my time.\"\n\n\"_What?_\" said the children both together, eagerly, \"oh, do tell us some\nof them. If you would tell us a story, Dudu, it would be as nice as an\nadventure.\"\n\n\"Stories,\" said Dudu, \"are hardly in my line. I might tell you a little\nof some things I've seen, but I don't know that they would interest\nyou.\"\n\n\"Oh yes! oh yes!\" cried the children, \"of course they would. And it's so\nnice and warm up here, Dudu--much warmer than in the house.\"\n\n\"Sit down, then,\" said Dudu, \"here, in this corner. You can lean against\nthe parapet,\"--for a low wall ran round the roof--\"and look at the stars\nwhile you listen to me. Well--one day, a good long while ago you would\nconsider it, no doubt----\"\n\n\"Was it a hundred years ago?\" interrupted Jeanne.\n\n\"About that, I daresay,\" said the raven carelessly. \"I cannot be quite\nexact to twenty or thirty years, or so. Well, one day--it was a very hot\nday, I remember, and I had come up here for a little change of air--I\nwas standing on the edge of the parapet watching our two young ladies\nwho were walking up and down the terrace path down there, and thinking\nhow nice they looked in their white dresses and blue sashes tied close\nup under their arms, like the picture of your great-grandmother as a\nyoung girl, in the great salon, Mademoiselle Jeanne.\"\n\n\"Oh yes, I know it,\" said Jeanne. \"She has a nice face, but _I_ don't\nthink her dress is at all pretty, Dudu.\"\n\n\"And I don't suppose your great-grandmother would think yours at all\npretty, either, Mademoiselle Jeanne,\" said Dudu, with the queer sort of\ncroak which he used for a laugh. \"It is one of the things that has\namazed me very much in my observations--the strange fancies the human\nrace has about clothes. Of course you are not so fortunate as we are in\nhaving them ready-made, but still I cannot understand why you don't do\nthe best you can--adopt a pattern and keep to it always. It would be the\nnext best thing to having feathers, _I_ should say.\"\n\n\"I don't think so,\" said Jeanne. \"It would be very stupid every morning\nwhen you got up, and every time you were going out, or friends coming to\nsee you, or anything like that--it would be _very_ stupid never to have\nto think, 'What shall I put on?' or to plan what colours would look nice\ntogether. There would hardly be any use in having shops or dressmakers,\nor anything. And _certainly_, Monsieur Dudu, I wouldn't choose to be\ndressed like you, never anything but black--as if one were always going\nto a funeral.\"\n\n\"It is all a matter of taste, Mademoiselle,\" replied Dudu, so amiably\nthat Hugh wondered more and more at his politeness to Jeanne, who was\ncertainly not very civil to him. \"For my part, I confess I have always\nhad a great fancy for white--the force of contrast, I suppose--and this\nbrings me back to telling you how very nice your great-grandmother and\nher sister looked that day walking up and down the terrace path in their\nwhite dresses.\"\n\n\"My great-grandmother!\" exclaimed Jeanne. \"Why, you said 'our young\nladies.'\"\n\n\"So they were our young ladies,\" replied Dudu. \"Even though one was your\ngreat-grandmother, Mademoiselle, and not yours only but Monsieur Chéri's\ntoo, and the other, of course, your great-grand-aunt. There have been\nmany 'our young ladies' that I can remember in this house, which has so\nlong been the home of one family, and my home always. In three or four\nhundred years one sees a good deal. Ah yes! Well, as I was saying, I was\nstanding on the edge of the parapet looking over at the young ladies,\nand admiring them and the sunshine and the flowers in the garden all at\nonce, when I suddenly heard a window open. It was not one of the windows\nof our house. I have very quick ears, and I knew that in an instant, so\nI looked about to see what window it was. In those days there were not\nquite so many houses behind our garden as there are now. Your\ngreat-great-grandfather sold some of the land about that time, and then\nhouses were built, but just then there were only two or three that\noverlooked one side of the garden. One of them was a large high house,\nwhich was let in flats to various families, often visitors to the town,\nor strangers who had come for a short time for the education of their\nchildren, or some other reason. It was not long before I discovered\nthat the window I had heard open was in this house. It was one on the\nsecond story, looking on to a little balcony which at one end was not\nvery high above the terrace walk. I watched to see who had opened the\nwindow, and in a few moments I saw peeping out half timidly the pretty\nfair face of a little girl. Quite a little girl she was, not much older\nthan you, Mademoiselle Jeanne, but not like you, for she had light hair\nand soft blue eyes, and a fair face like Monsieur Chéri. She was a\nlittle English girl. She peeped out, and then, seeing that no one was\nobserving her, she came quietly on to the balcony, and, creeping down\ninto a corner where she could scarcely be seen, she sat watching our two\npretty young ladies with all her eyes. No wonder, I thought; they were\nvery pretty young ladies, and it was nice to see them together, walking\nup and down with arms intertwined, and talking eagerly, their talk\nsometimes interrupted by merry bursts of soft girlish laughter. And all\nthe time the lonely little creature on the balcony sat and watched them\nlongingly, her little pale face pressed against the bars, her plain\nblack dress almost hiding her from notice.\n\n\"'How happy they look, those pretty young ladies,' the lonely little\ngirl said to herself. 'How happy I should be if I had a sister, for I\nhave no one to talk to, no one to kiss me and play with me and if ever I\nsay I am sad my aunt is angry. O mother! why did you go away and leave\nme?'\"\n\n\"Could you hear all that from up here on the roof?\" said Jeanne. \"Dear\nme, Dudu, you must have good ears.\"\n\n\"Of course I have; I told you so, Mademoiselle,\" said Dudu drily. \"I had\nbetter ears than your great-grandmother and her sister, for they heard\nnothing, not even when the poor little girl took courage to push her\nface farther forward between the railings, and to say very softly and\ntimidly,\n\n\"'Mesdemoiselles, Mesdemoiselles, _might_ I come and walk with you? I am\nso tired of being here all alone.'\n\n\"They did not hear her. They were talking too busily about the fête of\ntheir mother, I think, which was to be in a few days, and of what they\nwere to prepare for her. And the poor little girl sat up there for more\nthan an hour watching them with longing eyes, but not daring to call out\nmore loudly. It made me quite melancholy to see her, and when at last\nour young ladies went in, and she had to give up hopes of gaining their\nattention, it made me more melancholy still, she looked so\ndisappointed, and her eyes were full of tears; and I felt quite upset\nabout her, and kept turning over in my head what I could do to make her\nhappier. I thought about it for some time, and at last I decided that\nthe first thing to do was to find out more about the little stranger and\nthe cause of her grief. For this purpose I stationed myself the next\nmorning just below the window of the kitchen of her house, which, by\nhopping from the balcony, I was easily able to do, and by listening to\nthe conversation of the servants I soon learned all I wanted to know.\nShe was, as I had supposed, a little English girl. Her mother had died\nin Italy but a short time before, and she was now in the charge of her\nmother's aunt, an elderly and severe lady, who understood nothing about\nchildren, and took no pains to make poor little Charlotte happy. So it\nwas a sad life for the child, whose father also was dead; and as from\nthe talk of the servants I gathered that she was a good and gentle\nlittle girl, I felt more sorry for her than before; and as I hopped back\non to the balcony I looked to see if she was again at the window. Yes,\nthere she was, her face pressed against the glass, staring out in the\ndirection of the terrace walk, watching, no doubt, to see if our young\nladies were coming out again. I hopped in front of the window backwards\nand forwards two or three times to catch her attention, and a smile lit\nup her little pale face when she saw me.\n\n\"'Good day, Mr. Raven,' she said politely. 'Have you come to see me? It\nis very kind of you if you have, for I have nobody to play with. But,\noh! if you could tell those pretty young ladies how I should like to\nwalk about their garden with them, how pleased I should be.'\n\n\"I bowed to her in token of understanding what she said, but I was not\nsure that she noticed it, for she just went on chattering in her soft\nlittle voice.\n\n\"'Poor old raven,' she said. 'What a pity you can't speak, for if you\ncould I might send a message by you to those pretty young ladies;' and\nthough I walked slowly backwards and forwards on the balcony, and bowed\nmost politely each time I passed her, yet she did not seem to\nunderstand.\"\n\n\"Why didn't you speak?\" interrupted Jeanne. \"You can speak quite well to\nChéri and me. Had you not learned to speak at that time, Dudu?\"\n\nThe raven hemmed and hawed and cleared his throat.\n\n\"It is not to the point, Mademoiselle,\" he said, \"to enter into all\nthese explanations. If you would have the goodness to let me continue my\nreminiscences without interrupting me, I should really be obliged. I\nwarned you I had not any amusing stories to tell, merely recollections\nof scenes in my past life. If you would prefer my leaving off, you have\nonly to say so.\"\n\n\"Oh no, no. Please go on,\" exclaimed Jeanne, seeing that the raven was\nreally ruffled. \"I think it's _very_ interesting, and I'll promise not\nto interrupt you any more.\"\n\n\"Well,\" continued Dudu, \"I bowed, as I told you, very politely two or\nthree times, and at last I hopped away, still revolving in my mind how I\ncould serve the poor little girl. That afternoon our young ladies came\nagain on to the terrace, but they did not stay long, and the little girl\nwas not to be seen on the balcony, though I daresay she was peering out\nthrough the window to see as far as she could. And the next day and the\nday after were very rainy, so there was nothing I could do. But after\nthat again there came a very fine day--a beautiful sunny day it was, I\nremember it well--and our young ladies came out like the flowers and the\nbirds to enjoy it. Out, too, came the forlorn little black figure,\nhiding itself as before behind the railings of the balcony, but looking\nwith longing eyes at the garden below, which to her must have seemed a\nkind of Paradise. I directed my steps to the terrace, and walked slowly\nin front of the young ladies, slowly and solemnly straight in front of\nthem, for I wanted to attract their attention.\n\n\"'How particularly solemn Dudu looks to-day,' said one of them to the\nother.\n\n\"'Yes,' she replied, 'quite as if he had something on his mind. Have you\nbeen doing anything naughty, Dudu?'\n\n\"I turned and looked at her reproachfully. I was not offended, I knew\nshe was only joking, my character stood far above any imputation; but\nstill, there are subjects on which jokes are better avoided, and there\n_was_ a cousin of mine whose honesty, I am sorry to say, had been more\nthan once suspected; altogether, I hardly thought the remark in good\ntaste, and Mademoiselle Eliane was not slow to perceive it.\n\n\"'Poor old Dudu,' she cried; 'have I hurt your feelings? But tell me\nwhat are you looking so solemn about?'\n\n\"I looked at her again, and then, sure that she and her sister were\nboth watching me with attention, I sprang up the side of the wall next\nthe little stranger's house, hopped over the balcony railings, and\nfinding, as I expected, my little friend crouched down in the corner, I\ngave a loud, sharp croak, as if something were the matter. Charlotte\nstarted up in a fright, and the young ladies, watching me curiously, for\nthe first time observed her little figure.\n\n\"'Why, Dudu has a friend up there!' exclaimed Mademoiselle Jeanne--your\ngreat-grandmother, my dears. 'Mademoiselle,' she called out to the\nlittle girl, whose small black figure did not look very much bigger than\nmine as we stood up there side by side; 'Mademoiselle, do not be\nfrightened of our old raven. He will not hurt you.'\n\n\"'I am not frightened, thank you,' said the little girl's gentle voice.\n'He has been to see me before. I was only startled when he made that\nfunny noise. But O Mesdemoiselles,' she continued, clasping her hands in\nentreaty, 'you do not know how I should like to come down into your\ngarden and play with you, or at least,' as she suddenly recollected that\nsuch tall young ladies were rather past the age for mere 'playing,'\n'walk about and talk with you. I have watched you so many days, and I am\nso lonely. But I did not like to speak to you unless you spoke to me.'\n\n\"'We never saw you,' said Mademoiselle Eliane. 'We should have seen you\nnow but for the funny way Dudu has been going on, as if he wanted to\nintroduce us to each other.'\n\n\"I felt quite proud when Mademoiselle Eliane said that. It has always\nbeen a gratification to me to find myself understood. And I felt still\nprouder when the little girl replied, looking at me gratefully,\n\n\"'How nice of him! He must have understood what I said to him in fun the\nother day. But O Mesdemoiselles,' she went on, '_may_ I come down to\nyou?'\n\n\"'How can you get down?' said Mademoiselle Jeanne; 'and are you sure your\nmother would not mind?'\n\n\"'I have no mother,' said the little girl sadly, 'and my aunt would not\nmind, I know. She never minds what I do, if I don't make a noise.'\n\n\"'But how can you get down?' repeated Mademoiselle Jeanne, 'unless Dudu\ncan take you on his back and fly with you!'\n\n\"'Oh, I can easily get down,' said the little girl; 'I have often\nplanned it. I can climb over the railings at this end--look, there is a\njutting-out ledge that I can put my foot on. Then I can stand a minute\noutside and jump--if you will come close to, so that I shall not roll\ndown the terrace bank.'\n\n\n\n\nCHAPTER XII. AU REVOIR.\n\n          \"One after another they flew away\n             Far up to the heavenly blue,\n           To the better country, the upper day----\"\n                                  JEAN INGELOW.\n\n\n\"Little Charlotte climbed over the railings,\" continued Dudu, \"but she\ndid not jump down on the other side, for Mademoiselle Eliane, who was\ntall, found that by standing half-way up the bank she could reach the\nchild and hand her down to Mademoiselle Jeanne, a little way below.\nThere was a good deal of laughing over it all, and this helped them to\nmake friends more quickly than anything else would have done. But indeed\nCharlotte was not a shy child, she had travelled too much and seen too\nmany people to be so, and our young ladies, besides, were so kind and\nmerry that no little girl could long have been strange with them. She\nran about the garden in the greatest delight; her new friends showed\nher all their favourite nooks, and allowed her to make a bouquet of the\nflowers she liked best; and when they were tired of standing about they\nall sat down together on a bank, and Charlotte told to the young ladies\nthe story of her short life. It was a sad little story; her father had\ndied when she was very young, and her mother, whose health had never\nbeen good after the shock of his death, had gone to Italy with the aunt\nwho had brought her up, in hopes of growing stronger. But through two or\nthree years of sometimes seeming better and sometimes worse, she had\nreally been steadily failing, and at last she died, leaving her poor\nlittle girl almost alone, 'for the old aunt was now,' said Charlotte,\n'always ill, and not ill as mamma used to be,' she added, for however\ntired _she_ was, she always liked her little girl to be beside her, and\nnever wearied of listening to all she had to say.\n\n\"'But now,' said the child, 'I am always alone, and it is _so_ sad. And\nI have watched you so often from the balcony, and wished I might come\ndown to you. And now, if you will let me come to see you every day, I\nshall be _so_ happy.'\n\n\"She was a dear little girl, so sweet, and simple, and loving. She\nquite gained our young ladies' hearts with her pretty ways and her funny\nlittle English, accent. They kissed her on both cheeks, and told her\nthey would be very pleased for her to come to them in the garden\nwhenever she saw them from the balcony, as she was so sure her aunt\nwould not object to it. They could not invite her to the house, they\nexplained, unless their mother and her aunt had made acquaintance. Of\ncourse it would not have done, as little Charlotte quite understood; for\nin those days,\" Dudu observed in passing, \"politeness and ceremony were\nmuch more observed than is at present, I am sorry to say, the case.\n\n\"The little English girl, however,\" he went on, \"was only too delighted\nto have received permission to visit them in their garden. And not many\ndays passed on which she did not join them there. It was a lovely summer\nthat year--I remember it so well. Never now does the sun seem to me to\nshine quite so brightly as in those days. Perhaps it is that I am\ngrowing old, perhaps the sad days that soon after followed left a cloud\non my memory and a mist on my spirit which have never since entirely\ncleared away; however that may be, I never remember so bright and\nbeautiful a summer as the one I am telling you of. And little\nCharlotte's merry laugh was often heard on the terrace walk, as she ran\nraces with Mademoiselle Eliane's dog, or made daisy wreaths for\nMademoiselle Jeanne's dark hair. Kindness and companionship were all she\nrequired to make her a bright and happy child. But the pleasant summer\nfaded, and with the first autumn days came a fresh sorrow for the little\ngirl. One morning, before the usual time for meeting in the garden, I\ncaught sight of her on the balcony, her face looking again like the\nlittle pale Charlotte I had first known her, her eyes red with weeping.\nAnd as by good chance the young ladies came out soon the reason was soon\nexplained.\n\n\"'I am going away, my dear young ladies,' cried Charlotte, as she threw\nherself into their arms. 'My aunt has just told me. We return to England\nin a few days. To England, where I have no friends, where I shall be\nagain all alone. O Mademoiselle Eliane! O Mademoiselle Jeanne! what\nshall I do without you, and your pretty garden, and your kindness, and\npoor old Dudu, and the flowers, and everything?'\n\n\"They consoled her as well as they could, my kind young ladies, whose\nhearts were always full of sympathy. But the tears came to their own\neyes when they saw how real and acute was the little girl's grief.\n\n\"'You will come back to see us again, little Charlotte, perhaps,' they\nsaid. 'Your aunt has travelled so much, very likely she will not wish to\nremain always in England. And you would always find us here--in the\nwinter at any rate; generally in the summer we spend some months at our\nchâteau, though this summer our father had business which obliged him to\nstay here. But for that we should not have seen you so much.'\n\n\"But Charlotte was not to be consoled. Her aunt, she was sure, would\nnever travel any more. She had said only that very morning, that once\nshe got back to England she would stay there for the rest of her life,\nshe was too old to move about any more.\n\n\"'And I,' added Charlotte, with a fresh burst of weeping, 'I am to be\nsent to an English school as soon as aunt can settle about it.'\n\n\"'But you will be happier at school, dear,' said Mademoiselle Eliane.\n'You will have friends of your own age.'\n\n\"'I don't want friends of my own age. I shall never love _any_ friends\nas much as my dear Mademoiselle Jeanne and my dear Mademoiselle\nEliane,' sobbed Charlotte; and the only thing that consoled her at all\nwas when the two young ladies found for her among their little treasures\na very prettily painted 'bonbonnière,' and a quaint little workcase,\nfitted with thimble, scissors, and all such things, which she promised\nthem she would always keep, _always_, as souvenirs of their kindness.\n\n\"And in return, the poor little thing went out with her aunt's maid the\nnext morning and bought two little keepsakes--a scent-bottle for\nMademoiselle Jeanne, and a fan for Mademoiselle Eliane. She spent on\nthem all the money she had; and at this very moment,\" added Dudu, \"the\nscent-bottle is downstairs in your mother's large old dressing-case, the\ndressing-case she got from her grandfather. What became of the fan I\ncannot say.\n\n\"Well, the few remaining days passed, and one cold, dreary morning poor\nCharlotte clambered over the railings for the last time, to embrace her\nfriends and bid them farewell. She might have come in by the door and\nseen them in the salon; of course neither her aunt nor our young ladies'\nmother would have objected to such a thing, as she was going away, even\nthough no visits of ceremony had been exchanged between the families.\nBut this would not have suited Charlotte; it was in the garden she had\nfirst seen her friends, and in the garden must she bid them good-bye. I\nassisted at the interview,\" continued Dudu, \"and very touching it was.\nHad I been of a nature to shed tears, I really think my feelings would\nhave been too much for me. And Charlotte would have kissed and hugged me\ntoo, no doubt, had I encouraged anything of the kind. But, fortunately\nperhaps for the preservation of my feathers and my dignity, I am not,\nand never have been, of a demonstrative disposition.\"\n\nDudu cleared his throat and stopped to rest for a moment. Then he\ncontinued--\n\n\"The parting was over at last, and little Charlotte was away--quite away\nover the sea in cold, rainy England. Cold and rainy it must have been\nthat winter in any case, for it was cold and rainy even here, and many\nchanges happened, and shadows of strange events were already faintly\ndarkening the future. It was the next year that our pretty Mademoiselle\nJeanne married and went away with her husband from the old house, which\nyet was to be her home, and the home of her children in the end, for\nMademoiselle Eliane never married, and so all came to be inherited by\nher sister's sons. But with that we have nothing to do at present. I\nwished only to tell you what concerns our young ladies' friendship with\nthe little stranger. Years went on, as they always do, whether they\nleave the world happy or miserable, and the shadows I have told you of\ngrew darker and darker. Then, at last, the terrible days began--the\nstorm burst forth, our happy, peaceful home, with hundreds and thousands\nof others, was broken up, and its kindly inhabitants forced to flee.\nMademoiselle Jeanne came hurrying up from her husband's home, where\nthings were even worse than with us, with her boys, to seek for shelter\nand safety, which, alas! could not be given her here. For all had to\nflee--my poor old master, frail as he was, his delicate wife, our young\nladies, and the boys--all fled together, and after facing perils such as\nI trust none of their descendants will ever know, they reached a safe\nrefuge. And then they had to endure a new misery, for months and months\nwent by before they had any tidings of poor Mademoiselle Jeanne's\nhusband, your great-grandfather, my children, who, like all of his\nname--a name you may well be proud of, my little Mademoiselle\nJeanne--stayed at the post of danger till every hope was passed. Then at\nlast, in disguise, he managed to escape, and reached this place in\nsafety, hoping here to find something to guide him as to where his wife\nand children were. But he found nothing--the house was deserted, not a\nservant or retainer of any kind left except myself, and what, alas!\ncould _I_ do? He was worn out and exhausted, poor man; he hid in the\nhouse for a few days, creeping out at dusk in fear and trembling to buy\na loaf of bread, trusting to his disguise and to his not being well\nknown in the town. But he would have died, I believe, had he been long\nleft as he was, for distress of mind added to his other miseries, not\nknowing anything as to what had become of your great-grandmother and his\nchildren.\n\n\"She was a good wife,\" continued Dudu, after another little pause. \"Our\nMademoiselle Jeanne, I mean. Just when her poor husband was losing heart\naltogether, beginning to think they must all be dead, that there was\nnothing left for him to do but to die too, she came to him. She had\ntravelled alone, quite alone, our delicate young lady--who in former\ndays had scarcely been allowed to set her little foot on the\npavement--from Switzerland to the old home, with a strange belief that\nhere if anywhere she should find him. And she was rewarded. The worst of\nthe terrible days were now past, but still disguise was necessary, and\nit was in the dress of one of her own peasants--the dress in which she\nhad fled--that Mademoiselle Jeanne returned. But he knew her--through\nall disguises he would have known her--and she him. And the first\nevening they were together in the bare, deserted house, even with all\nthe terrors behind them, the perils before them, the husband and wife\nwere happy.\"\n\nDudu paused again. The children, too interested to speak, listened\neagerly.\n\n\"Go on, dear Dudu,\" whispered Jeanne at last, softly.\n\n\"How were they to get away to safety? That was the question,\" continued\nDudu. \"They dared not stay long where they were; yet they dared not go.\nMonsieur was far too feeble to stand much fatigue, and the two of them\njourneying together might attract notice.\n\n\"'If we could get to the sea,' said Mademoiselle Jeanne--Madame I should\ncall her, but it never comes naturally--there we might find a ship to\ntake us to England or Holland, and thence find our way to our dear ones\nagain.'\n\n\"But Monsieur shook his head. 'Impossible,' he said. 'I have not the\nstrength for even the four leagues' walk to the sea, and finding a ship\nthat would take us is a mere chance. We have almost no money. Here at\nleast we have shelter, and still some sous for bread. Jeanne, my\nbeloved, you must make up your mind to leave me again--alone and\nunhindered you might find your way back in safety.'\n\n\"'I will never leave you,' said Jeanne. 'We will die together, if it\nmust be so. The boys are safe--my father and mother and Eliane will care\nfor them. I will never leave you.'\n\n\"And Monsieur said no more; but in his own mind I could see that he\nthought himself fast dying, that want of comforts and nourishment much\nlonger would exhaust his little strength, and that his poor Jeanne\nwould, in the end, be forced to attempt the journey back alone. They\nwere sitting at the end of the terrace walk that evening--the end near\nlittle Charlotte's balcony; it was a mild, still evening--it seemed less\ndreary and miserable than in the house; from the distance came the sound\nof the children playing in the old streets, and near at hand some birds\nwere singing still--for children will play and birds will sing whatever\nhappens. Suddenly a sound close at hand made Mademoiselle Jeanne look\nup. And I too, for I was close beside them on the terrace, I looked up\nin amazement, half imagining it must be a dream. For we heard--both\nMademoiselle Jeanne and I knew it again--the sound of the window on to\nthe balcony opening, the window through which the little English girl\nused to come out to meet her friends. We looked and could scarcely\nbelieve our eyes. Out on to the balcony stepped a young lady, a young\ngirl rather she seemed, for she was tall and slight and had fair curls\nabout her sweet fresh face. She stood for one instant looking at us all\nas if bewildered, then, with a sudden cry, almost before we knew what\nshe was doing, she was over the railings and down the bank.\n\n\"'Mademoiselle Jeanne or Mademoiselle Eliane!' she cried, 'which of you\nis it? for it is one of you, I know! And you are _not_ dead--not all\ndead and gone--and there is Dudu, too. Oh, how glad, how very glad, I am\nthat I came!'\n\n\"Laughing and crying both at once, she threw herself into Madame's arms,\nwhile Monsieur looked on in amazement.\n\n\"'You know me?' she cried--'your little English Charlotte. See, here is\nthe bonbonnière,' feeling for it in her pocket as she spoke. 'And you\nare Mademoiselle Jeanne. I know you now--if you had twenty peasant caps\non I should know you. But how thin and pale you are, my poor Jeanne!\nAnd is this your husband? I knew you were married. I saw it in the\nnewspapers ever so many years ago. Do you know it is fifteen years since\nI went away? And I am married, too. But tell me first how it is you are\nhere and dressed like that, and why you look so sad and Monsieur so ill.\nTell me all. You may trust me, you may indeed, and perhaps my husband\nand I may be able to be of some use. You may trust me,' seeing that\nMadame and her husband looked at each other in bewilderment; 'may they\nnot, Dudu?' she added, turning to me. 'Tell Mademoiselle Jeanne that she\ncan indeed trust me.'\n\n\"I flapped my wings and croaked.\n\n\"'You see,' said Charlotte, and at that they all laughed.\n\n\"'It is not that we do not trust you, my dear friend,' said Madame; 'and\nindeed you see all in seeing us here as you do. There is nothing to tell\nbut the same sad story that has been to tell in so many once happy\nFrench homes. But explain to me, my dear Charlotte, how you are here. It\nis so strange, so extraordinary.'\n\n\"And Charlotte explained. Her husband was a sailor. To be near him, she\nhad been in Spain at the outbreak of the revolution, and had remained\nthere till he was ordered home. Now that the terror was subsiding, there\nwas--for them, as foreigners--but little risk. She had persuaded her\nhusband, whose vessel, owing to some slight accident at sea, had been\nobliged to put in at the neighbouring port, to let her come to have a\nlook at the old town, at the old house, or garden rather, she still\nloved so dearly. 'The house we used to live in,' she said, 'was empty. I\neasily found my way in, and out on to the balcony, as you saw. I had a\nsort of wild idea that perhaps I might see or hear something of you. Yet\nI was almost afraid to ask, such terrible things have happened,' added\nCharlotte, with a shudder.\n\n\"But nothing more terrible was in store for our young ladies, I am glad\nto say,\" continued Dudu. \"The faithful-hearted Charlotte and her husband\nwere able to be of the greatest service to Mademoiselle Jeanne and _her_\nhusband. They conveyed them in safety to the port and saw them on board\na friendly vessel, and not many weeks passed before they were again with\ntheir children and the old Monsieur and Madame and Mademoiselle Eliane\nin their home for the time in Switzerland.\"\n\n\"Oh, how glad I am!\" exclaimed Jeanne. \"I was dreadfully afraid your\nstory was going to end badly, Dudu.\"\n\n\"It is not ended yet,\" said Dudu.\n\n\"Isn't it?\" cried Jeanne. \"Oh dear, then go on quick, please. I _hope_\nMademoiselle Jeanne's poor husband----\"\n\n\"Your great-grandfather, you mean,\" corrected Dudu.\n\n\"Oh, well then, my great-grandfather, _our_ great-grandfather, for he\nwas Chéri's, too, you said. I do so hope he got better. Did he, Dudu?\"\n\n\"Yes,\" said Dudu, \"he got better, but never quite well again. However,\nhe lived some years, long enough to see his boys grown up and to\nreturn--after the death of our old Monsieur and Madame--to return to his\nown country with his wife and sister-in-law. But before very long, while\nstill far from an old man, he died. Then our young ladies, young no\nlonger, came back, after a time, to their childish home; and here they\nlived together quietly, kind and charitable to all, cheered from time to\ntime by the visits of Madame's two sons, out in the world now and\nmarried, and with homes of their own. And time went on gently and\nuneventfully, and gradually Madame's hair became quite, quite white, and\nMademoiselle Eliane took to limping a little in her walk with the\nrheumatism, and when they slowly paced up and down the terrace it was\ndifficult for me to think they were really my pretty young ladies with\nthe white dresses and blue ribbons of half a century ago. For it was now\njust thirty-five years since the last visit of their English friend. She\ntoo, if she were alive, must be a woman of more than sixty. They had\nnever heard of her again. In the hurry and anxiety of their last meeting\nthey had forgotten to ask and she to give her exact address, so they\ncould not write. She might have written to them to the old house\nperhaps, on the chance of it finding them; but if so, they had never got\nthe letter. Yet they often spoke of her, and never saw the balcony at\nthe end of the terrace without a kindly thought of those long ago days.\n\n\"One evening--an autumn evening--mild and balmy, the two old ladies were\nslowly pacing up and down their favourite walk, when a servant came out\nto say that they were wanted--a lady was asking for them. But not to\ndisturb them, he added, the visitor would be glad to see them in the\ngarden, if they would allow it. Wondering who it could be, Madame and\nher sister were hesitating what to do, when a figure was seen\napproaching them from the house.\n\n\"'I could not wait,' she said, almost before she reached them. 'I wished\nso much to see you once more in the old spot, dear friends;' and they\nknew her at once. They recognised in the bowed and worn but still sweet\nand lovely woman, their pretty child-friend of fifty years ago. She had\ncome to bid them farewell, she said. She was on her way to the\nsouth--not to live but to die, for she had suffered much and her days\nwere numbered.\n\n\"'My dear husband is dead some years ago,' she said. 'But we were very\nhappy together, which is a blessed thought. And my children--one after\nanother they faded. So I am an old woman now and quite alone, and I am\nglad to go to them all. My friends wished me to go to the south, for I\nhave always loved the sunshine, and there my little daughter died, and\nperhaps death will there come to me in gentler shape. But on my way, I\nwished to say good-bye to you, dear friends of long ago, whom I have\nalways loved, though we have been so little together.'\n\n\"And then they took each other's hands, gently and quietly, the three\nold ladies, and softly kissed each other's withered cheeks, down which a\nfew tears made their way; the time was past for them for anything but\ngentle and chastened feelings. And whispering to their old friend not\ngood-bye, but 'Au revoir, au revoir in a better country,' my ladies\nparted once more with their childish friend.\n\n\"She died a few months later; news of her death was sent them. _They_\nlived to be old--past eighty both of them, when they died within a few\ndays of each other. But I never hobble up and down the terrace walk\nwithout thinking of them,\" added Dudu, \"and on the whole, my dears, even\nif I had my choice, I don't think I should care to live another two or\nthree hundred years in a world where changes come so quickly.\"\n\nHugh and Jeanne were silent for a moment. Then \"Thank you, dear Dudu,\"\nthey said together.\n\nAnd Dudu cocked his head on one side. \"There is Marcelline calling you,\"\nhe said, in a matter-of-fact tone. \"Run downstairs. Take a look at the\nbeautiful stars overhead before you go. Good-bye, my dears.\"\n\n\"Good-night, Dudu, and thank you again,\" said the children, as they\nhastened away.\n\nThey found their way back to the tapestry room without difficulty. They\nwere standing in the middle of the room, half puzzled as to how they had\ngot there, when Marcelline appeared.\n\n\"We have been with Dudu,\" they told her, before she had time to ask them\nanything. \"He has told us lovely stories--nicer even than fairy\nadventures.\" And Marcelline smiled and seemed pleased, but not at all\nsurprised.\n\n       *       *       *       *       *\n\n\"A strange thing has happened,\" said Jeanne's father the next day. \"I\nfeel quite distressed about it. Old Dudu the raven has disappeared. He\nis nowhere to be found since yesterday afternoon, the gardener tells me.\nThey have looked for him everywhere in vain. I feel quite sorry--he has\nbeen in the family so long--how long indeed I should be afraid to say,\nfor my father remembered him as a child.\"\n\nThe children looked at each other.\n\n\"Dudu has gone!\" they said softly.\n\n\"We shall have no more stories,\" whispered Hugh.\n\n\"Nor fairy adventures,\" said Jeanne.\n\n\"He may come back again,\" said Hugh.\n\n\"I think not,\" said Jeanne, shaking her smooth little black head. \"Don't\nyou remember, Chéri, what he said about not wishing to stay here\nlonger?\"\n\n\"And he said 'good-bye,'\" added Hugh sadly. \"I fear he will not come\nback.\"\n\nBut if he _ever_ does, children dear, and if you care to hear what he\nhas to tell, you shall not be forgotten, I promise you.\n\n\n\nTHE END\n\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      383,
      414,
      1
    ],
    [
      "chapter.title",
      21868,
      21893,
      2
    ],
    [
      "chapter.title",
      40528,
      40562,
      3
    ],
    [
      "chapter.title",
      62062,
      62101,
      4
    ],
    [
      "chapter.title",
      84279,
      84300,
      5
    ],
    [
      "chapter.title",
      106171,
      106204,
      6
    ],
    [
      "chapter.title",
      150953,
      150995,
      7
    ],
    [
      "chapter.title",
      176816,
      176858,
      8
    ],
    [
      "chapter.title",
      199259,
      199296,
      9
    ],
    [
      "chapter.title",
      223141,
      223170,
      10
    ],
    [
      "chapter.title",
      246387,
      246410,
      11
    ]
  ]
}