{
  "content": "Nine Unlikely Tales\nE. Nesbit\n\n  IRIDI MEAE\n  HOC ET COR MEUM\n\n\nBOOK 1. _THE COCKATOUCAN_ _OR GREAT AUNT WILLOUGHBY_\n\n\nMATILDA’S ears were red and shiny. So were her cheeks. Her hands were\nred too. This was because Pridmore had washed her. It was not the usual\nwashing, which makes you clean and comfortable, but the “thorough good\nwash,” which makes you burn and smart till you wish you could be like\nthe poor little savages who do not know anything, and run about bare in\nthe sun, and only go into the water when they are hot.\n\nMatilda wished she could have been born in a savage tribe instead of at\nBrixton.\n\n“Little savages,” she said, “don’t have their ears washed thoroughly,\nand they don’t have new dresses that are prickly in the insides round\ntheir arms, and cut them round the neck. Do they, Pridmore?”\n\nBut Pridmore only said, “Stuff and nonsense,” and then she said, “don’t\nwriggle so, child, for goodness’ sake.”\n\nPridmore was Matilda’s nursemaid. Matilda sometimes found her trying.\nMatilda was quite right in believing that savage children do not\nwear frocks that hurt. It is also true that savage children are not\nover-washed, over-brushed, over-combed, gloved, booted, and hatted and\ntaken in an omnibus to Streatham to see their Great-aunt Willoughby.\nThis was intended to be Matilda’s fate. Her mother had arranged it.\nPridmore had prepared her for it. Matilda, knowing resistance to be\nvain, had submitted to it.\n\nBut Destiny had not been consulted, and Destiny had plans of its own\nfor Matilda.\n\nWhen the last button of Matilda’s boots had been fastened (the\nbutton-hook always had a nasty temper, especially when it was hurried,\nand that day it bit a little piece of Matilda’s leg quite spitefully)\nthe wretched child was taken downstairs and put on a chair in the hall\nto wait while Pridmore popped her own things on.\n\n“I shan’t be a minute,” said Pridmore. Matilda knew better. She\nseated herself to wait, and swung her legs miserably. She had been\nto her Great-aunt Willoughby’s before, and she knew exactly what to\nexpect. She would be asked about her lessons, and how many marks she\nhad, and whether she had been a good girl. I can’t think why grown-up\npeople don’t see how impertinent these questions are. Suppose you were\nto answer, “I’m top of my class, Auntie, thank you, and I’m very good.\nAnd now let’s have a little talk about you. Aunt, dear, how much money\nhave you got, and have you been scolding the servants again, or have\nyou tried to be good and patient as a properly brought up aunt should\nbe, eh, dear?”\n\n[MATILDA SWUNG HER LEGS MISERABLY.]\n\nTry this method with one of your aunts next time she begins asking you\nquestions, and write and tell me what she says.\n\nMatilda knew exactly what the Aunt Willoughby’s questions would be,\nand she knew how, when they were answered, her aunt would give her a\nsmall biscuit with carraway seeds in it, and then tell her to go with\nPridmore and have her hands and face washed again.\n\nThen she would be sent to walk in the garden—the garden had a gritty\npath, and geraniums and calceolarias and lobelias in the beds. You\nmight not pick anything. There would be minced veal at dinner, with\nthree-cornered bits of toast round the dish, and a tapioca pudding.\nThen the long afternoon with a book, a bound volume of the “Potterer’s\nSaturday Night”—nasty small print—and all the stories about children\nwho died young because they were too good for this world.\n\nMatilda wriggled wretchedly. If she had been a little less\nuncomfortable she would have cried, but her new frock was too tight and\nprickly to let her forget it for a moment, even in tears.\n\nWhen Pridmore came down at last, she said, “Fie, for shame! What a\nsulky face!”\n\nAnd Matilda said, “I’m not.”\n\n“Oh, yes you are,” said Pridmore, “you know you are, you don’t\nappreciate your blessings.”\n\n“I wish it was your Aunt Willoughby,” said Matilda.\n\n“Nasty, spiteful little thing!” said Pridmore, and she shook Matilda.\n\nThen Matilda tried to slap Pridmore, and the two went down the steps\nnot at all pleased with each other. They went down the dull road to\nthe dull omnibus, and Matilda was crying a little.\n\nNow Pridmore was a very careful person, though cross, but even the\nmost careful persons make mistakes sometimes—and she must have taken\nthe wrong omnibus, or this story could never have happened, and where\nshould we all have been then? This shows you that even mistakes are\nsometimes valuable, so do not be hard on grown-up people if they are\nwrong sometimes. You know after all, it hardly ever happens.\n\nIt was a very bright green and gold omnibus, and inside the cushions\nwere green and very soft. Matilda and her nursemaid had it all to\nthemselves, and Matilda began to feel more comfortable, especially as\nshe had wriggled till she had burst one of her shoulder-seams and got\nmore room for herself inside her frock.\n\nSo she said, “I’m sorry I was cross, Priddy dear.”\n\nPridmore said, “So you ought to be.” But she never said _she_ was sorry\nfor being cross. But you must not expect grown-up people to say that.\n\nIt was certainly the wrong omnibus because instead of jolting slowly\nalong dusty streets, it went quickly and smoothly down a green lane,\nwith flowers in the hedges, and green trees overhead. Matilda was\nso delighted that she sat quite still, a very rare thing with her.\nPridmore was reading a penny story called “The Vengeance of the Lady\nConstantia,” so she did not notice anything.\n\n“I don’t care. I shan’t tell her,” said Matilda, “she’d stop the ’bus\nas likely as not.”\n\nAt last the ’bus stopped of its own accord. Pridmore put her story in\nher pocket and began to get out.\n\n“Well, I never!” she said, and got out very quickly and ran round to\nwhere the horses were. They were white horses with green harness, and\ntheir tails were very long indeed.\n\n“Hi, young man!” said Pridmore to the omnibus driver, “you’ve brought\nus to the wrong place. This isn’t Streatham Common, this isn’t.”\n\nThe driver was the most beautiful omnibus driver you ever saw, and his\nclothes were like him in beauty. He had white silk stockings and a\nruffled silk shirt of white, and his coat and breeches were green and\ngold. So was the three-cornered hat which he lifted very politely when\nPridmore spoke to him.\n\n[HE WAVED AWAY THE EIGHTPENCE.]\n\n“I fear,” he said kindly, “that you must have taken, by some\nunfortunate misunderstanding, the wrong omnibus.”\n\n“When does the next go back?”\n\n“The omnibus does not go back. It runs from Brixton here once a month,\nbut it doesn’t go back.”\n\n“But how does it get to Brixton again, to start again, I mean,” asked\nMatilda.\n\n“We start a new one every time,” said the driver, raising his\nthree-cornered hat once more.\n\n“And what becomes of the old ones?” Matilda asked.\n\n“Ah,” said the driver, smiling, “that depends. One never knows\nbeforehand, things change so nowadays. Good morning. Thank you so much\nfor your patronage. No, on no account, Madam.”\n\nHe waved away the eightpence which Pridmore was trying to offer him for\nthe fare from Brixton, and drove quickly off.\n\nWhen they looked round them, no, this was certainly not Streatham\nCommon. The wrong omnibus had brought them to a strange village—the\nneatest, sweetest, reddest, greenest, cleanest, prettiest village in\nthe world. The houses were grouped round a village green, on which\nchildren in pretty loose frocks or smocks were playing happily.\n\nNot a tight armhole was to be seen, or even imagined in that happy\nspot. Matilda swelled herself out and burst three hooks and a bit more\nof the shoulder seam.\n\nThe shops seemed a little queer, Matilda thought. The names somehow did\nnot match the things that were to be sold. For instance, where it said\n“Elias Groves, Tinsmith,” there were loaves and buns in the window, and\nthe shop that had “Baker” over the door, was full of perambulators—the\ngrocer and the wheelwright seemed to have changed names, or shops, or\nsomething—and Miss Skimpling, Dressmaker or Milliner, had her shop\nwindow full of pork and sausage meat.\n\n“What a funny, nice place,” said Matilda. “I am glad we took the wrong\nomnibus.”\n\nA little boy in a yellow smock had come up close to them.\n\n“I beg your pardon,” he said very politely, “but all strangers are\nbrought before the king at once. Please follow me.”\n\n“Well, of all the impudence,” said Pridmore. “Strangers, indeed! And\nwho may you be, I should like to know?”\n\n“I,” said the little boy, bowing very low, “am the Prime Minister. I\nknow I do not look it, but appearances are deceitful. It’s only for a\nshort time. I shall probably be myself again by to-morrow.”\n\nPridmore muttered something which the little boy did not hear. Matilda\ncaught a few words. “Smacked,” “bed,” “bread and water”—familiar words\nall of them.\n\n“If it’s a game,” said Matilda to the boy, “I should like to play.”\n\nHe frowned.\n\n“I advise you to come at once,” he said, so sternly that even Pridmore\nwas a little frightened. “His Majesty’s Palace is in this direction.”\nHe walked away, and Matilda made a sudden jump, dragged her hand out\nof Pridmore’s, and ran after him. So Pridmore had to follow, still\ngrumbling.\n\nThe Palace stood in a great green park dotted with white-flowered\nmay-bushes. It was not at all like an English palace, St. James’s or\nBuckingham Palace, for instance, because it was very beautiful and very\nclean. When they got in they saw that the Palace was hung with green\nsilk. The footmen had green and gold liveries, and all the courtiers’\nclothes were the same colours.\n\nMatilda and Pridmore had to wait a few moments while the King changed\nhis sceptre and put on a clean crown, and then they were shown into the\nAudience Chamber. The King came to meet them.\n\n“It is kind of you to have come so far,” he said. “Of _course_ you’ll\nstay at the Palace?” He looked anxiously at Matilda.\n\n“Are you _quite_ comfortable, my dear?” he asked doubtfully.\n\nMatilda was very truthful—for a girl.\n\n“No,” she said, “my frock cuts me round the arms——”\n\n“Ah,” said he, “and you brought no luggage—some of the Princess’s\nfrocks—her old ones perhaps—yes—yes—this person—your maid, no doubt?”\n\nA loud laugh rang suddenly through the hall. The King looked uneasily\nround, as though he expected something to happen. But nothing seemed\nlikely to occur.\n\n“Yes,” said Matilda, “Pridmore is—Oh, dear!”\n\nFor before her eyes she saw an awful change taking place in Pridmore.\nIn an instant all that was left of the original Pridmore were the boots\nand the hem of her skirt—the top part of her had changed into painted\niron and glass, and even as Matilda looked the bit of skirt that was\nleft got flat and hard and square. The two feet turned into four feet,\nand they were iron feet, and there was no more Pridmore.\n\n[THE TOP PART OF PRIDMORE TURNED INTO PAINTED IRON AND\nGLASS.]\n\n“Oh, my poor child,” said the King, “your maid has turned into an\nAutomatic Machine.”\n\nIt was too true. The maid had turned into a machine such as those which\nyou see in a railway station—greedy, grasping things which take your\npennies and give you next to nothing in chocolate and no change.\n\nBut there was no chocolate to be seen through the glass of the machine\nthat once had been Pridmore. Only little rolls of paper.\n\nThe King silently handed some pennies to Matilda. She dropped one into\nthe machine and pulled out the little drawer. There was a scroll of\npaper. Matilda opened it and read—\n\n“Don’t be tiresome.”\n\nShe tried again. This time it was—\n\n“If you don’t give over I’ll tell your Ma first thing when she comes\nhome.”\n\nThe next was—\n\n“Go along with you do—always worrying;” so then Matilda _knew_.\n\n“Yes,” said the King sadly, “I fear there’s no doubt about it. Your\nmaid has turned into an Automatic Nagging Machine. Never mind, my\ndear, she’ll be all right to-morrow.”\n\n“I like her best like this, thank you,” said Matilda quickly. “I\nneedn’t put in any more pennies, you see.”\n\n“Oh, we mustn’t be unkind and neglectful,” said the King gently, and he\ndropped in a penny. _He_ got—\n\n“You tiresome boy, you. Leave me be this minute.”\n\n“I can’t help it,” said the King wearily; “you’ve no idea how suddenly\nthings change here. It’s because—but I’ll tell you all about it at\ntea-time. Go with nurse now, my dear, and see if any of the Princess’s\nfrocks will fit you.”\n\nThen a nice, kind, cuddly nurse led Matilda away to the Princess’s\napartments, and took off the stiff frock that hurt, and put on a green\nsilk gown, as soft as birds’ breasts, and Matilda kissed her for sheer\njoy at being so comfortable.\n\n“And now, dearie,” said the nurse, “you’d like to see the Princess,\nwouldn’t you? Take care you don’t hurt yourself with her. She’s rather\nsharp.”\n\nMatilda did not understand this then. Afterwards she did.\n\n[THE PRINCESS WAS LIKE A YARD AND A HALF OF WHITE TAPE.]\n\nThe nurse took her through many marble corridors and up and down many\nmarble steps, and at last they came to a garden full of white roses,\nand in the middle of it, on a green satin-covered eiderdown, as big as\na feather bed, sat the Princess in a white gown.\n\nShe got up when Matilda came towards her, and it was like seeing a yard\nand a half of white tape stand up on one end and bow—a yard and a half\nof broad white tape, of course; but what is considered broad for tape\nis very narrow indeed for princesses.\n\n“How are you?” said Matilda, who had been taught manners.\n\n“Very slim indeed, thank you,” said the Princess. And she was. Her\nface was so white and thin that it looked as though it were made of an\noyster-shell. Her hands were thin and white, and her fingers reminded\nMatilda of fish-bones. Her hair and eyes were black, and Matilda\nthought she might have been pretty if she had been fatter. When she\nshook hands with Matilda her bony fingers hurt quite hard.\n\nThe Princess seemed pleased to see her visitor, and invited her to sit\nwith Her Highness on the satin cushion.\n\n“I have to be very careful or I should break,” said she; “that’s\nwhy the cushion is so soft, and I can’t play many games for fear of\naccidents. Do you know any sitting-down games?”\n\nThe only thing Matilda could think of was Cat’s-cradle, so they played\nthat with the Princess’s green hair-ribbon. Her fish-bony fingers were\nmuch cleverer than Matilda’s little fat, pink paws.\n\nMatilda looked about her between the games and admired everything very\nmuch, and asked questions, of course. There was a very large bird\nchained to a perch in the middle of a very large cage. Indeed the cage\nwas so big that it took up all one side of the rose-garden. The bird\nhad a yellow crest like a cockatoo and a very large bill like a toucan.\n(If you do not know what a toucan is you do not deserve ever to go to\nthe Zoological Gardens again.)\n\n“What is that bird?” asked Matilda.\n\n“Oh,” said the Princess, “that’s my pet Cockatoucan; he’s very\nvaluable. If he were to die or be stolen the Green Land would wither up\nand grow like New Cross or Islington.”\n\n“How horrible!” said Matilda.\n\n“I’ve never been to those places, of course,” said the Princess,\nshuddering, “but I hope I know my geography.”\n\n“All of it?” asked Matilda.\n\n“Even the exports and imports,” said the Princess. “Goodbye, I’m so\nthin I have to rest a good deal or I should wear myself out. Nurse,\ntake her away.”\n\nSo nurse took her away to a wonderful room, where she amused herself\ntill tea-time with all the kind of toys that you see and want in the\nshop when some one is buying you a box of bricks or a puzzle map—the\nkind of toys you never get because they are so expensive.\n\nMatilda had tea with the King. He was full of true politeness and\ntreated Matilda exactly as though she had been grown up—so that she was\nextremely happy and behaved beautifully.\n\nThe King told her all his troubles.\n\n“You see,” he began, “what a pretty place my Green Land was once. It\nhas points even now. But things aren’t what they used to be. It’s that\nbird, that Cockatoucan. We daren’t kill it or give it away. And every\ntime it laughs something changes. Look at my Prime Minister. He was a\nsix-foot man. And look at him now. I could lift him with one hand. And\nthen your poor maid. It’s all that bad bird.”\n\n“Why _does_ it laugh?” asked Matilda.\n\n“I can’t think,” said the King; “I can’t see anything to laugh at.”\n\n“Can’t you give it lessons, or something nasty to make it miserable?”\n\n“I have, I do, I assure you, my dear child. The lessons that bird has\nto swallow would choke a Professor.”\n\n“Does it eat anything else besides lessons?”\n\n“Christmas pudding. But there—what’s the use of talking—that bird would\nlaugh if it were fed on dog-biscuits.”\n\nHis Majesty sighed and passed the buttered toast.\n\n“You can’t possibly,” he went on, “have any idea of the kind of things\nthat happen. That bird laughed one day at a Cabinet Council, and all my\nministers turned into little boys in yellow socks. And we can’t get any\nlaws made till they come right again. It’s not their fault, and I must\nkeep their situations open for them, of course, poor things.”\n\n“Of course,” said Matilda.\n\n“There was a Dragon, now,” said the King. “When he came I offered the\nPrincess’s hand and half my kingdom to any one who would kill him.\nIt’s an offer that is always made, you know.”\n\n“Yes,” said Matilda.\n\n“Well, a really respectable young Prince came along, and every one\nturned out to see him fight the Dragon. As much as ninepence each was\npaid for the front seats, I assure you. The trumpet sounded and the\nDragon came hurrying up. A trumpet is like a dinner-bell to a Dragon,\nyou know. And the Prince drew his bright sword and we all shouted, and\nthen that wretched bird laughed and the Dragon turned into a pussy-cat,\nand the Prince killed it before he could stop himself. The populace was\nfurious.”\n\n“What happened then?” asked Matilda.\n\n“Well, I did what I could. I said, ‘You shall marry the Princess just\nthe same.’ So I brought the Prince home, and when we got there the\nCockatoucan had just been laughing again, and the Princess had turned\ninto a very old German governess. The Prince went home in a great hurry\nand an awful temper. The Princess was all right in a day or two. These\nare trying times, my dear.”\n\n“I am so sorry for you,” said Matilda, going on with the preserved\nginger.\n\n“Well you may be,” said the miserable Monarch; “but if I were to try\nto tell you all that that bird has brought on my poor kingdom I should\nkeep you up till long past your proper bedtime.”\n\n“I don’t mind,” said Matilda kindly. “Do tell me some more.”\n\n“Why,” the King went on, growing now more agitated, “why, at one titter\nfrom that revolting bird the long row of ancestors on my Palace wall\ngrew red-faced and vulgar; they began to drop their H’s and to assert\nthat their name was Smith from Clapham Junction.”\n\n“How dreadful!”\n\n“And once,” said the King in a whimper, “it laughed so loudly that two\nSundays came together and next Thursday got lost, and went prowling\naway and hid itself on the other side of Christmas.”\n\n“And now,” he said suddenly, “it’s bedtime.”\n\n“Must I go?” asked Matilda.\n\n“Yes please,” said the King. “I tell all strangers this tragic story\nbecause I always feel that perhaps some stranger might be clever enough\nto help me. You seem a very nice little girl. Do you think you are\nclever?”\n\nIt is very nice even to be _asked_ if you are clever. Your Aunt\nWilloughby knows well enough that you are not. But kings do say nice\nthings. Matilda was very pleased.\n\n“I don’t think I am clever,” she was saying quite honestly, when\nsuddenly the sound of a hoarse laugh rang through the banqueting hall.\nMatilda put her hands to her head.\n\n“Oh, dear!” she cried, “I feel so different. Oh! wait a minute. Oh!\nwhatever is it? Oh!”\n\nThen she was silent for a moment. Then she looked at the King and said,\n“I was wrong, your Majesty, I _am_ clever, and I know it is not good\nfor me to sit up late. Good-night. Thank you so much for your nice\nparty. In the morning I think I shall be clever enough to help you,\nunless the bird laughs me back into the other kind of Matilda.”\n\nBut in the morning Matilda’s head felt strangely clear; only when she\ncame down to breakfast full of plans for helping the King, she found\nthat the Cockatoucan must have laughed in the night, for the beautiful\nPalace had turned into a butcher’s shop, and the King, who was too wise\nto fight against Fate, had tucked up his royal robes, and was busy in\nthe shop weighing out six ounces of the best mutton-chops for a child\nwith a basket.\n\n“I don’t know how ever you can help me now,” he said, despairingly; “as\nlong as the Palace stays like this, it’s no use trying to go on with\nbeing a king, or anything. I can only try to be a good butcher. You\nshall keep the accounts if you like, till that bird laughs me back into\nmy Palace again.”\n\nSo the King settled down to business, respected by his subjects, who\nhad all, since the coming of the Cockatoucan, had their little ups and\ndowns. And Matilda kept the books and wrote out the bills, and really\nthey were both rather happy. Pridmore, disguised as the automatic\nmachine, stood in the shop and attracted many customers. They used to\nbring their children, and make the poor innocents put their pennies in,\nand then read Pridmore’s good advice. Some parents are so harsh. And\nthe Princess sat in the back garden with the Cockatoucan, and Matilda\nplayed with her every afternoon. But one day, as the King was driving\nthrough another kingdom, the King of that kingdom looked out of one of\nhis Palace windows, and laughed as the King went by, and shouted,\n“Butcher!”\n\n[THE KING SENT HIS ARMY, AND THE ENEMY WERE CRUSHED.]\n\nThe Butcher-King did not mind this, because it was true, however rude.\nBut when the other King called out, “What price cat’s meat!” the King\nwas very angry indeed, because the meat he sold was always of the best\nquality. When he told Matilda all about it, she said, “Send the Army to\ncrush him.”\n\nSo the King sent his Army, and the enemy were crushed. The Bird laughed\nthe King back into his throne, and laughed away the butcher’s shop\njust in time for his Majesty to proclaim a general holiday, and to\norganise a magnificent reception for the Army. Matilda now helped the\nKing to manage everything. She wonderfully enjoyed the new delightful\nfeeling of being clever, so that she felt it was indeed too bad when\nthe Cockatoucan laughed just as the reception was beautifully arranged.\nIt laughed, and the general holiday was turned into an income tax; the\nmagnificent reception changed itself to a royal reprimand, and the Army\nitself suddenly became a discontented Sunday-school treat, and had to\nbe fed with buns and brought home in brakes, crying.\n\n“Something must be done,” said the King.\n\n“Well,” said Matilda, “I’ve been thinking if you will make me the\nPrincess’s governess, I’ll see what I can do. I’m quite clever enough.”\n\n“I must open Parliament to do that,” said the King; “it’s a\nConstitutional change.”\n\nSo he hurried off down the road to open Parliament. But the bird put\nits head on one side and laughed at him as he went by. He hurried on,\nbut his beautiful crown grew large and brassy, and was set with cheap\nglass in the worst possible taste. His robe turned from velvet and\nermine to flannelette and rabbit’s fur. His sceptre grew twenty feet\nlong and extremely awkward to carry. But he persevered, his royal blood\nwas up.\n\n“No bird,” said he, “shall keep me from my duty and my Parliament.”\n\nBut when he got there, he was so agitated that he could not remember\nwhich was the right key to open Parliament with, and in the end he\nhampered the lock and so could not open Parliament at all, and members\nof Parliament went about making speeches in the roads to the great\nhindrance of the traffic.\n\nThe poor King went home and burst into tears.\n\n“Matilda,” he said, “this is too much. You have always been a comfort\nto me. You stood by me when I was a butcher; you kept the books; you\nbooked the orders; you ordered the stock. If you really are clever\nenough, now is the time to help me. If you won’t, I’ll give up the\nbusiness. I’ll leave off being a King. I’ll go and be a butcher in the\nCamberwell New Road, and I will get another little girl to keep my\nbooks, not you.”\n\nThis decided Matilda. She said, “Very well, your Majesty, then give\nme leave to prowl at night. Perhaps I shall find out what makes the\nCockatoucan laugh; if I can do that, we can take care he never gets it,\nwhatever it is.”\n\n“Ah!” said the poor King, “if you could only do that.”\n\nWhen Matilda went to bed that night, she did not go to sleep. She lay\nand waited till all the Palace was quiet, and then she crept softly,\npussily, mousily to the garden, where the Cockatoucan’s cage was, and\nshe hid behind a white rosebush, and looked and listened. Nothing\nhappened till it was gray dawn, and then it was only the Cockatoucan\nwho woke up. But when the sun was round and red over the Palace roof,\nsomething came creeping, creeping, pussily, mousily out of the Palace;\nand it looked like a yard and a half of white tape creeping along; and\nit was the Princess herself.\n\nShe came quietly up to the cage, and squeezed herself between the bars;\nthey were very narrow bars, but a yard and a half of white tape can\ngo through the bars of any birdcage I ever saw. And the Princess went\nup to the Cockatoucan and tickled him under his wings till he laughed\naloud. Then, quick as thought, the Princess squeezed through the bars,\nand was back in her room before the bird had finished laughing. Matilda\nwent back to bed. Next day all the sparrows had turned into cart\nhorses, and the roads were impassable.\n\nThat day when she went, as usual, to play with the Princess, Matilda\nsaid to her suddenly, “Princess, what makes you so thin?”\n\nThe Princess caught Matilda’s hand and pressed it with warmth.\n\n“Matilda,” she said simply, “you have a noble heart. No one else has\never asked me that, though they tried to cure it. And I couldn’t answer\ntill I was asked, could I? It’s a sad, a tragic tale, Matilda. I was\nonce as fat as you are.”\n\n[THE KING HAD TURNED INTO A VILLA RESIDENCE.]\n\n“I’m not so very fat,” said Matilda, indignantly.\n\n“Well,” said the Princess impatiently, “I was quite fat enough anyhow.\nAnd then I got thin—”\n\n“But how?”\n\n“Because they would not let me have my favourite pudding every day.”\n\n“What a shame!” said Matilda, “and what is your favourite pudding?”\n\n“Bread and milk, of course, sprinkled with rose leaves—and with\npear-drops in it.”\n\nOf course, Matilda went at once to the King, and while she was on her\nway the Cockatoucan happened to laugh. When she reached the King, he\nwas in no condition for ordering dinner, for he had turned into a\nvilla-residence, replete with every modern improvement. Matilda only\nrecognised him, as he stood sadly in the Park, by the crown that stuck\ncrookedly on one of the chimney-pots, and the border of ermine along\nthe garden path. So she ordered the Princess’s favourite pudding on her\nown responsibility, and the whole Court had it every day for dinner,\ntill there was no single courtier but loathed the very sight of bread\nand milk, and there was hardly one who would not have run a mile rather\nthan meet a pear-drop. Even Matilda herself got rather tired of it,\nthough being clever, she knew how good bread and milk was for her.\n\nBut the Princess got fatter and fatter, and rosier and rosier. Her\nthread-paper gowns had to be let out, and let out, till there were no\nmore turnings in left to be let out, and then she had to wear the old\nones that Matilda had been wearing, and then to have new ones. And as\nshe got fatter she got kinder, till Matilda grew quite fond of her.\n\nAnd the Cockatoucan had not laughed for a month.\n\nWhen the Princess was as fat as any Princess ought to be, Matilda\nwent to her one day, and threw her arms round her and kissed her. The\nPrincess kissed her back, and said, “Very well, I _am_ sorry then, but\nI didn’t want to say so, but now I will. And the Cockatoucan never\nlaughs except when he’s tickled. So there! He hates to laugh.”\n\n“And you won’t do it again,” said Matilda, “will you?”\n\n“No, of course not,” said the Princess, very much surprised, “why\nshould I? I was spiteful when I was thin, but now I’m fat again I want\nevery one to be happy.”\n\n“But how can any one be happy?” asked Matilda, severely, “when every\none is turned into something they weren’t meant to be? There’s your\ndear father—he’s a desirable villa—the Prime Minister was a little boy,\nand he got back again, and now he’s turned into a Comic Opera. Half the\nPalace housemaids are breakers, dashing themselves against the Palace\ncrockery: the Navy, to a man, are changed to French poodles, and the\nArmy to German sausages. Your favourite nurse is now a flourishing\nsteam laundry, and I, alas! am too clever by half. Can’t that horrible\nbird do anything to put us all right again?”\n\n“No,” said the Princess, dissolved in tears at this awful picture, “he\ntold me once himself that when he laughed he could only change one or\ntwo things at once, and then, as often as not, it turned out to be\nsomething he didn’t expect. The only way to make everything come right\nagain would be—but it can’t be done! If we could only make him laugh on\nthe wrong side of his mouth. That’s the secret. He told me so. But I\ndon’t know what it _is_, let alone being able to do it. Could _you_ do\nit, Matilda?”\n\n“No,” said Matilda, “but let me whisper. He’s listening. Pridmore\ncould. She’s often told me she’d do it to me. But she never has. Oh,\nPrincess, I’ve got an idea.”\n\nThe two were whispering so low that the Cockatoucan could not hear,\nthough he tried his hardest. Matilda and the Princess left him\nlistening.\n\nPresently he heard a sound of wheels. Four men came into the\nrose-garden wheeling a great red thing in a barrow. They set it down in\nfront of the Cockatoucan, who danced on his perch with rage.\n\n“Oh,” he said, “if only some one would make me laugh, that horrible\nthing would be the one to change. I know it would. It would change into\nsomething much horrider than it is now. I feel it in all my feathers.”\n\nThe Princess opened the cage-door with the Prime Minister’s key, which\na tenor singer had found at the beginning of his music. It was also the\nkey of the comic opera. She crept up behind the Cockatoucan and tickled\nhim under both wings. He fixed his baleful eye on the red Automatic\nMachine and laughed long and loud; he saw the red iron and glass\nchange before his eyes into the form of Pridmore. Her cheeks were red\nwith rage and her eyes shone like glass with fury.\n\n[FOUR MEN CAME WHEELING A GREAT RED THING ON A BARROW.]\n\n“Nice manners!” said she to the Cockatoucan, “what are you laughing at,\nI should like to know—I’ll make you laugh on the wrong side of your\nmouth, my fine fellow!”\n\nShe sprang into the cage, and then and there, before the astonished\nCourt, she shook that Cockatoucan till he really and truly did laugh on\nthe wrong side of his mouth. It was a terrible sight to witness, and\nthe sound of that wrong-sided laughter was horrible to hear.\n\nBut instantly all the things changed back as if by magic to what they\nhad been before. The laundry became a nurse, the villa became a king,\nthe other people were just what they had been before, and all Matilda’s\nwonderful cleverness went out like the snuff of a candle.\n\nThe Cockatoucan himself fell in two—one half of him became a common,\nordinary Toucan, such as you must have seen a hundred times at the Zoo,\nunless you are unworthy to visit that happy place, and the other half\nbecame a weathercock, which, as you know, is always changing and makes\nthe wind change too. So he has not quite lost his old power. Only now\nhe is in halves, any power he may have has to be used without laughing.\nThe poor, broken Cockatoucan, like King you-know-who in English\nhistory, has never since that sad day smiled again.\n\nThe grateful King sent an escort of the whole Army, now no longer\ndressed in sausage skins, but in uniforms of dazzling beauty, with\ndrums and banners, to see Matilda and Pridmore home. But Matilda was\nvery sleepy. She had been clever for so long that she was quite tired\nout. It is indeed a very fatiguing thing, as no doubt you know. And\nthe soldiers must have been sleepy too, for one by one the whole Army\ndisappeared, and by the time Pridmore and Matilda reached home there\nwas only one left, and he was the policeman at the corner.\n\nThe next day Matilda began to talk to Pridmore about the Green Land and\nthe Cockatoucan and the Villa-residence-King, but Pridmore only said—\n\n“Pack of nonsense! Hold your tongue, do!”\n\nSo Matilda naturally understood that Pridmore did not wish to be\nreminded of the time when she was an Automatic Nagging Machine, so of\ncourse, like a kind and polite little girl, she let the subject drop.\n\nMatilda did not mention her adventures to the others at home because\nshe saw that they believed her to have spent the time with her\nGreat-aunt Willoughby.\n\nAnd she knew if she had said that she had not been there she would be\nsent at once—and she did not wish this.\n\nShe has often tried to get Pridmore to take the wrong omnibus again,\nwhich is the only way she knows of getting to the Green Land; but only\nonce has she been successful, and then the omnibus did not go to the\nGreen Land at all, but to the Elephant and Castle.\n\nBut no little girl ought to expect to go to the Green Land more than\nonce in a lifetime. Many of us indeed are not even so fortunate as to\ngo there once.\n\n\n\n\nBOOK 2. WHEREYOUWANTOGO. or THE BOUNCIBLE BALL.\n\n\nIT is very hard, when you have been accustomed to go to the seaside\nevery summer ever since you were quite little, to be made to stay in\nLondon just because an aunt and an uncle choose to want to come and\nstay at your house to see the Royal Academy and go to the summer sales.\n\nSelim and Thomasina felt that it was very hard indeed. And aunt and\nuncle were not the nice kind, either. If it had been Aunt Emma, who\ndressed dolls and told fairy-tales—or Uncle Reggie, who took you to the\nCrystal Palace, and gave you five bob at a time, and never even asked\nwhat you spent it on, it would have been different. But it was Uncle\nThomas and Aunt Selina.\n\nAunt Selina was all beady, and sat bolt upright, and told you to mind\nwhat you were told, and Selim had been named after her—as near as they\ncould get. And Uncle Thomas was the one Thomasina had been named after:\nhe was deaf, and he always told you what the moral of everything was,\nand the housemaid said he was “near.”\n\n“I know he is, worse luck,” said Thomasina.\n\n“I mean, miss,” explained the housemaid, “he’s none too free with his\nchink.”\n\nSelim groaned. “He never gave me but a shilling in his life,” said\nhe, “and that turned out to be bad when I tried to change it at the\nginger-beer shop.”\n\nThe children could not understand why this aunt and uncle were allowed\nto interfere with everything as they did: and they quite made up their\nminds that when they were grown up they would never allow an aunt or an\nuncle to cross their doorsteps. They never thought—poor, dear little\nthings—that some day they would grow up to be aunts and uncles in their\nturn, or, at least, one of each.\n\nIt was very hot in London that year: the pavement was like hot pie,\nand the asphalt was like hot pudding, and there was a curious wind\nthat collected dust and straw and dirty paper, and then got tired of\nits collection, and threw it away in respectable people’s areas and\nfront gardens. The blind in the nursery had never been fixed up since\nthe day when the children took it down to make a drop-scene for a play\nthey were going to write and never did. So the hot afternoon sun came\nburning in through the window, and the children got hotter and hotter,\nand crosser and crosser, till at last Selim slapped Thomasina’s arms\ntill she cried, and Thomasina kicked Selim’s legs till he screamed.\n\nThen they sat down in different corners of the nursery and cried, and\ncalled each other names, and said they wished they were dead. This is\nvery naughty indeed, as, of course, you know; but you must remember how\nhot it was.\n\nWhen they had called each other all the names they could think of,\nThomasina said, suddenly, “All right, Silly,” (that was Selim’s pet\nname)—“cheer up.”\n\n“It’s too hot to cheer up,” said Selim, gloomily.\n\n“We’ve been very naughty,” said Thomasina, rubbing her eyes with the\npaint rag, “but it’s all the heat. I heard Aunt Selina telling mother\nthe weather wore her nerves to fiddle-strings. That just meant she was\ncross.”\n\n“Then it’s not _our_ fault,” said Selim. “People say be good and you’ll\nbe happy. Uncle Reggy says, ‘Be happy, and perhaps you’ll be good.’ _I_\ncould be good if I was happy.”\n\n“So could I,” said Thomasina.\n\n“What _would_ make you happy?” said a thick, wheezy voice from the toy\ncupboard, and out rolled the big green and red india-rubber ball that\nAunt Emma had sent them last week. They had not played with it much,\nbecause the garden was so hot and sunny—and when they wanted to play\nwith it in the street, on the shady side, Aunt Selina had said it was\nnot like respectable children, so they weren’t allowed.\n\nNow the Ball rolled out very slowly—and the bright light on its new\npaint seemed to make it wink at them. You will think that they were\nsurprised to hear a ball speak. Not at all. As you grow up, and more\nand more strange things happen to you, you will find that the more\nastonishing a thing is the less it surprises you. (I wonder why this\nis. Think it over, and write and tell me what you think.)\n\nSelim stood up, and said, “Halloa”; but that was only out of\npoliteness. Thomasina answered the Ball’s question.\n\n“We want to be at the seaside—and no aunts—and none of the things we\ndon’t like—and no uncles, of course,” she said.\n\n“Well,” said the Ball, “if you think you can be good, why not set me\nbouncing?”\n\n“We’re not allowed in here,” said Thomasina, “because of the crinkly\nornaments people give me on my birthdays.”\n\n“Well, the street then,” said the Ball; “the nice shady side.”\n\n“It’s not like respectable children,” said Selim sadly.\n\nThe Ball laughed. If you have never heard an india-rubber ball laugh\nyou won’t understand. It’s the sort of quicker, quicker, quicker,\nsofter, softer, softer chuckle of a bounce that it gives when it’s\nsettling down when you’re tired of bouncing it.\n\n“The garden, then,” it said.\n\n“I don’t mind, if you’ll go on talking,” said Selim kindly.\n\nSo they took the Ball down into the garden and began to bounce it in\nthe sun, on the dry, yellowy grass of the lawn.\n\n“Come on,” said the Ball. “You do like me!”\n\n“What?” said the children.\n\n“Why, do like I do—bounce!” said the Ball. “That’s right—higher,\nhigher, higher!”\n\nFor then and there the two children had begun bouncing as if their\nfeet were india-rubber balls, and you have no idea what a delicious\nsensation that gives you.\n\n“Higher, higher,” cried the green and red ball, bouncing excitedly.\n“Now, follow me, higher, higher.” And off it bounced down the blackened\ngravel of the path, and the children bounced after it, shrieking with\ndelight at the new feeling. They bounced over the wall—all three of\nthem—and the children looked back just in time to see Uncle Thomas\ntapping at the window, and saying, “Don’t.”\n\nYou have not the least idea how glorious it is to feel full of\nbouncibleness; so that, instead of dragging one foot after the other,\nas you do when you feel tired or naughty, you bounce along, and every\ntime your feet touch the ground you bounce higher, and all without\ntaking any trouble or tiring yourself. You have, perhaps, heard of the\nGreek gentleman who got new strength every time he fell down. His name\nwas Antæus, and I believe he was an india-rubber ball, green on one\nside where he touched the earth, and red on the other where he felt the\nsun. But enough of classical research.\n\nThomasina and Selim bounced away, following the Bouncible Ball. They\nwent over fences and walls, and through parched, dry gardens and\nburning-hot streets; they passed the region where fields of cabbages\nand rows of yellow brick cottages mark the division between London and\nthe suburbs. They bounced through the suburbs, dusty and neat, with\ngeraniums in the front gardens, and all the blinds pulled half-way\ndown; and then the lamp-posts in the road got fewer and fewer, and\nthe fields got greener and the hedges thicker—it was real, true\ncountry—with lanes instead of roads; and down the lanes the green and\nred Ball went bouncing, bouncing, bouncing, and the children after it.\nThomasina, in her white, starched frock, very prickly round the neck,\nand Selim, in his every-day sailor-suit, a little tight under the\narms. His Sunday one was a size larger. No one seemed to notice them,\nbut they noticed and pitied the children who were being “taken for a\nwalk” in the gritty suburban roads.\n\n“Where are we going?” they asked the Ball, and it answered, with a\nsparkling green and red smile—\n\n“To the most delightful place in the world.”\n\n“What’s it called?” asked Selim.\n\n“It’s called Whereyouwantogoto,” the Ball answered, and on they went.\nIt was a wonderful journey—up and down, looking through the hedges and\nover them, looking in at the doors of cottages, and then in at the top\nwindows, up and down—bounce—bounce—bounce.\n\nAnd at last they came to the sea. And the Bouncing Ball said, “Here you\nare! Now be good, for there’s nothing here but the things that make\npeople happy.” And with that he curled himself up like a ball in the\nshadow of a wet sea-weedy rock, and went to sleep, for he was tired out\nwith his long journey. The children stopped bouncing, and looked about\nthem.\n\n“Oh, Tommy;” said Selim.\n\n[THEY BOUNCED THROUGH THE SUBURBS.]\n\n“Oh, Silly!” said Thomasina. And well they might! In the place to which\nthe Ball had brought them was all that your fancy can possibly paint,\nand a great deal more beside.\n\nThe children feel exactly as you do when you’ve had the long, hot,\ndirty train journey—and every one has been so cross about the boxes and\nthe little brown portmanteau that was left behind at the junction—and\nthen when you get to your lodgings you are told that you may run down\nand have a look at the sea if you’re back by tea time, and mother and\nnurse will unpack.\n\nOnly Thomasina and her brother had not had a tiresome journey—and there\nwere no nasty, stuffy lodgings for them, and no tea with oily butter\nand a new pot of marmalade.\n\n“There’s silver-sand,” said she—“miles of it.”\n\n“And rocks,” said he.\n\n“And cliffs.”\n\n“And caves in the cliffs.”\n\n“And how cool it is,” said Thomasina.\n\n“And yet it’s nice and warm too,” said Selim.\n\n“And what shells!”\n\n“And seaweed.”\n\n“And the downs behind!”\n\n“And trees in the distance!”\n\n“And here’s a dog, to go after sticks. Here, Rover, Rover.”\n\nA big black dog answered at once to the name, because he was a\nretriever, and they are all called Rover.\n\n“And spades!” said the girl.\n\n“And pails!” said the boy.\n\n“And what pretty sea-poppies,” said the girl.\n\n“And a basket—and grub in it!” said the boy. So they sat down and had\nlunch.\n\nIt was a lovely lunch. Lobsters and ice-creams (strawberry and\npine-apple), and toffee and hot buttered toast and ginger-beer. They\nate and ate, and thought of the aunt and uncle at home, and the minced\nveal and sago pudding, and they were very happy indeed.\n\nJust as they were finishing their lunch they saw a swirling, swishing,\nsplashing commotion in the green sea a little way off, and they tore\noff their clothes and rushed into the water to see what it was. It was\na seal. He was very kind and convenient. He showed them how to swim and\ndive.\n\n“But won’t it make us ill to bathe so soon after meals? Isn’t it\nwrong?” asked Thomasina.\n\n[THE SEAL WAS VERY KIND AND CONVENIENT.]\n\n“Not at all,” said the seal. “Nothing is wrong here—as long as you’re\ngood. Let me teach you water-leapfrog—a most glorious game, so cool,\nyet so exciting. You try it.”\n\nAt last the seal said: “I suppose you wear man-clothes. They’re very\ninconvenient. My two eldest have just outgrown their coats. If you’ll\naccept them——”\n\nAnd it dived, and came up with two golden sealskin coats over its arm,\nand the children put them on.\n\n“Thank you very much,” they said. “You _are_ kind.”\n\nI am almost sure that it has never been your luck to wear a fur coat\nthat fitted you like a skin, and that could not be spoiled with sand or\nwater, or jam, or bread and milk, or any of the things with which you\nmess up the nice new clothes your kind relations buy for you. But if\nyou like, you may try to imagine how jolly the little coats were.\n\nThomasina and Selim played all day on the beach, and when they were\ntired then went into a cave, and found supper—salmon and cucumber, and\nwelsh-rabbit and lemonade—and then they went to bed in a great heap\nof straw and grass and fern and dead leaves, and all the delightful\nthings you have often wished to sleep in. Only you have never been\nallowed to.\n\nIn the morning there were plum-pudding for breakfast, and roast duck\nand lemon jelly, and the day passed like a happy dream, only broken by\nsurprising and delightful meals. The Ball woke up and showed them how\nto play water-polo; and they bounced him on the sand, with shrieks of\njoy and pleasure. You know, a Ball likes to be bounced by people he is\nfond of—it is like slapping a friend on the shoulder.\n\nThere were no houses in “Whereyouwantogoto,” and no bathing machines\nor bands, no nursemaids or policemen or aunts or uncles. You could do\nexactly what you liked as long as you were good.\n\n“What will happen if we’re naughty?” Selim asked. The Ball looked very\ngrave, and answered—\n\n“I must not tell you; and I very strongly advise you not to try to find\nout.”\n\n“We won’t—indeed, we won’t,” said they, and went off to play rounders\nwith the rabbits on the downs—who were friendly fellows, and very keen\non the game.\n\nOn the third evening Thomasina was rather silent, and the Ball said,\n“What’s the matter, girl-bouncer? Out with it.”\n\nSo she said, “I was wondering how mother is, and whether she has one of\nher bad headaches.”\n\nThe Ball said, “Good little girl! Come with me and I’ll show you\nsomething.”\n\nHe bounced away, and they followed him, and he flopped into a rocky\npool, frightening the limpets and sea-anemones dreadfully, though he\ndid not mean to.\n\n“Now look,” he called from under the water, and the children looked,\nand the pool was like a looking-glass, only it was not their own faces\nthey saw in it.\n\nThey saw the drawing-room at home, and father and mother, who were\nboth quite well, only they looked tired—and the aunt and uncle were\nthere—and Uncle Thomas was saying, “What a blessing those children are\naway.”\n\n“Then they know where we are?” said Selim to the Ball.\n\n“They think they know,” said the Ball, “or you think they think they\nknow. Anyway, they’re happy enough. Good-night.”\n\nAnd he curled himself up like a ball in his favourite sleeping-place.\nThe two children crept into their pleasant, soft, sweet nest of straw\nand leaves and fern and grass, and went to sleep. But Selim was vexed\nwith Thomasina because she had thought of mother before he had, and he\nsaid she had taken all the fern—and they went to sleep rather cross.\nThey woke crosser. So far they had both helped to make the bed every\nmorning, but to-day neither wanted to.\n\n“I don’t see why I should make the beds,” said he; “it’s a girl’s work,\nnot a boy’s.”\n\n“I don’t see why I should do it,” said Thomasina; “it’s a servant’s\nplace, not a young lady’s.”\n\nAnd then a very strange and terrible thing happened. Quite suddenly,\nout of nothing and out of nowhere, appeared a housemaid—large and stern\nand very neat indeed, and she said—\n\n“You are quite right, miss; it is my place to make the beds. And I am\ninstructed to see that you are both in bed by seven.”\n\nThink how dreadful this must have been to children who had been going\nto bed just when they felt inclined. They went out on to the beach.\n\n“You see what comes of being naughty,” said Thomasina; and Selim\nsaid, “Oh, shut up, do!”\n\n[SUDDENLY, OUT OF NOTHING AND NOWHERE, APPEARED A LARGE,\nSTERN HOUSEMAID.]\n\nThey cheered up towards dinner-time—it was roast pigeons that day and\nbread sauce, and whitebait and syllabubs—and for the rest of the day\nthey were as good as gold, and very polite to the Ball. Selim told it\nall about the dreadful apparition of the housemaid, and it shook its\nhead (I know _you’ve_ never seen a ball do that, and very likely you\nnever will) and said—\n\n“My Bouncible Boy, you may be happy here for ever and ever if you’re\ncontented and good. Otherwise—well, it’s a quarter to seven—you’ve got\nto go.”\n\nAnd, sure enough, they had to. And the housemaid put them to bed, and\nwashed them with yellow soap, and some of it got in their eyes. And\nshe lit a night-light, and sat with them till they went to sleep, so\nthat they couldn’t talk, and were ever so much longer getting to sleep\nthan they would have been if she had not been there. And the beds were\niron, with mattresses and hot, stuffy, fluffy sheets and many more new\nblankets than they wanted.\n\nThe next day they got out as early as they could and played water\nfootball with the seal and the Bouncible Ball, and when dinner-time\ncame it was lobster and ices. But Thomasina was in a bad temper. She\nsaid, “I wish it was duck.” And before the words had left her lips it\nwas cold mutton and rice-pudding, and they had to sit up to table and\neat it properly too, and the housemaid came round to see that they\ndidn’t leave any bits on the edges of their plates, or talk with their\nmouths full.\n\nThere were no more really nice meals after that, only the sort of\nthings you get at home. But it is possible to be happy even without\nreally nice meals. But you have to be very careful. The days went by\npleasantly enough. All the sea and land creatures were most kind and\nattentive. The seal taught them all it knew, and was always ready to\nplay with them. The star-fish taught them astronomy, and the jelly-fish\ntaught them fancy cooking. The limpets taught them dancing as well\nas they could for their lameness. The sea-birds taught them to make\nnests—a knowledge they have never needed to apply—and if the oysters\ndid not teach them anything it was only because oysters are so very\nstupid, and not from any lack of friendly feeling.\n\nThe children bathed every day in the sea, and if they had only been\ncontent with this all would have been well. But they weren’t.\n\n[A LONG, POINTED THING CAME SLOWLY UP OUT OF THE SAND.]\n\n“Let’s dig a bath,” said Selim, “and the sea will come in and fill it,\nand then we can bathe in it.”\n\nSo they fetched their spades and dug—and there was no harm in that, as\nyou very properly remark.\n\nBut when the hole was finished, and the sea came creep, creep, creeping\nup—and at last a big wave thundered up the sand and swirled into the\nhole, Thomasina and Selim were struggling on the edge, fighting which\nshould go in first, and the wave drew sandily back into the sea, and\nneither of them had bathed in the new bath. And now it was all wet and\nsandy, and its nice sharp edges rounded off, and much shallower. And\nas they looked at it angrily, the sandy bottom of the bath stirred and\nshifted and rose up, as if some great sea-beast were heaving underneath\nwith his broad back. The wet sand slipped back in slabs at each side,\nand a long pointed thing like a thin cow’s back came slowly up. It\nshowed broader and broader, and presently the flakes of wet sand were\ndropping heavily off the top of a brand-new bathing machine that stood\non the sand over where their bath had been.\n\n“Well,” said Selim, “we’ve done it this time.”\n\nThey certainly had, for on the door of the bathing machine was painted:\n“You must not bathe any more except through me.”\n\nSo there was no more running into the sea just when and how they liked.\nThey had to use the bathing machine, and it smelt of stale salt water\nand other people’s wet towels.\n\nAfter this the children did not seem to care so much about the seaside,\nand they played more on the downs, where the rabbits were very kind\nand hospitable, and in the woods, where all sorts of beautiful flowers\ngrew wild—and there was nobody to say “Don’t” when you picked them. The\nchildren thought of what Uncle Thomas would have said if he had been\nthere, and they were very, very happy.\n\nBut one day Thomasina had pulled a lot of white convolvulus and some\npink geraniums and calceolarias—the kind you are never allowed to pick\nat home—and she had made a wreath of them and put it on her head.\n\nThen Selim said, “You _are_ silly! You look like a Bank Holiday.”\n\nAnd his sister said, “I can’t help it. They’d look lovely on a hat, if\nthey were only artificial. I wish I had a hat.”\n\nAnd she had. A large stiff hat that hurt her head just where the\nelastic was sewn on, and she had her stiff white frock that scratched,\nher tiresome underclothing, all of it, and stockings and heavy boots;\nand Selim had his sailor suit—the every-day one that was too tight in\nthe arms; and they had to wear them always, and their fur coats were\ntaken away.\n\nThey went sadly, all stiff and uncomfortable, and told the Bouncible\nBall. It looked very grave, and great tears of salt water rolled down\nits red and green cheeks as it sat by the wet, seaweed-covered rock.\n\n“Oh, you silly children,” it said, “haven’t you been warned enough?\nYou’ve everything a reasonable child could wish for. Can’t you be\ncontented?”\n\n“Of course we can,” they said—and so they were—for a day and a half.\nAnd then it wasn’t exactly discontent but real naughtiness that brought\nthem to grief.\n\nThey were playing on the downs by the edge of the wood under the\nheliotrope tree. A hedge of camellia bushes cast a pleasant shadow, and\nout in the open sunlight on the downs the orchids grew like daisies,\nand the carnations like buttercups. All about was that kind of turf\non which the gardener does not like you to play, and they had pulled\narmfuls of lemon verbena and made a bed of it. But Selim’s blouse was\ntight under the arms. So when Thomasina said—\n\n“Oh, Silly dear, how beautiful it is, just like fairyland,” he said—\n\n“Silly yourself. There’s no such thing as fairyland.”\n\nJust then a fairy, with little bright wings the colour of a peacock’s\ntail, fluttered across the path, and settled on a magnolia flower.\n\n“Oh! Silly darling,” cried Thomasina, “it _is_ fairyland, and there’s a\nfairy, such a beautiful dear. Look—there she goes.”\n\nBut Selim would not look—he turned over and hid his eyes.\n\n“There’s no such thing as fairyland, I tell you,” he grunted, “and I\ndon’t believe in fairies.”\n\nAnd then, quite suddenly and very horribly the fairy turned into a\npoliceman—because every one knows there are such things as policemen,\nand any one can believe in _them_.\n\nAnd all the rare and beautiful flowers withered up and disappeared,\nand only thorns and thistles were left, and the misty, twiny trim\nlittle grass path that led along the top of the cliffs turned into\na parade, and the policeman walked up and down it incessantly, and\nwatched the children at their play, and you know how difficult it is\nto play when any one is watching you, especially a policeman. Selim\nwas extremely vexed: that was why, he said, there couldn’t possibly be\nglow-worms as big as bicycle lamps, which, of course, there were in\n“Whereyouwantogoto.” It was after that that the gas-lamps were put all\nalong the parade, and a pier sprang up on purpose to be lighted with\nelectricity, and a band played, because it is nonsense to have a pier\nwithout a band.\n\n[IT IS DIFFICULT TO PLAY WHEN ANY ONE IS WATCHING YOU,\nESPECIALLY A POLICEMAN.]\n\n“Oh, you naughty, silly children,” said the Bouncible Ball, turning red\nwith anger, except in the part where he was green with disgust; “it\nmakes me bounce with rage to see how you’ve thrown away your chances,\nand what a seaside resort you’re making of ‘Whereyouwantogoto.’”\n\nAnd he did bounce, angrily, up and down the beach till the housemaid\nlooked out of the cave and told the children not to be so noisy, and\nthe policeman called out—\n\n“Now then, move along there, move along. You’re obstructing of the\ntraffic.”\n\nAnd now I have something to tell you which you will find it hard to\nmake any excuses for. I can’t make any myself. I can only ask you to\nremember how hard it is to be even moderately good, and how easy it is\nto be extremely naughty.\n\nWhen the Bouncible Ball stopped bouncing, Selim said—\n\n“I wonder what makes him bounce.”\n\n“Oh no, _don’t!_” cried Thomasina, for she had heard her brother wonder\nthat about balls before, and she knew all too well what it ended in.\n\n“Oh, _don’t_,” she said, “oh, Silly, he brought us here, he’s been so\nkind.” But Selim said, “Nonsense; balls can’t feel, and it will be\nalmost as good to play with after I’ve looked inside it.”\n\nAnd then, before Thomasina could prevent him, he pulled out the knife\nUncle Reggy gave him last holiday but one, and catching the Ball up,\nhe plunged the knife into its side. The Bouncible Ball uttered one\nwhiffing squeak of pain and grief, then with a low, hissing sigh\nits kindly spirit fled, and it lay, a lifeless mass of paint and\nindia-rubber in the hands of its assassin. Thomasina burst into\ntears—but the heartless Selim tore open the Ball, and looked inside.\nYou know well enough what he found there. Emptiness; the little square\npatch of india-rubber that makes the hard lump on the outside of the\nball which you feel with your fingers when the ball is alive and his\nown happy, bouncing, cheerful self.\n\nThe children stood looking at each other.\n\n“I—I almost wish I hadn’t,” said Selim at last; but before Thomasina\ncould answer he had caught her hand.\n\n“Oh, look,” he cried, “look at the sea.”\n\nIt was, indeed, a dreadful sight. The beautiful dancing, sparkling blue\nsea was drying up before their eyes—in less than a moment it was quite\nflat and dusty. It hurriedly laid down a couple of railway lines, ran\nup a signal-box and telegraph-poles, and became the railway at the back\nof their house at home.\n\nThe children, gasping with horror, turned to the downs. From them tall,\nyellow brick houses were rising, as if drawn up by an invisible hand.\nJust as treacle does in cold weather if you put your five fingers in\nand pulled them up. But, of course, you are never allowed to do this.\nThe beach got hard—it was a pavement. The green downs turned grey—they\nwere slate roofs—and Thomasina and Selim found themselves at the iron\ngate of their own number in the terrace—and there was Uncle Thomas at\nthe window knocking for them to come in, and Aunt Selina calling out to\nthem how far from respectable it was to play in the streets.\n\nThey were sent to bed at once—that was Aunt Selina’s suggestion—and\nUncle Thomas arranged that they should have only dry bread for tea.\n\nSelim and Thomasina have never seen “Whereyouwantogoto” again, nor the\nBouncible Ball—not even his poor body—and they don’t deserve to either.\nOf course, Thomasina was not so much to blame as Selim, but she was\npunished just the same. I can’t help that. This is really the worst of\nbeing naughty. You not only have to suffer for it yourself, but some\none else always has to suffer too, generally the person who loves you\nbest.\n\nYou are intelligent children, and I will not insult you with a moral.\nI am not Uncle Thomas. Nor will I ask you to remember what I have told\nyou. I am not Aunt Selina.\n\n\n\n\nBOOK 3. THE BLUE MOUNTAIN\n\n\nTONY was young Tony, and old Tony was his grandfather. This story is\nabout young Tony, and no human being believes a word of it, unless\nyoung Tony does.\n\nTony was born in the town of Antioch. This is not the same Antioch that\nyou read about in history, but quite a different place. It was a place\nwhere nearly every one was very dark as to the complexion, and rather\nshort as to the temper and figure. People who were fair in the face and\neasy in the temper were not thought much of in Antioch. When Tony’s\nmother saw that her baby was as fair as a daffodil and as good as gold,\nand laughed all day, she said, “Oh dear, oh dear, I suppose he takes\nafter his grandfather, he is not in the least like _my_ family,” and\nthe matter annoyed her so much that she died.\n\nThen there was only old Tony left to look after young Tony, because\nhis father had been killed in the wars—-only a few weeks before.\n\nThe people of Antioch were always fighting the neighbouring tribes,\nred-faced savages who deserved no better fate than to be killed, only,\nof course, sometimes a few Antiochians had to be killed too, because\nthat is part of the game, and if there were no danger there would be no\nglory, would there?\n\nLittle Tony’s hair remained yellow, and his habit of laughing grew with\nhis years, and he learned his lessons and he learned his play. He was\nexcellent company, and if it had not been for the yellowness of his\nhair and the gentleness of his nature, he would have been quite popular\namong his schoolmates.\n\nHis grandfather called him “gentle,” but the people of Antioch called\nhim “lazy,” for they, as I said, were very black, and generally angry.\nThey scurried up and down in their rocky little city, and always they\nseemed to be driven by most urgent affairs, hurrying to keep important\nappointments. They ran about all day long, attending to their business,\nand hardly stopping even for their dinner or their tea, and no one ever\nsaw any of them asleep.\n\n“Why is it, Grandfather?” young Tony asked one day, “what is it all\nabout? why do they never sit down quietly like you and me?”\n\n[THE PEOPLE OF ANTIOCH WERE ALWAYS IN A HURRY AND\nGENERALLY ANGRY.]\n\n“It is the great heart of the Nation, my boy,” said old Tony, “it\ncannot be still; it is in the breed, you know, they can’t help it. They\nare all alike too, except you and me. Why, bless your heart, look at\nthe King, he is more in a hurry than all the rest, and more—and more\nnoble and active, bless him.”\n\nThe old man ended his speech in quite a different voice from the one he\nhad begun with. This was because he suddenly caught the glitter of the\nKing’s crown as the Monarch popped round the corner.\n\nThe King of Antioch was always in a hurry, always running somewhere or\nother, consequently he was seldom on his throne, and his loyal subjects\nhad to look out very sharply, for he was always sure to be where they\nleast expected him. You may think that they could have got over this\nlittle difficulty by always looking for the King where they least\nexpected him, but if you try this simple experiment for yourself with\nyour governess or tutor, or even your nurse, I think you will find that\nit is not so easy as it looks.\n\n“Ha!” said the King, standing in the doorway and laughing cheerfully,\n“talking treason, eh? well, you know what the punishment for that is.\nPinching with black pincers, you know, till—well—till you don’t feel\nthe pinching any more.”\n\n“Aha! your Majesty always has such a pleasant way with you,” said old\nTony politely; and young Tony decided that when he grew up he would try\nnot to have any pleasant ways at all.\n\nThe King rustled quickly round the little house, and looked at\neverything—dresser, chairs, plates and pots. He was sorry that there\nwas nothing that he could find fault with, so he said, “Beware of\nLuxury,” and hurried off to make his presence felt in some other humble\nhome. There was no pride about King Anthony XXIII. He just dropped in\nwithout an invitation and took his subjects as he found them.\n\n“King Anthony XXIII. is the noblest of monarchs,” said old Tony, as he\nand his grandson sat down to their plain supper.\n\n“It’s all right, grandfather, he has quite gone, he’s not listening—for\na wonder!” said young Tony.\n\nMeantime the King was hurrying in and out and up and down the crowded\nstreets of his city, picking up little bits of information, and making\nhis subjects feel that his kingship was not a mere matter of form, but\nthat he was really interested in the most humble life among his people.\n\nIt was a strange town, all up-hill and down-hill, with steep rocks and\nprecipices all mixed up with the public streets. The people, for all\ntheir busy habits, had no trade, or rather they did not manufacture\nanything. They built houses, and brought up their families. They\nwrapped their children up very snugly and carried them about at an\nearlier age than we consider safe, and they milked their cows, which\nwere large and green and had wings, and they drank the milk, and they\ngathered the fruit of the trees that grew on the plain below the town,\nand they got on very well indeed. There was only one drawback to life\nin Antioch, and that was its uncertainty. At any moment an earthquake\nmight occur, then down would go half the town, and the busy citizens\nhad it all to build again. They soon did it, for they were nothing if\nnot industrious. A much more awful thing was the storm of hot rain\nthat now and then fell on the town, a blighting rain that killed all\nit touched. This was more dreaded than even the earthquakes, but\nfortunately it very seldom happened.\n\nOld Tony was beadle and sexton and keeper of the town records; and\nvery nicely he kept them too. There was not a speck of dirt on one of\nthem. He used to spend hours and hours polishing the records, and he\nscoured the tombstones till they shone again; and he had most of the\ninscriptions by heart. After an earthquake he was always most careful\nto put the tombstones back in their proper places, and one day, when\nhe was doing this, he came on a stone he did not remember to have seen\nbefore. He called to young Tony, who had had a Board School education,\nto see if he could read the bits of words that were carved upon it.\n\n“It seems like a foreign language,” said he.\n\n“I can’t make it out,” said young Tony, “it is not carved, it is in the\nstone somehow. Looks as if it were coming through from the other side.”\n\nHe turned the stone over, and there, on the other side, was an\ninscription which both of them had read a hundred times.\n\n  “HERE LIES HENRY BIRKBECK,\n   MAGICIAN TO THE INSTITUTE,\n\n   However humble he seems to you,\n   His last foretelling is going to come true.\n\n   P.S.—You see if it doesn’t.”\n\n“Dear me,” said old Tony. “Poor old Henry Birkbeck, it seems like\nyesterday; yes, he was very respectable, but only in a small way of\nbusiness. A magician he was by trade, but no one thought much of him,\nexcept perhaps the King, and _he_ never gave him a lift. He used to do\nthings with eggs and a hat. He broke the eggs as often as not. And the\ngoldfish and handkerchief he hardly ever brought off.”\n\nOld Tony began to lay down the tombstone, but young Tony held it up\nwith one hand and tried to scrape the back of it with the other.\n\n“There’s something here,” he said, “let’s set it upright instead of\nlaying it down, and I will scrub it and see what the letters are. Poor\nold Mr. Birkbeck, I wonder what his last foretelling was. Was he good\nat prophesying, grandfather?”\n\n“Not a bit,” said the sexton, “and to do him justice he almost gave\nit up in his later years. You see people laughed at him so, because\nthe things that he foretold never happened. Towards the end he grew\nvery feeble—hardly prophesied a single prophecy from one year’s end\nto another. Sometimes he would say, ‘I should not wonder if it rained\nbefore Sunday,’ but then he never wondered at anything. He was a calm\nold man, was poor Henry. It took a good deal to astonish him.”\n\nYoung Tony tried to interest his boy friends in the back of poor old\nHenry Birkbeck’s tombstone, but nobody cared. They were all in too much\nof a hurry to care for an occupation so slow as cleaning tombstones,\nbut Tony worked away perseveringly. He cleaned it with soap, and he\ncleaned it with soda, with brickdust and vinegar, with rotten stone and\nwashleather, with patience and elbow grease, and the last two, as you\nknow, will clean almost anything. So after a time a few letters began\nto show distinctly here and there, and presently Tony found he could\nread whole words.\n\nThere was “milk” and “mountain,” and a word that looked like “Jilk,”\nonly of course it could not be that. And the last word of all was\n“reign,” and the second word of all was “Tony.”\n\n“It must be something to do with me,” said young Tony, “because of my\nname being in it.”\n\n“It must have something to do with the King,” said old Tony, “because\nit says ‘reign,’ so you’d better cut off to the Palace, and look sharp\nabout it, or His Majesty will know the reason why.”\n\nSo Tony looked sharp about it, and got to the Palace in less than five\nminutes. For a wonder the King was not engaged in dropping in on his\nsubjects, but was on his throne amid his fussy black courtiers, who\nwere all busy trying to make themselves as small as they could.\n\nThis was because the King was very short, though he did not like to\nsay so. He always had himself described in the Census and the Palace\nReports as a “powerful man of middle height,” though he was nowhere\nnear the middle height, and no more powerful than other people.\n\n“Well, boy,” said King Anthony XXIII., “what have you come here for?”\n\n“There is a prophecy,” said Tony.\n\n“There are a good many,” said King Anthony, “but they don’t amount to\nmuch since poor Henry Birkbeck died. He was something like a prophet,”\nhe went on, turning to his courtiers; “he foretold, when I was only a\nbaby, that if I grew up I should perhaps be king. The late King, my\nfather, was very pleased, I remember.”\n\nThe courtiers all bowed, and said it was really wonderful. Tony said,\n\n“Well, then you’d better come and have a look at this prophecy,\nbecause it is the late Mr. Birkbeck’s last one, and he said it’ll come\ntrue.”\n\n“Bring it here, can’t you?” said the King.\n\n“No, I can’t,” said the boy. “It’s on his tombstone, so there. I can’t\ncarry tombstones about.”\n\n“No,” said the King thoughtfully, “of course you are not powerfully\nbuilt. You are nowhere near the medium height.”\n\n“Come and look at it if you want to,” said Tony. “I’m in no hurry.”\n\n“Well,” said King Anthony, “I don’t care if I do. I’m tired of sitting\nstill.”\n\nSo off they all went, King, Court, heralds, men-at-arms, banner-bearers\nand spearmen, down the narrow, dark, crooked town streets, till they\ncame to the churchyard where the tombstones were—both the upright and\nthe flat kind.\n\nTony ran on ahead and knelt in front of the tombstone. Then he jumped\nup and called out,\n\n“You hurry up, it’s as plain now as the nose on your face.”\n\n“You should say the royal nose on your Majesty’s royal face,” said old\nTony anxiously.\n\nBut the King was too interested to care about even his subjects’\nmanners.\n\n[OFF THEY ALL WENT, KING, COURT, AND MEN-AT-ARMS.]\n\nHe came up to the tombstone, and on it he read, and Tony read, and all\nthe courtiers read:—\n\n  “When Tony drinks the Blue Mountain’s milk\n   He shall wear a Sunday suit of silk.\n   He shall be tallest in all the Land,\n   And hold the town under his command.\n   He shall have greatness and we shall have grain;\n   Soon may it happen and long may he reign!\n                                       Hurrah.\n                              H. T. BIRKBECK.”\n\nThe King read this, and said—\n\n“Well, I never!”\n\nAnd all the courtiers said the same.\n\n“Tony means Me,” said the King.\n\nThe courtiers said that of course it did.\n\n“I am King Tony XXIII.,” said he.\n\nAnd the courtiers said of course he was.\n\nThey all spoke at once like a chorus.\n\n“I was christened Anthony, of course,” his restless Majesty went on,\nfidgeting with his gold collar; “but I know that my subjects have\nalways spoken of me behind my back by the endearing diminutive.”\n\nThe courtiers assured the King that this was so.\n\n“I suppose there’s no one else called Tony?” The King turned a\nthreatening glance on the crowd, and every one hastened to say “No,\nthere wasn’t.” But old Tony turned extremely pale, and hurrying into\nthe vestry, he tampered with the register of births, and altered his\nown name to Sydney Cecil Ernest Watchett.\n\nBut young Tony spoke up. “My name’s Tony,” said he.\n\n“Oh, is it?” said His Majesty. “We’ll soon see about that. Guards,\nseize him! Now, what is your name?”\n\n“Tony,” said he.\n\n“Your name is not Tony,” said the King, “your name is——” he could not\nthink of a name at the moment, so he stopped.\n\nTony said, “My name is Tony.”\n\n“Take him to the Parliament House,” said the King, beside himself with\nrage. “Give him a taste of the Mace,” and Tony tasted the Mace and was\nstamped on by the Great Seal, who was very fierce and lived in a cage\nat the Parliament House, until he was stiff and sore and sorry enough\nto be glad to say that his name was anything the King liked, except\nTony, which of course it never, never could have been. He admitted at\nlast that his name was William Waterbury Watchett, and was discharged\nwith a caution.\n\n[TONY WAS STAMPED ON BY THE GREAT SEAL, WHO WAS VERY\nFIERCE.]\n\n“But my name _is_ Tony after all,” he said to himself as he went home,\nfull of sad memories of the Mace and the Great Seal. “I wonder where\nthe Blue Mountain is?”\n\nYoung Tony thought a good deal about poor Henry Birkbeck’s prophecy.\nPerhaps the Great Seal had stamped it on his memory. Anyway he could\nnot forget it, and all the next day he was wandering about on the steep\nedge of the town, looking out over the landscape below. It was not an\ninteresting landscape. All round the brown hill where the town was lay\nthe vast forests of green trees, something like bamboos, whose fruit\nthe people ate; and beyond that one could see the beginnings of a still\nlarger forest, where none of the people of Antioch had ever dared to\ngo—the forest, whose leaves were a hundred times as big as the King\nhimself, and the trunks of the trees as big as whole countries. Above\nall was the blue sky—but, look as Tony would, he could see no blue\nmountain.\n\nThen suddenly he saw the largest forest shake and shiver—its enormous\nleaves swaying this way and that.\n\n“It must be an earthquake,” said Tony, trembling, but he did not run\naway. And his valour was rewarded as valour deserves to be. The next\nmoment the vast branches of the enormous forest parted, and a giant\nfigure came out into the forest of bamboo-like trees. It was a figure\nmore gigantic than Tony had ever imagined possible. It had long yellow\nhair. In its hand it carried a great white bowl, big enough to float\na navy in. If such an expression did not sound rather silly, I should\nsay that this figure gave Tony the idea of a little-girl-giant. It\nsat down among the bamboo forest, crushing millions of trees as it\nsat. With a spoon twice the length of the King’s banqueting hall, it\nbegan to eat out of the tremendous basin. Tony saw great lumps, like\nblocks of soft marble, balanced on the vast spoon, and he knew that the\ngiant-little-girl was eating giant-bread-and-milk. And she wore a giant\nfrock, and the frock was blue. Then Tony understood. This was the “Blue\nMountain,” and in that big big sea of a basin there was milk—the Blue\nMountain’s milk.\n\nTony stood still for a moment, then turned and ran as hard as he could\nstraight into the Royal presence. To be more exact, he ran into the\nRoyal waistcoat, for the King, in a hurry, as usual, was coming out of\nhis palace gates with a rush. The King was extremely annoyed. He\nrefused to listen to a word Tony had to say until Parliament had been\ncalled together, and had passed a Bill strengthening the enactments\nagainst cheek. Then he allowed Tony to tell his tale. And when the tale\nwas told every one ran to the battlements of the town to look. There\nwas no blue mountain to be seen.\n\n[THE GIANT-LITTLE-GIRL.]\n\nThen his Majesty told Tony what he thought of him, and it was not\npleasant hearing.\n\n“I am not a liar,” said Tony; “I am very sorry I told you anything\nabout it; I might jolly well have gone and got it for myself. _My_ name\nis——William——Waterbury——Watchett.” He stopped in confusion.\n\n“I should think it was,” said the King; “if there is any mountain,\nwhich I don’t for a moment believe, you had better go and fetch me some\nof the milk (not that I think there is any) out of the mountain’s basin\n(which I cannot believe exists outside of your imagination). If you\nbring it to this address you will be suitably rewarded.”\n\n“All right,” said Tony; “shall I fetch it in a jug, or will they lend\nme a can?”\n\n“I will lend you my mug,” said the King; “and mind you bring it back\nfull.”\n\nSo Tony took the mug. It had “For a good little King. A present from\nAntwerp,” on it. And he kissed his grandfather, and started off on his\nlong, perilous journey.\n\n“I suppose he will give me a reward if I get it,” he thought, “and if\nnot, well, it’s an adventure, anyway.”\n\nHe passed through the crowded streets, where every one was rushing\nabout in the usual frantic haste, and out at the town gates, and down\nthe road into the forest. The trunks of the trees towered tall and\nstraight above, and a subdued green light shone all about him.\n\nThe ground was very broken and uneven, and often Tony had to go a long\nway round to avoid some great rock or chasm. But he travelled fast, for\nhe was a quick walker, and he did not miss the way once, although, of\ncourse, it was quite a strange country to him.\n\nThere had been evening classes at his school to teach the boys the art\nof finding their way in strange places, and Tony had attended all the\nlectures and taken notice as well as notes. And now he was able to\npractise what he had learned, and he was glad he had not wasted his\ntime in drawing pictures of the masters, or playing nibs with the boys\nnext him, and throwing ink pellets at more studious boys.\n\nBut the journey was longer than he expected, and the mug was rather in\nhis way. He was very much afraid of breaking that mug: it is an awkward\nthing to break a mug with “A present for a good King” on it. It is so\ndifficult to replace. There are very few of those mugs made nowadays.\nThere is little or no demand for them.\n\nBut at last the green light of the forest began to grow brighter, and\nTony saw that he was approaching a sort of clearing among the trees, so\nhe put his best foot foremost, without stopping to think which was his\nworst foot—always a mistake when you are tired and footsore.\n\nAnd now he came out from under the tall branches, and saw a round open\nspace in the forest, where millions of fallen trees lay on the ground.\nAnd he knew that this was the spot where the mountain had sat down to\neat its unimaginable enormous breakfast. But there was no mountain to\nbe seen, and Tony knew that he could do nothing but sit down and wait,\nin the hope that the Blue Mountain would come next morning to eat its\nbreakfast in the same place.\n\nSo he looked about for a place to rest safely in, and presently found\njust what he wanted—a little cave, whose walls and roof were of dried\nearth—and there he stayed all that day and night, eating the fruit of\nthe fallen trees.\n\nAnd next morning there was a rustling and a swaying of the trees, and\nthe Blue Mountain came striding over the tall tree-tops, bending down\nthe forest as she came on colossal black legs and massive shoes with\nmonstrous ankle straps. Each shoe was big enough to have crushed a\nhundred Tonys at one step. So he hid in his cave, and presently knew by\nthe shaking of the ground, like an earthquake, that the mountain had\nsat down.\n\nThen he came out. He was too near to see the mountain properly, but\nhe saw a great blue-fold of giant frock near him, and far above him\ntowered the blue heights of the giant-little-girl’s knees. On the\nsummit of these shone a vast white round—the great bread-and-milk basin.\n\nTony started to climb the blue-fold. It was stiff, starched—with giant\nstarch, I suppose—and it bore his weight easily. But it was a long\nclimb, and he drew a deep breath of thankfulness when he reached the\nbroad table-land of the giant-little-girl’s knees—and now the smooth\nchina roundness of the big basin was before him. He tried its polished\nsurface again and again, and always fell back baffled. Then he saw\nthat he might climb up the sleeve of the gigantic arm whose hand held\nthe basin. With his heart in his mouth he began the ascent, slowly\nand carefully, holding the precious mug closely to his breast. His\nbreath came faster and faster as he went up and up, and at last stood\ntriumphantly on the edge of the great blue sleeve. From there to the\nedge of the basin it was easy to crawl, and now at last he stood on\nthe giddy verge of the monstrous basin, and looked down at the lake of\nmilk with the rocks of bread in it, many feet below. The great height\nmade him giddy. He lost his footing, and still clasping the mug, he\nfell headlong into the giant-bread-and-milk. The bread rocks were\nfortunately soft. Tony picked himself up. He was wet, but no bones were\nbroken, and the mug—oh, joy! the mug was safe. Tony looked it over\nanxiously as he sat on a rock, a sloppy and uncertain resting place.\nThere was only one small crack near the handle, and Tony was almost\nsure that that had been there before.\n\n“I don’t know however I shall get out again,” said Tony; “perhaps I\nnever shall, but in case I do, I suppose I had better fill the mug”;\nso he stooped from the rocks and filled the mug from the lake of milk,\nwhich was much thicker than the milk of the green cows with wings, the\nonly milk Tony was used to. He had just filled the mug and tied it down\nwith a piece of parchment which he had taken from the Town Records and\nbrought with him for the purpose, when a noise like thunder suddenly\nbroke on his ear. And indeed it very nearly broke the ear itself, and\nso startled Tony that the precious mug all but slipped from his grasp.\nThen a wave of milk swept up almost over his head. The whole of the\nmassive basin was moved sideways. Then came a shock like an earthquake.\nThe basin was being set on the ground. Tony felt that the Blue Mountain\nhad seen him and had screamed. What would the giant-little-girl do?\nWould she kill him? If so, how?\n\nThese questions afforded Tony food for some interesting reflections\nduring the next few moments.\n\nHe looked round him for a way of escape. Everywhere towered the smooth\nwhite walls. The tremendous spoon which he had seen the Blue Mountain\nuse had, unfortunately, not been left in the basin, or he could\nhave climbed out by that. He gave himself up for lost. Then suddenly\nhe saw the trunk of a slender tree appear at the edge of the basin. It\nwas pushed down towards him. Yes on to the very bread-rock on which\nhe crouched. Would it crush him? No! The end of it rested on the rock\nby his side; it gently moved towards him. He saw now that the Blue\nMountain was not cruel. She was not bent on destroying him. She was\noffering him a way of escape. He eagerly climbed the tree. When he was\nhalf-way up, however, the giant-little-girl flung the tree aside, and\nwith Tony still clinging to it, it fell crashing into the forest. When\nhe came to himself he almost shouted for joy to find the mug still\nwhole.\n\n[TONY AMONG THE ROCKS IN THE BREAD-AND-MILK BASIN.]\n\nHe never knew how he got home.\n\nWhen he took the mug to the King the monarch looked at it, and said—\n\n“The milk’s very thick.”\n\n“It’s giant cow’s milk,” said Tony, “you drink it up and let’s see what\nhappens.”\n\n“I don’t know,” said the King, suspiciously, “suppose it’s poison; I\nshall have it analysed.”\n\n“Well, you promised me a reward,” said Tony, “and you wouldn’t grudge\nit if you knew what a time I’ve had of it. I might have been killed,\nyou know.”\n\n“_Reward!_” said the King, who had been looking at the mug, “_reward!_\nwhen you have cracked my mug—my own only mug, with ‘A present for a\ngood King’ on it. Reward indeed! a stamp from the Great Seal would be\nmore——”\n\nBut Tony was gone. He ran home to tell his grandfather—but his\ngrandfather was not there—only a letter lay on the kitchen table.\n\n“Dear grandson,” it said, “the King has found out that my name was\nentered in the register as Anthony Antrobus, and he refuses to believe\nthat the alteration to Sydney Cecil Ernest Watchett was made at my\nbirth. So I am seeking safety at a distance. I have only one piece of\nadvice to give you. _Do so too._—Your loving Grandfather.”\n\nThis seemed such good advice to Tony, whose name was also in the\nregister, that he was just going to take it when the door was flung\nopen, and in rushed the King and the Army. They hustled and bustled\nand rustled round the house, breaking and tearing everything, and when\nthere was nothing more to spoil they carried Tony off to prison.\n\n“So this is my reward for getting the milk for him,” said poor Tony\nto himself, as he sat in prison, loaded with chains, and waiting for\nhis trial. “I wish I had drunk the milk myself. This is what comes of\nloyalty. But I don’t care, my name is Tony, and his is not, and I will\nsay so too, if I hang for it.”\n\nActing on this resolution next day, at his trial, Tony said so, and\nwhat is more, he came very near indeed to hanging for it. For King\nAnthony XXIII. was furious. He absolutely danced with rage, and it took\nsix Prime Ministers to restrain his emotion while the trial went on.\nTony was tried for an attempt to murder the King. The whole thing, said\nthe Public Persecutor, was nothing but a plot. The prophecy of Henry\nBirkbeck, which nobody had seen, till Tony found it; the Blue Mountain,\nwhich nobody but Tony had seen at all; the thick milk so mysteriously\nobtained, all pointed to dark treason and villainy. The crack in the\nmug was a peculiarly incriminating circumstance. (I cannot help the\nlong words—Public Persecutors will use them.) It was a vile plot, the\nPersecutor said, but it had failed. The Public Analyst gave evidence\nthat the milk was not milk at all, but some explosive substance too\ndangerous to analyse.\n\nTony looked at the Jury and he looked round the Court, and he saw that\nthe case did indeed look black against himself. When he was asked what\nwas his defence, he said—\n\n“There is no pleasing some people.”\n\n“It is my duty to caution you,” said the Persecutor, “that everything\nyou say will be used against you.”\n\n“I am sure it will,” said Tony, wearily, “but I can’t help that,\neverything I do is used against me too. I needn’t have told any one\nanything about it. I might have got the milk myself and been King, but\nI got it for him, and I did not crack the mug. At least, I am almost\nsure not. I only wish I had drunk the milk.”\n\n“Make him drink it now,” shouted a thousand voices from the crowded\nCourt.\n\n“Don’t!” said the King, hastily, “it might not be poison after all.”\n\n“You can’t have it both ways, your Majesty,” said the Persecutor\nbravely; “either it is poison, in which case the Prisoner deserves to\ndrink it, or it is not poison, in which case the Prisoner leaves the\nCourt without a stain upon his character.”\n\n“It is poison!”\n\n[“EVERYTHING YOU SAY WILL BE USED AGAINST YOU,” SAID THE\nPUBLIC PERSECUTOR.]\n\n“It isn’t!”\n\n“It is!”\n\n“It is not!”\n\nThe shouts rose louder and louder.\n\n“It is not poison, it is milk!” cried Tony, and suddenly seizing\nthe mug of milk, which had been brought into the Court to give its\nevidence, he lifted it to his lips, and before the Jailer could prevent\nit, he drained the milk to the last drop and ran out of the Court. For\nevery one was too astonished to stop him.\n\nThe moment he was outside, he felt a sudden and awful change in\nhimself. He was growing, growing, growing. He hurried out of the town.\nHe felt that it would soon be too small to hold him. Outside he got\nbigger and bigger till the trees of the nearer forest were like grass\nunder his feet, and the mug ran out of his hand like a little grain of\nrape-seed. And there beside him stood the Mountain—a little girl in a\nblue dress—and he was taller than she was.\n\n“Hullo!” said the Blue Mountain, “where did you spring from?”\n\n“From the town down there,” said Tony.\n\n“There?” said the Mountain, stooping, “that’s not a town, silly, you\nknow it’s only an ant-heap, really.”\n\n“It is my town,” said Tony, “and its name is Antioch, and——”\n\nAnd then he told her the whole story. In the middle of it she sat down\nto listen better, crushing millions of trees as she sat. And Tony sat\ndown, crushing other millions, only now it seemed to him that he had\nsat down on the grass. It makes a great deal of difference what size\nyou are.\n\n“And that is where I used to live,” said Tony, pointing to the town,\n“and my name is Tony.”\n\n“I know that,” said the Blue Mountain, “but you live next door to us,\nyou know you do, you always did, and that is only an ant-heap.”\n\nAnd when Tony looked down again it seemed to him that perhaps it really\nwas only an ant-heap.\n\nAll the same he knew the King when he saw him hurrying along the\nramparts, and he picked the King up and put him on a cow’s ear. And the\ncow scratched its ear with its hind foot. And that was the end of the\nKing.\n\n“Don’t tease the ants,” said the Blue Mountain. “People pour boiling\nwater sometimes, or dig up the heaps, but I think it’s cruel.”\n\n[HE WAS GROWING, GROWING, GROWING.]\n\nTony remembered the hot rain and the earthquakes.\n\n“It is a nice story,” she said, “of course the grass is like a forest\nto the ants, and the big forest is the hedge. Your Sunday suit is silk\nvelvet, your aunt told mother so. Yes, it is a nice story, and an ant\ndid drop into my bread and milk yesterday, though I don’t know how you\nknew.”\n\n“You mayn’t believe it;” said Tony, “but I shall give them corn because\nit says so in Mr. Birkbeck’s prophecy, only I won’t ever give them any\nmilk in case they grow big. They are too bad-tempered. Just think if\nthe King had been our size!”\n\n“Oh, come along home, do,” said the Blue Mountain, a little crossly.\n“I am tired. It is dinner time, it’s no use pretending about Kings and\nthings. You know well enough you are only Tony-next-door.”\n\nAnd whatever he may have been before, it is quite certain that since\nthen he has been “Tony-next-door,” and nothing else whatever.\n\n\n\n\nBOOK 4. _THE PRINCE, TWO MICE, AND SOME KITCHEN-MAIDS_\n\n\nWHEN the Prince was born the Queen said to the King, “My dear, do be\nvery, very careful about the invitations. You know what fairies are.\nThey always come to the christening whether you invite them or not,\nand if you forget to invite one of them she always makes herself so\nterribly unpleasant.”\n\n“My love,” said the King, “I will invite them all,” and he took out his\ndiamond-pointed pen and wrote out the cards on the spot.\n\nBut just then a herald came in to bring news of war. So the King had to\ngo off in a hurry. The invitations were sent out, but the christening\nhad to be put off for a year. At the end of this time the King had\nsubdued all his enemies, so he was very pleased with himself. The\nPrince was a year old, and he also was pleased with himself, as all\ngood babies are, and found the little royal fingers and toes a fresh\nand ever-delightful mystery. And the Queen was pleased with herself,\nas all good mothers should be—so everything went merrily. The Palace\nwas hung with cloth of silver and strewn with fresh daisies, in honour\nof the great day, and after all had eaten and drunk to their hearts’\ncontent the fairies came near with the gifts they had brought to their\ngodson the Prince.\n\n“He shall have beauty,” said the first.\n\n“And wit,” said the second.\n\n“And a pretty sweetheart,” said the third; “who loves him,” said the\nfourth.\n\nAnd so they went on, foretelling for him all sorts of happy and\ndesirable things. And as each fairy gave her gift she stooped and\nkissed the baby Prince, and then spreading her fine gossamer-gauze\nwings, fluttered away across the rosy garden. The crowd of fairies grew\nless and less, and there were only three left when the Queen pulled the\nKing’s sleeve and whispered, “My dear, where’s Malevola?”\n\n“I sent her a card,” said the King, casting an anxious look round him.\n\n“Then it must have been lost on the way,” said the Queen, “or she’d\nhave been here——”\n\n“She _is_ here,” said a low voice in the Queen’s ear. Suddenly the room\ngrew dark, grey clouds hid the sun, and all the daisies on the floor\nshut up quite close. The poor Queen gave a start and a scream, and the\nKing, brave as he was, turned pale, for Malevola was a terrible fairy,\nand the dress she wore was not at all the thing for a christening. It\nwas made of spiders’ webs matted together, dark and dank with the damp\nof the tomb and the dust of dungeons. Her wings were the wings of a\ngreat bat; spiders and newts crawled round her neck; a serpent coiled\nabout her waist and little snakes twisted and writhed in her straight\nblack hair.\n\nShe looked at the Queen so terribly that her poor Mother-Majesty cried\nout without meaning to.\n\n“Oh don’t!” she cried, and flung both arms round the cradle. The Prince\nwas quite happy, playing with his new coral and bells, and looking at\nthe Palace cat, who sat at the foot of the cradle washing herself.\n\n“Now listen,” said Malevola, still speaking in the low, even voice that\nwas so terrible. “You did not invite me to the christening. I’ve read\nmy fairy tales, and I know what’s expected of a fairy who is left out\non an occasion like this. I intend to curse your son.”\n\nThen all the Kings and Queens who had come to the christening wished\nthey had stayed away, and they and all the Court fell on their knees\nand begged Malevola for mercy. As for the three good fairies who were\nleft, they hid behind the window-curtains, and the Court ladies,\npeeping between their fingers, said—\n\n“Fancy deserting their godson like this! How unfairy-like!”\n\nBut the Queen and the King only wept, and the Prince played with his\nrattle and looked at the cat.\n\nThen Malevola said mockingly: “Great King and mighty Sovereign,\nMalevola was not good enough to be asked to your tea-party. But\nyour family shall come down in the world; your son shall marry a\nkitchen-maid and marry a lady with four feet and no hands.”\n\nA shiver of horror ran through the room, and Malevola vanished. Then,\nsuddenly, the sun came out, and people lifted up their heads, and dared\nagain to look at each other. And the daisies, too, opened their eyes\nagain.\n\n[MALEVOLA’S DRESS WAS NOT AT ALL THE THING FOR A\nCHRISTENING.]\n\nThen the good fairies came out from behind the window-curtains, and the\npoor Queen fell on her knees before them.\n\n“Can’t you do _anything_?” she asked. “Can’t you undo what she says,\nand make it untrue?”\n\n“Not even a fairy can make a true thing untrue,” said the good fairies\nsadly. “Malevola’s words will come true; but the Prince has already\nmany gifts, and our gifts are yet to give, and these you shall choose.\nWhatever you wish shall be his.”\n\nThen the King, recovering a little from the terror into which the fairy\nMalevola had thrown him, and remembering how well he and his royal line\nhad always borne them in battle, said at once—\n\n“Let the boy be brave.”\n\n“He is brave,” said one of the good fairies; “he fears nothing.”\n\nAnd at this the Prince ceased to feel any fear of the Palace cat. He\nput out his hand and pulled her tail so merrily that Pussy turned and\nclawed the little arm till the blood ran.\n\n“Oh, dear!” cried his mother, “he is fearless, as you say. I wish he\nwere afraid of cats, poor darling.”\n\n“He is,” said the second fairy; “you have your wish.” And, indeed, the\nPrince screamed, and hid his face, and shrank from the Palace cat with\nsuch horror that the King pulled out his pencil and note-book and wrote\nan edict then and there banishing all cats from his dominions. But, all\nthe same, he was very angry.\n\n“Your Majesty has wasted one wish,” he said very politely to the Queen;\n“let us now leave the last gift in the hands of the last fairy.”\n\nThe last fairy came and kissed the Prince, who was now sobbing sleepily.\n\n“He shall be happy,” she said; “he shall have his heart’s desire.”\n\nThen she too vanished; and the Kings and Queens took their leave when\ntheir gold coaches came for them. And presently the King and Queen were\nleft alone with the silver hangings and the strewn daisies and the baby.\n\n“Oh dear! oh dear!” said the Queen; “this is dreadful! A\nkitchen-maid!—and a lady with four feet and no hands!”\n\n“At least we are not likely to have a kitchen-maid with less than two\nhands,” said the King.\n\n“We might arrange only to have _titled_ kitchen-maids,” said the Queen\ntimidly.\n\n“The very thing,” the King answered: “that would make the love affair\nall that one could wish. But there’s still the marriage.”\n\n“Of course he’ll marry the lady he loves.”\n\n“It’s not the way of the world,” said the King. “At any rate, let’s\nhope he’ll love the lady he marries. Otherwise——”\n\n“Otherwise what?” said the Queen.\n\n“We know nothing about otherwise, do we, my Queen?” he said, catching\nher round the waist. And in his love for his wife and his son the King\nfelt almost happy again, for here they were all three together, and\nwhen your son is in his cradle his marriage seems very far off indeed.\n\nBut the Queen was anxious and frightened, and while the Prince was\nstill a child she sent messengers to the Courts of all the neighbouring\nKings and Queens to tell them what had been foretold, which, indeed,\nmost of them knew, having been at the christening. And she begged such\nof them as had daughters to send them as kitchen-maids, that so the\nPrince might at least fall in love with a real Princess. And as the\nPrince grew up he was so handsome and so brave, fearing nothing but\ncats, which, of course, he never saw, though he dreamed of them often\nand woke screaming, and also so brilliant and good, that, his father’s\nkingdom, being beyond compare the finest in all the round world, the\nyoung daughters of Kings vied with each other as to who should find\nfavour in the eyes of the Queen-Mother, and so get leave to serve in\nthe kitchen, each nursing the hope that some day the Prince would see\nher and love her, and perhaps even marry her. And he was very good\nfriends with all the noble kitchen-maids, but he loved none of them,\ntill one day he saw, at a window of the tower where the kitchen was,\na bright face and bright hair tied round with a scarlet kerchief. And\nas he looked at the face it was withdrawn—but the Prince had lost his\nheart. He kept his secret safe in the place where his heart had been,\nand schemed and plotted to see this fair lady again; for when he went\namong the royal kitchen-maids she was not there with them. And he\nlooked morning, noon, and evening, but he never could see her. So then\nhe said—\n\n“I must watch o’ nights—perhaps she is kept in prison in the tower\nabove the kitchen, and at night those who watch her may sleep, and so I\nshall be able to talk to her.”\n\nSo he dressed in dark clothes and hid in the shadow of the palace\ncourtyard and watched all one night. And he saw nothing. But in the\nearly morning, when the setting moon and the rising sun were mixing\ntheir lights in the sky, he heard a heavy bolt shot back, and the\ndoor of the kitchen tower opened slowly. The Prince crouched behind a\nbuttress and watched, and he saw the fair maid with the bright hair\nunder the red kerchief. She swept the doorstep, and she drew water\nfrom the well in the middle of the courtyard; and presently he crept\nto the kitchen window and saw her light the fire and wash the dishes,\nand make all neat and clean within. And the Prince’s eyes followed her\nin all she did, and the more he looked at her the more he loved her.\nAnd at last he heard sounds as of folks stirring above, so he crept\naway, keeping close to the wall, and so back to his own rooms. And this\nhe did again on the next morning, and on the next. And on the third\nmorning, as he stood looking through the window at the girl with the\nbright hair and the bright kerchief, the gold chain he wore clinked\nagainst the stone of the window-sill. The maid started, and the bowl\nshe held dropped on to the brick floor of the kitchen and broke into\ntwenty pieces; and then and there she sat down on the floor beside it,\nand began to cry bitterly.\n\nThe Prince ran in and knelt beside her.\n\n“Don’t cry, dear,” he said, “I’ll get you another bowl.”\n\n“It isn’t that,” she sobbed, “but now they’ll send me away.”\n\n“Who will?”\n\n“The noble Kitchen-Maids. They keep me to do the work because, being\nKings’ daughters, they don’t know how to do anything; but the Queen\ndoesn’t know that there is a Real Kitchen-maid here, and now you have\nfound out they will send me away.”\n\nAnd she went on crying.\n\n“Then you are a Real Kitchen-maid, and not noble at all?” said the\nPrince.\n\nShe stopped crying for a minute to say “No.”\n\n“Never mind,” said the Prince. “You are twice as pretty as all the\nKings’ daughters put together and twenty times as dear.”\n\nAt that she stopped crying for good and all, and looked up at him from\nthe floor where she sat.\n\n“Yes you are,” he said, “and I love you with all my heart.”\n\nAnd with that he caught her in his arms and kissed her; and the Real\nKitchen-Maid laid her face against his, and her heart beat wildly, for\nshe knew what the Prince did not, and what, indeed, all the folk knew\nexcept the Prince, that this had been foretold at his christening; but\nshe knew also that though he loved her, he was not to marry her, since\nit was his dreadful destiny to marry some one with four feet and no\nhands.\n\n“I wish I had no hands and four feet,” said the Real Kitchen-maid to\nherself. “I wouldn’t mind a bit, since it is me he loves.”\n\n“What are you saying?” asked the Prince.\n\n“I am saying that you must go,” said she. “If their Kitchen Highnesses\nfind you here with me they’ll tear me into little pieces, for they all\nlove you—to a Highness.”\n\n“And you,” he whispered, “how much do you love me?”\n\n“Oh,” she answered, “I love you better than my right hand and my left.”\n\nAnd the Prince thought that a very strange answer. He went through that\nday in a happy dream; but he did not tell his dream to any one, lest\nsome harm should come to the Real Kitchen-Maid. For he meant to marry\nher, and he had a feeling that his parents would not approve of the\nmatch.\n\nNow that night, when the whole palace was asleep, the Real Kitchen-Maid\ngot up and crept out past the sleepy sentinel and went home to her\nfather the farmer and got one of his great white cart horses and rode\naway through the woods to the cavern where the Great White Rat sits\nsleeplessly guarding the Magic Cat’s-eye.\n\nAnd every one wondered why he guarded it so carefully, for it seemed\nto have no great value. But the Great White Rat watched it constantly,\nwithout ever closing one of those round bright rat’-eyes of his, and\nwhen folk sought to lay hands on it he said—\n\n“Be careful: it has the power to change you into a mouse.”\n\nOn which folk dropped it hastily and went their ways, leaving him still\non guard.\n\nTo him now went the little Kitchen-Maid, and asked for help, for he\nwas thousands of years old, and had more wisdom between his nose and\nears than all the books in all the world. She told him all that had\nhappened.\n\n“Now what shall I do?” she said. And the Great White Rat, never\nshifting his eyes from the Magic Cat’s-eye, answered—\n\n“Keep your own counsel and be contented. The Prince loves you.”\n\n“But,” said the Real Kitchen-Maid, “he is not to marry me, but a\nhorrible creature with four feet and no hands.”\n\n“Keep your secret and be content,” the Great White Rat repeated, “and\nif ever you see him in danger from a lady with four feet and no hands,\ncome straight to me.”\n\nSo the Real Kitchen-Maid went back to the Palace, and set to work to\nclean pots and pans, for now it was bright dewy daylight, and the night\nhad gone. And before the rest were awake again her Prince came to her\nand vowed he loved her more than life; so she kept her secret and was\ncontent.\n\nAt the time of the Prince’s christening the King had banished all cats\nfrom the kingdom, because he could not bear to see his son show fear of\nanything. But now and then strangers, not knowing of the edict, brought\ncats to that country, and if the Prince saw one of these cats he was\ntaken with a trembling and a paleness, standing like stone awhile, and\npresently, with shrieks of terror, fleeing the spot. And it was now a\nlong time since he had seen a cat.\n\nNow, soon after the Prince had found out how he loved the Real\nKitchen-Maid, his father and mother died suddenly as they were sitting\nhand in hand, for they loved each other so much that it was not\npossible for either to stay here without the other.\n\nSo then the Prince wept bitterly, and would not be comforted, and the\nCourt stood about him with a long face, wearing its new mourning.\nAnd as he sat there with his face hidden Something came through the\nPalace gate and up the marble stairs and into the great hall where the\nPrince sat on the steps of his father’s throne weeping. And, before the\ncourtiers could draw breath or decide whether it was Court etiquette\nfor them to do anything while the Prince was crying except to stand\nstill and look sad, the creature came up to the Prince and began to rub\nitself against his arm. And he, still hiding his face, reached out his\nhand and stroked it!\n\nThen all the Court drew a deep breath, for they saw that the thing that\nhad come in was a great black Cat.\n\nAnd the Prince raised his eyes, and they looked to see him shrink and\nshriek; but instead he passed his hand over the black fur and said—\n\n“Poor Pussy, then!”\n\nAnd at these words the whole Court fled—by window and door. The\ncourtiers took horse, those who had carriages went away in them, those\nwho had none went on foot, and in less than a minute the Prince and the\nCat were left alone together.\n\nFor the Court was learned in witch law, and knowing the Prince’s horror\nof cats it saw at once that a cat he was not afraid of was no cat at\nall, but a witch in that shape. Therefore the courtiers and the whole\nRoyal household fled trembling and hid themselves.\n\nAll but the little Real Kitchen-Maid. She saw with terror that the\nCat, or rather the witch in Cat’s shape, had done what no one else\ncould do—roused the Prince from his dull dream of grief. And then she\nremembered the fate which Malevola had foretold for him—that he should\nmarry a lady with four feet and no hands.\n\n“Alack-a-day!” she cried. “This witch has four feet and no hands; but\nshe can have hands whenever she chooses, and be a woman by her magic\narts as easily as she can be a cat. And then he will love her—and what\nwill become of me? Or, worse, she may marry him only to torment him.\nShe may shut him up in some enchanted dungeon far from the light of\nday. Such things have happened before now.”\n\nSo she stood, hidden by the blue arras, and wrung her hands, and the\ntears ran down her cheeks. And all the time the black Cat purred to the\nPrince, and the Prince stroked the black Cat, and any one could have\nseen that he was every moment becoming more deeply bewitched. And still\nthe Real Kitchen-Maid crouched behind the arras, and her heart ached\nthat it knew no way to save him. Then suddenly she remembered the words\nof the Great White Rat—\n\n“If ever you see him in danger from a lady with four feet and no hands\ncome straight to me.”\n\nNow surely was the time, for the Prince, she knew, was in desperate\ndanger.\n\nThe Real Kitchen-Maid crept silently down the marble stairs, but once\nshe was out of the Palace she ran like the wind to the stable. No men\nwere about there—all had followed the example of the Court, and had run\naway when they heard of the strange coming of the witch-Cat. And of\nall the many horses that had stood in the stable only one remained,\nfor each man in his fright had saddled the first horse that came to\nhand and ridden off on it. And the one that still stayed there was the\nPrince’s own black charger. He had had no mind to be saddled in haste\nby a stranger, and had turned and bitten the stranger who had attempted\nit. So he was there alone.\n\nNow the little Kitchen-Maid lifted the Prince’s gold-broidered saddle\nfrom its perch, and the weight of it was such that she could not have\ncarried it but for the heavy heart she bore because of her love to the\nPrince and his danger, and that made all else seem light. She put the\nsaddle on the charger, and the jewelled bridle. And he neighed with\npleasure, for he understood, being a horse who could see as far into\na stone wall as most people. And when he was saddled he knelt for her\nto mount, and then up and away like the wind, and she had no need to\nguide him with the reins, for he found the way and kept it. He galloped\nsteadily on, and the sun went down and the night grew dark, and he went\non, and on, and on without stumble or pause, till at moonrise he halted\nbefore the house of the Great White Rat.\n\nThen, as the Real Kitchen-Maid sprang down, the Great White Rat came\nout from his house and spoke. “You’ve come for it, then?”\n\n“For what?”\n\n“The Magic Cat’s-eye. I’ve guarded it some thousands of years. I knew\nthere would be a use for it at last. He may be saved yet, if some one\nshould love him well enough to die for him.”\n\n“I do that,” said the little Kitchen-Maid, and took the Cat’s-eye in\nher hands.\n\n“Swallow it,” said the White Rat, “and you’ll turn into a mouse.”\n\nThe little maid swallowed it at once, and, behold! she was a little\nmouse.\n\n“What am I to do?” she asked.\n\n“I can’t tell you,” said the Great White Rat, “but Love will tell you.”\n\nSo the little Kitchen-Maid, in the form of the mouse, ran up one of the\nhorse’s legs, and held tight on to the saddle with all her little claws.\n\nAnd as the great horse galloped back towards the palace in the\nmoonlight, she thought and thought, and at last she said to herself—\n\n“The witch is in cat’s shape, and she must have cat nature, so she will\nrun after a mouse. She will run after _me_, and if I can lead her to a\nrunning stream she will leap across it, and then she will have to take\nher own shape again. That must be what the Great White Rat meant me to\ndo. And if the Cat catches me—well, at least if I can’t save my Prince\nI can die for him.”\n\nAnd the thought warmed her heart as the great horse thundered on\nthrough the dawn-light.\n\nWhen at last, creeping softly on little noiseless feet, the\nMouse-Kitchen-Maid re-entered the great hall, she saw that she was\nonly just in time, for the black Cat was purring and looking back at\nthe Prince as she walked, waving her black tail towards the further\ndoor of the hall, and the Prince, more bewitched than ever, was slowly\nfollowing her.\n\nThen the Real-Kitchen-Maid-Mouse uttered a squeak, and rushed across\nthe porphyry floor, and the black Cat, true to its cat nature, left\npurring at the Prince and sprang after the Mouse, and the Mouse at\nits best speed, made for the garden where ran the stream that fed the\nmarble basins where the royal gold-fish lived. The Prince understood\nnothing save that the enchanting black furry creature was leaving him,\nand in an instant he was alone. He followed to the door, and saw the\nCat springing along the passage down the stairs—he followed fast—then\nalong another passage that passed the foot of the back stairs, and he\nsaw that the back stairs were like a water-fall—water was running down\nin a torrent and meandering away down the brick passage and out into\nthe faint new sunshine.\n\nWhen the Mouse saw this stream, she thought, “I’m saved.” She never\nthought of wondering how a stream came to be running down the back\nstairs of the palace. When she came to think of it afterwards she\nalways believed that the Great White Rat had managed it somehow. She\nnever knew that it was really a great flood from the royal bathroom,\nwhere the royal housemaid, in her eagerness to run away from the witch,\nhad left all the royal bath-taps full on.\n\nThe Mouse bounded across the stream—the Cat saw the danger, but she\ncould not stop herself. She, too, crossed the stream, and as she\ncrossed it she turned into the wicked fairy Malevola—cobwebs, and\nsnakes, and newts, and bat’s-wings, and all.\n\nThe Prince put his hand to his head like one awakening from sleep, and\nthe horrible fairy vanished suddenly and for ever.\n\nThen the Mouse ran trembling to the Prince, and in its thin little\nmouse’s voice told him all.\n\n“My love and my lady,” he said, holding the Mouse against his cheek. “I\nwill marry you now. That will carry out the wicked fairy’s prophecy.\nThen we will go back to the Great White Rat, and you shall be changed\ninto a Princess.”\n\nSo the Prince rang the church bells till all the people came out of\ntheir holes where they had been hiding, to see the strange spectacle of\na Prince married to a Mouse.\n\nAnd directly they were married they set off on the black charger, and\nwhen they reached the Great White Rat they told their tale.\n\n“And now,” said the Prince joyously, “if you will change her into a\nlady again we will go home at once and begin living happily ever after.”\n\nThe Great White Rat looked at them gravely.\n\n“It’s impossible,” he said. “I am sorry, but the effects of the Magic\nCat’s-eye are _permanent_. Once a mouse, always a mouse, if you get\nmoused by the Magic Cat’s-eye.”\n\nThe Prince and the Mouse looked sadly at each other. This was the last\nthing they had expected. The Great White Rat looked at them earnestly.\nThen he said—\n\n“If it would be of any use to you, I’ve got another Magic Cat’s-eye.”\n\nHe held it out. The Prince took it gladly. Kingdom and the life of a\nking were nothing to him compared with the love and happiness of a\nReal-Kitchen-Maid disguised as a mouse. He put the stone to his lips.\n\n“You know what’ll happen if you do,” said the Great White Rat.\n\n“I shall change into a mouse and live happy ever after,” said the\nPrince gaily.\n\n“Perhaps,” said the Great White Rat, “nothing is impossible if people\nlove each other enough.”\n\n“You mustn’t,” cried the Mouse, trying to get between his lips and the\nCat’s-eye.\n\n“My dear little Real Kitchen-Maid,” said the Prince tenderly, “you have\nsaved my life—and you _are_ my life. I would rather be a mouse with you\nthan a king without you!” And with that he swallowed the Cat’s-eye,\nand two small mice stood side by side before the Great White Rat. Very\nkindly he looked at them. Then he pulled a hair from his left whisker\nand laid it across their little brown backs. And on the instant there\nstood up a Prince and a Princess and at their feet lay the little\nempty mouse-skins.\n\n[THERE STOOD UP A PRINCE AND A PRINCESS.]\n\n“It’s lucky for you,” said the Great White Rat, “that you chose to\nswallow the Cat’s-eye, because people who have been moused by that\nmeans can never be un-moused except _in pairs_. Nothing is impossible\nif people only love each other enough.”\n\nSo the Prince and his bride returned to the palace and lived happy ever\nafter. They were as happy as if they had been mice—which, in a country\nwhere there are no cats, is saying a good deal. Of course the Prince\nis still afraid of cats. But the curious thing is that now his wife is\nafraid of them too. Perhaps she learnt that lesson when she was a mouse\nfor his sake. He, when he was a mouse for hers, learned this lesson,\nwhich is also the moral of this story: “Nothing is impossible if people\nonly love each other enough.”\n\n\n\n\nBOOK 5. _MELISANDE_ _OR, LONG AND SHORT DIVISION_\n\n\nWHEN the Princess Melisande was born, her mother, the Queen, wished to\nhave a christening party, but the King put his foot down and said he\nwould not have it.\n\n“I’ve seen too much trouble come of christening parties,” said he.\n“However carefully you keep your visiting-book, some fairy or other\nis sure to get left out, and you know what _that_ leads to. Why, even\nin my own family, the most shocking things have occurred. The Fairy\nMalevola was not asked to my great-grandmother’s christening—and you\nknow all about the spindle and the hundred years’ sleep.”\n\n“Perhaps you’re right,” said the Queen. “My own cousin by marriage\nforgot some stuffy old fairy or other when she was sending out the\ncards for her daughter’s christening, and the old wretch turned up at\nthe last moment, and the girl drops toads out of her mouth to this day.”\n\n“Just so. And then there was that business of the mouse and the\nkitchen-maids,” said the King; “we’ll have no nonsense about it. I’ll\nbe her godfather, and you shall be her godmother, and we won’t ask a\nsingle fairy; then none of them can be offended.”\n\n“Unless they all are,” said the Queen.\n\nAnd that was exactly what happened. When the King and the Queen and\nthe baby got back from the christening the parlourmaid met them at the\ndoor, and said—\n\n“Please, your Majesty, several ladies have called. I told them you were\nnot at home, but they all said they’d wait.”\n\n“Are they in the parlour?” asked the Queen.\n\n“I’ve shown them into the Throne Room, your Majesty,” said the\nparlourmaid. “You see, there are several of them.”\n\nThere were about seven hundred. The great Throne Room was crammed with\nfairies, of all ages and of all degrees of beauty and ugliness—good\nfairies and bad fairies, flower fairies and moon fairies, fairies like\nspiders and fairies like butterflies—and as the Queen opened the door\nand began to say how sorry she was to have kept them waiting, they all\ncried, with one voice, “Why didn’t you ask _me_ to your christening\nparty?”\n\n“I haven’t had a party,” said the Queen, and she turned to the King and\nwhispered, “I told you so.” This was her only consolation.\n\n“You’ve had a christening,” said the fairies, all together.\n\n“I’m very sorry,” said the poor Queen, but Malevola pushed forward and\nsaid, “Hold your tongue,” most rudely.\n\nMalevola is the oldest, as well as the most wicked, of the fairies.\nShe is deservedly unpopular, and has been left out of more christening\nparties than all the rest of the fairies put together.\n\n“Don’t begin to make excuses,” she said, shaking her finger at the\nQueen. “That only makes your conduct worse. You know well enough what\nhappens if a fairy is left out of a christening party. We are all going\nto give our christening presents _now_. As the fairy of highest social\nposition, I shall begin. The Princess shall be bald.”\n\nThe Queen nearly fainted as Malevola drew back, and another fairy, in a\nsmart bonnet with snakes in it, stepped forward with a rustle of bats’\nwings. But the King stepped forward too.\n\n“No you don’t!” said he. “I wonder at you, ladies, I do indeed. How can\nyou be so unfairylike? Have none of you been to school—have none of you\nstudied the history of your own race? Surely you don’t need a poor,\nignorant King like me to tell you that this is _no go_?”\n\n“How dare you?” cried the fairy in the bonnet, and the snakes in it\nquivered as she tossed her head. “It is my turn, and I say the Princess\nshall be——”\n\nThe King actually put his hand over her mouth.\n\n“Look here,” he said; “I won’t have it. Listen to reason—or you’ll\nbe sorry afterwards. A fairy who breaks the traditions of fairy\nhistory goes out—you know she does—like the flame of a candle. And\nall tradition shows that only _one_ bad fairy is ever forgotten at a\nchristening party and the good ones are always invited; so either this\nis not a christening party, or else you were all invited except one,\nand, by her own showing, that was Malevola. It nearly always is. Do I\nmake myself clear?”\n\nSeveral of the better-class fairies who had been led away by Malevola’s\ninfluence murmured that there was something in what His Majesty said.\n\n“Try it, if you don’t believe me,” said the King; “give your nasty\ngifts to my innocent child—but as sure as you do, out you go, like a\ncandle-flame. Now, then, will you risk it?”\n\nNo one answered, and presently several fairies came up to the Queen and\nsaid what a pleasant party it had been, but they really must be going.\nThis example decided the rest. One by one all the fairies said goodbye\nand thanked the Queen for the delightful afternoon they had spent with\nher.\n\n“It’s been quite too lovely,” said the lady with the snake-bonnet;\n“_do_ ask us again soon, dear Queen. I shall be so _longing_ to see you\nagain, and the _dear_ baby,” and off she went, with the snake-trimming\nquivering more than ever.\n\nWhen the very last fairy was gone the Queen ran to look at the baby—she\ntore off its Honiton lace cap and burst into tears. For all the baby’s\ndowny golden hair came off with the cap, and the Princess Melisande was\nas bald as an egg.\n\n“Don’t cry, my love,” said the King. “I have a wish lying by, which\nI’ve never had occasion to use. My fairy godmother gave it me for a\nwedding present, but since then I’ve had nothing to wish for!”\n\n“Thank you, dear,” said the Queen, smiling through her tears.\n\n“I’ll keep the wish till baby grows up,” the King went on. “And then\nI’ll give it to her, and if she likes to wish for hair she can.”\n\n“Oh, won’t you wish for it _now_?” said the Queen, dropping mixed tears\nand kisses on the baby’s round, smooth head.\n\n“No, dearest. She may want something else more when she grows up. And\nbesides, her hair may grow by itself.”\n\nBut it never did. Princess Melisande grew up as beautiful as the sun\nand as good as gold, but never a hair grew on that little head of hers.\nThe Queen sewed her little caps of green silk, and the Princess’s\npink and white face looked out of these like a flower peeping out of\nits bud. And every day as she grew older she grew dearer, and as she\ngrew dearer she grew better, and as she grew more good she grew more\nbeautiful.\n\nNow, when she was grown up the Queen said to the King—\n\n“My love, our dear daughter is old enough to know what she wants. Let\nher have the wish.”\n\nSo the King wrote to his fairy godmother and sent the letter by a\nbutterfly. He asked if he might hand on to his daughter the wish the\nfairy had given him for a wedding present.\n\n“I have never had occasion to use it,” said he, “though it has always\nmade me happy to remember that I had such a thing in the house. The\nwish is as good as new, and my daughter is now of an age to appreciate\nso valuable a present.”\n\nTo which the fairy replied by return of butterfly:—\n\n    “DEAR KING,—Pray do whatever you like with my poor\n    little present. I had quite forgotten it, but I am\n    pleased to think that you have treasured my humble\n    keepsake all these years.\n\n                  “Your affectionate godmother,\n                                          “FORTUNA F.”\n\nSo the King unlocked his gold safe with the seven diamond-handled keys\nthat hung at his girdle, and took out the wish and gave it to his\ndaughter.\n\nAnd Melisande said: “Father, I will wish that all your subjects should\nbe quite happy.”\n\nBut they were that already, because the King and Queen were so good. So\nthe wish did not go off.\n\nSo then she said: “Then I wish them all to be good.”\n\nBut they were that already, because they were happy. So again the wish\nhung fire.\n\nThen the Queen said: “Dearest, for my sake, wish what I tell you.”\n\n“Why, of course I will,” said Melisande. The Queen whispered in her\near, and Melisande nodded. Then she said, aloud—\n\n“I wish I had golden hair a yard long, and that it would grow an inch\nevery day, and grow twice as fast every time it was cut, and——”\n\n“Stop,” cried the King. And the wish went off, and the next moment the\nPrincess stood smiling at him through a shower of golden hair.\n\n“Oh, how lovely,” said the Queen. “What a pity you interrupted her,\ndear; she hadn’t finished.”\n\n“What was the end?” asked the King.\n\n“Oh,” said Melisande, “I was only going to say, ‘and twice as thick.’”\n\n“It’s a very good thing you didn’t,” said the King. “You’ve done about\nenough.” For he had a mathematical mind, and could do the sums about\nthe grains of wheat on the chess-board, and the nails in the horse’s\nshoes, in his Royal head without any trouble at all.\n\n“Why, what’s the matter?” asked the Queen.\n\n“You’ll know soon enough,” said the King. “Come, let’s be happy while\nwe may. Give me a kiss, little Melisande, and then go to nurse and ask\nher to teach you how to comb your hair.”\n\n“I know,” said Melisande, “I’ve often combed mother’s.”\n\n“Your mother has beautiful hair,” said the King; “but I fancy you will\nfind your own less easy to manage.”\n\nAnd, indeed, it was so. The Princess’s hair began by being a yard long,\nand it grew an inch every night. If you know anything at all about the\nsimplest sums you will see that in about five weeks her hair was about\ntwo yards long. This is a very inconvenient length. It trails on the\nfloor and sweeps up all the dust, and though in palaces, of course, it\nis all gold-dust, still it is not nice to have it in your hair. And\nthe Princess’s hair was growing an inch every night. When it was three\nyards long the Princess could not bear it any longer—it was so heavy\nand so hot—so she borrowed nurse’s cutting-out scissors and cut it all\noff, and then for a few hours she was comfortable. But the hair went on\ngrowing, and now it grew twice as fast as before; so that in thirty-six\ndays it was as long as ever. The poor Princess cried with tiredness;\nwhen she couldn’t bear it any more she cut her hair and was comfortable\nfor a very little time. For the hair now grew four times as fast as\nat first, and in eighteen days it was as long as before, and she had\nto have it cut. Then it grew eight inches a day, and the next time it\nwas cut it grew sixteen inches a day, and then thirty-two inches and\nsixty-four inches and a hundred and twenty-eight inches a day, and so\non, growing twice as fast after each cutting, till the Princess would\ngo to bed at night with her hair clipped short, and wake up in the\nmorning with yards and yards and yards of golden hair flowing all about\nthe room, so that she could not move without pulling her own hair, and\nnurse had to come and cut the hair off before she could get out of bed.\n\n“I wish I was bald again,” sighed poor Melisande, looking at the\nlittle green caps she used to wear, and she cried herself to sleep o’\nnights between the golden billows of the golden hair. But she never let\nher mother see her cry, because it was the Queen’s fault, and Melisande\ndid not want to seem to reproach her.\n\nWhen first the Princess’s hair grew her mother sent locks of it to all\nher Royal relations, who had them set in rings and brooches. Later,\nthe Queen was able to send enough for bracelets and girdles. But\npresently so much hair was cut off that they had to burn it. Then when\nautumn came all the crops failed; it seemed as though all the gold of\nharvest had gone into the Princess’s hair. And there was a famine. Then\nMelisande said—\n\n“It seems a pity to waste all my hair; it does grow so very fast.\nCouldn’t we stuff things with it, or something, and sell them, to feed\nthe people?”\n\nSo the King called a council of merchants, and they sent out samples\nof the Princess’s hair, and soon orders came pouring in; and the\nPrincess’s hair became the staple export of that country. They stuffed\npillows with it, and they stuffed beds with it. They made ropes of it\nfor sailors to use, and curtains for hanging in Kings’ palaces. They\nmade haircloth of it, for hermits, and other people who wished to be\nuncomfy. But it was so soft and silky that it only made them happy and\nwarm, which they did not wish to be. So the hermits gave up wearing\nit, and, instead, mothers bought it for their little babies, and all\nwell-born infants wore little shirts of Princess-haircloth.\n\nAnd still the hair grew and grew. And the people were fed and the\nfamine came to an end.\n\nThen the King said: “It was all very well while the famine lasted—but\nnow I shall write to my fairy godmother and see if something cannot be\ndone.”\n\nSo he wrote and sent the letter by a skylark, and by return of bird\ncame this answer—\n\n“Why not advertise for a competent Prince? Offer the usual reward.”\n\nSo the King sent out his heralds all over the world to proclaim that\nany respectable Prince with proper references should marry the Princess\nMelisande if he could stop her hair growing.\n\nThen from far and near came trains of Princes anxious to try their\nluck, and they brought all sorts of nasty things with them in\nbottles and round wooden boxes. The Princess tried all the remedies,\nbut she did not like any of them, and she did not like any of the\nPrinces, so in her heart she was rather glad that none of the nasty\nthings in bottles and boxes made the least difference to her hair.\n\n[TRAINS OF PRINCES BRINGING NASTY THINGS IN BOTTLES AND\nROUND WOODEN BOXES.]\n\nThe Princess had to sleep in the great Throne Room now, because no\nother room was big enough to hold her and her hair. When she woke in\nthe morning the long high room would be quite full of her golden hair,\npacked tight and thick like wool in a barn. And every night when she\nhad had the hair cut close to her head she would sit in her green silk\ngown by the window and cry, and kiss the little green caps she used to\nwear, and wish herself bald again.\n\nIt was as she sat crying there on Midsummer Eve that she first saw\nPrince Florizel.\n\nHe had come to the palace that evening, but he would not appear in\nher presence with the dust of travel on him, and she had retired with\nher hair borne by twenty pages before he had bathed and changed his\ngarments and entered the reception-room.\n\nNow he was walking in the garden in the moonlight, and he looked up\nand she looked down, and for the first time Melisande, looking on\na Prince, wished that he might have the power to stop her hair from\ngrowing. As for the Prince, he wished many things, and the first was\ngranted him. For he said—\n\n“You are Melisande?”\n\n“And you are Florizel?”\n\n“There are many roses round your window,” said he to her, “and none\ndown here.”\n\nShe threw him one of three white roses she held in her hand. Then he\nsaid—\n\n“White rose trees are strong. May I climb up to you?”\n\n“Surely,” said the Princess.\n\nSo he climbed up to the window.\n\n“Now,” said he, “if I can do what your father asks, will you marry me?”\n\n“My father has promised that I shall,” said Melisande, playing with the\nwhite roses in her hand.\n\n“Dear Princess,” said he, “your father’s promise is nothing to me. I\nwant yours. Will you give it to me?”\n\n“Yes,” said she, and gave him the second rose.\n\n“I want your hand.”\n\n“Yes,” she said.\n\n“And your heart with it.”\n\n“Yes,” said the Princess, and she gave him the third rose.\n\n“And a kiss to seal the promise.”\n\n“Yes,” said she.\n\n“And a kiss to go with the hand.”\n\n“Yes,” she said.\n\n“And a kiss to bring the heart.”\n\n“Yes,” said the Princess, and she gave him the three kisses.\n\n“Now,” said he, when he had given them back to her, “to-night do not go\nto bed. Stay by your window, and I will stay down here in the garden\nand watch. And when your hair has grown to the filling of your room\ncall to me, and then do as I tell you.”\n\n“I will,” said the Princess.\n\nSo at dewy sunrise the Prince, lying on the turf beside the sun-dial,\nheard her voice—\n\n“Florizel! Florizel! My hair has grown so long that it is pushing me\nout of the window.”\n\n“Get out on to the window-sill,” said he, “and twist your hair three\ntimes round the great iron hook that is there.”\n\nAnd she did.\n\nThen the Prince climbed up the rose bush with his naked sword in his\nteeth, and he took the Princess’s hair in his hand about a yard from\nher head and said—\n\n“Jump!”\n\nThe Princess jumped, and screamed, for there she was hanging from the\nhook by a yard and a half of her bright hair; the Prince tightened his\ngrasp of the hair and drew his sword across it.\n\nThen he let her down gently by her hair till her feet were on the\ngrass, and jumped down after her.\n\nThey stayed talking in the garden till all the shadows had crept under\ntheir proper trees and the sun-dial said it was breakfast time.\n\nThen they went in to breakfast, and all the Court crowded round to\nwonder and admire. For the Princess’s hair had not grown.\n\n“How did you do it?” asked the King, shaking Florizel warmly by the\nhand.\n\n“The simplest thing in the world,” said Florizel, modestly. “You have\nalways cut the hair off the Princess. _I_ just cut the Princess off the\nhair.”\n\n“Humph!” said the King, who had a logical mind. And during breakfast he\nmore than once looked anxiously at his daughter. When they got up from\nbreakfast the Princess rose with the rest, but she rose and rose and\nrose, till it seemed as though there would never be an end of it. The\nPrincess was nine feet high.\n\n“I feared as much,” said the King, sadly. “I wonder what will be the\nrate of progression. You see,” he said to poor Florizel, “when we cut\nthe hair off _it_ grows—when we cut the Princess off _she_ grows. I\nwish you had happened to think of that!”\n\nThe Princess went on growing. By dinner-time she was so large that she\nhad to have her dinner brought out into the garden because she was\ntoo large to get indoors. But she was too unhappy to be able to eat\nanything. And she cried so much that there was quite a pool in the\ngarden, and several pages were nearly drowned. So she remembered her\n“Alice in Wonderland,” and stopped crying at once. But she did not stop\ngrowing. She grew bigger and bigger and bigger, till she had to go\noutside the palace gardens and sit on the common, and even that was too\nsmall to hold her comfortably, for every hour she grew twice as much as\nshe had done the hour before. And nobody knew what to do, nor where the\nPrincess was to sleep. Fortunately, her clothes had grown with her, or\nshe would have been very cold indeed, and now she sat on the common\nin her green gown, embroidered with gold, looking like a great hill\ncovered with gorse in flower.\n\nYou cannot possibly imagine how large the Princess was growing, and her\nmother stood wringing her hands on the castle tower, and the Prince\nFlorizel looked on broken-hearted to see his Princess snatched from his\narms and turned into a lady as big as a mountain.\n\nThe King did not weep or look on. He sat down at once and wrote to his\nfairy godmother, asking her advice. He sent a weasel with the letter,\nand by return of weasel he got his own letter back again, marked “Gone\naway. Left no address.”\n\nIt was now, when the kingdom was plunged into gloom, that a\nneighbouring King took it into his head to send an invading army\nagainst the island where Melisande lived. They came in ships and they\nlanded in great numbers, and Melisande looking down from her height saw\nalien soldiers marching on the sacred soil of her country.\n\n“I don’t mind so much now,” said she, “if I can really be of some use\nthis size.”\n\nAnd she picked up the army of the enemy in handfuls and\ndouble-handfuls, and put them back into their ships, and gave a\nlittle flip to each transport ship with her finger and thumb, which\nsent the ships off so fast that they never stopped till they reached\ntheir own country, and when they arrived there the whole army to a man\nsaid it would rather be courtmartialled a hundred times over than go\nnear the place again.\n\n[THE PRINCESS GREW SO BIG THAT SHE HAD TO GO AND SIT ON\nTHE COMMON.]\n\nMeantime Melisande, sitting on the highest hill on the island, felt the\nland trembling and shivering under her giant feet.\n\n“I do believe I’m getting too heavy,” she said, and jumped off the\nisland into the sea, which was just up to her ankles. Just then a great\nfleet of warships and gunboats and torpedo boats came in sight, on\ntheir way to attack the island.\n\nMelisande could easily have sunk them all with one kick, but she did\nnot like to do this because it might have drowned the sailors, and\nbesides, it might have swamped the island.\n\nSo she simply stooped and picked the island as you would pick a\nmushroom—for, of course, all islands are supported by a stalk\nunderneath—and carried it away to another part of the world. So that\nwhen the warships got to where the island was marked on the map they\nfound nothing but sea, and a very rough sea it was, because the\nPrincess had churned it all up with her ankles as she walked away\nthrough it with the island.\n\nWhen Melisande reached a suitable place, very sunny and warm, and with\nno sharks in the water, she set down the island; and the people made it\nfast with anchors, and then every one went to bed, thanking the kind\nfate which had sent them so great a Princess to help them in their\nneed, and calling her the saviour of her country and the bulwark of the\nnation.\n\nBut it is poor work being the nation’s bulwark and your country’s\nsaviour when you are miles high, and have no one to talk to, and when\nall you want is to be your humble right size again and to marry your\nsweetheart. And when it was dark the Princess came close to the island,\nand looked down, from far up, at her palace and her tower and cried,\nand cried, and cried. It does not matter how much you cry into the sea,\nit hardly makes any difference, however large you may be. Then when\neverything was quite dark the Princess looked up at the stars.\n\n“I wonder how soon I shall be big enough to knock my head against\nthem,” said she.\n\nAnd as she stood star-gazing she heard a whisper right in her ear. A\nvery little whisper, but quite plain.\n\n“Cut off your hair!” it said.\n\nNow, everything the Princess was wearing had grown big along with her,\nso that now there dangled from her golden girdle a pair of scissors as\nbig as the Malay Peninsula, together with a pin-cushion the size of the\nIsle of Wight, and a yard measure that would have gone round Australia.\n\nAnd when she heard the little, little voice, she knew it, small as it\nwas, for the dear voice of Prince Florizel, and she whipped out the\nscissors from her gold case and snip, snip, snipped all her hair off,\nand it fell into the sea. The coral insects got hold of it at once and\nset to work on it, and now they have made it into the biggest coral\nreef in the world; but that has nothing to do with the story.\n\nThen the voice said, “Get close to the island,” and the Princess did,\nbut she could not get very close because she was so large, and she\nlooked up again at the stars and they seemed to be much farther off.\n\nThen the voice said, “Be ready to swim,” and she felt something climb\nout of her ear and clamber down her arm. The stars got farther and\nfarther away, and next moment the Princess found herself swimming in\nthe sea, and Prince Florizel swimming beside her.\n\n“I crept on to your hand when you were carrying the island,” he\nexplained, when their feet touched the sand and they walked in through\nthe shallow water, “and I got into your ear with an ear-trumpet. You\nnever noticed me because you were so great then.”\n\n“Oh, my dear Prince,” cried Melisande, falling into his arms, “you have\nsaved me. I am my proper size again.”\n\nSo they went home and told the King and Queen. Both were very, very\nhappy, but the King rubbed his chin with his hand, and said—\n\n“You’ve certainly had some fun for your money, young man, but don’t\nyou see that we’re just where we were before? Why, the child’s hair is\ngrowing already.”\n\nAnd indeed it was.\n\nThen once more the King sent a letter to his godmother. He sent it by a\nflying-fish, and by return of fish come the answer—\n\n“Just back from my holidays. Sorry for your troubles. Why not try\nscales?”\n\nAnd on this message the whole Court pondered for weeks.\n\nBut the Prince caused a pair of gold scales to be made, and hung them\nup in the palace gardens under a big oak tree. And one morning he said\nto the Princess—\n\n“My darling Melisande, I must really speak seriously to you. We are\ngetting on in life. I am nearly twenty: it is time that we thought of\nbeing settled. Will you trust me entirely and get into one of those\ngold scales?”\n\nSo he took her down into the garden, and helped her into the scale, and\nshe curled up in it in her green and gold gown, like a little grass\nmound with buttercups on it.\n\n“And what is going into the other scale?” asked Melisande.\n\n“Your hair,” said Florizel. “You see, when your hair is cut off you\nit grows, and when you are cut off your hair you grow—oh, my heart’s\ndelight, I can never forget how you grew, never! But if, when your\nhair is no more than you, and you are no more than your hair, I snip\nthe scissors between you and it, then neither you nor your hair can\npossibly decide which ought to go on growing.”\n\n“Suppose _both_ did,” said the poor Princess, humbly.\n\n“Impossible,” said the Prince, with a shudder; “there are limits even\nto Malevola’s malevolence. And, besides, Fortuna said ‘Scales.’ Will\nyou try it?”\n\n“I will do whatever you wish,” said the poor Princess, “but let me kiss\nmy father and mother once, and Nurse, and you, too, my dear, in case I\ngrow large again and can kiss nobody any more.”\n\nSo they came one by one and kissed the Princess.\n\nThen the nurse cut off the Princess’s hair, and at once it began to\ngrow at a frightful rate.\n\nThe King and Queen and nurse busily packed it, as it grew, into the\nother scale, and gradually the scale went down a little. The Prince\nstood waiting between the scales with his drawn sword, and just before\nthe two were equal he struck. But during the time his sword took to\nflash through the air the Princess’s hair grew a yard or two, so that\nat the instant when he struck the balance was true.\n\n“You are a young man of sound judgment,” said the King, embracing him,\nwhile the Queen and the nurse ran to help the Princess out of the gold\nscale.\n\nThe scale full of golden hair bumped down on to the ground as the\nPrincess stepped out of the other one, and stood there before those\nwho loved her, laughing and crying with happiness, because she remained\nher proper size, and her hair was not growing any more.\n\n[THE PRINCESS IN ONE SCALE AND HER HAIR IN THE OTHER.]\n\nShe kissed her Prince a hundred times, and the very next day they were\nmarried. Every one remarked on the beauty of the bride, and it was\nnoticed that her hair was quite short—only five feet five and a quarter\ninches long—just down to her pretty ankles. Because the scales had been\nten feet ten and a half inches apart, and the Prince, having a straight\neye, had cut the golden hair exactly in the middle!\n\n\n\n\nBOOK 6. _FORTUNATUS REX & CO._\n\n\nTHERE was once a lady who found herself in middle life with but a\nslight income. Knowing herself to be insufficiently educated to be\nable to practise any other trade or calling, she of course decided,\nwithout hesitation, to enter the profession of teaching. She opened a\nvery select Boarding School for Young Ladies. The highest references\nwere given and required. And in order to keep her school as select as\npossible, Miss Fitzroy Robinson had a brass plate fastened on to the\ndoor, with an inscription in small polite lettering. (You have, of\ncourse, heard of the “polite letters.” Well, it was with these that\nMiss Fitzroy Robinson’s door-plate was engraved.)\n\n  “SELECT BOARDING ESTABLISHMENT FOR THE\n   DAUGHTERS OF RESPECTABLE MONARCHS.”\n\nA great many kings who were not at all respectable would have given\ntheir royal ears to be allowed to send their daughters to this school,\nbut Miss Fitzroy Robinson was very firm about references, and the\nconsequence was that all the really high-class kings were only too\npleased to be permitted to pay ten thousand pounds a year for their\ndaughters’ education. And so Miss Fitzroy Robinson was able to lay\naside a few pounds as a provision for her old age. And all the money\nshe saved was invested in land.\n\nOnly one monarch refused to send his daughter to Miss Fitzroy Robinson,\non the ground that so cheap a school could not be a really select one,\nand it was found out afterwards that his references were not at all\nsatisfactory.\n\nThere were only six boarders, and of course the best masters were\nengaged to teach the royal pupils everything which their parents wished\nthem to learn, and as the girls were never asked to do lessons except\nwhen they felt quite inclined, they all said it was the nicest school\nin the world, and cried at the very thought of being taken away. Thus\nit happened that the six pupils were quite grown up and were just\nbecoming parlour boarders when events began to occur. Princess Daisy,\nthe daughter of King Fortunatus, the ruling sovereign, was the only\nlittle girl in the school.\n\nNow it was when she had been at school about a year, that a ring came\nat the front door-bell, and the maid-servant came to the schoolroom\nwith a visiting card held in the corner of her apron—for her hands were\nwet because it was washing-day.\n\n“A gentleman to see you, Miss,” she said; and Miss Fitzroy Robinson was\nquite fluttered because she thought it might be a respectable monarch,\nwith a daughter who wanted teaching.\n\nBut when she looked at the card she left off fluttering, and said,\n“Dear me!” under her breath, because she was very genteel. If she had\nbeen vulgar like some of us she would have said “Bother!” and if she\nhad been more vulgar than, I hope, any of us are, she might have said\n“Drat the man!” The card was large and shiny and had gold letters on\nit. Miss Fitzroy Robinson read:—\n\n  Chevalier Doloro De Lara\n  Professor of Magic (white)\n  and the Black Art.\n  Pupils instructed at their own residences.\n  No extras.\n  Special terms for Schools. Evening Parties\n  attended.\n\nMiss Fitzroy Robinson laid down her book—she never taught without a\nbook—smoothed her yellow cap and her grey curls and went into the front\nparlour to see her visitor. He bowed low at sight of her. He was very\ntall and hungry-looking, with black eyes, and an indescribable mouth.\n\n“It is indeed a pleasure,” said he, smiling so as to show every one of\nhis thirty-two teeth—a very polite, but very difficult thing to do—“it\nis indeed a pleasure to meet once more my old pupil.”\n\n“The pleasure is mutual, I am sure,” said Miss Fitzroy Robinson. If it\nis sometimes impossible to be polite and truthful at the same moment,\nthat is not my fault, nor Miss Fitzroy Robinson’s.\n\n“I have been travelling about,” said the Professor, still smiling\nimmeasurably, “increasing my stock of wisdom. Ah, dear lady—we live and\nlearn, do we not? And now I am really a far more competent teacher than\nwhen I had the honour of instructing you. May I hope for an engagement\nas Professor in your Academy?”\n\n“I have not yet been able to arrange for a regular course of Magic,”\nsaid the schoolmistress; “it is a subject in which parents, especially\nroyal ones, take but too little interest.”\n\n“It was your favourite study,” said the professor.\n\n“Yes—but—well, no doubt some day——”\n\n“But I want an engagement _now_,” said he, looking hungrier than ever;\n“a thousand pounds for thirteen lessons—to _you_, dear lady.”\n\n“It’s quite impossible,” said she, and she spoke firmly, for she knew\nfrom history how dangerous it is for a Magician to be allowed anywhere\nnear a princess. Some harm almost always comes of it.\n\n“Oh, very well!” said the Professor.\n\n“You see my pupils are all princesses,” she went on, “they don’t\nrequire the use of magic, they can get all they want without it.”\n\n“Then it’s ‘_No_’?” said he.\n\n“It’s ‘No thank you kindly,’” said she.\n\nThen, before she could stop him, he sprang past her out at the door,\nand she heard his boots on the oilcloth of the passage. She flew after\nhim just in time to have the schoolroom door slammed and locked in her\nface.\n\n“Well, I never!” said Miss Fitzroy Robinson. She hastened to the top\nof the house and hurried down the schoolroom chimney, which had been\nmade with steps, in case of fire or other emergency. She stepped out of\nthe grate on to the schoolroom hearthrug just one second too late. The\nseven Princesses were all gone, and the Professor of Magic stood alone\namong the ink-stained desks, smiling the largest smile Miss Fitzroy\nRobinson had seen yet.\n\n“Oh, you naughty, bad, wicked man, you!” said she, shaking the school\nruler at him.\n\n       *       *       *       *       *\n\nThe next day was Saturday, and the King of the country called as usual\nto take his daughter Daisy out to spend her half holiday. The servant\nwho opened the door had a coarse apron on and cinders in her hair,\nand the King thought it was sackcloth and ashes, and said so a little\nanxiously, but the girl said, “No, I’ve only been a-doing of the\nkitchen range—though, for the matter of that—but you’d best see missus\nherself.”\n\nSo the King was shown into the best parlour where the tasteful\nwax-flowers were, and the antimacassars and water-colour drawings\nexecuted by the pupils, and the wool mats which Miss Fitzroy\nRobinson’s bed-ridden aunt made so beautifully. A delightful parlour\nfull of the traces of the refining touch of a woman’s hand.\n\nMiss Fitzroy Robinson came in slowly and sadly. Her gown was neatly\nmade of sack-cloth—with an ingenious trimming of small cinders sewn on\ngold braid—and some larger-sized cinders dangled by silken threads from\nthe edge of her lace cap.\n\nThe King saw at once that she was annoyed about something. “I hope I’m\nnot too early,” said he.\n\n“Your Majesty,” she answered, “not at all. You are always punctual, as\nstated in your references. Something has happened. I will not aggravate\nyour misfortunes by breaking them to you. Your daughter Daisy, the\npride and treasure of our little circle, has disappeared. Her six royal\ncompanions are with her. For the present all are safe, but at the\nmoment I am unable to lay my hand on any one of the seven.”\n\nThe King sat down heavily on part of the handsome walnut and rep suite\n(ladies’ and gentlemen’s easy-chairs, couch and six occasional chairs)\nand gasped miserably. He could not find words. But the schoolmistress\nhad written down what she was going to say on a slate and learned it\noff by heart, so she was able to go on fluently.\n\n“Your Majesty, I am not wholly to blame—hang me if I am—I mean hang me\nif you must; but first allow me to have the honour of offering to you\none or two explanatory remarks.”\n\nWith this she sat down and told him the whole story of the Professor’s\nvisit, only stopping exactly where I stopped when I was telling it to\nyou just now.\n\nThe King listened, plucking nervously at the fringe of a purple and\ncrimson antimacassar.\n\n“I never _was_ satisfied with the Professor’s methods,” said Miss\nFitzroy Robinson sadly; “and I always had my doubts as to his moral\ncharacter, doubts now set at rest for ever. After concluding my course\nof instruction with him some years ago I took a series of lessons from\na far more efficient master, and thanks to those lessons, which were, I\nmay mention, extremely costly, I was mercifully enabled to put a spoke\nin the wheel of the unprincipled ruffian——”\n\n“Did you save the Princesses?” cried the King.\n\n“No; but I can if your Majesty and the other parents will leave the\nmatter entirely in my hands.”\n\n“It’s rather a serious matter,” said the King; “my poor little Daisy——”\n\n“I would ask you,” said the schoolmistress with dignity, “not to attach\ntoo much importance to this event. Of course it is regrettable, but\nunpleasant accidents occur in all schools, and the consequences of them\ncan usually be averted by the exercise of tact and judgment.”\n\n“I ought to hang you, you know,” said the King doubtfully.\n\n“No doubt,” said Miss Fitzroy Robinson, “and if you do you’ll never\nsee your Daisy again. Your duty as a parent—yes—and your duty to\nme—conflicting duties are very painful things.”\n\n“But can I trust you?”\n\n“I may remind you,” said she, drawing herself up so that the cinders\nrattled again, “that we exchanged satisfactory references at the\ncommencement of our business relations.”\n\nThe King rose. “Well, Miss Fitzroy Robinson,” he said, “I have been\nentirely satisfied with Daisy’s progress since she has been in your\ncharge, and I feel I cannot do better than leave this matter entirely\nin your able hands.”\n\nThe schoolmistress made him a curtsey, and he went back to his marble\npalace a broken-hearted monarch, with his crown all on one side and his\npoor, dear nose red with weeping.\n\nThe select boarding establishment was shut up.\n\nTime went on and no news came of the lost Princesses.\n\nThe King found but little comfort in the fact that his other child,\nPrince Denis, was still spared to him. Denis was all very well and a\nnice little boy in his way, but a boy is not a girl.\n\nThe Queen was much more broken-hearted than the King, but of course\nshe had the housekeeping to see to and the making of the pickles and\npreserves and the young Prince’s stockings to knit, so she had not much\ntime for weeping, and after a year she said to the King—\n\n“My dear, you ought to do something to distract your mind. It’s\nunkinglike to sit and cry all day. Now, do make an effort; do something\nuseful, if it’s only opening a bazaar or laying a foundation stone.”\n\n“I am frightened of bazaars,” said the King; “they are like bees—they\nbuzz and worry; but foundation stones——” And after that he began to sit\nand think sometimes, without crying, and to make notes on the backs of\nold envelopes. So the Queen felt that she had not spoken quite in vain.\n\nA month later the suggestion of foundation stones bore fruit.\n\nThe King floated a company, and Fortunatus Rex & Co. became almost at\nonce the largest speculative builders in the world.\n\nPerhaps you do not know what a speculative builder is. I’ll tell you\nwhat the King and his Co. did, and then you will know.\n\nThey bought all the pretty woods and fields they could get and cut them\nup into squares, and grubbed up the trees and the grass and put streets\nthere and lamp-posts and ugly little yellow brick houses, in the hopes\nthat people would want to live in them. And curiously enough people\ndid. So the King and his Co. made quite a lot of money.\n\nIt is curious that nearly all the great fortunes are made by turning\nbeautiful things into ugly ones. Making beauty out of ugliness is very\nill-paid work.\n\nThe ugly little streets crawled further and further out of the town,\neating up the green country like greedy yellow caterpillars, but at\nthe foot of the Clover Hill they had to stop. For the owner of Clover\nHill would not sell any land at all—for any price that Fortunatus Rex\n& Co. could offer. In vain the solicitors of the Company called on\nthe solicitors of the owner, wearing their best cloaks and swords and\nshields, and took them out to lunch and gave them nice things to eat\nand drink. Clover Hill was not for sale.\n\nAt last, however, a little old woman all in grey called at the\nCompany’s shining brass and mahogany offices and had a private\ninterview with the King himself.\n\n“I am the owner of Clover Hill,” said she, “and you may build on all\nits acres except the seven at the top and the fifteen acres that go\nround that seven, and you must build me a high wall round the seven\nacres and another round the fifteen—of _red_ brick, mind; none of your\ncheap yellow stuff—and you must make a brand new law that any one who\nsteals my fruit is to be hanged from the tree he stole it from. That’s\nall. What do you say?”\n\nThe King said “Yes,” because since his trouble he cared for nothing but\nbuilding, and his royal soul longed to see the green Clover Hill eaten\nup by yellow brick caterpillars with slate tops. He did not at all like\nbuilding the two red brick walls, but he did it.\n\nNow, the old woman wanted the walls and the acres to be this sort of\nshape—\n\n\nBut it was such a bother getting the exact amount of ground into the\ntwo circles that all the surveyors tore out their hair by handfuls, and\nat last the King said, “Oh bother! Do it this way,” and drew a plan on\nthe back of an old Act of Parliament. So they did, and it was like\nthis—\n\n              +---+---+\n              | 1 | 2 |\n  +---+---+---+---+---+\n  | 13| 14| 15| I | 3 |\n  +---+---+---+---+---+\n  | 12| II|III| IV| 4 |\n  +---+---+---+---+---+\n  | 11| V | VI|VII| 5 |\n  +---+---+---+---+---+\n  | 10| 9 | 8 | 7 | 6 |\n  +---+---+---+---+---+\n\n\nThe old lady was very vexed when she found that there was only one\nwall between her orchard and the world, as you see was the case at the\ncorner where the two 1’s and the 15 meet; but the King said he couldn’t\nafford to build it all over again and that she’d got her two walls as\nshe had said. So she had to put up with it. Only she insisted on the\nKing’s getting her a fierce bull-dog to fly at the throat of any one\nwho should come over the wall at that weak point where the two 1’s join\non to the 15. So he got her a stout bull-dog whose name was Martha, and\nbrought it himself in a jewelled leash.\n\n“Martha will fly at any one who is not of kingly blood,” said he. “Of\ncourse she wouldn’t dream of biting a royal person; but, then, on the\nother hand, royal people don’t rob orchards.”\n\nSo the old woman had to be contented. She tied Martha up in the\nunprotected corner of her inner enclosure and then she planted little\nbaby apple trees and had a house built and sat down in it and waited.\n\nAnd the King was almost happy. The creepy, crawly yellow caterpillars\nate up Clover Hill—all except the little green crown on the top, where\nthe apple trees were and the two red brick walls and the little house\nand the old woman.\n\nThe poor Queen went on seeing to the jam and the pickles and the\nblanket washing and the spring cleaning, and every now and then she\nwould say to her husband—\n\n“Fortunatus, my love, do you _really_ think Miss Fitzroy Robinson is\ntrustworthy? Shall we ever see our Daisy again?”\n\nAnd the King would rumple his fair hair with his hands till it stuck\nout like cheese straws under his crown, and answer—\n\n“My dear, you must be patient; you know we had the very highest\nreferences.”\n\nNow one day the new yellow brick town the King had built had a\ndelightful experience. Six handsome Princes on beautiful white horses\ncame riding through the dusty little streets. The housings of their\nchargers shone with silver embroidery and gleaming glowing jewels, and\ntheir gold armour flashed so gloriously in the sun that all the little\nchildren clapped their hands, and the Princes’ faces were so young and\nkind and handsome that all the old women said: “Bless their pretty\nhearts!”\n\nNow, of course, you will not need to be told that these six Princes\nwere looking for the six grown-up Princesses who had been so happy at\nthe Select Boarding Establishment. Their six Royal fathers, who lived\nmany years’ journey away on the other side of the world, and had not\nyet heard that the Princesses were mislaid, had given Miss Fitzroy\nRobinson’s address to these Princes, and instructed them to marry the\nsix Princesses without delay, and bring them home.\n\nBut when they got to the Select Boarding Establishment for the\nDaughters of Respectable Monarchs, the house was closed, and a card was\nin the window, saying that this desirable villa residence was to be\nlet on moderate terms, furnished or otherwise. The wax fruit under the\nglass shade still showed attractively through the dusty panes. The six\nPrinces looked through the window by turns. They were charmed with the\nfurniture, and the refining touch of a woman’s hand drew them like a\nmagnet. They took the house, but they had their meals at the Palace by\nthe King’s special invitation.\n\nKing Fortunatus told the Princes the dreadful story of the\ndisappearance of the entire Select School; and each Prince swore by\nhis sword-hilt and his honour that he would find out the particular\nPrincess that he was to marry, or perish in the attempt. For, of\ncourse, each Prince was to marry one Princess, mentioned by name in his\ninstructions, and not one of the others.\n\nThe first night that the Princes spent in the furnished house passed\nquietly enough, so did the second and the third and the fourth, fifth\nand sixth, but on the seventh night, as the Princes sat playing\nspilikins in the schoolroom, they suddenly heard a voice that was not\nany of theirs. It said, “Open up Africa!”\n\nThe Princes looked here, there, and everywhere—but they could see no\none. They had not been brought up to the exploring trade, and could not\nhave opened up Africa if they had wanted to.\n\n“Or cut through the Isthmus of Panama,” said the voice again.\n\nNow, as it happened, none of the six Princes were engineers. They\nconfessed as much.\n\n“Cut up China, then!” said the voice, desperately.\n\n“It’s like the ghost of a Tory newspaper,” said one of the Princes.\n\nAnd then suddenly they knew that the voice came from one of the pair of\nglobes which hung in frames at the end of the schoolroom. It was the\nterrestrial globe.\n\n“I’m inside,” said the voice; “I can’t get out. Oh, cut the\nglobe—anywhere—and let me out. But the African route is most\nconvenient.”\n\nPrince Primus opened up Africa with his sword, and out tumbled half a\nProfessor of Magic.\n\n“My other half’s in there,” he said, pointing to the Celestial globe.\n“Let my legs out, do——”\n\nBut Prince Secundus said, “Not so fast,” and Prince Tertius said, “Why\nwere you shut up?”\n\n“I was shut up for as pretty a bit of parlour-magic as ever you saw in\nall your born days,” said the top half of the Professor of Magic.\n\n“Oh, you were, were you?” said Prince Quartus; “well, your legs aren’t\ncoming out just yet. We want to engage a competent magician. You’ll do.”\n\n“But I’m not all here,” said the Professor.\n\n“Quite enough of you,” said Prince Quintus.\n\n“Now look here,” said Prince Sextus; “we want to find our six\nPrincesses. We can give a very good guess as to how they were lost; but\nwe’ll let bygones be bygones. You tell us how to find them, and after\nour weddings we’ll restore your legs to the light of day.”\n\n“This half of me feels so faint,” said the half Professor of Magic.\n\n“What are we to do?” said all the Princes, threateningly; “if you don’t\ntell us, you shall never have a leg to stand on.”\n\n“Steal apples,” said the half Professor, hoarsely, and fainted away.\n\nThey left him lying on the bare boards between the inkstained desks,\nand off they went to steal apples. But this was not so easy. Because\nFortunatus Rex & Co. had built, and built, and built, and apples do not\ngrow freely in those parts of the country which have been “opened up”\nby speculative builders.\n\nSo at last they asked the little Prince Denis where he went for apples\nwhen he wanted them. And Denis said—\n\n“The old woman at the top of Clover Hill has apples in her seven acres,\nand in her fifteen acres, but there’s a fierce bulldog in the seven\nacres, and I’ve stolen all the apples in the fifteen acres myself.”\n\n“We’ll try the seven acres,” said the Princes.\n\n“Very well,” said Denis; “You’ll be hanged if you’re caught. So, as I\nput you up to it, I’m coming too, and if you won’t take me, I’ll tell.\nSo there!”\n\nFor Denis was a most honourable little Prince, and felt that you must\nnot send others into danger unless you go yourself, and he would never\nhave stolen apples if it had not been quite as dangerous as leading\narmies.\n\nSo the Princes had to agree, and the very next night Denis let himself\ndown out of his window by a knotted rope made of all the stockings his\nmother had knitted for him, and the grown-up Princes were waiting under\nthe window, and off they all went to the orchard on the top of Clover\nHill.\n\nThey climbed the wall at the proper corner, and Martha, the bulldog,\nwho was very wellbred, and knew a Prince when she saw one, wagged her\nkinked tail respectfully and wished them good luck.\n\nThe Princes stole over the dewy orchard grass and looked at tree after\ntree: there were no apples on any of them.\n\nOnly at last, in the very middle of the orchard there was a tree with a\ncopper trunk and brass branches, and leaves of silver. And on it hung\nseven beautiful golden apples.\n\nSo each Prince took one of the golden apples, very quietly, and off\nthey went, anxious to get back to the half-Professor of Magic, and\nlearn what to do next. No one had any doubt as to the half-Professor\nhaving told the truth; for when your legs depend on your speaking the\ntruth you will not willingly tell a falsehood.\n\nThey stole away as quietly as they could, each with a gold apple in\nhis hand, but as they went Prince Denis could not resist his longing\nto take a bite out of his apple. He opened his mouth very wide so as\nto get a good bite, and the next moment he howled aloud, for the apple\nwas as hard as stone, and the poor little boy had broken nearly all his\nfirst teeth.\n\nHe flung the apple away in a rage, and the next moment the old woman\nrushed out of her house. She screamed. Martha barked. Prince Denis\nhowled. The whole town was aroused, and the six Princes were arrested,\nand taken under a strong guard to the Tower. Denis was let off, on the\nground of his youth, and, besides, he had lost most of his teeth, which\nis a severe punishment, even for stealing apples.\n\nThe King sat in his Hall of Justice next morning, and the old woman and\nthe Princes came before him. When the story had been told, he said—\n\n“My dear fellows, I hope you’ll excuse me—the laws of hospitality are\nstrict—but business is business after all. I should not like to have\nany constitutional unpleasantness over a little thing like this; you\nmust all be hanged to-morrow morning.”\n\nThe Princes were extremely vexed, but they did not make a fuss. They\nasked to see Denis, and told him what to do.\n\nSo Denis went to the furnished house which had once been a Select\nBoarding Establishment for the Daughters of Respectable Monarchs. The\ndoor was locked, but Denis knew a way in, because his sister had told\nhim all about it one holiday. He got up on the roof and walked down\nthe schoolroom chimney.\n\nThere, on the schoolroom floor, lay half a Professor of Magic,\nstruggling feebly, and uttering sad, faint squeals.\n\n“What are we to do now?” said Denis.\n\n“Steal apples,” said the half-Professor in a weak whisper. “Do let my\nlegs out. Slice up the Great Bear—or the Milky Way would be a good one\nfor them to come out by.”\n\nBut Denis knew better.\n\n“Not till we get the lost Princesses,” said he, “now, what’s to be\ndone?”\n\n“Steal apples I tell you,” said the half-Professor, crossly; “seven\napples—there—seven kisses. Cut them down. Oh go along with you, do.\nLeave me to die, you heartless boy. I’ve got pins and needles in my\nlegs.”\n\nThen off ran Denis to the Seven Acre Orchard at the top of Clover Hill,\nand there were the six Princes hanging to the apple-tree, and the\nhangman had gone home to his dinner, and there was no one else about.\nAnd the Princes were not dead.\n\nDenis climbed up the tree and cut the Princes down with the penknife of\nthe gardener’s boy. (You will often find this penknife mentioned in\nyour German exercises; now you know why so much fuss is made about it.)\n\nThe Princes fell to the ground, and when they recovered their wits\nDenis told them what he had done.\n\n“Oh why did you cut us down?” said the Princes, “we were having such\nhappy dreams.”\n\n“Well,” said Denis, shutting up the penknife of the gardener’s boy,\n“of all the ungrateful chaps!” And he turned his back and marched off.\nBut they ran quickly after him and thanked him and told him how they\nhad been dreaming of walking arm in arm with the most dear and lovely\nPrincesses in the world.\n\n“Well,” said Denis, “it’s no use dreaming about _them_. You’ve got your\nown registered Princesses to find, and the half-Professor says, ‘Steal\napples.’”\n\n“There aren’t any more to steal,” said the Princes—but when they\nlooked, there were the gold apples back on the tree just as before.\n\nSo once again they each picked one. Denis chose a different one this\ntime. He thought it might be softer. The last time he had chosen the\nbiggest apple—but now he took the littlest apple of all.\n\n“Seven kisses!” he cried, and began to kiss the little gold apple.\n\nEach Prince kissed the apple he held, till the sound of kisses was like\nthe whisper of the evening wind in leafy trees. And, of course, at the\nseventh kiss each Prince found that he had in his hand not an apple,\nbut the fingers of a lovely Princess. As for Denis, he had got his\nlittle sister Daisy, and he was so glad he promised at once to give her\nhis guinea-pigs and his whole collection of foreign postage stamps.\n\n“What is your name, dear and lovely lady?” asked Prince Primus.\n\n“Sexta,” said his Princess. And then it turned out that every single\none of the Princes had picked the wrong apple, so that each one had a\nPrincess who was not the one mentioned in his letter of instructions.\nSecundus had plucked the apple that held Quinta, and Tertius held\nQuarta, and so on—and everything was as criss-cross-crooked as it\npossibly could be.\n\nAnd yet nobody wanted to change.\n\nThen the old woman came out of her house and looked at them and\nchuckled, and she said—\n\n“You must be contented with what you have.”\n\n“We _are_,” said all twelve of them, “but what about our parents?”\n\n“They must put up with your choice,” said the old woman, “it’s the\ncommon lot of parents.”\n\n“I think you ought to sort yourselves out properly,” said Denis; “I’m\nthe only one who’s got his right Princess—because I wasn’t greedy. I\ntook the smallest.”\n\nThe tallest Princess showed him a red mark on her arm, where his little\nteeth had been two nights before, and everybody laughed.\n\nBut the old woman said—\n\n“They can’t change, my dear. When a Prince has picked a gold apple that\nhas a Princess in it, and has kissed it till she comes out, no other\nPrincess will ever do for him, any more than any other Prince will ever\ndo for her.”\n\nWhile she was speaking the old woman got younger and younger and\nyounger, till as she spoke the last words she was quite young, not more\nthan fifty-five. And it was Miss Fitzroy Robinson!\n\nHer pupils stepped forward one by one with respectful curtsies,\nand she allowed them to kiss her on the cheek, just as if it was\nbreaking-up day.\n\nThen, all together, and very happily, they went down to the furnished\nvilla that had once been the Select School, and when the half-professor\nhad promised on his honour as a Magician to give up Magic and take to\na respectable trade, they took his legs out of the starry sphere, and\ngave them back to him; and he joined himself together, and went off\nfull of earnest resolve to live and die an honest plumber.\n\n“My talents won’t be quite wasted,” said he; “a little hanky-panky is\nuseful in most trades.”\n\nWhen the King asked Miss Fitzroy Robinson to name her own reward for\nrestoring the Princesses, she said—\n\n“Make the land green again, your Majesty.”\n\nSo Fortunatus Rex & Co. devoted themselves to pulling down and carting\noff the yellow streets they had built. And now the country there is\nalmost as green and pretty as it was before Princess Daisy and the six\nparlour-boarders were turned into gold apples.\n\n“It was very clever of dear Miss Fitzroy Robinson to shut up that\nProfessor in those two globes,” said the Queen; “it shows the\nadvantage of having lessons from the best Masters.”\n\n“Yes,” said the King, “I always say that you cannot go far wrong if you\ninsist on the highest references!”\n\n\n\n\nBOOK 7. _THE SUMS THAT CAME RIGHT_\n\n\n“IF twenty-seven barrelsful of apples cost £25 13_s._ 3_d._, what\nwould the same barrels be worth if they had been packed by a dishonest\nperson, who only put in 7/9ths of apples in each barrel and the rest\nsawdust?”\n\nThis was the sum.\n\nIt does not look very hard, perhaps, to you who have studied ardently\nfor years at a Board School, or a High School, or a Preparatory School\nfor the sons of gentlemen; but to Edwin it looked as hard as a ship’s\nbiscuit. But he went for it like a man, and presently produced an\nAnswer and his Master wrote a big curly R across the sum. Perhaps you\ndo not know that a big curly R means Right? As for the answer to the\nsum, I will try to get a Fellow of Trinity College, Cambridge (who is\na very terrible person), to work it out for you, and if he can do it I\nwill put the answer at the end of this story. I cannot work it myself.\n\nEdwin was glad to see the large curly R. He saw it so seldom that to\nmeet it was a real pleasure.\n\n“But what’s the use?” he said. “Everything else leads to something\nelse, except lessons. If you put seeds in the garden they come up\nflowers, unless they’re rotten seeds or you forget where you put them.\nAnd if you buy a rabbit—well, there it is, unless it dies. And if you\neat your dinner—well, you’re not hungry any more for an hour or two.\nBut lessons!”\n\nHe bit his penholder angrily and put his head into his desk to look for\nnibs to play Simpkins minor with. You know the game of nibs, of course?\nHe held up the lid of the desk on his head, as I daresay you have often\ndone, and the inside of the desk was darkish, so that the sudden light\nat the very back of the desk showed quite brightly and unmistakably.\n\n“Those firework fusees, O Crikey!” was Edwin’s first thought.\n\nBut it was no firework fusee. It was like glow-worms, only a thousand\ntimes more bright and white. For it was the light of pure reason, and\nit glowed from the glorious eyes of the Arithmetic Fairy. You did not\nknow that there was an Arithmetic Fairy? If you knew as much as I do,\nit would be simply silly for me to try to tell you stories, wouldn’t it?\n\nHer wonderful eyes gleamed and flashed straight into the round goggling\neyes of the amazed Edwin.\n\n“Upon my word!” she said.\n\nEdwin said nothing.\n\n“Did no one ever tell you?” the fairy went on, shaking out her dress,\nwhich was woven of the integral calculus, and trimmed with a dazzling\nfringe of logarithms. “Did no one ever tell you that the things that\nhappen when you’ve done your sums right, happen when you’re grown up?”\n\n“I don’t care what happens then,” Edwin dared to say, for the flashing\neyes were kind eyes. “I shall be a pirate, or a bushranger, or\nsomething.”\n\nThe fairy drew herself up, and her graceful garland of simple equations\ntrembled as Edwin breathed heavily.\n\n“A Pirate,” said she, “a nice sort of pirate who can’t calculate his\nmen’s share of the plunder to three-seventeenths of a gold link of the\ndead captain’s chain! A fine bushranger who can’t arrange the forty-two\nbullets from the revolvers of his seven dauntless followers so that\neach of the fifteen enemies gets his fair share! Go along with you!”\nsaid the Arithmetic Fairy.\n\nBut Edwin’s eyes were, as I said, wide open, goggling.\n\n“I say,” he suddenly remarked, “how jolly pretty you are.”\n\nThe Arithmetic Fairy has but one weakness—a feminine weakness.\nShe loves a pretty speech. If blunt, so much the worse; yet even\nbluntness....\n\nShe looked down and played shyly with the bunch of miscellaneous\nexamples in vulgar fractions which adorned her waistband.\n\n“I suppose you can’t be expected to understand, yet,” she said, and she\nsaid it very gently.\n\nEdwin took courage.\n\n“When I do things I want something to happen at once. ‘I want a white\nrabbit and I want it _now_.’”\n\nShe did not recognise the quotation.\n\n“Get your Master to set you a little simple multiplication sum in white\nrabbits,” she said. “Goodbye, my child. You’ll know me better in time,\nand as you know me better you’ll love me more.”\n\n“I ... you’re lovely now,” said Edwin.\n\nThe Fairy laughed, and spread her dazzling wings glistening with all\nthe glories of the higher mathematics.\n\nEdwin closed dazzled eyes, and opened them as the desk lid shut down on\nhis head, swayed by no uncertain hand. It was the mathematical master’s\nhand, in fact.\n\nA new example was set. And, curiously enough, white rabbits were in it.\n\n“If seven thousand five hundred and sixty-three white rabbits,” it\nbegan. Edwin, his brain in a whirl, worked it correctly, by a sort of\ninspiration, like an ancient prophet or a calculating machine.\n\nWhen he returned, with his books in a strap, to the red villa whose\ngables meant home for him, he found an excited crowd dancing round the\nwhite-painted gates.\n\nThe whole of the front garden, as well as most of the back garden,\nwas a seething mass of white rabbits. Seven thousand five hundred and\nsixty-three there were, to be exact. I alone know this. The joyous\nEdwin and his distracted parents were never able to count them.\n\n“What a lot of hutches we shall want,” Edwin thought gaily. But when\nhis father came home from the Stock Exchange, where he spent his days\nin considering 7⅝ and 10-3/32—no doubt under the direct guidance of the\nArithmetic Fairy, he said at once—\n\n“Send for the poulterer.”\n\nThis was done. Only one pair of white rabbits remained the property of\nEdwin, but these, by the power of the Arithmetic Fairy, became ten by\nChristmas.\n\nThe rabbits disposed of, peace spread a longing wing over the villa,\nbut was not allowed to settle.\n\n“Oh, please ’m,” the startled cook, cap all crooked, exclaimed in the\nhall, “the cellar is choke-full of apples—most of ’em bad ’m—_I_ never\nsee no one deliver them, nor yet give no receipt.”\n\nThe cook, for once in a lurid career, spoke truth. The cellar _was_\nfull of apples. Nineteen pounds nineteen and twopence and one-third of\na pennyworth—to be accurate.\n\nEdwin went to bed, feeling now quite sure that he had _not_ dreamed the\nArithmetic Fairy, and anxiously wondering what to-morrow’s sums would\nbe about. Not, he trusted, about snakes, or Sunday School teachers.\n\nThe next day’s sum was about oranges. Edwin did it correctly, and\nwent home a prey to the most golden apprehensions. Nor were these\nunfounded. The whole of the dining-room and most of the hall—up to the\nseventh step of the neatly carpeted stairs, was golden with oranges.\nEdwin’s father said some severe things about practical jokers, and sent\nfor the greengrocer. Edwin ate nine 3/7th oranges, and went to bed\nyellow, but not absolutely unhappy.\n\nBut now he was quite sure.\n\nOn the following day his sum dealt with elephants, and in such numbers\nthat his father, on returning from business, yielded to a very natural\nannoyance, and gave notice to his landlord that he should, at Lady Day,\nleave a villa where elephants and oranges occurred to such an extent.\n\nNo one suspected Edwin of having anything to do with these happenings.\nAnd indeed, it was not his fault, so how and why could or should he\nhave owned up to it?\n\nI wish I had time to tell you of the events that occurred when Edwin’s\nsums were set in buttered muffins. Of the seventy-five pigs travelling\nin a circle at varying rates, I can only say that part of this circle\nran through Edwin’s mother’s drawing-room. Nor can I here relate the\ntale of the three hundred lightning conductors which were suddenly\nfound to be attached to the once happy villa-home. Edwin’s mother cried\nall day when she was not laughing, and people came from far and near to\nsee the haunted house. For when it came to four thousand white owls and\na church steeple every one felt that it was more than a mere accident.\n\nEdwin’s master had a pretty taste in sums, and about once a term he\nused to set a sum about canes. Edwin worked that sum wrong on purpose,\nso I suppose it served him right that the canes should be at home\nbefore he was, just as they would have been if he had worked the sum\nproperly, and as he had borrowed his father’s razor that morning to\nsharpen a slate-pencil, the fifty-seven canes were not all thrown away.\n\nBut it was the sum about the cistern that convinced Edwin of the\ndesperate need of finding the Arithmetic Fairy, and begging her to\ntake back the present she had made him. It is not polite to ask this,\nbut Edwin had to do it. You see in the sum the cistern had to leak\nthree pints in thirteen minutes and a quarter, but the cistern at home\nhappened to have a little leak of its own already, where Edwin had\ntried his new drill on it, and the two leaks together managed so well\nthat when Edwin got home he found water dripping from all the top\nbedroom ceilings and the staircase was a sort of Niagara. It was very\nexciting—but when the plumber came he let Edwin’s father know all about\nthe little drilled hole, and Edwin got the credit of the leak in the\nsum, which was much larger and most unfair. His father spoke to Edwin\nabout this matter in his study, and it was then that Edwin saw that he\nmust put an end to the sums that came true.\n\nSo he went up to his bedroom with his candle and his arithmetic book.\nDirectly he put the candle on the chest of drawers a big splash of\nwater from the ceiling fell right on the flame and it went out. He had\nto go right down stairs to get another light. Then he put the candle on\nthe dressing table—splash—out it went. Chair. Splash! Out! At last he\ngot the candle to stay alight on the washhand-stand, which was, by some\ncurious accident, the only dry place in the room.\n\nThen he opened his book. Somewhere in the book he knew there must be\nsomething that would fetch the fairy. He said the Multiplication Table\nup to nine times-after that, as you know, the worst is over. But no\nfairy appeared.\n\nThen he read aloud the instructions for working the different rules,\nincluding the examples given. There was no result.\n\nThen he called to the Fairy—but she did not come.\n\nThen he tried counting. Then counting and calling mixed with other\nthings. Like this:\n\n“Oh, good Fairy! One-two-three-four-five-six-seven; do come and help\nme! Eight-nine-ten-eleven! Beautiful, dear, kind, lovely fairy! Nine\nnines are eighty-one! Dear fairy, do come! Seven million two hundred\nthousand six hundred and fifty-nine! I will always love you if you\nwill come to me now. Three-sevenths of five-ninths of five-twelfths\nof sixteen-fiftieths. You were so kind the other day. Two and two are\nfour, and three are seven! Do come now—you’ve no idea what an awful\nmess you’ve got me into. Seven nines are sixty-three—though I know\nyou meant it kindly. Dear Fairy. Thirteen from thirty-seven leaves\ntwenty-four. Do come and see what a hole I’m in—do come—and the product\nwill give you the desired result!”\n\nEdwin stopped, out of breath. He looked round him for the Fairy. But\nhis room, with the water dripping from the roof and the wet towels and\nbasins on the floor, was not a fairy-like place. Edwin saw, with a\nsigh, that it was no go.\n\n“I’ll have another go in prep to-morrow,” he said. This he did.\n\nThe Mathematical Master was pleased with himself that day because\nhe had succeeded in preventing his best boy from yielding to the\nallurements of the Head-master and the Classical side.\n\nOf course his class knew at once what kind of temper the Mathematical\nMaster was in—you know we always know that—and Edwin ventured to ask\nthat the examples that day might be about a model steam engine.\n\n“Only _one_, sir, please,” he was careful to explain. The Master kindly\nconsented, and by great good fortune the example did not deal with a\nfaulty boiler, nor with any other defect—but concerned itself solely\nwith the model engine’s speed. So Edwin knew, when he had worked his\nsum, exactly what pace the model engine he would find at home would be\ngood for. He worked the sum right.\n\nThen he put his head into his desk and began again.\n\n“Oh, good Fairy, if a sum of £4,700 is to be divided between A, B, and\nC,—do, do come and help me. Three-tenths of a pound is six shillings,\ndear Fairy—eleven—twelve—thirteen—fourteen—oh, lovely Fairy—” and so on.\n\nBut no Fairy came. And Simpkins minor whispered—\n\n“What are you chunnering about?” and stuck a pin into Edwin’s leg.\n“Can’t you do the beastly example?”\n\nThen quite suddenly Edwin knew what he had to do. He made up an example\nfor himself. This was it.\n\n“If 7,535 fairies were in my desk at school and I subtracted 710 and\nadded 1,006, and the rest flew away in 783 equal gangs, how many would\nbe left over in the desk?”\n\nWhen he had worked it the answer was one. Very quickly he opened his\ndesk again, and there was the Arithmetic Fairy, looking more lovely\nthan ever in a rich gown of indices, lined with surds, that fell to\nher feet in osculating curves. In her hand, like a sceptre, shone the\nstarry glory of the binomial theorem. But her eyes were starrier still.\nShe smiled, but her first words were severe.\n\n“You careless boy,” she said. “Why can’t you learn to be accurate? It’s\nthe merest chance you got me. You should have stated your problem more\nclearly, and you should have said seven thousand _Arithmetic_ Fairies.\nWhy suppose you had found one fairy in your desk, and it had been the\nGrammar Fairy, or the Football Fairy—what would you have done then?”\n\n“_Is_ there a Football Fairy?” Edwin asked.\n\n“Of course. There’s a fairy for everything you have to learn. There’s a\nPatience Fairy, and a Good-temper Fairy, and a Fairy to teach people to\nmake bread, and another to teach them to make love. Didn’t you really\nknow that?”\n\n“No,” said Edwin, “but I say, look here——”\n\n“I am looking,” she said, fixing her bright eyes on Edwin’s goggling\nones, exactly as at their first meeting.\n\n“No—I mean—oh—I say—” he said.\n\n“So I hear,” she said.\n\n“No, but—no kid,” said he.\n\n“Of course there isn’t any kid,” said she.\n\n“Dear, kind, pretty Fairy,” Edwin began again.\n\n“That’s better,” said the Fairy.\n\n“Didn’t you hear all I was saying to you yesterday, when the water was\ndripping from the ceiling all over the room?”\n\n“From nineteen several spots. Of course I did.”\n\n“Well then,” said Edwin.\n\n“You mean that you’re tired of having things happen when you do your\nsums correctly? You prefer the old way!”\n\n“Yes, _please_,” said Edwin, “if you’re sure you don’t mind? I know you\nmeant it for kindness, but, oh, it is most beastly, when you get into\nthe thick of it.” He was thinking of the elephants, I fancy.\n\n“I only did it to please you,” said the Fairy pouting. “I’ll make\neverything as it was before. Does _that_ please you? And there’s your\nthird wish. You know we always give three wishes. It’s customary in the\nprofession. What would you like?”\n\nEdwin had not attended properly to this speech, so he had only heard\n“as it was before” and then “What would you like?”\n\nSo he said, “I should like to see you again some day.”\n\nThe Arithmetic Fairy smiled at him, and her beauty grew more and more\nradiant. She had not expected this. “I made sure you would ask for a\npony or a cricket bat or a pair of white mice,” she said. “You _shall_\nsee me again, Edwin. Goodbye.”\n\nAnd the bright vision faded away in a dim mist of rosy permutations.\n\nWhen Edwin got home he heard that a model engine had been discovered in\nthe larder, and had been given to his younger brother. There are some\nwrongs, some sorrows, to which even a pen like mine cannot hope to do\njustice.\n\n       *       *       *       *       *\n\nEdwin is now a quiet-looking grown-up person in a black frock coat; and\nhis hair is slowly withdrawing itself from the top of his learned head.\nI suppose it feels itself unworthy to cover so great a brain. The fairy\nhas been with him, unseen, this many a year. The other day he saw her.\n\nHe had been Senior Wrangler, of course; that was nothing to Edwin. And\nhe was Astronomer Royal, but that, after all, he had a right to expect.\n\nBut it was when he took breath from his researches one day, and\nsuddenly found that he had invented a bran-new Hypernebular\nHypothesis—that he thought of the Fairy, and thinking of her, he beheld\nher. She was lightly poised above a pile of books based on Newton’s\n“Principia,” and topped with his own latest work, “The Fourth and\nFurther Dimensions.” He knew her at once, and now he appreciated, more\nthan ever in his youth, the radiance of her eyes and of her wings, for\nnow he understood it.\n\n“Dear, beautiful Fairy,” he said, “how glad I am to see you again.”\n\n“I’ve been with you all the time,” she said. “I wish I could do\nsomething more for you. Is there anything you want?”\n\nThe great Mathematician who was Edwin ran his hand over his thin hair.\n\n“No,” he said, “no.” And then he remembered the school and Simpkins\nminor and the old desk he used to keep firework fusees in. “Unless,” he\nadded, “you could make me young again.”\n\nShe dropped a little tear, clear as a solved problem.\n\n“I can’t do _that_,” she said. “You can’t have _everything_. The only\nperson who could do that for you is the Love Fairy. If you had found\nher instead of me you would have been always young, but you wouldn’t\nhave invented the Hypernebular Hypothesis.”\n\n“I suppose I shall never never find her now?” said Edwin, and as he\nspoke he looked out of the window to the garden, where a girl was\ngathering roses.\n\n“I wonder!” said she. “The Love Fairy doesn’t live in schooldesks or\nbooks on Fourth Dimensions.”\n\n“I wonder!” said Edwin. “Does the Love Fairy live in gardens?”\n\n“I wonder!” echoed the Arithmetic Fairy, a little sadly, and she spread\nher bright wings and flew out of the open window and out of this story.\n\nEdwin went out into the rose garden. And did he find the Love Fairy?\n\nI wonder!\n\n       *       *       *       *       *\n\nPS.—The Fellow of Trinity says the answer to that sum is nineteen\npounds, nineteen shillings and two pence and one-third of a penny.\n\nDoes the Fellow of Trinity speak the truth?\n\nI wonder!\n\n\n\n\nBOOK 8. _THE TOWN IN THE LIBRARY IN THE TOWN IN THE LIBRARY_\n\n\nROSAMUND and Fabian were left alone in the library. You may not believe\nthis; but I advise you to believe everything I tell you, because it is\ntrue. Truth is stranger than story-books, and when you grow up you will\nhear people say this till you grow quite sick of listening to them: you\nwill then want to write the strangest story that ever was—just to show\nthat _some_ stories can be stranger than truth.\n\nMother was obliged to leave the children alone, because Nurse was ill\nwith measles, which seems a babyish thing for a grown-up nurse to\nhave—but it is quite true. If I had wanted to make up anything I could\nhave said she was ill of a broken heart or a brain-fever, which always\nhappens in books. But I wish to speak the truth even if it sounds\nsilly. And it _was_ measles.\n\nMother could not stay with the children, because it was Christmas\nEve, and on that day a lot of poor old people came up to get their\nChristmas presents, tea and snuff, and flannel petticoats, and warm\ncapes, and boxes of needles and cottons and things like that. Generally\nthe children helped to give out the presents, but this year Mother was\nafraid they might be going to have measles themselves, and measles is\na nasty forward illness with no manners at all. You can catch it from\na person before they know they’ve got it, and if Rosamund and Fabian\nhad been going to have it they might have given it to all the old men\nand women who came up to get their Christmas presents. And measles is a\npresent no old men or women want to have given them, even at Christmas\ntime, no matter how old they may be. They would not mind brain-fever or\na broken heart so much perhaps—because it is more interesting. But no\none can think it interesting to have measles, at any rate till you come\nto the part where they give you jelly and boiled sole.\n\nSo the children were left alone. Before Mother went away she said—\n\n“Look here, dears, you may play with your bricks, or make pictures\nwith your pretty blocks that kind Uncle Thomas gave you, but you must\nnot touch the two top-drawers of the bureau. Now don’t forget. And if\nyou’re good you shall have tea with me, and perhaps there will be cake.\nNow you _will_ be good, won’t you?”\n\nFabian and Rosamund promised faithfully that they would be _very_ good\nand that they would not touch the two top-drawers, and Mother went away\nto see about the flannel petticoats and the tea and snuff and tobacco\nand things. When the children were left alone, Fabian said—\n\n“I am going to be very good, I shall be much more good than Mother\nexpects me to.”\n\n“We _won’t_ look in the drawers,” said Rosamund, stroking the shiny top\nof the bureau.\n\n“We won’t even _think_ about the insides of the drawers,” said Fabian.\nHe stroked the bureau too and his fingers left four long streaks on it,\nbecause he had been eating toffee.\n\n“I suppose,” he said presently, “we may open the two _bottom_ drawers?\nMother couldn’t have made a mistake—could she?”\n\nSo they opened the two bottom drawers just to be sure that Mother\nhadn’t made a mistake, and to see whether there was anything in the\nbottom drawers that they ought not to look at.\n\nBut the bottom drawer of all had only old magazines in it. And the next\nto the bottom drawer had a lot of papers in it. The children knew at\nonce by the look of the papers that they belonged to Father’s great\nwork about the Domestic Life of the Ancient Druids, and they knew it\nwas not right—or even interesting—to try to read other people’s papers.\n\nSo they shut the drawers and looked at each other, and Fabian said, “I\nthink it would be right to play with the bricks and the pretty blocks\nthat Uncle Thomas gave us.”\n\nBut Rosamund was younger than Fabian, and she said, “I am tired of the\nblocks, and I am tired of Uncle Thomas. I would rather look in the\ndrawers.”\n\n“So would I,” said Fabian. And they stood looking at the bureau.\n\nPerhaps you don’t know what a bureau is—children learn very little at\nschool nowadays—so I will tell you that a bureau is a kind of chest\nof drawers. Sometimes it has a bookcase on the top of it, and instead\nof the two little top corner drawers like the chests of drawers in a\nbedroom it has a sloping lid, and when it is quite open you pull out\ntwo little boards underneath—and then it makes a sort of shelf for\npeople to write letters on. The shelf lies quite flat, and lets you see\nlittle drawers inside with mother of pearl handles—and a row of pigeon\nholes—(which are not holes pigeons live in, but places for keeping the\nletters carrier-pigeons could carry round their necks if they liked).\nAnd there is very often a tiny cupboard in the middle of the bureau,\nwith a pattern on the door in different coloured woods. So now you know.\n\nFabian stood first on one leg and then on the other, till Rosamund said—\n\n“Well, you might as well pull up your stockings.”\n\nSo he did. His stockings were always just like a concertina or a very\nexpensive photographic camera, but he used to say it was not his fault,\nand I suppose he knew best. Then he said—\n\n“I say, Rom! mother only said we weren’t to _touch_ the two\ntop-drawers——”\n\n“I _should_ like to be good,” said Rosamund.\n\n“I _mean_ to be good,” said Fabian. “But if you took the little thin\npoker that is not kept for best you could put it through one of the\nbrass handles and I could hold the other handle with the tongs. And\nthen we could open the drawer without touching it.”\n\n“So we could! How clever you are, Fabe,” said Rosamund. And she admired\nher brother very much. So they took the poker and the tongs. The front\nof the bureau got a little scratched, but the top drawer came open, and\nthere they saw two boxes with glass tops and narrow gold paper going\nall round; though you could only see paper shavings through the glass\nthey knew it was soldiers. Besides these boxes there was a doll and a\ndonkey standing on a green grass plot that had wooden wheels, and a\nlittle wicker-work doll’s cradle, and some brass cannons, and a bag\nthat looked like marbles, and some flags, and a mouse that seemed as\nthough it moved with clockwork; only, of course, they had promised not\nto touch the drawer, so they could not make sure. There was a wooden\nbox, too, and it was wrong way up and on the bottom of it was written\nin pencil, “Vill: and anim: 5/9-1/2.” They looked at each other, and\nFabian said:\n\n“I wish it was to-morrow!”\n\nYou have seen that Fabian was quite a clever boy; and he knew at once\nthat these were the Christmas presents which Santa Claus had brought\nfor him and Rosamund. But Rosamund said, “Oh dear, I wish we hadn’t!”\n\nHowever, she consented to open the other drawer—without touching it,\nof course, because she had promised faithfully—and when, with the\npoker and tongs, the other drawer came open, there were large wooden\nboxes—the kind that hold raisins and figs—and round boxes with paper\non—smooth on the top and folded in pleats round the edge; and the\nchildren knew what was inside without looking. Every one knows what\ncandied fruit looks like on the outside of the box. There were square\nboxes, too—the kind that have crackers in—with a cracker going off\non the lid, very different in size and brightness from what it does\nreally, for, as no doubt you know, a cracker very often comes in two\nquite calmly, without any pop at all, and then you only have the motto\nand the sweet, which is never nice. Of course, if there is anything\nelse in the cracker, such as brooches or rings, you have to let the\nlittle girl who sits next you at supper have it.\n\nWhen they had pushed back the drawer Fabian said—\n\n“Let us pull out the writing drawer and make a castle.”\n\nSo they pulled the drawer out and put it on the floor. Please do\nnot try to do this if your father has a bureau, because it leads to\ntrouble. It was only because this one was broken that they were able to\ndo it.\n\nThen they began to build. They had the two boxes of bricks—the wooden\nbricks with the pillars and the coloured glass windows, and the\nrational bricks which are made of clay like tiles, and their father\ncalled them the All-Wool bricks, which seems silly, only of course\ngrown-up people always talk sense. When all the bricks were used up\nthey got the pretty picture blocks that kind Uncle Thomas gave them,\nand they built with these; but one box of blocks does not go far.\nPicture blocks are only good for building, except just at first. When\nyou have made the pictures a few times you know exactly how they go,\nand then what’s the good? This is a fault which belongs to many very\nexpensive toys. These blocks had six pictures—Windsor Castle with the\nRoyal Standard hoisted; ducks in a pond, with a very handsome green and\nblue drake; Rebecca at the well; a snowball fight—but none of the boys\nknew how to chuck a snowball; the Harvest Home; and the Death of Nelson.\n\nThese did not go far, as I said. There are six times as few blocks as\nthere are pictures, because every block has six sides. If you don’t\nunderstand this it shows they don’t teach arithmetic at your school, or\nelse that you don’t do your home lessons.\n\nBut the best of a library is the books. Rosamund and Fabian made up\nwith books. They got Shakespeare in fourteen volumes, and Rollin’s\n“Ancient History,” and Gibbon’s “Decline and Fall,” and “The Beauties\nof Literature” in fifty-six fat little volumes, and they built not only\na castle, but a town—and a big town—that presently towered high above\nthem on the top of the bureau.\n\n“It’s almost big enough to get into,” said Fabian, “if we had\nsome steps.” So they made steps with the “British Essayists,” the\n“Spectator,” and the “Rambler,” and the “Observer,” and the “Tatler”;\nand when the steps were done they walked up them.\n\nYou may think that they could not have walked up these steps and\ninto a town they had built themselves, but I assure you people have\noften done it, and anyway this is a true story. They had made a\nlovely gateway with two fat volumes of Macaulay and Milton’s poetical\nworks on top, and as they went through it they felt all the feelings\nwhich people have to feel when they are tourists and see really fine\narchitecture. (Architecture means buildings, but it is a grander word,\nas you see.)\n\nRosamund and Fabian simply walked up the steps into the town they\nhad built. Whether they got larger or the town got smaller, I do not\npretend to say. When they had gone under the great gateway they found\nthat they were in a street which they could not remember building. But\nthey were not disagreeable about it, and they said it was a very nice\nstreet all the same.\n\nThere was a large square in the middle of the town, with seats, and\nthere they sat down, in the town they had made, and wondered how they\ncould have been so clever as to build it. Then they went to the walls\nof the town—high, strong walls built of the Encyclopedia and the\nBiographical Dictionary—and far away over the brown plain of the carpet\nthey saw a great thing like a square mountain. It was very shiny. And\nas they looked at it a great slice of it pushed itself out, and Fabian\nsaw the brass handles shine, and he said:\n\n“Why, Rom, that’s the bureau.”\n\n“It’s larger than I want it to be,” said Rosamund, who was a little\nfrightened. And indeed it did seem to be an extra size, for it was\nhigher than the town.\n\nThe drawer of the great mountain bureau opened slowly, and the children\ncould see something moving inside; then they saw the glass lid of one\nof the boxes go slowly up till it stood on end and looked like one side\nof the Crystal Palace, it was so large—and inside the box they saw\nsomething moving. The shavings and tissue-paper and the cotton-wool\nheaved and tossed like a sea when it is rough and you wish you had not\ncome for a sail. And then from among the heaving whiteness came out a\nblue soldier, and another and another. They let themselves down from\nthe drawer with ropes of shavings, and when they were all out there\nwere fifty of them—foot soldiers with rifles and fixed bayonets, as\nwell as a thin captain on a horse and a sergeant and a drummer.\n\nThe drummer beat his drum and the whole company formed fours and\nmarched straight for the town. They seemed to be quite full-size\nsoldiers—indeed, _extra_ large.\n\nThe children were very frightened. They left the walls and ran up and\ndown the streets of the town trying to find a place to hide.\n\n“Oh, there’s our very own house,” cried Rosamund at last; “we shall be\nsafe there.” She was surprised as well as pleased to find their own\nhouse inside the town they had built.\n\nSo they ran in, and into the library, and there was the bureau and the\ncastle they had built, and it was all small and quite the proper size.\nBut when they looked out of the window it was not their own street, but\nthe one they had built; they could see two volumes of the “Beauties of\nLiterature” and the head of Rebecca in the house opposite, and down the\nstreet was the Mausoleum they had built after the pattern given in the\nred and yellow book that goes with the All-Wool bricks. It was all very\nconfusing.\n\nSuddenly, as they stood looking out of the windows, they heard a\nshouting, and there were the blue soldiers coming along the street by\ntwos, and when the Captain got opposite their house he called out—\n\n“Fabian! Rosamund! come down!”\n\nAnd they had to, for they were very much frightened.\n\nThen the Captain said—\n\n“We have taken this town, and you are our prisoners. Do not attempt to\nescape, or I don’t know what will happen to you.”\n\nThe children explained that they had built the town, so they thought it\nwas theirs; but the captain said very politely—\n\n“That doesn’t follow at all. It’s our town now. And I want provisions\nfor my soldiers.”\n\n“We haven’t any,” said Fabian, but Rosamund nudged him, and said,\n“Won’t the soldiers be very fierce if they are hungry?”\n\nThe Blue Captain heard her, and said—\n\n“You are quite right, little girl. If you have any food, produce it. It\nwill be a generous act, and may stop any unpleasantness. My soldiers\n_are_ very fierce. Besides,” he added in a lower tone, speaking behind\nhis hand, “you need only feed the soldiers in the usual way.”\n\nWhen the children heard this their minds were made up.\n\n“If you do not mind waiting a minute,” said Fabian, politely, “I will\nbring down any little things I can find.”\n\nThen he took his tongs, and Rosamund took the poker, and they opened\nthe drawer where the raisins and figs and dried fruits were—for\neverything in the library in the town was just the same as in the\nlibrary at home—and they carried them out into the big square where\nthe Captain had drawn up his blue regiment. And here the soldiers were\nfed. I suppose you know how tin soldiers are fed? But children learn\nso little at school nowadays that I daresay you don’t, so I will tell\nyou. You just put a bit of the fig or raisin, or whatever it is, on\nthe soldier’s tin bayonet—or his sword, if he is a cavalry man—and you\nlet it stay on till you are tired of playing at giving the soldiers\nrations, and then of course _you eat it for him_. This was the way in\nwhich Fabian and Rosamund fed the starving blue soldiers. But when they\nhad done so, the soldiers were as hungry as ever. Which only shows that\nsoldiers are an ungrateful lot, and it is idle to try and make their\nlives better and brighter.\n\nSo then the Blue Captain, who had not had anything, even on the point\nof his sword, said—\n\n“More—more, my gallant men are fainting for lack of food.”\n\nSo there was nothing for it but to bring out the candied fruits, and\nto feed the soldiers with them. So Fabian and Rosamund stuck bits of\ncandied apricot and fig and pear and cherry and beetroot on the tops of\nthe soldiers’ bayonets, and when every soldier had a piece they put a\nfat candied cherry on the officer’s sword. Then the children knew the\nsoldiers would be quiet for a few minutes, and they ran back into their\nown house and into the library to talk to each other about what they\nhad better do, for they both felt that the blue soldiers were a very\nhard-hearted set of men.\n\n“They might shut us up in the dungeons,” said Rosamund, “and then\nMother might lock us in, when she shut up the lid of the bureau, and we\nshould starve to death.”\n\nFor they could not be sure exactly what size they were, or which\nlibrary their Mother would come back to when she had given away all the\nflannel petticoats and things.\n\nThe dungeons were the pigeon-holes of the bureau, and the doors of them\nwere the little “Beauties of Literature”—very heavy doors they were too.\n\nYou see the curious thing was that the children had built a town and\ngot into it, and in it they had found their own house with the very\ntown they had built—or one exactly like it—still on the library floor.\n\n“I think it’s all nonsense,” said Rosamund. But when they looked out\nof the window there was the house with Windsor Castle and the head of\nRebecca just opposite.\n\n“If we could only find Mother,” she said; but they knew without looking\nthat Mother was not in the house that they were in then.\n\n“I wish we had that mouse that looked like clockwork—and the donkey,\nand the other box of soldiers—perhaps they are red ones, and they would\nfight the blue and lick them—because red-coats are English and they\nalways win,” said Fabian.\n\nAnd then Rosamund said—\n\n“Oh, Fabe, I believe we could go into _this_ town, too, if we tried!\nLet us put all the things in, and then try!”\n\nSo they went to the bureau drawer, and Rosamund got out the other box\nof soldiers and the mouse—it _was_ a clockwork one—and the donkey with\npanniers, and put them in the town, while Fabian ate up a few odd\nraisins that had dropped on the floor.\n\nWhen all the soldiers (they _were_ red) were arranged on the ramparts\nof the little town, Fabian said—\n\n“I am thinking of all the raisins and things on the soldiers’ bayonets\noutside. It seems a pity not to eat the things for them.”\n\nBut Rosamund said—\n\n“No, no; let’s get into this town, and perhaps we shall be safe from\nthe blue soldiers. Oh, Fabe, never mind the raisins!”\n\nBut Fabian said, “I don’t want you to come if you’re frightened. I’ll\ngo alone. Who’s afraid?”\n\nSo then of course Rosamund said she would come with him, so they went\nout and ate the things for the soldiers, leaving the Captain’s cherry\nfor the last. And when that was eaten they ran as hard as they could\nback to their house and into the library, where the town was on the\nfloor, with the little red soldiers on the ramparts.\n\n“I’m sure we can get into this town,” cried Fabian, and sure enough\nthey did, just as they had done into the first one. Whether they got\nsmaller or the town got larger I leave you to decide. And it was\nexactly the same sort of town as the other. So now they were in a town\nbuilt in a library in a house in a town built in a library in a house\nin a town called London—and the town they were in now had red soldiers\nin it and they felt quite safe, and the Union Jack was stuck up over\nthe gateway. It was a stiff little flag they had found with some\nothers in the bureau drawer; it was meant to be stuck in the Christmas\npudding, but they had stuck it between two blocks and put it over the\ngate of their town. They walked about this town and found their own\nhouse, just as before, and went in, and there was the toy town on the\nfloor; and you will see that they might have walked into that town\nalso, but they saw that it was no good, and that they couldn’t get out\nthat way, but would only get deeper and deeper into a nest of towns in\nlibraries in houses in towns in libraries in houses in towns in ...\nand so on for always—something like Chinese puzzle-boxes multiplied by\nmillions and millions for ever and ever. And they did not like even\nto think of this, because of course they would be getting further and\nfurther from home every time. And when Fabian explained all this to\nRosamund she said he made her head ache, and she began to cry.\n\nThen Fabian thumped her on the back and told her not to be a little\nsilly, for he was a very kind brother. And he said—\n\n“Come out and let’s see if the soldiers can tell us what to do.”\n\nSo they went out; but the red soldiers said they knew nothing but\ndrill, and even the Red Captain said he really couldn’t advise. Then\nthey met the clockwork mouse. He was big like an elephant, and the\ndonkey with panniers was as big as a mastodon or a megatherium. (If\nthey teach you anything at school of course they have taught you all\nabout the megatherium and the mastodon.)\n\nThe Mouse kindly stopped to speak to the children, and Rosamund burst\ninto tears again and said she wanted to go home.\n\nThe great Mouse looked down at her and said—\n\n“I am sorry for _you_, but your brother is the kind of child that\noverwinds clockwork mice the very first day he has them. I prefer to\nstay this size.”\n\nThen Fabian said: “On my honour, I won’t. If we get back home I’ll give\nyou to Rosamund. That is, supposing I get you for one of my Christmas\npresents.”\n\nThe donkey with panniers said—\n\n“And you won’t put coals in my panniers or unglue my feet from my green\ngrass-plot because I look more natural without wheels?”\n\n“I give you my word,” said Fabian, “I wouldn’t think of such a thing.”\n\n“Very well,” said the Mouse, “then I will tell you. It is a great\nsecret, but there is only one way to get out of this kind of town.\nYou—I hardly know how to explain—you—you just _walk out of the gate_,\nyou know.”\n\n“Dear me,” said Rosamund; “I never thought of that!”\n\nSo they all went to the gate of the town and walked out, and there they\nwere in the library again. But when they looked out of the window the\nAll-Wool Mausoleum was still to be seen, and the terrible blue soldiers.\n\n“What are we to do now?” asked Rosamund; but the clockwork mouse and\nthe donkey with panniers were their proper size again now (or else the\nchildren had got bigger. It is no use asking me which, for I do not\nknow), and so of course they could not speak.\n\n“We must walk out of this town as we did out of the other,” said Fabian.\n\n“Yes,” Rosamund said; “only this town if full of blue soldiers and I am\nafraid of them. Don’t you think it would do if we _ran_ out?”\n\nSo out they ran and down the steps that were made of the “Spectator”\nand the “Rambler” and the “Tatler” and the “Observer.” And directly\nthey stood on the brown library carpet they ran to the window and\nlooked out, and they saw—instead of the building with Windsor Castle\nand Rebecca’s head in it, and the All-Wool Mausoleum—they saw their own\nroad with the trees without any leaves and the man was just going along\nlighting the lamps with the stick that the gas-light pops out of, like\na bird, to roost in the glass cage at the top of the lamp-post. So they\nknew that they were safe at home again.\n\nAnd as they stood looking out they heard the library door open, and\nMother’s voice saying—\n\n“What a dreadful muddle! And what have you done with the raisins and\nthe candied fruits?” And her voice was very grave indeed.\n\nNow you will see that it was quite impossible for Fabian and Rosamund\nto explain to their mother what they had done with the raisins and\nthings, and how they had been in a town in a library in a house in a\ntown they had built in their own library with the books and the bricks\nand the pretty picture blocks kind Uncle Thomas gave them. Because they\nwere much younger than I am, and even I have found it rather hard to\nexplain.\n\nSo Rosamund said, “Oh, Mother, my head does ache so,” and began to cry.\nAnd Fabian said nothing, but he, also, began to cry.\n\nAnd Mother said, “I don’t wonder your head aches, after all those sweet\nthings.” And she looked as if she would like to cry too.\n\n“I don’t know what Daddy will say,” said Mother, and then she gave them\neach a nasty powder and put them both to bed.\n\n“I wonder what he _will_ say,” said Fabian just before he went to sleep.\n\n“_I_ don’t know,” said Rosamund, and, strange to say, they don’t\nknow to this hour what Daddy said. Because next day they both had\nmeasles, and when they got better every one had forgotten about what\nhad happened on Christmas Eve. And Fabian and Rosamund had forgotten\njust as much as everybody else. So I should never have heard of it\nbut for the clockwork mouse. It was he who told me the story, just as\nthe children told it to him in the town in the library in the house\nin the town they built in their own library with the books and the\nbricks and the pretty picture blocks which were given to them by kind\nUncle Thomas. And if you do not believe the story it is not my fault:\nI believe every word the mouse said, for I know the good character of\nthat clockwork mouse, and I know it could not tell an untruth even if\nit tried.\n\n\n\n\nBOOK 9. _THE PLUSH USURPER_\n\n\nTHERE was a knock at the King’s study door. The King looked up from his\nplans for the new municipal washhouses and sighed; for that was the\ntwenty-seventh knock that had come to his door since breakfast.\n\n“Come in,” said the King, wearily.\n\nAnd the Lord Chief Good-doer came in. He wore a white gown and carried\na white wand. If you had been there you would have noticed how clean\nthe King’s study looked. All the books were bound in white vellum, and\nthe floor was covered with white matting, and the window curtains were\nof white silk. Of course, it would not be right for every one to have\nsuch things, even if we were all kings because it would make such a lot\nof work for the servants. But this king, whose name was Alban, had an\nexcellent housekeeper. She did all the cooking and cleaned everything\nby white magic, which is better even than _nettoyage-à-sec_ (if you\nknow what that is), and only took the good lady five minutes every\nmorning.\n\n“I am extremely sorry to disturb your Majesty,” said the Lord Chief\nGood-doer, “but your Majesty’s long-lost brother Negretti has called\nin from the Golden Indies, and he says he can’t stay more than half an\nhour.”\n\nThe King jumped up, knocking over the white wood table where the White\nBooks were. (We call them Blue Books in England, but the insides are\njust as dull whatever colour you put outside.)\n\n“My dear brother! I haven’t seen him since we were boys together,” he\ncried, and ran out to meet him, tucking up his royal white velvet robes\nto run the quicker down the cool marble corridors.\n\nAt the front door of the Palace was the King’s brother just getting\noff his elephant. He was a brown and yellow brother, withered and\nshrivelled like a very old apple, and dressed in a suite of plush of a\nbright orange, sown thick with emeralds. All the white marble terrace\nin front of the Palace was crowded with the retinue of the new arrival.\nSlaves of all colours—black, brown, yellow, and cream colour, dressed\nin all sorts of bright hues, scarlet and blue and purple and orange,\nwith rubies and sapphires and amethysts and topazes sewn thickly on\nthem, so that the eye could hardly bear the glow and glitter of them as\nthey shone in the sunlight on the terrace.\n\n“Welcome, welcome!” King Alban cried, and kissed his brother on both\ncheeks, as is the fashion in Albanatolia and in many other civilised\nlands. Then, still holding him by both hands, he led him into the\nPalace. The jewelled gorgeous retinue followed him in, and the head\nparlour-maid shut the front door and put the chain up, because she knew\nit to be more than possible that a few odd rubies and sapphires and\nthings would drop off the retinue on to the floor, and she thought any\nsuch little odds and ends might as well go into her dust-pan, when she\nswept up after lunch, as into the pockets of any poor people who might\nlook in during the afternoon to ask the King’s advice, as they were\nfond of doing. This was the beginning of the trouble that was wrought\nby the coming of the King’s brother. Before this every door stood\nunfastened all day long, because every one was contented, and therefore\nhonest.\n\nKing Alban entertained his brother royally for seven days in the good\nold fashion, and then gave him a palace of his own to live in. The\nPalace was of white marble, like most of the buildings in Albanatolia,\nbut the King’s brother had it painted red all over without a moment’s\ndelay. And then he began to give parties and to have processions and\nto scatter money among the crowd, and every day the people loved him\nmore. He was a loud, jolly, joking sort of man, with a black beard,\nand he always wore clothes of plush, a material hitherto unknown; and\nhe always blazed with jewels, and he had a circus set up at his own\nexpense in the field at the back of his Palace; and he introduced\nhorse-racing and animated photographs—all highly coloured—and thus\nbecame extraordinarily popular: so much so that the people presently\nbegan to forget all the good that King Alban had done for them, and to\nwish secretly that the kingdom had happened to have a bright, cheerful\nking like Prince Negretti.\n\nFor King Alban had worked so hard for his people’s good that he had\nnot had time to be amusing. He had never had processions and circuses,\npreferring rather small tea-parties with the Lord Chief Good-doer, the\nCommissioner of Public Health, and a few chosen spirits from the\nEducation Department, and loving best of all to wander alone, dreaming,\namong the blossoming orchards or in the meadows beyond the river, where\nthe white jonquils grew, or in the lanes between the pearly may-bushes,\nor in the terraced garden of his Palace, where the white roses hung in\nheavy-scented clusters, and the white peacocks spread their tails upon\nthe marble balustrades. And wherever he went he thought of the people’s\ngood, and devised new ways of making them comfortable. Everything\nwas beautifully managed. Every one had enough to wear and enough to\neat, and enough to do, which is very important; but they had not\nenough to play at, and this was what made them ready to lend long and\ndiscontented ears to the whispers of the King’s brother.\n\n[“WELCOME! WELCOME!”]\n\nNow Negretti was a Magician, and his was the black or coloured magic\nwhich won’t wash clothes. He was always messing about with acids and\nalkalis, and sulphites and bicarbonates, and retorts and furnaces, and\ntest-tubes, and pestles and mortars, and the like; and whenever he\nhappened to make a nice colour by mixing two or more of these things\ntogether, he always put it in a bottle and stuck it up in one of the\nPalace windows, so that at night his windows were brighter than any\nchemist’s and druggist’s in any street, and the people said it was as\ngood as fireworks. The King’s palace windows only sent out a soft white\nlight like moonlight, and this was now considered very tame.\n\nIt was the Magician’s habit to wander about the town stirring up\ndiscontent as easily as if it had been one of his chemical messes; and\nthough he was so well known among the people he was never recognised,\nbecause he always took care to disguise himself as a respectable\nperson, and the disguise was quite impenetrable. (I hope you know what\nthat is?)\n\nOne night he sat disguised at the King’s Head—the finest of the\nmunicipal alehouses—drinking dog’s-nose out of a pewter-pot, and the\ngrumbling of the people was music in his wicked ears.\n\n“Alban is not my sort of king,” said the blacksmith.\n\n“I’d make a better king out of a penn’orth of putty any day of the\nweek,” said the painter.\n\n“What’s the good of a king if you never see him?” said the landlady.\n\n“No processions, no flags, no gilt coaches, no rubies and diamonds and\nsapphires, no royal robes of purple and gold—such as a loyal country\nhas a right to expect on its sovereign’s back! Only that old white\nthing,” said the barmaid.\n\n“No better than a velvet nightgown,” said the landlady.\n\n“I like a bit of colour, I do,” said the painter. “Graining I don’t ask\nfor, for he’s not had the education to know its beauty; but a good warm\nmaroon, or a royal blue, now! But, no; it’s white, white, white, till\nI’m sick of it. And us all wearing white by law, and washing done free,\nby white magic, at the Palace, on Mondays from 10 to 4. And no one to\nhave more than a quart of beer of an evening! I tell you what it is, my\nboys, we’re miserable, degraded slaves; that’s what we are!”\n\n“If we must have a king,” said the blacksmith, “why not good old\nNegretti? He’s something like a king, he is! Ah! if he only knew how\nour free hearts beat with him, he’d be sitting on the throne to-morrow.”\n\nThen Negretti threw off his disguise—the pewter with the municipal\narms on it rolled on the sanded floor, and spilt what was left of the\ndog’s-nose on to the disguise—and the Magician stood before them, pale\nbut firm, his dark lantern in his hand. It was a magic lantern, of\ncourse.\n\n“Down-trodden slaves!” he cried, “poor benighted, oppressed people!\nFollow me! Let us dethrone a king who seeks to mask tyranny with\nhypocritical public kitchens, and cloaks his infamous autocracy with\nfree washing by white magic on a Monday! To the Palace, to the Palace!”\n\nAnd they all finished up their beer and followed him, and half the town\nbeside joined the throng as it pressed through the streets towards the\nEastern gate, beyond which was the King’s Palace.\n\nNow while the Magician was drinking his dog’s-nose, disguised as a\nrespectable person, the King in his white robes was walking under the\nboughs of the white-blossomed pear-trees, for it was spring, and the\nmoon was at the full. And presently, coming along over the dewy grey\ngrass of the orchard, he saw a figure in white, and when it came close\nto him he saw that it was a lady more fair than the fair stars of that\nfair night.\n\n“And who are you?” said the King.\n\n[“POOR BENIGHTED, OPPRESSED PEOPLE, FOLLOW ME!”]\n\n“I am a poor Princess seeking my fortune,” said she.\n\n“You will rest under my roof to-night,” said the King, and led her\nthrough the long sweet grass under the blossoming boughs to the Palace\ngarden. When they came to the terrace the Princess loosed a lantern\nfrom her girdle, set it on the stone balustrade close by where one of\nthe white peacocks perched in fluffy feathery slumber, kindled it, and\nthrew open the horn door. A flood of light streamed out, bright as\nspring sunshine, and fell full upon her, and then the King saw that\nher gown was not white, as it had seemed in the moonlight, but was the\ncolour of yellow gold, and her hair was red gold, and her eyes were of\ngold and grey mingled. Then for the first time in all his life the King\nthought of himself and of his own happiness, and he caught her hands\nand said—\n\n“Nothing will ever again content me, not even doing good to my people,\nif I must part from you. Will you stay and be my Queen?”\n\nThe Princess said, “I am seeking my fortune. Do you think you are it?”\n\n“I do not know, my dear,” said the King, “whether I am your fortune,\nbut I know well enough that _you_ are _mine_!”\n\nThen the Princess clapped her hands and said, “That is the right\nanswer! I have travelled half round the world to hear it; and will you\nlove me always?”\n\n“Always, my Queen,” said he, “exactly the same as you will love me. We\nare not of the race that changes heart.”\n\nSo then they kissed each other as lovers should, and wandered along the\nyew-tree avenue deep in lovers’ talk, and never even heard the crowd\nthat the Magician had brought to the front door. So when the crowd\nfound that the Palace door was locked for the night it went home again,\nbut it came back in the morning with trumpets and banners and scraps of\ncoloured stuff tied over its white clothing, and the King went out to\nmeet it.\n\nWhen the crowd saw him every one began to shout: “Down with Alban!”\n“Down with the White King!” “Free Beer!” “No more washing!” and things\nlike that.\n\nThen the King stood forth and said—\n\n“What have I done but seek for your good? When, till now, have I\nthought of my own happiness? Who has stirred you up to these ill\nthoughts of me? My people, my own beloved people, have my ears ever\nbeen closed to your complaints? Have you wrongs? Tell me, and I will\nright them. Have you sorrows? Make them known and let me soothe them.\nDo you not know that your King is your servant, and lives but to do you\ngood?”\n\nAnd the crowd grumbled and muttered, and one voice cried—\n\n“We don’t want to be done good to. We want to enjoy ourselves.”\n\n“I did not know,” said the King, gently. “But now you have spoken I\nwill at once appoint a Minister of Public Enjoyment, and——”\n\nThe Magician was watching the crowd, and he saw how the sight of the\nKing’s good face and the sound of his good voice were working on their\nhearts that had once loved him. Now Negretti sprang forward. “One word,\nbrother!” he cried, and led the King into the shadow of a close-clipped\nyew-tree walk. The moment they were hidden he caught his brother’s\narm and whispered a wicked spell: and the first words of it were in\nPersian, and the next in Greek, and after that came words in Arabic and\nSpanish, and the speech of the county of Essex, and the last words of\nall were “be changed to a stone.”\n\nAnd so strong was the spell that the King was turned to a stone that\nvery minute—a great white stone—and fell under the yew hedge, and lay\nthere.\n\nThen the Magician said “Ha, ha!” and, after waiting so long as he\ndeemed prudent, he went back to the people, and said—\n\n“I regret to inform you that your King has proved quite unreliable as\na man of business. When I urged him to sign a written agreement to\nkeep you always in a good humour he refused, and then he remembered an\nurgent appointment in Nova Scotia; and he has gone, and taken most of\nthe crown treasure with him. But, do not despair, I will be your King,\nand I have an income quite sufficient to keep up a small establishment\nof my own. And my golden argosies are now on the way from the Indies,\nbearing all manner of precious things, and bales of plush are on their\nway from Yorkshire. So now I am King.”\n\nThe people believed him, for they had never known a King who spoke\nanything but the truth. So they shouted, “Long live the King!” and\nthe matter was settled. That very day Negretti had the Palace painted\nmagenta, and covered all the window-sashes and mantelpieces with gold\npaint, and stuck embossed coloured scraps on them.\n\nThen he went out into the garden to get a good look at his magenta\nPalace from the outside, and as he went along the clipped-yew walk\nthere was the Princess Perihelia weeping over the white stone.\n\n“What are you crying for?” he asked.\n\n“I’m crying for the White King,” said she.\n\n“And why do you cry _here_?” said the Magician.\n\n“I don’t know,” said the poor Princess, and she looked so beautiful\nthat the Magician went straight into the Palace and told the Prime\nTailor to sew new rubies all over his new purple plush suit because he\nwas going a-courting.\n\nThe very next day Negretti put on the purple plush suit as well as the\nRoyal Crown, and went to the wing of the Palace which the White King\nhad set apart for the Princess Perihelia to live in. Alban’s crown was\nmade of silver and pearls and moonstones, and the new King had ordered\na new crown, all gold, and stuck as full of rubies and emeralds and\nsapphires as a really good Christmas cake is of plums. (I do not mean\nthe cake they call “good, wholesome school cake,” but the kind they\nhave at home when there is a party.) He took all his many-coloured\nretinue with him, and they waited on the terrace while the Magician\nknocked at the door.\n\n“Come in,” said the Princess.\n\n“I’ve come to marry you,” said the Magician, coming to the point at\nonce; for he had arranged to have a procession that afternoon, and he\nwas a little pressed for time.\n\nBut Perihelia said, “No, thank you.”\n\nThe Magician could hardly believe his ears. “But you’ll be Queen of the\nland,” said he, “and that’s what you’d have been if you’d married my\nbrother, and, I suppose, what you wanted to be.”\n\n“O no, it isn’t,” said she.\n\n“Well, what did you want?” said he.\n\n“I wanted to be the White King’s wife,” said she.\n\n“It’s the same thing,” he said.\n\nBut she said: “No, it isn’t, not a bit.” And it was in vain that he\nshowed her his best plush suit and the plush suits of his retainers;\nshe simply wouldn’t look at them, nor at the precious stones either;\nso at last he went off to his Palace to make more rubies and precious\nstones and things like that, and she went off to cry over the white\nstone.\n\nNow a lot of tell-tale-tits had built their nests above the Palace,\nand some of them flew off and told the Magician how Perihelia was\nalways crying in the yew avenue over the white stone. So he said to\nhis slaves: “Get a hand-cart, and carry the thing on to the middle of\nthe bridge and drop it into the river.” So they did, and the stone\nstuck, end-up, in the mud; and when the golden argosies of the Magician\ncame up the river, bearing peacocks and apes and turquoises, every\nsingle galley split on that stone, and the whole treasure went to the\nbottom; all but the peacocks, and they flew away into the country of\na neighbouring King, who thought every one should be useful and not\nornamental; so he cut off the peacocks tails, and clipped their wings,\nand tried to teach them to lay turkey’s eggs. But it is very difficult\nto get a peacock to do anything useful.\n\nSo then the Magician set a lot of people dredging for the lost\ntreasure; and, among other things, they fished up some poor dead apes\nand the big white stone, and as the stone seemed to have been rather\nin the way in the bed of the river, they carted it away to the fields\nbehind the town, where the white jonquils grew, and dumped it down\nthere, and left it among the long grass.\n\nAnd the Princess could not come and cry over it there because she did\nnot know where it was, and besides she was very busy; for, after she\nhad refused to marry him, the Magician said, “Very well, then, you can\njust do the free washing;” for the royal housekeeper had given five\nminutes’ notice, and left at the end of it, as soon as the new King\nhad the Palace painted magenta, and no one else knew how to do washing\nby white magic, and though the people had sneered at it in the White\nKing’s time they stood out for it now, and said free washing was what\nthey had always been accustomed to. Poor Perihelia did not know the\nwhite magic; but she washed by the Sunlight Magic, and everything she\nsent home from the wash was pinky or pearly or greeny, like the little\nclouds in a May dawn. The people were pleased, but not the Magician.\n\n“I like a colour to _be_ a colour,” he said. “I hate your half\nmeasures.”\n\nHe was beginning to remodel the kingdom to his own fancy. Instead of\na Lord Chief Good-doer he had a Lord Chief Magician, and instead of\nthe Education Department he had a Permanent Committee of Black and\nColoured Magic, and he shut up the free washhouses. “Who wants to\nwash?” said he, and he ordered a free distribution of nasty medicine\ninstead; and altogether he was really beginning to enjoy himself\nwhen another tell-tale-tit came fluttering in at the window of his\nlaboratory, and, perching on the top of a crucible, told him of a\nRumour. The Rumour had been running about the town like a mad thing,\nand wherever it ran it left its tail behind it. Rumour, as you know, is\na beast with many tales; and now everybody knew that the white stone\nhad moved in the night and had come rolling up to the gate of the town.\n\n“Whatever shall we do?” said the Lord Chief Magician, who was pounding\nup nasty things in the mortar ready for the free distribution of\nmedicine next day.\n\n“Smash it,” said Negretti. “I’ll take a turn at the medicine while you\ngo and see the thing done.”\n\nSo the Lord Chief Magician called together the Permanent Committee of\nBlack and Coloured Magic and sent them to break the stone. And when\nthey began to hit it with their hammers and picks seventeen sharp\nsplinters of white stone flew off, and each splinter hit a member of\nthe Committee in the eye and killed him. There were exactly seventeen\nmembers, as it happened. So then the Lord Chief Magician shut the town\ngates and ran home and hid under the bed.\n\nAnd the people of the town were very much interested in the stone that\nhad rolled by itself and had killed seventeen members of the Committee,\nand they made little parties and picnics all day long, taking their\nchildren to look at the stone and carrying sandwiches with them and\nbottles of beer.\n\nThe Magician was very angry.\n\n“Such rubbish I never heard of,” said he when the tell-tale-tit\nalighted on the window-sill and told him of it. “If they want to\nlook at anything, why can’t they come and look at _me_? I’m sure I’m\ncoloured enough!”\n\nThat night the stone rose up in the thickest of the black dark, when no\none at all is out of doors, except the Police—and not always him—and it\nsmashed through the town gate and came rolling right up into the Square\nand lay there.\n\nThe tell-tale-tit awoke the Magician in the morning by singing the news\nsharply in his ear, and he went out to see. There was a great crowd in\nthe Square, and they all cried out—\n\n“It is a magic stone. It will bring us luck. Build it into the royal\nPalace.”\n\n“I might do worse,” thought Negretti. “If good Roman cement and a\ndouble coat of magenta paint doesn’t keep it quiet nothing will.”\n\nSo he gave orders, and the stone was carted to the Palace, and built\ninto the wall over the great gate; and while they were gone to fetch\nthe red paint to cover up the stone and the mortar the Lord Chief\nMagician came out from under his bed, and went sneaking up to the\nPalace and in at the gate, and the stone fell on him and smashed him\nquite flat.\n\nThen Perihelia came running out, and she washed the mortar off the\nwhite stone by her Sunlight Magic; and when the Magician come out she\nsaid: “Let it lie here to-night, and to-morrow, if you will let me go,\nI will take it away to my own kingdom, so that it shall never trouble\nyou again.”\n\nNegretti agreed, because he did not know what else to do, and he was\nbeginning to despair of the Princess ever marrying him, because he had\nnow asked her to do so every day for a month, and always with more\ndisplay of plush and jewels, and she said “No” more decidedly, and even\ncrossly, every time. So he began to lose heart.\n\nThat night, just when the moon was waning, and before morning broke,\nPrincess Perihelia slipped down the Palace stairs and into the garden\nto look once more on the place where the White King had promised to\nlove her always.\n\nAnd when she came to that same place there was the white stone lying\nunder the shadow of the white rose bushes, and pearly rose leaves had\nfallen all over it, and were falling still, like tears.\n\nPerihelia knelt down beside the stone and put her arms round it, and\nsaid—\n\n“Poor stone, dear stone, what is it that troubles you so that you\ncannot rest? If I only knew, I might help you with my Sunlight Magic.\nWhy are you so troubled, and why do I pity you so? Oh, if my White King\nwere here he would understand and help you! But I can do nothing!”\n\nWith that she began to weep over the stone, calling on the White King\nto come back to her. And all the while she was talking and weeping the\nmoon was waning and the light in the East grew pearlier and prettier\nminute by minute. And as she wept and clasped the stone she presently\nsaw in the glowing light that the stone was changing in her arms. Like\nwhite sands falling in an hour-glass, the white stone fell away and\nfell away until the sun looked through the white rose bushes and saw\nPerihelia clasp the living form of the White King in her loving arms.\n\nThe sun’s was not the only eye which saw that meeting. The Magician\nhad had a bad night, and he came out early, curious to see whether the\nstone had moved again. His curiosity was gratified.\n\nWhen the White King saw his treacherous brother his tongue was\nloosed—hitherto kisses had been speech enough for him—and he spoke the\nwords which he found in his mouth. And they were, naturally enough,\nthe last words that had gone in at his ears, and the words were first\nPersian and then Greek, and then Arabic and Spanish, and the language\nof foreigners from Essex; and the words he wound up with were, “be\nchanged into a stone.”\n\nBut the wicked spell that had turned King Alban into a stone had grown\nweaker by keeping (as even ’20 port did when it was kept too long),\nand it had no longer power to do what it ought to have done. It could\nnot turn the wicked Magician into a stone, as I am sure you would wish\nit to have done; it was only strong enough to turn him into a wooden\npost.\n\n       *       *       *       *       *\n\nI do not wish to have to mention such an unpleasant character as\nNegretti again, so I will tell you at once the end of him. He remained\na post for ever and ever, and later on, when King Alban had begun to\ndo things for his people’s good again, he thought it a pity to waste\neven a post, for he was ever a careful King. So he had it made into a\npump, and the water from it was bitter and nasty, like the medicine the\nMagician used to give the people; and it was very good for children,\nand gave them a nice bright colour in their cheeks. Take care you do\nnot grow pale, or you may have to drink the water out of that pump. It\nis now at Harrogate, or Epsom, or Bath, or somewhere, and you might\nquite easily be taken there and made to drink that unpleasant water.\nThe first persons who had to drink it were the Magician’s retinue. The\nKing thought it would be good for them, and they were very grateful;\nbut the next night they stole the State barge, and went home by sea to\ntheir own country.\n\nAmong his other improvements, the King started municipal omnibuses,\nwhich were white and gold. But the pump being near the place where\nthe omnibuses changed horses the conductors used to take the bitter\nwater to wash the omnibuses with, and gradually they became scarlet\nand blue and green and violet, just as you see them to-day. So now you\nknow the reason of the colour of omnibuses. And this is the end of the\nMagician’s part of the story.\n\n       *       *       *       *       *\n\nWhen the Magician had been turned into a post, the King said—\n\n“I’m very sorry;” but the Princess said—\n\n“Dear, he deserved it. And being a post is not painful. Let us never\nthink of him again. I have learned many things since I came here. I\nhave something to break to you. Do you think you can bear it?”\n\n“I can bear anything now,” said he, holding her in his arms, and\nkissing her again, because she was so very dear.\n\n“Well,” said Perihelia, “I am Princess of the Sun, and if I marry you,\nmy own dear King, I shan’t be able to help colouring your pretty white\nkingdom a little. Just soft sweet colours, dear, and not an inch of\nplush. We’ll make a law against _that_ the very first thing. And you\nshall go on teaching your people to be good, and I’ll try to teach them\nto be happy. Do you think I can?”\n\nThe White King smiled. “You’ve taught _me_,” he said; “but now, before\nwe do anything for the people, let’s go and get married, and we can\nbegin to make the new laws directly we’ve finished breakfast. We shall\njust have time to be married if we go off to church at once.”\n\nSo they went off, and woke up the Archbishop, and were married, and the\nArchbishop came home with them to breakfast, and afterwards they began\nto make laws as hard as they could.\n\nThe first law was “There is to be no Plush at all in this kingdom.”\nAnd now Albanatolia is the most beautiful country in the world, all\nsoft sweet colours and clear pearly white; and the Queen Perihelia has\ntaught the people how to be happy, so the King has very little work\nto do, for they are good almost without his interfering at all. It\nis a lovely country. I hope you will go there some day. I went there\nonce but they would not let me stay because I had a black coat on, and\ngaiters; and the sight of these clothes made the people so unhappy that\nthe Queen asked me as a private and personal favour to go away, and\nnever to come back unless I could come dressed in something like the\ncolours of the clouds at dawn. I have never been able to manage this,\nand, anyway, I don’t suppose I could find the way there now. But, if\nyou could get the proper dress, perhaps you could?\n\n\n  THE END\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": []
}