{
  "content": "Adventures in Wallypug-Land\nG. E. Farrow\n\n\n                               DEDICATED\n                                  TO\n                                LIONEL\n\n\n\nPREFACE.\n\n\n  MY DEAR LITTLE FRIENDS,\n\nI have again to thank you for the many kind and delightful letters\nwhich I have received from all parts of the world, and I cannot tell\nyou how happy I am to find that I have succeeded so well in pleasing\nyou with my stories.\n\nWhat am I to say to the little boy who wrote, and begged “that, if the\nWallypug came to stay with me again, would I please invite him too?” or\nto the other dear little fellow who came to me with tears in his eyes,\nto tell me that some superior grown-up person had informed him that\n“there never was a Wallypug, and it was all just a pack of nonsense”;\nthat “Girlie never went to Why at all, and that in fact there was no\nsuch place in existence”?\n\nI can only regretfully admit that, sooner or later as we grow up to\nbe men and women, there are bound to be many fond illusions which\nare one by one ruthlessly dispelled, and that many of the dreams and\nthoughts which, in our younger days, we cherish most dearly, the hard,\nmatter-of-fact world will always persist in describing as “a pack of\nnonsense.” However, for many of us fortunately, this tiresome time has\nnot yet arrived, and for the present we will refuse to give up our poor\ndear Wallypug—for whom I declare I have as great an affection and\nregard, as the most enthusiastic of my young readers.\n\nYou will see that in the following story I have described my own\nexperiences during a recent visit to the remarkable land over which\nHis Majesty reigns as a “kind of king”, and I may tell you that,\namongst all of the extraordinary creatures that I met there, there\nwas not one who expressed the slightest doubt as to the reality of\nwhat was happening; while for my own part, I should as soon think of\ndoubting the existence of the fairies themselves, as of the simple,\nkind-hearted, little Wallypug.\n\nThere now! I hope that I have given quite a clear and lucid\nexplanation, and one which will prevent you from being made unhappy\nby any doubts which may arise in your mind as to the possibility, or\nprobability, of this story. Please don’t forget to write to me again\nduring the coming year.\n\n  Believing me to be as ever,\n\n  Your affectionate Friend,\n\n  G. E. FARROW.\n\n\n\n\n\n\n[Adventures in Wallypug-Land]\n\n\n[MR. NOBODY.]\n\n\n\n\nCHAPTER I. HOW I WENT TO WHY.\n\n\nFOR some time past I have been the guest of his Majesty the Wallypug at\nhis palace in the mysterious kingdom of Why—a country so remarkable\nthat even now I am only just beginning to get used to my strange\nsurroundings and stranger neighbors. Imagine, if you can, a place\nwhere all of the animals not only talk, but take an active part in\nthe government of the land, a place where one is as likely as not\nto receive an invitation to an evening party from an ostrich, or is\nexpected to escort an elderly rhinoceros in to dinner; where it is\nquite an everyday occurrence to be called upon by a hen with a brood of\nyoung chickens just as you are sitting down to tea, and be expected to\ntake a lively interest in her account of how the youngest chick passed\nthrough its latest attack of the “pip.”\n\nIn such a country, the unexpected is always happening, and I am\ncontinually being startled in the streets at being addressed by some\ndangerous-looking quadruped, or an impertinent bird, for I must say\nthat as a class the birds are the most insolent of all the inhabitants\nof this strange land. There is in particular one old crow, a most\nobjectionable personage, and a cockatoo who is really the most violent\nand ill-natured bird that I have ever been acquainted with.\n\nShe takes a very active interest in Parliamentary affairs, and is a\nstrong supporter of woman’s wrongs.\n\n“Every woman has her wrongs,” she declares, “and if she hasn’t she\nought to have.”\n\nYou will naturally wish to know how I reached this strange country,\nand will, no doubt, be surprised when I tell you how the journey was\naccomplished.\n\nOne morning a few weeks since, I received a letter from his Majesty\nthe Wallypug asking me to visit him at his palace at Why, in order\nto assist him in establishing some of our social customs and methods\nof government, which he had so greatly admired during his visit to\nEngland, and which he was desirous of imitating in his own land. A\nlittle packet was enclosed in the letter, bearing the words, “The\nshortest way to Why. This side up with _anxiety_.” “Well,” I thought,\n“I suppose they mean ‘This side up with _care_,’” and was proceeding\nvery carefully to open the packet when a gust of wind rushed in at the\nwindow, and blowing open the paper wrapper, scattered the contents—a\nlittle white powder—in all directions. Some particles flew up into\nmy eyes, and caused them to smart so violently that I was obliged to\nclose them for some time till the pain had gone, and when I opened them\nagain, what do you think? I was no longer in my study at home, but out\non a kind of heath in the brilliant sunshine, and apparently miles from\na house of any kind. A finger-post stood a little way in front of me,\nand I could see that three roads met just here. Anxiously I hurried up\nto the post to see where I was. One arm pointed, “To Nowhere.” “And\nI certainly don’t want to go there,” I thought; the other one was\ninscribed, “To Somewhere,” which was decidedly a little better, but the\nthird one said, “To Everywhere Else.”\n\n[“THAT’S NOT MUCH USE.”]\n\n“And, good gracious me,” I thought, “that’s not much use, for I don’t\nknow in the least now which of the last two roads to take.” I was\npuzzling my brain as to what was the best thing to be done, when\nI happened to look down the road leading to “Nowhere,” and saw a\ncurious-looking little person running towards me. He had an enormous\nhead, and apparently his arms and legs were attached to it, for I could\nsee no trace of a body. He was flourishing something in his hand as he\nran along, and as soon as he came closer I discovered that it was his\ncard which he handed to me with a polite bow and an extensive smile, as\nsoon as he got near enough to do so.\n\n  “_MR. NOBODY,_\n    _No. 1 NONESUCH-STREET,_\n      _NOWHERE,_”\n\nis what I read.\n\nThe little man was still smiling and bowing, so I held out my hand and\nsaid:\n\n“How do you do, sir? I am very pleased to make your acquaintance.\nPerhaps you can be good enough to tell me—”\n\nThe little man nodded violently.\n\n“To tell me where I am,” I continued.\n\nMr. Nobody looked very wise, and after a few moments’ thought smiled\nand nodded more violently than ever, and simply pointed his finger at\nme.\n\n“Yes, yes,” I cried, rather impatiently; “of course I know that I’m\nhere, but what I want to know is, what place is this?”\n\nThe little fellow knitted his brows, and looked very thoughtful, and\nfinally staring at me sorrowfully, he slowly shook his head.\n\n“You don’t know?” I inquired.\n\nHe shook his head again.\n\n“Dear me, this is very sad; the poor man is evidently dumb,” I said,\nhalf aloud.\n\nMr. Nobody must have heard me, for he nodded violently, then resuming\nhis former smile, he bowed again, and turning on his heels ran back in\nthe direction of Nowhere, stopping every now and then to turn around\nand nod and smile and wave his hand.\n\n“What a remarkable little person,” I was just saying, when I heard a\nvoice above my head calling out:\n\n“Man! man!”\n\nI looked up and saw a large crow perched on the finger-post. He had a\nnewspaper in one claw, and was gravely regarding me over the tops of\nhis spectacles.\n\n“Well! what are you staring at?” he remarked as soon as he caught my\neye.\n\n“Well, really,” I began.\n\n“Haven’t you ever seen a crow before?” he interrupted.\n\n“Of course I have,” I answered rather angrily, for my surprise at\nhearing him talk was fast giving way to indignation at his insolent\ntone and manner.\n\n“Very well, then, what do you want to stand there gaping at me in\nthat absurd way for?” said the bird. “What did he say to you?” he\ncontinued, jerking his head in the direction in which Mr. Nobody had\ndisappeared.\n\n“Nothing,” I replied.\n\n“Very well, then, what was it?” he asked.\n\n“What do you mean?” said I.\n\n“Why, stupid, you said Nobody and nothing, didn’t you, and as two\nnegatives make an affirmative that means he must have said something.”\n\n“I’m afraid I don’t quite understand,” I said.\n\n“Ignorant ostrich!” remarked the crow contemptuously.\n\n“Look here,” I cried, getting very indignant, “I will not be spoken to\nlike that by a mere bird!”\n\n“Oh, really! Who do you think you are, pray, you ridiculous biped?\nWhere’s your hat?”\n\nI was too indignant to answer, and though I should have liked to have\nasked the name of the place I was at, I determined not to hold any\nfurther conversation with the insolent bird, and walked away in the\ndirection of “Somewhere,” pursued by the sound of mocking laughter from\nthe crow.\n\n[“WHERE’S YOUR HAT?”]\n\nI had not gone far, however, before I perceived a curious kind of\ncarriage coming towards me. It was a sort of rickshaw, and was drawn\nby a kangaroo, who was jerking it along behind him. A large ape sat\ninside, hugging a carpet bag, and holding on to the dashboard with his\ntoes.\n\n“Let’s pass him with withering contempt,” I heard one of them say.\n\n“All right,” was the reply. “Drive on.”\n\n“I say, Man,” called out the Ape, as they passed, “we’re not taking the\nslightest notice of you.”\n\n“Oh, aren’t you? Well, I’m sure I don’t care,” I replied rather crossly.\n\nThe Kangaroo stopped and stared at me in amazement, and the Ape got out\nof the rickshaw and came towards me, looking very indignant.\n\n“Do you know who I am?” he asked, striking an attitude.\n\n“No, I don’t,” I replied, “and what’s more, I don’t care.”\n\n“But I’m a person of consequence,” he gasped.\n\n“You are only an ape or a monkey,” I said firmly.\n\n“Oh! I can clearly see that you don’t know me,” remarked the Ape\npityingly. “I’m Oom Hi.”\n\n“Indeed,” I said unconcernedly. “I am afraid I’ve never heard of you.”\n\n“Never heard of Oom Hi,” cried the Ape. “Why, I am the inventor of\nBroncho.”\n\n“What’s that?” I asked. “Good gracious! what ignorance,” said the Ape;\n“here, go and fetch my bag,” he whispered to the Kangaroo, who ran back\nto the rickshaw and returned with the carpet bag.\n\n“This,” continued Oom Hi, taking out a bottle, “is the article; it is\ncalled ‘Broncho,’ and is excellent for coughs, colds, and affections\nof the throat; you will notice that each bottle bears a label stating\nthat the mixture is prepared according to my own formula, and bears\nmy signature; none other is genuine without it. The Wallypug, when he\nreturned from England and heard that I had invented it, declared that I\nmust be a literary genius.”\n\n[“There,” continued Oom Hi, taking out the bottle, “is\nthe article; it is called ‘Broncho.’”—Page 24.\n  _Wallypugland._]\n\n“A what!” I exclaimed.\n\n“A literary genius,” repeated the Ape, smirking complacently.\n\n“Why, what on earth has cough mixture to do with literature?” I\ninquired.\n\n“I don’t know, I’m sure,” admitted Oom Hi, “but the Wallypug said that\nin England any one who invented anything of that sort was supposed to\npossess great literary talent.”\n\n“The Wallypug!” I exclaimed, suddenly remembering. “Am I anywhere near\nhis Kingdom of Why, then?”\n\n“Of course you are; it’s only about a mile or two down the road. Are\nyou going there?” inquired Oom Hi.\n\n“Well, yes,” I answered. “I’ve had an invitation from his Majesty, and\nshould rather like to go there, as I’m so near.”\n\n“His Majesty; he—he—he, that’s good,” laughed the Kangaroo. “Do you\ncall the Wallypug ‘his Majesty’?” he asked.\n\n“Of course,” I replied, “he is a king, isn’t he?”\n\n“A _kind_ of king,” corrected Oom Hi. “You don’t catch us calling him\n‘your Majesty,’ I can tell you though, one animal is as good as another\nhere, and if anything, a little better. If you are going to Why, we may\nas well go back with you, and give you a lift in the rickshaw.”\n\n“You’re very kind,” I said, gratefully.\n\n“Not at all, not at all; jump in,” said Oom Hi.\n\n“Hold on a moment,” said the Kangaroo. “It’s _his_ turn to pull, you\nknow.”\n\n“Of course, of course,” said the Ape, getting into the vehicle; “put\nhim in the shafts!”\n\n“What do you mean?” I expostulated.\n\n“Your turn to pull the rickshaw, you know; we always take turns, and\nas I have been dragging it for some time it’s your turn now.”\n\n“But I’m not going to pull that thing with you two animals in it. I\nnever heard of such a thing,” I declared.\n\n“Who are you calling an animal?” demanded the Kangaroo, sulkily.\n“You’re one yourself, aren’t you?”\n\n“Well, I suppose I am,” I admitted. “But I’m not going to draw that\nthing, all the same.”\n\n“Oh, get in, get in; don’t make a fuss. I suppose I shall have to take\na turn myself,” said Oom Hi, grasping the handles, and the Kangaroo and\nmyself having taken our seats we were soon traveling down the road. The\nKangaroo turned out to be a very pleasant companion after all, and when\nhe found out that I came from England told me all about his brother,\nwho was a professional boxer, and had been to London and made his\nfortune as the Boxing Kangaroo. He was quite delighted when I told him\nthat I had seen notices of his performance in the papers. We soon came\nin sight of a walled city, which Oom Hi, turning around, informed me\nwas Why. And on reaching the gate he gave the rickshaw in charge of an\nold turtle, who came waddling up, and each of the animals taking one of\nmy arms, I was led in triumph through the city gates to the Wallypug’s\npalace, several creatures, including a motherly-looking goose and\na little gosling, taking a lively interest in my progress, while a\ngiraffe in a very high collar craned his neck through a port-hole to\ntry and get a glimpse of us as we passed under the portcullis.\n\n\n\n\nCHAPTER II. A STRANGE WELCOME.\n\n\n[GOOD BYE!]\n\nWE soon reached the Wallypug’s palace, which stood in a large park in\nthe center of the city of Why. I had been very interested in noticing\nthe curious architecture in the streets as we passed along, but was\nscarcely prepared to find the palace such a very remarkable place. It\nwas a long, low, rambling building, built in a most singular style,\nwith all sorts of curious towers and gables at every point.\n\nOom Hi and the Kangaroo saw me as far as the entrance, and then took\ntheir departure, saying that they would see me again another day, and I\nwalked up the stone steps, to what I imagined to be the principal door,\nalone. To my great surprise, however, I found that, instead of being\nthe way in, it was nothing more or less than a huge jam-pot, with a\nvery large label on it marked “Strawberry Jam,” while above it were\nthe words, “When is a door not a door?” “When is a door not a door?” I\nrepeated, vaguely conscious of having heard the question before.\n\n[“SOLD AGAIN! SERVE YOU RIGHT!”]\n\n“Ha—ha—ha,” laughed a mocking voice at the bottom of the steps, and\nlooking down I saw an enormous Cockatoo with a Paisley shawl over her\nshoulders and walking with the aid of a crutched stick.\n\n“Sold again, were you? Serve you right,” she cried. “When is a door not\na door? Pooh! fancy not knowing that old chestnut. Why! when it’s a\njar, of course, stupid. Bah!”\n\n“It’s a very absurd practical joke, that’s all that I can say,” I\nremarked, crossly, walking down the steps again. “Perhaps you can tell\nme how I am going to get into this remarkable place.”\n\n“Humph! Perhaps I can and perhaps I won’t,” said the Cockatoo. “I dare\nsay it’s a better place than you came from, anyhow. You’re not the\nfirst man that has come down here with his superior airs and graces,\ngrumbling and finding fault with this, that, and the other; but we’ll\nsoon take the conceit out of you, I can tell you. Where’s your hat?”\n\nThis was the second creature that had asked me this question, and\nreally they threw so much scorn and contempt into the inquiry that one\nwould imagine that it was a most disgraceful offense to be without a\nhead covering.\n\nI thought the most dignified thing to do under the circumstances was to\ntake no further notice of the bird, and was quietly walking away when\nthe Cockatoo screamed out again, “Where’s your hat? Where’s your hat?\nWhere’s your hat?” each time louder and louder, till the last inquiry\nended in a perfect shriek.\n\n“Don’t be so ridiculous,” I cried. “I’ve left it at home, if you must\nknow.”\n\n“Down with the hatters!” screamed the Cockatoo irrelevantly, “Down\nwith the Wallypug! Down with men without hats! Down with everybody and\neverything!” and the wretched bird danced about like a demented fury.\n\nAt the sound of all this commotion a number of windows in the upper\nstories of the palace were thrown open, and curious heads were popped\nout to see what was the matter. Among them and immediately over my\nhead, I noticed the Doctor-in-Law.\n\n“Oh! it’s you, is it, kicking up all this fuss?” he remarked as soon as\nhe recognized me.\n\n“Well, really!” I replied, “I think you might have the politeness to\nsay ‘How do you do?’ considering that it is some months since we met.”\n\n“Oh, do you indeed?” said the Doctor-in-Law, contemptuously. “Well,\nsupposing I don’t care one way or another. Where’s your hat?”\n\n[“DOWN WITH THE DOCTOR-IN-LAW.”]\n\nBefore I could answer the Cockatoo had screamed out “Down with the\nDoctor-in-Law!” and the irate little man had replied by throwing a book\nat her head out of the palace window.\n\n[“I saw his Majesty, the Wallypug himself, running across\nthe lawn towards me, with both hands stretched out in welcome.”—Page\n35.\n  _Wallypugland._]\n\nI was thoroughly disgusted at this behavior and at the strange\nreception that I was receiving, and had fully determined to try and\nfind some way of getting home again, when, happening to turn round, I\nsaw his Majesty the Wallypug himself running across the lawn towards\nme, with both hands stretched out in welcome, and his kind little face\nbeaming with good nature.\n\n“How d’ye do? How d’ye do?” he cried. “So pleased to see you. Didn’t\nexpect you quite so soon, though. Come along—this way.” And his\nMajesty led me to another entrance, and through a large square hall\nhung with tapestry and many quaint pieces of old-fashioned armor, to a\ndoor marked “His Majesty the Wallypug. Strictly private.” I noticed, in\npassing, that the words, “His Majesty” had been partly painted out, and\n“What cheek!” written above them. Once inside the door, the Wallypug\nmotioned me to a chair, and said, in a mysterious whisper,\n\n“I’m _so_ glad you came before _she_ returned; there’s so much I want\nto tell you.”\n\n“Who do you mean?” I asked.\n\n“Sh—Madame—er, my sister-in-law,” he replied, with a sigh.\n\n“Your sister-in-law!” I exclaimed. “Why, I didn’t know you were\nmarried.”\n\n“Neither am I,” said his Majesty, with a puzzled frown. “That’s the\nawkward part about it.”\n\n“But how on earth can you possibly have a sister-in-law, unless you\nhave a wife or a married brother?” I asked.\n\n“Well, I’ve never quite been able to understand _how_ they make it\nout,” said the poor Wallypug, sorrowfully; “but I believe it is\nsomething mixed up with the Deceased Wife’s Sister’s Bill, and the fact\nthat my uncle, The Grand Mochar of Gamboza, was married twice. Anyhow,\nwhen I returned from London I found this lady, who _says_ that she\nis my sister-in-law, established here in the palace; and—and—” his\nMajesty sank his voice to a whisper, “she rules me with a rod of iron.”\n\nI had no time to make further inquiries, for just then the door opened,\nand a majestic-looking person sailed into the room, and after looking\nme up and down with elevated eyebrows, pointed her finger at me, and\nsaid, in a stern voice:\n\n“And _who_ is this person, pray?”\n\n“Oh, this,” said his Majesty, smiling nervously, and bringing me\nforward, “is the gentleman who was so kind to us in London, you know.\nAllow me to present him, Mr. Er—er——”\n\n“I hope you have not been picking up any undesirable acquaintances,\nWallypug,” interrupted his Majesty’s Sister-in-Law severely. “I don’t\nlike the look of him at all.”\n\n“I’m sorry, madame, that my appearance doesn’t please you,” I\ninterposed, feeling rather nettled; “perhaps under the circumstances I\nhad better——”\n\n[“I DON’T APPROVE OF YOU IN THE LEAST,” SAID THE\nSISTER-IN-LAW.]\n\n“You had better do as you are bid and speak when you are spoken to,”\nremarked the lady grimly. “Where’s your hat?”\n\n“I haven’t one,” I replied, rather abruptly, I am afraid, but I was\ngetting quite tired of this continual cross-questioning; “and really I\ndon’t see that it’s of the slightest consequence,” I ventured to add.\n\n“Oh! don’t you,” said his Majesty’s Sister-in-Law, with a sarcastic\nsmile. “Well, that’s one of the _many_ points upon which we shall\ndisagree. Now, look here, I may tell you at once that I don’t approve\nof you in the least; still, as you are here now you had better remain;\nbut mind, no putting on parts or giving yourself airs and graces, or\nI shall have something to say to you. Do you understand?” And with a\nsevere glance at me, the lady folded her arms and stalked out of the\nroom, leaving his Majesty and myself staring blankly at one another.\n\n\n\n\nCHAPTER III. A TERRIBLE NIGHT.\n\n\nMY reception at Why had been such a very peculiar one that I had fully\nmade up my mind to return home at once, but his Majesty the Wallypug\nbegged me so earnestly to stay with him, at any rate for a few days,\nthat I determined, out of friendship to him, to put up as best I could\nwith that extraordinary person the Sister-in-Law, and the rest of the\ncreatures, and remain, in order to help him if possible to establish\nhis position at Why on a firmer basis.\n\nSo I took possession of a suite of rooms in the west wing of the\npalace, near his Majesty’s private apartments, and we spent a very\npleasant evening together in my sitting-room, playing draughts till\nbedtime, when his Majesty left me to myself, promising that he would\nshow me around the palace grounds the first thing in the morning.\n\nAfter he had gone, there being a bright wood fire burning in my\nbedroom, I drew a high-backed easy-chair up to the old-fashioned\nfireplace, and made myself comfortable for a little while before\nretiring for the night.\n\nMy bedroom was a large, old-fashioned apartment, with a low ceiling\nand curiously carved oak wainscoting, and I watched the firelight\nflickering, and casting all sorts of odd shadows in the dark corners,\ntill I must have fallen asleep, for I remember awaking with a start,\nat hearing a crash in the corridor outside my bedroom door. A muttered\nexclamation, and a Pelican, carrying a bedroom candlestick marched in,\nand carefully fastened the door behind him.\n\n“Great clumsy things—I can’t think who can have left them there,”\nhe grumbled, sitting down and rubbing one foot against the other, as\nthough in pain. And I suddenly came to the conclusion that he must have\nstumbled over my boots, which I had stood just outside the door, in\norder that they might be cleaned for the morning.\n\nThe Pelican had not noticed me in my high-backed chair, and, being\nrather curious to see what he was up to, I kept perfectly still.\n\nGoing over to a clothes press, which stood in one corner of the room,\nthe bird drew forth a long white night-gown and a nightcap; these he\nproceeded solemnly to array himself in, and then, getting up on a\nchair, he turned back the bedclothes with his enormous beak, and was\njust about to hop into bed, when I thought that it was time for me to\ninterfere.\n\n“Here! I say, what are you up to?” I called out in a stern voice.\n\n[“He turned back the bedclothes with his enormous beak,\nand was just about to hop into bed.”—Page 42.\n  _Wallypugland._]\n\n“Oh—h-h! Ah—h-h! There’s a man in my room!” screamed the Pelican,\nevidently greatly alarmed. “Murder! Fire! Police! Thieves!”\n\n“Hold your tongue!” I commanded. “What do you mean by making all that\nnoise at this time of night, and what are you doing in my room?”\n\n“Your room, indeed!” gasped the bird; “my room you mean, you\nfeatherless biped, you!”\n\n“Look here!” I remarked, going up to the Pelican, and shaking him till\nhis beak rattled again. “Don’t you talk to me like that, my good bird,\nfor I won’t put up with it.” You see I was getting tired of being\ntreated so contemptuously by all of these creatures, and was determined\nto put a stop to it, somehow.\n\n“But it _is_ my room. Let me go, I say!” screamed the bird, struggling\nto get free, and dabbing at me viciously with his great beak.\n\n“It is not your room,” I maintained; “and what is more, you are not\ngoing to stay here,” and I pushed the creature towards the door.\n\n“We’ll soon see all about that,” shouted the Pelican, wrenching himself\nfrom my grasp, and rushing at me with his beak wide open, and his wings\noutstretched.\n\nHe was an enormous bird, and I had a great struggle with him. We went\nbanging about the room, knocking over the furniture and making a\nterrible racket. At last, however, I managed to get him near the door,\nand giving a terrific shove I pushed him outside, and, pulling the door\nto, quickly turned the key.\n\nI could hear Mr. Pelican slipping and stumbling about on the highly\npolished floor of the corridor outside, and muttering indignantly.\nPresently he came to the door, and banging with his beak, he cried,\n“Look here! this is beyond a joke—let me in, I say—where do you\nsuppose I am going to sleep?”\n\n“Anywhere you like except here,” I replied, feeling that I had got the\nbest of it. “Go and perch or roost, or whatever you call it, on the\nbanisters, or sleep on the mat if you like—I don’t care what you do!”\n\n“Impertinent wretch!” yelled the bird. “You only wait till the morning.\nI’ll pay you out;” and I could hear him muttering and mumbling in\nan angry way as he waddled down the corridor to seek some other\nresting-place. “What ridiculous nonsense it is,” I thought, as I\ntumbled into bed shortly after this little episode; “these creatures\ngiving themselves such airs. No wonder the Wallypug is such a meek\nlittle person if he has been subjected to this sort of treatment\nall his life.” And pondering over the best method of altering the\nextraordinary state of affairs, I dropped off to sleep.\n\nI do not know how long it may have been after this, but a terrific din,\nthis time in the courtyard below my window, caused me once more to\njump from my bed in alarm. I could hear a most unearthly yelling going\non, a babel of voices, and occasionally a resounding crash as though\nsomething hollow had been violently struck.\n\n[HE WAS INTERRUPTED BY A SHOWER OF MISSILES.]\n\nPushing open the latticed windows I saw in the moonlight a little man\ndressed in a complete suit of armor with an enormous shield, like a\ndishcover, arranged over his head, playing the guitar, and endeavoring\nto sing to its accompaniment. He was continually interrupted, however,\nby a shower of missiles thrown from all of the windows overlooking the\ncourtyard, out of which angry heads of animals and other occupants of\nthe palace were thrust; he was surrounded by a miscellaneous collection\nof articles which had evidently been thrown at him, and some of them,\nhad it not been for his suit of armor and the erection over his head,\nwould have caused him considerable injury.\n\n[THE MUSICIAN TOOK TO HIS HEELS AND FLED.]\n\nHe did not seem to mind them in the least, though, and continued\nsinging amid a perfect storm of boots, brushes, and bottles, as though\nhe was quite accustomed to such treatment: and it was only when an\nirate figure, which somehow reminded me of his Majesty’s Sister-in-Law,\nclad in white garments and flourishing a pair of tongs, appeared in\nthe courtyard, that he took to his heels and fled, pursued by the\nwhite-robed apparition, till both disappeared beneath an archway at\nthe farther end of the courtyard. Most of the windows were thereupon\nclosed, and the disturbed occupants of the palace returned to their\nrest. I was just about to close my lattice too, when I caught sight of\na familiar figure at the adjoining window. It was my old friend A.\nFish, Esq.\n\n“Oh! id’s you iz id,” he cried. “You _have_ cub thed, I heard that you\nwere egspegded.”\n\n“Yes, here I am,” I replied. “How are you? How is your cold?”\n\n“Oh, id’s quide cured, thags; dote you dotice how butch better I speak?”\n\n“I’m very glad to hear it, I’m sure,” I replied, waiving the question\nand trying to keep solemn. “What’s all this row about?”\n\n“Oh! thad’s the troubadour, up to his old gabes agaid; he’s ad awful\ndusadce. I’ll tell you aboud hib in the bordig—good dight.” And A.\nFish, Esq., disappeared from view.\n\n\n\n\nCHAPTER IV. LATE FOR BREAKFAST.\n\n\nI AWOKE very early in the morning, just as it was daylight, and being\nunable to get to sleep again amid my strange surroundings, I arose and\ncrept down-stairs as noiselessly as possible, intending to go for a\nlong walk before breakfast.\n\nAt the bottom of the stairs I came upon a strange-looking white object,\nwhich, upon closer inspection, turned out to be the Pelican, asleep on\nthe floor.\n\nHe was not sleeping as any respectable bird would have done, with his\nhead tucked under his wing; but was lying stretched out on a rug in the\nhall, with his head resting on a cushion. His enormous beak was wide\nopen, and he was snoring violently, and muttering uneasily in his sleep.\n\n[THE PELICAN WAS SNORING VIOLENTLY.]\n\nI did not disturb him for fear lest he should make a noise; but\nhurrying past him I made my way to the hall door, which after a little\ndifficulty I succeeded in unfastening. An ancient-looking turtle with a\nwhite apron was busily cleaning the steps, and started violently as I\nmade my appearance at the door.\n\n“Bless my shell and fins!” he muttered; “what’s the creature wandering\nabout this time of the morning for; they’ll be getting up in the\nmiddle of the night next. Just mind where you’re treading, please!” he\ncalled out. “The steps have been cleaned, and I don’t want to have to\ndo them all over again.”\n\nI managed to get down without doing much damage, and then remarked\npleasantly:\n\n“Good morning; have you——”\n\n“No, I haven’t,” interrupted the Turtle snappishly; “and what’s more, I\ndon’t want to.”\n\n“What do you mean?” I inquired, in surprise.\n\n“Soap!” was the reply.\n\n“I don’t understand you,” I exclaimed.\n\n“You’re an advertisement for somebody’s soap, aren’t you?” asked the\nTurtle.\n\n“Certainly not,” I replied, indignantly.\n\n“Your first remark sounded very much like it,” said the Turtle\nsuspiciously. “‘Good morning, have you used——’”\n\n“I wasn’t going to say that at all,” I interrupted. “I was merely\ngoing to ask if you could oblige me with a light.”\n\n“Oh, that’s another thing entirely,” said the Turtle, handing me some\nmatches from his waistcoat pocket, and accepting a cigarette in return.\n“But really we have got so sick of those advertisement catchwords since\nthe Doctor-in-Law returned from London with agencies for all sorts of\nthings, that we hate the very sound of them. We are continually being\ntold to ‘Call a spade a spade,’ which will be ‘grateful and comforting’\nto ‘an ox in a teacup’ who is ‘worth a guinea a box,’ and who ‘won’t be\nhappy till he gets it.’”\n\n“It must be very trying,” I murmured sympathetically.\n\n“Oh, it is,” remarked the Turtle. “Well,” he continued in a\nbusiness-like tone, “I’m sorry you can’t stop—good morning.”\n\n“I didn’t say anything about going,” I ejaculated.\n\n“Oh, didn’t you? Well, I did then,” said the Turtle emphatically. “Move\non, please!”\n\n“You’re very rude,” I remarked.\n\n“Think so?” said the Turtle pleasantly. “That’s all right\nthen—good-by,” and he flopped down on his knees and resumed his\nscrubbing.\n\n[THE TURTLE FLOPPED DOWN ON HIS KNEES AND RESUMED HIS\nSCRUBBING.]\n\nThere was nothing for me to do but to walk on, and seeing a\nquaint-looking old rose garden in the distance, I decided to go over\nand explore.\n\nI was walking slowly along the path leading to it, when I heard a\ncurious clattering noise behind me, and turning around I beheld the\nTroubadour, still in his armor, dragging a large standard rosebush\nalong the ground.\n\n“As if it were not enough,” he grumbled, “to be maltreated as I am\nevery night, without having all this trouble every morning. I declare\nit is enough to make you throw stones at your grandfather.”\n\n“What’s the matter?” I ventured to ask of the little man.\n\n“Matter?” was the reply. “Why, these wretched rosebushes, they _will_\nget out their beds at night, and wander about. I happened to leave the\ngate open last night, and this one got out, and goodness knows where he\nwould have been by this time if I hadn’t caught him meandering about\nnear the Palace.”\n\n“Why! I’ve never heard of such a thing as a rosebush walking about,” I\nexclaimed in surprise.\n\n[“IN YOU GO!”]\n\n“Never heard of a——. Absurd!” declared the Troubadour, incredulously.\n“Of course they do. That’s what you have hedges and fences around\nthe gardens for, isn’t it? Why, you can’t have been in a garden at\nnight-time, or you wouldn’t talk such nonsense. All the plants are\nallowed to leave their beds at midnight. They are expected to be back\nagain by daylight, though, and not go wandering about goodness knows\nwhere like this beauty,” and he shook the rosebush violently.\n\n“In you go,” he continued, digging a hole with the point of his mailed\nfoot, and sticking the rosebush into it.\n\n“Hullo!” he exclaimed, going up to another one, at the foot of which\nwere some broken twigs and crumpled leaves. “You’ve been fighting, have\nyou? I say, it’s really too bad!”\n\n“But what does it matter to you?” I inquired. “It’s very sad, no doubt,\nbut I don’t see why you should upset yourself so greatly about it.”\n\n“Well, you see,” was the reply, “I’m the head gardener here as well as\nTroubadour, and so am responsible for all these things. I do troubing\nas an extra,” he explained. “Three shillings a week and my armor.\nLittle enough, isn’t it, considering the risk?”\n\n“Well, the office certainly does not seem overpopular, judging from\nlast night,” I laughed. “Who were you serenading?”\n\n“Oh, any one,” was the reply. “I give it to them in turns. If any one\noffends me in the daytime I pay them out at night, see?\n\n“I serenaded the Sister-in-Law mostly, but I shall give that up. She\ndoesn’t play fair. I don’t mind people shying things at me in the\nleast, for you see I’m pretty well protected; but when it comes to\nchivying me round the garden with a pair of tongs, it’s more than I\nbargained for. Look out! Here comes the Wallypug,” he continued.\n\nSure enough his Majesty was walking down the path, attended by A. Fish,\nEsq., who was wearing a cap and gown and carrying a huge book.\n\n“Ah! good morning—good morning,” cried his Majesty, hurrying towards\nme. “I’d no idea you were out and about so early. I’m just having my\nusual morning lesson.”\n\n“Yes,” said A. Fish, Esq., smiling, and offering me a fin. “Ever sidse\nI god rid of by cold I’ve been teaching the Wallypug elocutiod. We have\nad ‘our every bordig before breakfast, ad he’s geddig on spledidly.”\n\n“I’m sure his Majesty is to be congratulated on having so admirable an\ninstructor,” I remarked, politely, if not very truthfully.\n\n[“His Majesty was walking down the path, attended by\nA. Fish, Esq., who was wearing a cap and gown and carrying a huge\nbook.”—Page 58.\n  _Wallypugland._]\n\n“Thags,” said A. Fish, Esq., looking very pleased. “I say, Wallypug,\nrecide that liddle thig frob Richard III., jusd to show hib how well\nyou cad do id, will you? You doe thad thig begiddidg ’Ad ’orse, ad\n’orse, by kigdob for ad ’orse.’”\n\n“Yes, go on, Wallypug!” chimed in the Troubadour, indulgently.\n\n“Oh, I don’t know,” said his Majesty, simpering nervously. “I’m afraid\nI should break down.”\n\n“Doe you wondt, doe you wondt,” said A. Fish, Esq. “Cub alog, try id.”\n\nSo his Majesty stood up, with his hands folded in front of him, and was\njust about to begin, when a bell in a cupola on the top of the palace\nbegan to ring violently.\n\n“Good gracious, the breakfast bell! We shall be late,” cried the\nWallypug, anxiously grasping my hand and beginning to run towards the\npalace.\n\nA. Fish, Esq., also shuffled along behind us as quickly as possible,\ntaking three or four wriggling steps, and then giving a funny little\nhop with his tail, till, puffing and out of breath, we arrived at the\npalace just as the bell stopped ringing.\n\nHis Majesty hastily rearranged his disordered crown, and led the way\ninto the dining hall.\n\nA turtle carrying a large dish just inside the door whispered warningly\nto the Wallypug as we entered, “Look out! You’re going to catch it,”\nand hurried away.\n\nA good many creatures were seated at the table which ran down\nthe center of the room, and at the head of which his Majesty’s\nSister-in-Law presided, with a steaming urn before her. The\nDoctor-in-Law occupied a seat near by, and I heard him remark:\n\n“They are two minutes late, madame. I hope you are not going to\noverlook it,” to which the lady replied, grimly, “You leave that to\nme.”\n\n“Sit there,” she remarked coldly, motioning me to a vacant seat, and\nthe Wallypug and A. Fish, Esq., subsided into the two other unoccupied\nchairs on the other side of the table.\n\n\n\n\nCHAPTER V. THE TRIAL.\n\n\nFOR a moment nobody spoke. The Wallypug sat back in a huddled heap in\nhis chair, looking up into Madame’s face with a scared expression. A.\nFish unconcernedly began to eat some steaming porridge from a plate in\nfront of him—and I sat still and waited events.\n\nA band of musicians in the gallery at the end of the hall were playing\nsomewhat discordantly, till Madame turned around and called out in an\nangry voice:\n\n“Just stop that noise, will you? I can’t hear myself speak.”\n\n[“STOP THAT NOISE!”]\n\nThe musicians immediately left off playing with the exception of an\nold hippopotamus, playing a brass instrument, who being deaf, and\nvery near-sighted, had neither heard what had been said nor observed\nthat the others had stopped. With his eyes fixed on the music stand\nin front of him, he kept up a long discordant tootling on his own\naccount, gravely beating time with his head and one foot.\n\nHis Majesty’s Sister-in-Law turned around furiously once or twice, and\nthen seeing that the creature did not leave off, she threw a teacup at\nhis head, and followed it up with the sugar basin.\n\nThe latter hit him, and hastily dropping his instrument, he looked over\nthe top of his spectacles in surprise.\n\nPerceiving that the others had left off playing, he apparently realized\nwhat had happened, and meekly murmuring, “I beg your pardon,” he leaned\nforward with one foot up to his ear, to hear what was going on.\n\n“I’m waiting to know what you have to say for yourselves,” resumed\nMadame, addressing the Wallypug and myself.\n\n“The traid was late, add there was a fog od the lide,” explained A.\nFish, Esq., mendaciously, with his mouth full of hot porridge.\n\n“A likely story!” said the good lady sarcastically. “A very convenient\nexcuse, I must say; but that train’s been late too many times recently\nto suit me. I don’t believe a word of what you are saying.”\n\n“If I might venture a suggestion,” said the Doctor-in-Law, sweetly,\n“I would advise that they should all be mulcted in heavy fines, and I\nwill willingly undertake the collection of the money for a trifling\nconsideration.”\n\n“It’s too serious a matter for a fine,” said the Madame severely. “What\ndo you mean by it?” she demanded, glaring at me furiously.\n\n“Well, I’m sure we are all very sorry,” I remarked, “but I really do\nnot see that being two minutes late for breakfast is such a dreadful\naffair after all.”\n\n“Oh! you don’t, don’t you?” said the Sister-in-Law, working herself up\ninto a terrible state of excitement; “Well, I do, then. Do you suppose\nthat you are going to do just as you please here? Do you think that I\nam going to allow myself to be brow-beaten and imposed upon by a mere\nman——”\n\n“Who hasn’t a hat to his back,” interposed the Doctor-in-Law,\nspitefully.\n\n“Hold your tongue,” said the Sister-in-Law. “I’m dealing with him now.\nDo you suppose,” she went on, “that I am to be openly defied by a\nridiculous Wallypug and a person with a cold in his head?”\n\n“I’b sure I havn’d,” declared A. Fish, Esq., indignantly. “By code’s\nbeed cured this last bunth or bore.”\n\n“Humph, sounds like it, doesn’t it?” said the lady, tauntingly.\n“However, we’ll soon settle this matter. We’ll have a public meeting,\nand see who’s to be master, you or I.”\n\n“Hooray, public meeting! Public meeting!” shouted all the creatures\nexcitedly.\n\n“Yes, and at once,” said the Sister-in-Law impressively, getting up and\nleaving the table, regardless of the fact that scarcely anybody had as\nyet had any breakfast.\n\nThe rest of the creatures followed her out of the room.\n\nWhen they had quite disappeared and the Wallypug, A. Fish, Esq., and\nmyself were left alone, I thought that we might as well help ourselves\nto some breakfast. So I poured out some of the coffee, which we found\nexcellent, and had just succeeded in persuading his Majesty to try a\nlittle bread and butter, when some crocodiles appeared at the door and\nannounced: “You are commanded to attend the trial at once.”\n\n“What trial?” I asked.\n\n“Your own,” was the reply. “You and the Wallypug are to be tried for\n‘Contempt of Sister-in-Law,’ and A. Fish, Esq., is subpœnaed as a\nwitness.”\n\n“Oh, dear! Oh, dear!” said the poor Wallypug, wringing his hands. “I\nknow what that means. Whatever shall we do?”\n\n“Dever bide, old chap. I do the best I cad to get you off,” said A.\nFish, Esq. “Cub alog, it will odly bake badders worse to delay.”\n\nSo we allowed ourselves to be taken in charge by the crocodiles, and\nled to the Public Hall, his Majesty and myself being loaded with chains.\n\nWe found the Sister-in-Law and the Doctor-in-Law seated at the judges’\nbench when we entered. The Sister-in-Law wore a judge’s red robe, and a\nlong, flowing wig under her usual head-dress, and the Doctor-in-Law was\nprovided with a slate, pencil, and sponge.\n\n[“SILENCE IN COURT!” SCREAMED THE OSTRICH.]\n\nWe were conducted to a kind of dock on one side of the bench, and on\nthe other side appeared what afterwards transpired to be the witness\nbox. The body of the hall was crowded with animals, craning their necks\nto catch a glimpse of us.\n\n“Silence in court,” screamed out a gaily-dressed ostrich, and the trial\nbegan.\n\n“We’ll take the man creature first,” said the Sister-in-Law, regarding\nme contemptuously. “Now then, speak up! What have you got to say for\nyourself?”\n\n“There appears to be—” I began.\n\n“Silence in court,” shouted the ostrich, who was evidently an official.\n\n“Surely I may be allowed to explain,” I protested.\n\n“Silence in court,” shouted the bird again.\n\nI gave it up and remained silent. “Call the first witness,” remarked\nthe Sister-in-Law impatiently, and the Turtle, whom I had seen cleaning\nthe steps in the morning, walked briskly up into the witness-box.\n\n“Well, Turtle, what do you know about this man?” was the first question.\n\n“So please your Importance, I was cleaning my steps very early this\nmorning, when the prisoner opened the door in a stealthy manner and\ncrept out very quietly. ‘Ho!’ thinks I, ‘this ’ere man’s up to no\ngood,’ and so I keeps him in conversation a little while, but his\nlanguage—oh!—and what with one thing and another and noticing that he\nhadn’t a hat, I told him he had better move on. I saw him walk over to\nthe rose garden and afterwards join the Wallypug and Mr. Fish. I think\nthat’s all, except—ahem—that I missed a small piece of soap.”\n\n“Soap?” said the Doctor-in-Law, elevating his eyebrows. “This is\nimportant—er—er—what kind of soap?”\n\n“Yellow,” said the Turtle. “Fourpence a pound.”\n\n“Hum!” said the Doctor-in-Law, “very mysterious, but not at all\nsurprising from what I know of this person—call the next witness.”\n\nThe next witness was the Cockatoo, who scrambled into the box in a\ngreat fluster.\n\n“He’s a story-teller, and a pickpocket, and a backbiter, and a fibber,\nand a bottle-washer,” she screamed excitedly, “and a heartless\ndeceiver, and an organ-grinder, so there!” And she danced out of the\nwitness-box again excitedly, muttering, “Down with him, down with him,\nthe wretch,” all the way back to her seat.\n\n“Ah, that will about settle him, I fancy,” remarked the Doctor-in-Law,\nputting down some figures on his slate and counting them up.\n\n“What are you doing?” demanded the Sister-in-Law.\n\n“Summing up,” was the reply. “The judges always sum up in England, you\nknow; that’s thirty-two pounds he owes. Shall I collect it?”\n\n“Wait a minute till I pass the sentence,” said the Sister-in-Law.\n\n“Prisoner at the bar,” she continued, “you have since your arrival here\nbeen given every latitude.”\n\n“And longitude,” interrupted the Doctor-in-Law.\n\n“And have taken advantage of the fact to disobey the laws of the land\nin every possible way. You have heard the evidence against you, and I\nmay say more clear proof could not have been given. It appears that you\nare a thoroughly worthless character, and it is with great pleasure I\norder you to be imprisoned in the deepest dungeon beneath the castle\nmoat, and fined thirty-two pounds and costs.”\n\nThen pointing to me tragically, she called out, “Officers! take away\nthat Bauble!” And I was immediately seized by two of the crocodiles,\npreparatory to being taken below.\n\n\n\n\nCHAPTER VI. HIS MAJESTY IS DEPOSED.\n\n\n“STOP a minute!” cried Madame, as I was being led away. “We may as well\nsettle the Wallypug’s affair at the same time and get rid of them both\nat once. Put the creature into the dock.”\n\nHis Majesty was hustled forward, looking very nervous and white, as he\nstood trembling at the bar, while Madame regarded him fiercely.\n\n“Aren’t you ashamed of yourself?” she demanded.\n\n“Ye-e-s!” stammered his Majesty, though what the poor little fellow had\nto be ashamed of was more than I could tell.\n\n“I should think so, indeed,” commented the lady. “Now then, call the\nfirst witness.”\n\nThe first witness was A. Fish, Esq., who coughed importantly as he\nstepped up into the box with a jaunty air. “Let’s see, what’s your\nname?” asked the Doctor-in-Law, with a supercilious stare. Now, this\nwas absurd, for, of course, he knew as well as I did what the Fish’s\nname was; but as I heard him whisper to Madame, the judges in England\nalways pretend not to know _anything_, and he was doing the same.\n\n“By dabe is A. Fish, you doe thadt well edough,” was the answer.\n\n“Don’t be impertinent, or I shall commit you for contempt,” said the\nDoctor-in-Law, severely. “Now then—ah—you are a reptile of some sort,\nI believe, are you not?”\n\n“Certainly dot!” was indignant reply.\n\n“Oh! I thought you were. Er—what do you do for a living?”\n\n“I’b a teacher of elocutiod add a lecturer,” said A. Fish, Esq.,\nimportantly.\n\n“Oh! indeed. Teacher of elocution, are you? And how many pupils have\nyou, pray?”\n\n“Well, ad presend I’ve odly wud,” replied A. Fish, Esq., “and that the\nWallypug.”\n\n“Oh! the Wallypug’s a pupil of yours, is he? I suppose you find him\nvery stupid, don’t you?”\n\n“Doe, I don’t!” said A. Fish, Esq., loyally. “He’s a very clever pupil,\nad he’s gettig od splendidly with his recitig.”\n\n“Oh! is he, indeed; and what do you teach him, may I ask?”\n\n“I’ve taught hib ‘Twinkle, twinkle, little star,’ ad ‘Billy’s dead ad\ngone to glory,’ ad several other things frob Shakespeare.”\n\n“Shakespeare? hum—ha—Shakespeare? I seem to have heard the name\nbefore. Who is he?”\n\n“A great poet, born in England in 1564, m’lud,” explained one of the\nCrocodiles.\n\n“Really! He must be getting quite an old man by now,” said the\nDoctor-in-Law, vaguely.\n\n“He’s dead,” said A. Fish, Esq., solemnly.\n\n“Dear me! poor fellow! what did he die of?”\n\n“Don’t ask such a lot of silly questions,” interrupted the\nSister-in-Law, impatiently; “get on with the business. What has A. Fish\nto say on behalf of the Wallypug? that is the question.”\n\n“He’s gettig od very dicely with his recitig,” insisted A. Fish, Esq.\n“He was repeatig a speech from Richard III. to us this bordig whed the\nbreakfast bell rang, ad that’s why we were late at table.”\n\n“Oh! that’s the reason, is it?” said the Sister-in-Law. “Bah! I’ve no\npatience with a man at his time of life repeating poetry. Positively\nchildish, I call it. What was the rubbish?” she demanded, turning to\nthe Wallypug.\n\n“A horse, a horse, my kingdom for a horse,” began his Majesty, feebly.\n\n“What!” shrieked the Sister-in-Law, starting up from her seat. “Say\nthat again!”\n\n“‘A-a horse, a horse, my-my kingdom for a horse,’” stammered the\nWallypug, nervously.\n\n“Traitor! Monster!” cried the Sister-in-Law furiously. “Hear him!”\nshe screamed. “He actually has the effrontery to tell us to our faces\nthat he is willing to sell the whole of this kingdom for a horse. Oh!\nit is too much! the heartless creature! Oh-h!” and the lady sank back\nand gasped hysterically. At this there was a terrible uproar in the\ncourt—the animals stood up on the seats, frantically gesticulating\nand crying: “Traitor!” “Down with the Wallypug!” “Off with his head!”\n“Banish him!” “Send him to jail!” while above all could be heard the\nCockatoo screaming:\n\n“I told you so. I told you so! Down with the Wallypug! Off with his\ncrown! Dance on his sceptre, and kick his orb round the town.”\n\nThe poor Wallypug threw himself on his knees and called out\nimploringly, “It’s all a mistake,” and I tried in vain to make myself\nheard above the uproar.\n\n[“TRAITOR! MONSTER!” “OFF WITH HIS HEAD!”]\n\nThe whole assembly seemed to have taken leave of their senses, and for\na few moments the utmost confusion prevailed. The creatures nearest to\nthe Wallypug seemed as though they would tear him to pieces in their\nfury, and if it had not been for his jailers, the Crocodiles, I am\nconvinced they would have done him some injury. “This is outrageous,”\nI managed to shout at last. “You are making all this disturbance for\nnothing. What the Wallypug said was merely a quotation from one of\nShakespeare’s plays.”\n\n“Oh, it’s all very well to try and blame it on to poor Shakespeare,\nwhen you know very well he’s dead and can’t defend himself,” was\nMadame’s reply. “That’s your artfulness. I’ve no doubt you are quite as\nbad as the Wallypug himself, and probably put him up to it.”\n\n“Yes. Down with him! Down with the hatless traitor!” screamed the\nCockatoo.\n\nAnd despite our protests the Wallypug and myself were loaded with\nchains and marched off by the Crocodiles, his Majesty having first\nbeen robbed of his crown, sceptre, and orb, and other insignia of\nRoyalty by the Doctor-in-Law, who hadn’t a kind word to say for his\nold sovereign, and who seemed positively to rejoice at his Majesty’s\ndownfall. I was highly indignant with his heartless ingratitude, but\ncould do positively nothing, while all of my protests were drowned in\nthe babel of sounds made by the furious creatures in the body of the\ncourt.\n\n[THE WALLYPUG WAS LOADED WITH CHAINS AND MARCHED OFF BY\nTHE CROCODILES.]\n\nAfter being taken from the dock I was marched off in one direction\nand his Majesty in another, and the last view I had of the Wallypug\nwas that of the poor little fellow being limply dragged along by two\nCrocodiles in the direction of the dungeons. I was conducted to the top\nroom of a tower, in an unfrequented part of the palace, and there left\nto my reflections, without any one to speak to for the remainder of the\nday.\n\nTowards the evening I heard some shouting at the bottom of the tower,\nand looking out as well as I could through the barred window, I saw\nthe Doctor-in-Law rushing about with a packet of newspapers under one\narm—and heard him calling out, in a loud voice, “Special edition!\nArrest of the Wallypug! Shocking discovery! The Wallypug a traitor!\nSister-in-Law prostrate with excitement! The Hatless Man implicated!”\nHe was doing a roaring trade, as nearly everybody was buying papers\nof him, and excited groups of animals were standing about eagerly\ndiscussing what was evidently the cause of a tremendous sensation in\nthe kingdom of Why.\n\n[“I saw the Doctor-in-Law rushing about with a packet\nof newspapers under one arm, calling out in a loud voice, ‘Special\nedition! Arrest of the Wallypug!’”—Page 82.\n  _Wallypugland._]\n\n\n\n\nCHAPTER VII. FOILED!\n\n\nI STOOD at the barred window for some time, watching the Doctor-in-Law\nrushing about with his papers, and then started back as a huge and\ndisreputable-looking black Crow settled on the stone ledge outside.\n\nI soon recognized him as being the bird who had behaved so\nimpertinently to me on my first arrival at Why.\n\n“Well!” he exclaimed, squeezing himself through the iron bars, and\nstaring at me over the tops of his spectacles. “You have got yourself\ninto a pretty muddle now, I must say. I should think you are thoroughly\nashamed of yourself, aren’t you?”\n\n“Indeed, I’m not,” I replied. “I’m not conscious of having done\nanything to be ashamed of, and as for that trial, why it was a\nmere farce, and perfectly absurd,” and I laughed heartily at the\nrecollection of it.\n\n“H’m! I’m glad you find it so amusing,” remarked the bird\nsententiously. “You won’t be so light-hearted about it to-morrow if\nthey treat you as the papers say they purpose doing.”\n\n“Why, what do they intend to do then?” I exclaimed, my curiosity\nthoroughly aroused.\n\n“Execute you,” said the Crow solemnly. “And serve you jolly well right,\ntoo.”\n\n“What nonsense!” I cried, “they can’t execute me for doing nothing.”\n\n“Oh, you think so, do you? Didn’t you instigate the Wallypug to become\na traitor, and sell the kingdom for the sake of a horse?” said the\nCrow, referring to his paper.\n\n“Certainly not!” I cried emphatically.\n\n“Well, they say you did, anyhow,” said the Crow, “and they intend to\nchop off your head and the Wallypug’s too. It won’t matter you not\nhaving a hat then,” he continued grimly.\n\n“But you don’t mean it, surely!” I exclaimed. “They certainly can’t be\nso ridiculous as to treat the affair seriously.”\n\n“Well, you see,” said the bird, “things without doubt look very black\nagainst you. In the first place what did you want to come here at all\nfor?”\n\n“I’m sure I wish I hadn’t,” I remarked.\n\n“Just so! So does every one else,” said the Crow rudely. “Then, when\nyou did come, you were without a hat, which is in itself a very\nsuspicious circumstance.”\n\n“Why?” I interrupted.\n\n“Respectable people don’t go gadding about without hats,” said the bird\ncontemptuously, turning up his beak. “And then, the first morning\nafter your arrival you must needs go prowling about the grounds before\nany one else was up.”\n\n[“WHAT ARE YOU GOING TO LEAVE ME IN YOUR WILL?”]\n\n“What are you going to leave me in your will?” he continued\ninsinuatingly.\n\n“Nothing at all,” I declared. “And besides, I’m not going to make a\nwill. I don’t intend to let them kill me without a good struggle, I can\ntell you.”\n\n“H’m, you might as well let me have your watch and chain. It will\nonly go to the Doctor-in-Law if you don’t. He is sure to want to grab\neverything. I expect he will want to seize the throne when the Wallypug\nis executed. I saw him just now trying on the crown, and smirking and\ncapering about in front of the looking-glass.”\n\n“The Doctor-in-Law is an odious little monster,” I exclaimed.\n\n“Oh, very well,” cried the Crow, wriggling through the bars, “I’ll\njust go and tell him what you say. I’ve no doubt he will be delighted\nto hear your opinion of him—and perhaps it will induce him to add\nsomething to your punishment. I hope so, I’m sure—ha—ha!”\n\nAnd the wretched ill-omened bird flew away laughing derisively.\n\nI could not help feeling rather uncomfortable at the turn which events\nhad taken, for there was no knowing to what lengths the extraordinary\ninhabitants of this remarkable place might go, and if it had really\nbeen decided that the poor Wallypug and myself should be executed on\nthe morrow, then there was no time to be lost in our efforts to effect\nan escape.\n\nI was puzzling over the matter, and wondering what was best to be done,\nwhen I heard a bell ringing at the other end of the apartment.\n\n“Ting-a-ling-a-ling-a-ling,” for all the world like the ring of a\ntelephone call bell.\n\nI ran across the room, and sure enough, there was a telephone fitted up\nin the far corner. I hastily put the receiver to my ears, and heard a\nsqueaky voice inquiring:\n\n“Are you there? Are you 987654321?”\n\n“Yes,” I called out, for I thought that I might as well be this number\nas any other.\n\n“Well,” the voice replied, in an agitated way, “Aunt Kesiah has done it\nat last.”\n\n“What?” I shouted.\n\n[“Are you there?” cried A. Fish, Esq. “Yes; what is it?”\nI asked.—Page 89.\n  _Wallypugland._]\n\n“Proposed to the curate, and so all those slippers will be wasted.\nDon’t you think we had better—”\n\nBut I rang off and stopped the connection, for I felt sure that the\ncommunication was not intended for me.\n\nPresently there was another ring at the bell, and this time I found\nmyself connected with the exchange. I knew that it was the exchange,\nbecause they were all quarreling so.\n\n“It was all your fault!” “No it wasn’t.” “Yes it was.” “Well, you\nknow A. Fish, Esq., is 13,579—so there.” “Yes, and he wanted to be\nconnected with the West Tower in the Palace.”\n\n“Connect me with 13,579, please,” I called.\n\nAnd a moment or two afterwards I heard a well-known voice sounding\nthrough the instrument, and I knew that A. Fish, Esq., was at the other\nend.\n\n“Are you there?” he cried.\n\n“Yes; what is it?” I asked.\n\n“There isn’t a biddit to spare,” he gasped; “lift up the loose stode\ndear the fireplace, ad you will find a secret staircase leadig to the\ndudgeod, where the Wallypug is ibprisod; hurry for your life, he has\ndiscovered a way of escape.”\n\nI dropped the receiver, and flew to the fireplace. Yes, sure enough,\nthere was the loose stone that A. Fish, Esq., had spoken of, and having\nraised it with some difficulty I found a narrow spiral staircase\nbeneath, leading down into mysterious depths.\n\nI plunged into the darkness, and after walking round and round, and\ndown and down, for a considerable time I saw a faint light at the\nother end. I hurried forward as quickly as I could, and found myself\nin a dimly-lighted dungeon. The Wallypug was here alone, and was\nbusily cramming everything he could lay his hands on into an enormous\ncarpet-bag.\n\n“Thank goodness, you have come!” he exclaimed, in a terrible fluster,\nwhen he saw me. “I was afraid you would be too late. We must escape at\nonce if we would save our necks. Fortunately, I have just remembered\nthat this dungeon is connected with the shute which the late Wallypug\nhad constructed between here and Ling Choo, in China, which is on the\nother side of the world—it is enormously long and very steep, but\nquite safe—we must use it in order to get away. We are to be executed\nin the morning if we stay here, so I am informed; therefore, we must\nlose no time. I have just finished packing up. Ah! What’s that?” he\nexclaimed, listening intently.\n\n“Quick! they are coming!” he cried, as sounds were heard in the passage\noutside the dungeon door; and touching a spring, an enormous opening\nappeared in the wall. His Majesty gave me a sudden push, which sent\nme sprawling on to a smooth and very steep incline, and jumping down\nhimself, we slid rapidly away into the unknown.\n\n[WE SLID RAPIDLY DOWN THE SHUTE.]\n\nThat we were only just in time was evidenced by the cries of rage and\ndisappointment which pursued us from the dungeon, as the Doctor-in-Law\nand the other creatures saw us escape from their clutches, and we could\nhear the Cockatoo’s shrill cries grow fainter and fainter as we sped\nswiftly down the shute towards Ling Choo.\n\n\n\n\nCHAPTER VIII. THE LITTLE BLUE PEOPLE.\n\n\nDOWN, and down, and down we flew, quicker and quicker each moment.\nThe shute was as smooth as glass, and grew steeper than ever as we\ndescended. His Majesty was a little way behind me, but the terrific\nrate at which we were traveling made it impossible for us to hold\nany conversation. Once or twice I shouted out something to him, but\nreceiving no reply I soon gave that up. The attitude in which I was\nslipping down the shute was a most uncomfortable one, but after a\nconsiderable time I managed to turn over on to my back, and eventually\nto twist around, till, at any rate, I was traveling feet foremost,\nwhich was some slight consolation, although naturally I was dreadfully\nconcerned as to what was to be our fate at the other end of our\njourney. “Slipping along at this rate,” I thought, “we shall probably\nbe smashed to a jelly when we do arrive at the bottom. At any rate I\nshall, for the Wallypug and the carpet-bag are bound to descend upon my\ndevoted head.”\n\nBy and by I began to grow very hungry, and then came another dismal\nthought. Supposing this extraordinary trip continued for any length of\ntime, how should we get on for food?\n\nWe seemed to be traveling through a kind of tunnel, with very smooth\nwalls on either side. The Wallypug had said that we were bound for\nChina, and that that country was on the other side of the world. If so,\nthen we were in for a pretty long journey. I twisted my head around,\nand tried to get a glimpse of his Majesty, who was only a few yards\nabove me. I could see that he was struggling to get something out\nof the carpet-bag, and a few minutes afterwards a little packet of\nsandwiches came whizzing past my head. I managed to catch it as it fell\nupon the highly-polished boards by stretching out one leg just in time\nto prevent it from slipping too far.\n\n[I COULD SEE HE WAS STRUGGLING TO GET SOMETHING OUT OF\nTHE CARPET-BAG.]\n\nThe sandwiches were very good, and I enjoyed them immensely, and for\na few moments almost forgot our strange surroundings. I was soon,\nhowever, recalled to a sense of our condition by the fact that we\nsuddenly emerged from the tunnel into broad daylight, the shute\napparently descending the steep sides of a high mountain. As soon as my\neyes became accustomed to the light I noticed, to my great surprise,\nthat everything in this new country was of a deep rich blue color. The\nrocks on the mountain side, the strange-looking trees, and even the\nbirds—of which I could see several flying about—were all of the same\nunusual tint.\n\nI had hardly noticed this fact, as we flew down the side of the\nmountain, when I felt myself suddenly pulled up with a jerk, and lifted\nhigh into the air in a most unaccountable manner, and when, after\na moment or two, I recovered from the shock, I found that both the\nWallypug and myself were suspended from a line at the end of two long\nfishing-rods which were fastened into a quaint little bridge crossing\nthe shute.\n\nThere we hung, dangling and bobbing about in front of each other in the\nmost ridiculous way, the dear Wallypug still clinging to his carpet-bag\nwith one hand, while in the other he clutched a half-eaten sandwich.\nI shall never forget his Majesty’s surprised expression when he found\nhimself hanging up the air in this unexpected way.\n\n“Like being a bird, isn’t it?” he remarked when at last he found a\nvoice.\n\n“H’m, not much,” I replied. “I feel more like a fish at the end of this\nline. I wish some one would come and help us off. There’s a hook, or\nsomething, sticking into my shoulder, and it hurts no end.” You see\nthere was evidently something at the end of the lines which had caught\ninto our clothes, and the hook, or whatever it was, just touched my\nshoulder. It did not hurt very much, but just enough to make me feel\nuncomfortable.\n\n[“I wonder where we are,” said the Wallypug, looking\nabout him. “What a funny colour everything is, to be sure.”—Page 98.\n  _Wallypugland._]\n\n“I wonder where we are,” said the Wallypug, looking about him. “What a\nfunny color everything is, to be sure.”\n\n“Yes, isn’t it?” I replied. And truly it was a most remarkable scene.\nThere was a curious little kind of temple in the distance and a number\nof most extraordinary-looking trees; and these, and the grass, and, in\nfact, everything that could be seen, were of a bright blue tint.\n\n“I know what those trees are called,” said the Wallypug, pointing to\nsome remarkable looking ones, with a lot of large blue globes on the\nbranches instead of leaves.\n\n“What?” I asked.\n\n“Gombobble trees,” said his Majesty. “I’ve seen pictures of them\nbefore.”\n\n“Where?” I asked, more for the sake of something to say than for\nanything else.\n\n“On our willow-pattern plates at home,” said his Majesty. “There were\nthose and the wiggle-woggely trees, you know.”\n\n“I wonder,” he continued speculatively, “if by any chance we are there.”\n\n“What do you mean?” I asked.\n\n“I wonder if this is the place which is shown on the willow-pattern\nplates,” said his Majesty.\n\nBefore I could reply we heard an excited exclamation from the bank,\nand turning around as well as we could we saw two curious little blue\npeople dressed in flowing blue costumes.\n\n“Oh!” they exclaimed, when they saw us, throwing up their hands in a\ncomical little way, “we’ve caught something. What funny things! What\nare they?”\n\n“I wonder if they bite,” cried the shorter of the two.\n\n“Do you bite, you funny things, you?” cried the other, shaking her head\nat us.\n\n“No, of course not,” said the Wallypug. “Help us to get down, will you,\nplease?”\n\n“Not yet,” said both of the little blue creatures, shaking their heads\nsimultaneously. “What are your names?”\n\n[“OH!” THEY EXCLAIMED, “WHAT ARE THEY?”]\n\n“I’m the Wallypug,” explained his Majesty graciously, “and this\ngentleman is——”\n\n“He, he, he! He, he, he! He, he, he!” giggled the little blue people.\n“They’re Wallypugs. Two great big fat Wallypugs. Oh, oh! what funny\nthings. Let’s go and fetch Ho-lor.” And they ran off as fast as their\nlittle blue legs would carry them.\n\n\n\n\nCHAPTER IX. THE WALLYPUG RECOVERS HIS CROWN.\n\n\nHIS Majesty and myself stared at each other in dismay. Our position was\ngrowing more and more uncomfortable every moment, and, added to this, I\nhad a growing impression that the rods to which we were attached would\nsooner or later break with our weight.\n\n“Well! I do think that they might have helped us off the hooks, at any\nrate,” grumbled his Majesty, discontentedly.\n\n“So do I,” I rejoined, and was about to add something else when my\nattention was attracted to the peculiar behavior of the two blue birds\nwhich we had previously noticed circling about over our heads.\n\nThey were wheeling round and round in a most eccentric manner, and as\nthey drew closer we could see that they were as singular in appearance\nas they were in their manner.\n\n“Why, they’ve got ever so many wings!” cried his Majesty in surprise.\n\n“Go away!” he shouted, as one of them fluttered past his face. The\nbirds, however, were not to be got rid of so easily, and, uttering\nshrill little cries, they hovered about over his Majesty’s head, every\nnow and then making a vicious dart at the sandwich which he still held\nin one hand.\n\n“Oh! take them away!—take them away!” he shouted, dropping his\ncarpet-bag in alarm, and evidently forgetting that I was as incapable\nas he was of driving them off.\n\n“Throw your sandwich away!” I shouted; “it’s that they are after, I\nbelieve.”\n\nHis Majesty did so, and we soon had the satisfaction of seeing the\nbirds squabbling over it on the bank at the side of the shute.\n\n[“GO AWAY!” SHOUTED HIS MAJESTY.]\n\n“Fortunate I tied my bag to the string of my cloak, wasn’t it?”\nremarked the Wallypug, when they had gone. “I should have lost it else.\nOh, look! What’s that coming down the shute?” he cried, as something\nsuddenly came rolling and bounding down the steep incline.\n\n“O—o—o—h!” he continued delightedly, as it stopped, caught in the\nmouth of the carpet-bag which, attached to the cord of his Majesty’s\ncloak, dangled down the shute. “Why, it’s my crown! They must have\nthought that I wanted it, and sent it down after me. How very kind of\nthem. Wasn’t it?”\n\nI had my own opinions on the subject, and held my peace, for I felt\nquite sure that it was not through any intentional kindness that the\ncrown had found its way to its proper owner.\n\nHis Majesty very carefully drew up the carpet-bag with its precious\nburden, and soon had the intense satisfaction of putting the crown of\nWhy on his royal head once more.\n\n“Oh!” he cried with a little sigh of satisfaction, “it does seem nice\nto have it on again. I’m afraid that I should soon have caught a cold\nin my head, like A. Fish, Esq., if I had gone without it much longer.”\n\n[A LONG LINE OF CREATURES WAS COMING DOWN THE SHUTE.]\n\n“Gracious!” he cried, pointing excitedly towards the top of the shute,\n“there’s something else coming down! Why it’s the Doctor-in-Law and\nMadame. Oh!—and the Cockatoo—and—the Rabbit and the Mole. Bless me!\nif the whole of Why isn’t coming along.”\n\nIt was quite true; attached to a strong rope a long line of creatures\nwas coming down the shute, the Doctor-in-Law leading the way.\n\nHe soon caught sight of us dangling at the end of our rods, and calling\nout “Halt!” in a loud voice, he pulled at the rope as a sign that they\nwere to stop. This signal was passed along by the others, and the\nCockatoo, who was attached to the rope in a very uncomfortable manner,\ngave a loud “squ-a-a-k” as the sudden jerk caused it to tighten about\nher neck.\n\nThe signal, however, managed somehow to reach those at the other end,\nfor the procession suddenly came to a standstill.\n\n“Oh, there you are then!” called out the Doctor-in-Law in a severe\nvoice. “Thought you had escaped us, I suppose.”\n\nThe Cockatoo, in a voice choking with rage, and the tightened rope,\nshrieked out, “Down with the traitors!” while the Rabbit passed the\nword along, “It’s all right. We’ve found them.”\n\n“Just you come down and tie yourself to this rope at once!” called out\nMadame, glaring fiercely at the Wallypug.\n\n“Shan’t!” shouted his Majesty defiantly, pushing his crown further on\nto his head.\n\n“What!” screamed the good lady, in a terrible passion. “Do you dare to\nrebel?”\n\n“Yes, I do,” called out his Majesty bravely. “I don’t believe you are\nmy sister-in-law at all, and I’m not going back to Why to be snubbed\nand ill-treated for you or any one else—so there. You can’t get at me,\nhanging up here, and I don’t mean to get down till you’re gone. Yah!”\n\n“Oh, we’ll soon see all about that,” called out the Doctor-in-Law,\nworking himself to the edge of the shute, and trying to climb up the\nsteep sides of the bank.\n\nWe watched his endeavors with considerable anxiety, for if he did\nsucceed in getting on to the bank, it would be an easy matter for him\nto get at us, by means of the bridge. The rope, however, by which he\nwas attached to the Sister-in-Law was not sufficiently long to enable\nhim to do this, and while he was unfastening it there was a sudden cry\nin the direction of the tunnel, and a moment afterwards, screaming,\nkicking, and struggling, the whole party rapidly disappeared down the\nshute.\n\nThe rope had given way!\n\n“He, he, he! Ha, ha!” laughed his Majesty, as the huddled mass vanished\nin the distance. “What a lark! Oh what a muddle they will be in when\nthey reach the bottom.”\n\nI tried to imagine what would be the result, and came to the conclusion\nthat, uncomfortable as I was in my present position, I would rather be\nwhere I was than attached to the rope with the others.\n\nIn the meantime the little blue people, their curiosity evidently\naroused by the noise, were hurrying towards us as quickly as possible,\nbringing with them a very stout blue person, who was waddling along,\nbeing alternately pushed and pulled by the others in their eagerness to\nreach us.\n\n“See, there they are!” cried the little lady whose name we afterwards\nfound out was Gra-Shus. “Oh my! Aren’t they a funny color?”\n\n“Shall we get them down?” asked the other, whose name was Mi-Hy.\n\nThe little fat man regarded us critically, and said nothing for a\nmoment or two, then he nodded his head violently.\n\n“You’re sure you won’t bite?” said Mi-Hy, looking up into my face.\n\n“No, of course not. Don’t be silly,” I replied.\n\nThereupon, after a great deal of pulling and pushing on the part of\nMi-Hy and Gra-Shus, the rods to which we were attached were swung\naround, and the Wallypug and myself alighted, one on either side of the\nbank.\n\nHis Majesty smoothed his rumpled garments, and, adjusting his crown to\na more becoming angle, positively swaggered across the bridge to where\nthe three little blue people stood in a line to receive us.\n\n“This is Ho-Lor,” said Mi-Hy, pushing the little fat man forward, while\nGra-Shus bashfully hid behind the ample folds of his gorgeous blue\nskirts.\n\n“How do you do?” asked his Majesty graciously.\n\n“Do what?” asked Ho-Lor, smilingly.\n\n“I mean, how are you?” explained the Wallypug.\n\n“You mean _what_ am I, I suppose?” said the little man, putting on a\npuzzled expression.\n\n“No, I don’t,” said the Wallypug. “I mean just what I say—How are you?”\n\n“But I don’t understand,” replied Ho-Lor. “How am I what?”\n\n“His Majesty the Wallypug of Why,” I explained, “wishes to say, that he\nhopes you are quite well.”\n\n[His Majesty swaggered across the bridge to where the\nthree little blue people stood in a line to receive us.—Page 112.\n  _Wallypugland._]\n\n“Oh! I beg your pardon” said Ho-Lor. “How very stupid of me. But\nyou know, the fact is, we get such a lot of foreigners down here,\nand they do ask such funny questions. A Frenchman we caught the\nother day actually asked me how I carried myself. Wasn’t it rude of\nhim—considering my weight too?”\n\n“You’re a Wallypug, too, aren’t you?” asked Gra-Shus, looking smilingly\nup into my face.\n\n“Oh, no!” I replied; “I am only his Majesty’s guest.”\n\n“His Majesty! Do you mean that?” said Mi-Hy, pointing to the Wallypug.\n\nThe Wallypug drew himself up with an air of offended dignity.\n\n“I am not a ‘that’; I’m a kind of a king,” he explained, in a tone of\nremonstrance.\n\n“O-ooh!” exclaimed the little blue people, falling down on their knees\nand bowing their foreheads to the ground, with their hands stretched\nout before them. “Pray forgive us, Majestuous Wallypug, we thought you\nwere only an ordinary person. You see we’ve never caught a king before.\nOh! don’t chop our heads off, will you?”\n\n[“PRAY FORGIVE US,” EXCLAIMED THE BLUE PEOPLE.]\n\n“Of course not,” said his Majesty, kindly.\n\n“But kings always chop off people’s heads, don’t they?” cried the\nlittle people, anxiously.\n\n“Oh dear no,” said the Wallypug.\n\n“Get up; or you’ll spoil your clothes. Could we have a cup of tea,\nplease? We are rather fatigued with our long journey.”\n\nThe little blue people immediately jumped up and led the way to\nwhere behind a clump of curious blue trees the quaintest little boat\nyou could possibly imagine was moored against the bank. A blue lake\nstretched as far as the eye could reach, and a number of little islands\nwere dotted about it. On one, a little larger than the rest, a quaint\nlittle blue pagoda could be seen.\n\n\n\n\nCHAPTER X. THE HOME OF HO-LOR.\n\n\n“I LIVE over there,” said Ho-Lor with pride, pointing to the island\nwith the pagoda on it. “Mi-Hy shall row us across, and Gra-Shus shall\nmake us some tea.”\n\n“Oh! yes,” said Gra-Shus clapping her hands. “And we’ll show Mr.\nMajesty Wallypug our beautiful pet dog—won’t we?”\n\nIt was impossible not to be interested in these quaint and\nsimple-minded little folk, and after we had all stepped into the little\nboat and Mi-Hy had pushed off, his Majesty was soon chatting affably\nwith Ho-Lor, who explained that he was a mandarin of the Blue Button,\nand ninety-eighth-cousin-twice-removed to the Emperor of China.\n\nWe soon reached the opposite bank, and his Majesty having been\nceremoniously assisted out of the boat, we ascended a slight hill, and\nsoon found ourselves before Ho-Lor’s residence. To our great surprise\nwe found that it exactly resembled the building so familiar to all who\nhave seen a willow-pattern plate.\n\nThe tall pillars at the portico, the quaintly-shaped curly roofs, the\nlittle zig-zag fence running along the path, and the curious trees, all\nseemed to be old friends—while two little islands, one of which was\nconnected to the mainland by a quaint bridge, completed the picture.\n\nThe two birds, which had by this time finished squabbling about the\nsandwich, were billing and cooing over our heads, and the sight of them\nseemed suddenly to convince us of the identity of the spot.\n\n“Why, this must be the land of the Willow-pattern plate,” cried his\nMajesty excitedly.\n\n“Yes, it is,” admitted Ho-Lor. “Don’t you think it is a very pretty\nspot?”\n\n“Charming,” declared the Wallypug; “I have often wanted to come here.”\n\n“The real name of the place,” said Ho-Lor, “is Wer-har-wei, and it is\na portion of China; but come, you must see our little dog; I can hear\nthat Mi-Hy has gone to fetch him.”\n\n“His name is Kis-Smee,” said Gra-Shus, “and he is such a dear old\nthing. We’ve had him ever since he was a puppy.”\n\nThere was a sound of barking, and a confused clattering of chains,\nwhich told of a dog being unloosed. A moment afterwards there came\nbounding out of the house the most extraordinary-looking creature that\nI have ever beheld.\n\nIt was a very fat and atrociously hideous animal, bearing but slight\nresemblance to a dog. Its enormous mouth wore a perpetual grin, and\nwas decorated at the corners with curious little scallops. It was\nbandy-legged, and its hinder legs were much longer than the front ones.\nAdded to this, the skin on its haunches was wrinkled up into curious\nkind of rosettes, while its tail was really all sorts of shapes.\n\n[“Come along, good dog! come and speak to the pretty\nWallypugs.”—Page 119.\n  _Wallypugland._]\n\nThis beautiful creature came careering down the steps, dragging Mi-Hy\nwith him, and was hailed with delight by Gra-Shus, who cried in\nendearing tones:\n\n“Come along, good dog! Come and speak to the pretty Wallypugs. Good\nKis-Smee. Good dog, then!”\n\nHis Majesty clutched my arm nervously, and retreating behind the\ncarpet-bag, regarded Kis-Smee with a certain amount of suspicion, while\nI must confess to having experienced a slight feeling of uneasiness\nmyself. For if Kis-Smee took it into his ugly head to object to us,\nthere was no knowing what might be the result.\n\nThere was no occasion for alarm, however, for Kis-Smee turned out to\nbe one of the mildest and best-behaved of dogs.\n\nHe made great friends with the Wallypug at once, and clumsily gamboled,\nor, as his Majesty explained it, “flumped,” about him in the most\nfriendly manner.\n\n“He doesn’t take to strangers as a rule,” said Ho-Lor, “but he\ncertainly seems to have taken a fancy to you.”\n\n“He is a beautiful creature,” said his Majesty, politely patting the\nhuge animal a little nervously.\n\n“Oh! I don’t know about that,” remarked Ho-Lor, looking very pleased\nnevertheless. “He is of a very rare breed, though.”\n\n“What kind of dog do you call him?” I inquired.\n\n“He’s a smirkler dog,” replied Ho-Lor proudly.\n\n“A what?” I exclaimed.\n\n“A smirkler. He smirkles for mivlets you know,” was the reply.\n\n“Good gracious. What are they?” cried the Wallypug.\n\n“Mivlets?” asked Ho-Lor.\n\n[“HE IS A BEAUTIFUL CREATURE,” SAID HIS MAJESTY.]\n\nHis Majesty nodded.\n\n“Why young mivs, of course.”\n\n“But what are mivs?” asked his Majesty curiously.\n\n“Things that are smirkled for,” replied Ho-Lor promptly. “But come. I\nsee that Gra-Shus has prepared some tea for us.”\n\nWe entered the little blue temple and were each presented with a little\nblue rug, upon which we sat cross-legged, as we observed that Mi-Hy and\nHo-Lor were doing. Gra-Shus served us in blue cups what tasted like\ndelicious tea, but which looked exactly like blue ink. No sooner had we\ntaken a few sips than I noticed that the Wallypug was slowly turning a\nlight blue color, while at the same moment he stared at me fixedly a\nmoment, and then exclaimed: “Why, what a funny color you are!”\n\nI looked at my hands, and found them a rich blue shade.\n\n“We look like the Oxford and Cambridge boat race, don’t we?” he\ncontinued: “I’m so glad that I’m Cambridge!”\n\nI did not at all approve of the change, for although we did not look so\nvery remarkable in the midst of our strange surroundings, I could not\nhelp thinking what an extraordinary object I should be considered in\nLondon if I ever reached that place again.\n\n“Oh! Aren’t they pretty now?” exclaimed Gra-Shus, clapping her hands\nand dancing about excitedly.\n\n“I am glad you think so,” I replied, in a huff.\n\n“Don’t you like it? Would you rather have been green? We’ve plenty of\ngreen tea, you know, if you wish.”\n\n“Thanks! I should prefer being my original color, if you don’t mind,” I\nreplied.\n\n“Dear me! I’m very sorry, but I’m afraid we’re out of that color. Let’s\nsee! Crushed strawberry, wasn’t it?”\n\n“Oh! let’s stay blue for a little while,” pleaded his Majesty. “It’s\nsuch a change, and so very uncommon, you know!”\n\nSo blue we remained, and directly after we had finished our tea Mi-Hy\nbrought around the little blue boat again, and we went for a row on the\nornamental lake.\n\nSomehow or another Kis-Smee was left behind, and although the Wallypug\nsuggested putting back for him, it was finally decided, however, not to\ndo so.\n\n[WE WENT FOR A ROW ON THE ORNAMENTAL LAKE.]\n\n“Perhaps he will smirkle a mivlet while we are away,” said Ho-Lor.\n\nAnd I confidently hoped that he might do so, for I was as curious as\nwas the Wallypug to know what the term meant.\n\nJust then we passed a curious little blue island with one tiny house on\nit, standing in the midst of some curious trees and strangely-shaped\nrocks. “Let’s go ashore and fish,” suddenly suggested Mi-Hy.\n\n“Oh! yes, do,” cried the Wallypug. “I love fishing; but I’m never\nallowed to do so in my own land.”\n\n“Why not?” inquired Ho-Lor.\n\n“The fishes object,” replied his Majesty, sadly; “they say that it\ngives them the tooth-ache.”\n\n“How absurd of them,” said Ho-Lor, sympathetically.\n\n“Yes; isn’t it perfectly ridiculous?” replied his Majesty; “for they\nreally haven’t any teeth, you know.”\n\nBy this time the boat had reached the shore, and we all scrambled out\nand assisted Ho-Lor up the steep rocks.\n\nFrom within the little blue house Mi-Hy brought some rods and lines,\nand we began to fish. There was no bait of any kind, but this Ho-Lor\nexplained was not necessary.\n\nUnder the circumstances I was not surprised to find that we did not get\na bite for a considerable time.\n\nAt last, however, the Wallypug announced with a delighted shout, “I’ve\ngot one!” and we all ran over to see what it was.\n\nSlowly his Majesty wound up his line, while Mi-Hy hung over the rocks\nwith a landing net. “I’ve got it!” he shouted. “Oh, what a beauty!” and\ndiving his hand into the net, he drew out—what do you think? An empty\nink-bottle!\n\nI couldn’t help laughing at his Majesty’s disappointed face, but Ho-Lor\nseemed positively to think that it was a catch worth having. “It’s in\ncapital condition,” he exclaimed, examining it critically, “and has a\nbeautifully-shaped neck.”\n\n“But it’s only an old ink bottle,” objected the poor Wallypug.\n\n“What else did you expect to catch, I should like to know?” said Mi-Hy.\n“Some people are never satisfied. Many a time I have fished here a\nwhole day and only caught a piece of blotting paper or a pen-wiper.”\n\n“What funny things to catch!” exclaimed the Wallypug.\n\n“They are very appropriate things to get from a lake of ink,” said\nHo-Lor rather huffily.\n\n“Oh! I’m sure I beg your pardon, I had no idea it was real ink,” said\nhis Majesty, apologetically. “I don’t think we had better fish any\nlonger,” he said putting away his rod. “I hoped to have caught some\nreal fish, you know.”\n\n“Never heard of them. What are they?” asked Ho-Lor.\n\n“Why, things with scales, you know,” exclaimed the Wallypug.\n\n“Oh, you mean weighing machines,” said Mi-Hy.\n\n“No! no! I mean—”\n\n“Hark! what’s that?” said Ho-Lor, putting his hand to his ear.\n\n“Come on! That’s Kis-Smee barking. I expect he has smirkled a mivlet.\nCome along, hurry up, or we shall be too late.”\n\nWe hurriedly launched the little boat, and were soon on our way across\nthe little lake.\n\nThe sound of furious barking, mingled with a strangely familiar voice,\ncame from behind Ho-Lor’s house, and hurrying forward we came suddenly\nupon a remarkable sight.\n\nKis-Smee was prancing madly round a gombobble tree to the lower\nbranches of which A. Fish, Esq., was clinging in an agony of fright.\n\n[Kis-Smee was prancing madly round a gombobble tree to\nthe lower branches of which A. Fish, Esq., was clinging in an agony of\nfright.—Page 128.\n  _Wallypugland._]\n\n“Lie dowd, sir! Lie dowd, good dog, thed!” he shouted, while Kis-Smee\nbarked and made sudden furious little darts at the fish’s tail.\n\n“Why, it’s A. Fish, Esq.,” cried his Majesty, hurrying forward\nanxiously. “Come away, Kis-Smee! Lie down, sir!”\n\nKis-Smee left his quarry in the tree, and came bounding up to the\nWallypug, wagging his great clumsy tail delightedly.\n\n“Good gracious!” exclaimed Mi-Hy, staring in amazement at A. Fish, Esq.\n“That’s not a mivlet, I’m sure—what on earth is the creature?”\n\n“Oh, that’s A. Fish, Esq., a great friend of mine,” hastily explained\nhis Majesty, running to his assistance, for when Kis-Smee had left him,\npoor A. Fish, Esq., had dropped off the gombobble tree, and was now\nlying exhausted on the blue grass beneath.\n\n“What a dreadful bodster!” he cried, waving Kis-Smee off as we\napproached. “Keep hib off. Take hib away!”\n\n“It’s all right,” said his Majesty, reassuringly, “he won’t bite you\nnow that we are here.”\n\nIndeed, directly the dog discovered that A. Fish, Esq., was a friend of\nthe Wallypug’s, he went up to him, and grinning in an absurd way, held\nout a paw to be shaken, which favor, however, was declined by A. Fish,\nEsq., who evidently regarded these overtures with a certain amount of\nsuspicion, and looked greatly relieved when Ho-Lor and Mi-Hy, seeing\nthat we were engaged with a friend, considerately left us to ourselves,\nand took Kis-Smee away with them.\n\n\n\n\nCHAPTER XI. THE WHY AND WER-HAR-WEI RAILWAY.\n\n\n“FANCY seeing you!” cried his Majesty, as we sat down beside the Fish\nunder the gombobble tree. “How ever did you get here? And what’s the\nnews at Why?”\n\n“Oh, thad’s a log story,” said A. Fish, Esq., and proceeded to tell us\nhow that after we had escaped from Why, by means of the shute, there\nhad been a great commotion in the place, and the Doctor-in-Law was\nfurious. He declared that we should not slip through his hands in this\nway, and had a long conversation with the Sister-in-Law and the others\nas to the best way of affecting our capture. Finally they decided to\nattach themselves to a long rope, and come down the shute in pursuit\nof us.\n\nA. Fish, Esq., made the excuse that his cold was too bad to permit him\nto join the party, and waited till they had got a good way down, and\nthen cut the rope. He thought that this would be the best way of being\nof service to us. And so it was, of course, for goodness only knows\nwhere our pursuers were by this time.\n\nA little while after he had cut the rope A. Fish, Esq., came across the\nCrow, who told him that he had been informed by two duffer birds (which\nwas the name of the curious blue birds which we had noticed) that we\nwere here at Wer-har-wei, and had immediately set about to discover the\nbest way to get here.\n\nHe went in the first place to the station-master at Why, and found him,\nas usual, engaged in squabbling with the porter.\n\nThey were arguing as to whether a certain signal should be up or down.\n\nThe station-master declared that the signal should always be up on the\nup line and down on the down line. This the porter would not agree to,\nso it was at last decided to put one up and one down and leave them so,\nand then the engine-drivers could do as they pleased about going on or\nstopping.\n\n[AS USUAL THE STATION-MASTER WAS SQUABBLING WITH THE\nPORTER.]\n\nWhen they had quite settled this dispute, A. Fish, Esq., had asked them\nif there were any trains running between Why and this place, and at\nfirst they had said no; but presently the porter remembered that there\nwas a certain train which started on some days and went no one knew\nwhere.\n\nNo one was ever known to travel by it, and the engine-driver, who was\nan old salamander by the name of Mike, was deaf and dumb, and could\nneither read nor write, so that they had never been able to find out\nfrom him where his train went to. It had some letters on it which\ncorresponded with those on the station-master’s collar, but no one\nhad ever been able to discover what they meant. They were popularly\nsupposed to stand for Weary Waiting and Horribly Wobbly Railway, the\ninitials on the station-master’s collar being W.W.H.W.R., but A.\nFish, Esq., had by a brilliant inspiration come to the conclusion\nthat they stood for Why and Wer-har-wei Railway, and when the train,\nwhich consisted of only one carriage and the engine, came into the\nstation, he jumped in, to the intense surprise of Mike, who had never\nhad a passenger before, and who in his agitation recklessly put two\nshovelfuls of coal into the furnace, and, giving a frantic “toot” on\nthe whistle, started off at full speed.\n\n“It was a dreadful journey,” said A. Fish, Esq., “ad I dever had so\nbedy ups and dowds id all by life.”\n\nWe didn’t quite understand what he meant by this at the moment, but a\nlittle later on we discovered the reason to our cost.\n\nAfter an eventful journey, A. Fish, Esq., had arrived at this place,\nand had found on alighting from the train that no one was to be seen,\nand he was just about to kick at the door of Ho-Lor’s house when\nKis-Smee came bounding out. Poor A. Fish, Esq., had been terribly\nalarmed, and had made for the nearest tree, and was vainly trying to\nclimb up into it when we made our appearance.\n\n“If I were you,” he advised, “I should certaidly cub back to Why at\nodce, for the people all seeb to be rejoiced thad Madame and the\nDoctor-id-Law have gode away, ad I think thad they would willingly\nforgive you for having said, ‘Ad horse! ad horse! by kigdob for ad\nhorse!’”\n\nAfter talking the matter over for a few minutes we decided that perhaps\nit would be the best thing to do, and as the little blue station was\nonly just at the back of Ho-Lor’s house we thought that perhaps by\nhurrying we should catch the same train back to Why by which A. Fish,\nEsq., had come. So we set out to try and find the little blue people,\nto bid them “good-by,” and thank them for their hospitality.\n\nWe found them at the station sitting beside Mike, to whom it appeared\nthey were in the habit of being very kind on his occasional visits.\n\nThey seemed quite sorry to hear that we were leaving them so soon,\nand insisted upon making the Wallypug a present of Kis-Smee, and of\nstuffing into my pocket an enormous gombobble as a souvenir of my\nvisit. Then there was just time to look at the “train” before we\nstarted. I must say that of all crazy, ramshackle affairs it was quite\nthe worst that I had ever seen. To begin with, the wheels were all\nsorts of shapes, and not one of them was quite round. There was only\none compartment, and that had no windows in it. And the engine! Well,\nit was something like Puffing Billy, only a little worse.\n\nThere was no room for Kis-Smee in the carriage, so we were obliged to\nchain him up on the roof, evidently much to his disgust.\n\nI must confess to a certain feeling of uneasiness when, having taken\nour seats, the engine gave a snort, and puffing out a volume of dense\nblack smoke and smuts, started us on our journey.\n\nBy reason of the odd shape of our wheels and the unevenness of the\nrails the carriage pitched and tossed about like a ship at sea, and our\npassage over a little wooden viaduct, where on either side the little\nblue people stood waving their adieux with quaint little flags, was, I\nam convinced, attended with considerable danger.\n\nIt was really a dreadful journey. The carriage pitched backward and\nforward, and rolled from side to side with every revolution of the\nwheels, while poor Kis-Smee, on the top, kept slipping about in the\nmost painful manner. His Majesty’s carpet-bag, which had not been\nsecurely fastened to the top of the carriage, slipped off soon after we\nstarted, and though we rang the bell violently Mike refused to stop,\nand it was lost forever.\n\n“Fortunately there was not much in it!” his Majesty gasped between\nthe jerks which the irregular motion of the train occasioned. “Only a\ntooth-brush and small cake of soap.”\n\n[The carriage pitched backward and rolled from side to\nside.—Page 138.\n  _Wallypugland._]\n\n“But it felt quite full,” I remarked in surprise.\n\n“Yes,” explained his Majesty. “I stuffed it full of paper and things,\nbecause I thought that it would look so bad for a king to be traveling\nabout without any luggage.”\n\nJust then there was a yelp and a howl from Kis-Smee, and looking out\nof the window we found that the poor creature had fallen from the roof\nand was hanging down by the chain which was attached to the top of the\ncarriage, and was in momentary danger of being strangled.\n\nWe managed, after a prolonged struggle, to haul him in through the\nwindow, and, although we were rather crowded, to find room for him in\nthe carriage. We had hardly settled down into our places, however,\nbefore the train came to a standstill, and Mike came to the door in a\ngreat state of agitation.\n\n“Av yez plaze, sor,” he began.\n\n“Why! I thought you were deaf and dumb,” I cried.\n\n“Och—that’s all gammon sure—oi can talk all roight, and hear all\nroight too when it suits me purpose. Well, now, ye see when the dog\nfell off the roof he upset me coal-scuttle, and never a bit of coal is\nthere left. Would ye be good enough, kind gentlemen, to go back and\npick some up off the line, it’s only about a moile and a half back.”\n\nThe engine, it appeared, could not be reversed, and, as there was no\nchance of getting a supply anywhere else, nothing remained but for his\nMajesty and myself to go back with the coal-scuttle and pick some of\nthe spilt coal up.\n\nKis-Smee bounded delightedly at our side; but we did not take A. Fish,\nEsq., with us, as he complained of a pain in his tail, and we feared\nthat the long walk might make it worse.\n\n“I shall amuse byself while you are away by giving Bike ad elocutiod\nlessod,” he said, as we left him.\n\nBut Mike, who was undoing his bundle preparatory to having some dinner,\ndid not look very enthusiastic over the project, and I am almost\ncertain I heard him mutter, “Not if I know it,” as we were walking away.\n\nWe found the coal, as we expected, beside the line, after we had walked\na little over a mile, and his Majesty and myself picked it up, and\npacking it in the scuttle, took turns in carrying it back to the train\nagain.\n\nWe had nearly arrived at the spot where the train was waiting for us,\nwhen his Majesty noticed some curious flowers growing in a little copse\nbeside the line, and we put down our coal-scuttle and went to gather\nthem. While we were doing so, however, we heard a wild shout, and\nlooking up beheld an enormously tall and thin man running towards us,\ngesticulating violently.\n\nHe was waving some wire and leather dog muzzles in one hand.\n\n[THE TALL THIN MAN WAS WAVING SOME MUZZLES.]\n\n“Where’s his muzzle?” he demanded, pointing to Kis-Smee. “Can’t you see\nthe dog is mad and must be muzzled immediately?”\n\n“I’m sure he’s not,” cried the Wallypug, indignantly, and patting\nKis-Smee’s head.\n\n“He is,” declared the man. “All dogs are mad, and I insist upon them\nbeing muzzled.”\n\n“Very well,” I interposed. “You had better try and put a muzzle on this\none yourself.”\n\n“Oh! I’ll soon do that,” cried the man, selecting a large muzzle from\nthe collection which he carried with him. “Come here, sir! Good dog,\nthen.”\n\nKis-Smee growled, and grinning more than ever made a dart at the man,\nwho dropped his muzzles and fled, screaming, “Mad dog! Mad dog!” at the\ntop of his voice.\n\nHis Majesty and myself, laughing heartily at his discomfiture, hurried\nback to the train without meeting with any further adventures.\n\nA. Fish, Esq., and Mike seemed to be rather cool towards each other, I\nthought, and I heard afterwards that they had not got on at all well\nwith the “elocution” lesson—in fact, Mike had absolutely refused to be\ninstructed in that very necessary art.\n\nOf course we told them of our adventure with the man in the wood, and\nMike explained that he was well known as “The Long Man of Muzzledom,”\nand was quite harmless, though rather silly, being under the impression\nthat all dogs and cats were mad and should be muzzled.\n\n“Well, he didn’t muzzle Kis-Smee, anyhow,” said his Majesty, as we took\nour seats in the carriage, and the train once more started for Why.\n\nAfter several hours of bumping and jolting, we were delighted to see\nthe familiar towers and gables of his Majesty’s palace in the distance,\nand knew that we had at last arrived at the end of our journey.\n\n\n\n\nCHAPTER XII. BACK AGAIN AT WHY.\n\n\nKIS-SMEE was overjoyed to get out of the train, and eagerly strained at\nthe chain which his Majesty had affixed to his collar, in his endeavor\nto get through the barrier.\n\nThe porter, however, who pretended not to know us, demanded our tickets.\n\n“It’s all right,” said his Majesty, smilingly. “I’m the Wallypug, you\nknow.”\n\n“Nonsense,” said the porter. “The Wallypug was ugly enough, goodness\nknows, but he hadn’t a _blue_ face like you; besides, Wallypug or no\nWallypug, you don’t get through here without a ticket, I can tell you.”\n\nHere was a pretty pickle. We had not thought in the least about\ntickets, and in fact had no idea that any would be required.\n\n“I certainly shan’t let you pass the barrier without,” said the porter,\nin answer to our explanations.\n\n“But what are we to do?” asked the Wallypug. “Can’t we pay at this end?”\n\n“Certainly not. My instructions are to demand a ticket of every one\npassing this barrier, and unless you give me one you cannot go through.”\n\n“But I tell you we haven’t any. Can’t you tell us what to do?”\n\n“Go back for them, I should say,” said the porter, yawning\nunconcernedly. “Now then, one thing or another. Are you going to give\nme the tickets or not?”\n\n“How can we give them to you if we haven’t any?” demanded the Wallypug.\nThe porter slammed the door to impatiently, and went a little way up\nthe platform, turning around to call out warningly, “If we find any\nsuspicious-looking characters hanging about the station premises we\nshoot them.”\n\n[THE PORTER DEMANDED OUR TICKETS.]\n\n“What nonsense!” cried the Wallypug, rattling and kicking the gate.\n“We can’t stop here all day. Let’s call the station-master. Hi! hi!\nstation-master!” he shouted.\n\nNo one answered for a few minutes, but eventually a door some little\ndistance up the platform opened, and the old station-master made his\nappearance, puffing and blowing, and followed by the porter, carrying a\nhuge blunderbuss.\n\n“Now then, what’s all this noise about?” he demanded.\n\n“We want to get out, if you please,” said the Wallypug.\n\n“Where are your tickets,” demanded the station-master.\n\n“We are very sorry,” I began in explanation.\n\n“Hold your tongue, and speak when you are spoken to,” interrupted the\nstation-master.\n\n“Where are your tickets?”\n\n“They haven’t any,” explained the porter officiously. “They are trying\nto defraud the company.”\n\n“H’m, funny-looking lot of people, too,” remarked the station-master.\n“Who are they, do you know?”\n\n“That,” said the porter, pointing to his Majesty, “says he is the\nWallypug.”\n\n“What! _that_ color!” objected the station-master. “The Wallypug!\nIndeed, what nonsense!”\n\n“But, indeed, I am the Wallypug,” declared his Majesty, “and we turned\nthis color after we drank the tea, you know.”\n\n“Turned blue through drinking tea!” said the station-master\nincredulously.\n\n“Ha! ha! a _likely_ story,” laughed the porter derisively.\n\n“Perhaps it will wear off in time,” said the Wallypug, “like being\nsunburnt does.”\n\n“Very well then, you had better stop here till it does,” said the\nstation-master. “Look here!” he cried, turning to the porter, “you stop\nhere at the barrier, and don’t let them through until they have turned\na respectable color, and you can recognize them.”\n\n“But it may take weeks,” began his Majesty.\n\n“Hold your tongue!” said the station-master sharply. “If you have any\nnonsense with them, shoot them,” he added to the porter, depositing the\nblunderbuss beside the barrier, and going back to the other end of the\nplatform.\n\nWhatever we should have done I cannot think, if just at that moment the\nporter’s wife had not put her head out of the signal-box and called to\nhim to “come in at once and mind the baby,” while she “did a little\nshopping.”\n\n“But he’s on duty, ma’am,” expostulated the station-master.\n\n“I don’t care anything about _that;_ you come in at once, Bill,”\nshouted the woman, and the porter meekly left the barrier and\ndisappeared within the signal-box.\n\nOf course we all rushed through the gate at once, and the\nstation-master catching sight of Kis-Smee, who had meanwhile slipped\nhis chain, fled up the platform in dismay.\n\nKis-Smee, evidently thinking him fair game, started off in pursuit,\nand it was not till the station-master had bolted into his office and\nlocked the door that we could get him to come back to our call.\n\n[FLED UP THE PLATFORM IN DISMAY.]\n\nSo soon as we got into the street we met the Turtle and the Pelican,\nwalking arm-in-arm, and each smoking a cigarette.\n\n“Hullo, Wallypug!” exclaimed the Pelican. “Why, we thought you were at\nWei-hai-wei.”\n\n“Wer-har-wei, you mean,” laughed his Majesty.\n\n“It’s all the same,” announced the Pelican. “Well, how have you been\ngetting on?”\n\nHis Majesty explained as briefly as possible the adventures we had\npassed through, and then inquired how affairs were progressing at Why.\n\n“Oh, not very well, I’m afraid,” said the Pelican. “You see, there\nhas been no one to take the lead since you’ve been away. We tried a\nRepublican form of government, and elected Oom-Hi as president, but he\nbecame so extravagant—wanted a new top-hat every day, and insisted on\na gilded coach to ride in; and at last we caught him tampering with the\npublic funds, so we had to dismiss him. Have you heard about Broncho?”\n\n“No,” said his Majesty.\n\n“Well, it didn’t answer as a cough mixture, so Oom-Hi turned it into a\npatent meat extract, and called it Vimbril, and it killed ever so many\npeople.”\n\n“Indeed!” exclaimed the Wallypug, anxiously. “Any one I know?”\n\n“Madame and a few other folk,” was the reply; “and the Doctor-in-Law is\nnot expected to recover.”\n\n“Good gracious! Why, we thought them at the other end of the world.\nHowever did they get back to Why again?”\n\n“Oh, they sent us a cablegram when they got to China, and we let down\nan enormously long rope and pulled them up the shute again, you know.\nBut it was a very long journey, and they had nothing to eat on the\nway. So as soon as we hauled them up we gave them each a large dose of\nVimbril. Madame expired at once,” he added, with a sob.\n\nThe tears were streaming down the Turtle’s nose as he sympathetically\njoined in the Pelican’s weeping.\n\n“What about the Doctor-in-Law?” inquired his Majesty, solicitously.\n\n“Oh, he has a very strong constitution, you know, and he may pull\nthrough. We’ve got him back at the palace in his old quarters.”\n\n“Poor fellow! Poor fellow!” said the Wallypug, sympathetically. “Let’s\ngo and see what we can do for him.”\n\nI thought this very kind of his Majesty, considering all he had\nsuffered through the Doctor-in-Law’s ingratitude; but the good-hearted\nlittle fellow was full of sympathy, and hurried towards the palace with\nall speed.\n\n\n\n\nCHAPTER XIII. A NEW STATE OF AFFAIRS.\n\n\n“OH my! Good gracious me!” exclaimed a voice as we approached the\nentrance to the palace and looking up we beheld the Cockatoo perched\non a window-sill. “Just look at these creatures. _What_ a color. Why,\nwhy,” she exclaimed, peering at us closely, “I’m bothered if it isn’t\nthe Wallypug and the Hatless Man, and the great Mr. A. Fish, Esq. Where\nhave you been? What did you come back for? What do you want?” she\nscreamed.\n\n“It’s dud of your busidess,” replied A. Fish, Esq., shortly.\n\n“Oh! isn’t it,” said the Cockatoo furiously. “I’ll soon show you\nwhether it’s none of my business or not. To begin with, the Wallypug\nand the headless traitor”—\n\n“Do you mean me?” I interrupted, “because I am not headless yet, you\nknow.”\n\n[“WHAT A COLOR!” EXCLAIMED THE COCKATOO.]\n\n“Headless, or hatless, it’s all the same,” said the Cockatoo, “you\nmight as well run about without your head for all the good it is to\nyou,” she added insolently. “Well you two are escaped prisoners,” she\nran on, “and I shall see that you are locked up again, so there.”\n\n“But it was all a mistake,” said His Majesty mildly.\n\n“What was?” yelled the bird.\n\n“What I said about a ’horse a horse, my kingdom for a horse!’ you\nknow,” said the Wallypug.\n\n“Why don’t you say what you mean then?” cried the Cockatoo. “Well, I\nshall have you locked up anyhow. Here, Crocodile,” she shouted, “just\ncome and arrest these creatures will you?”\n\n“Shan’t!” replied a voice from within; “who are you ordering about. If\nyou want them arrested, do it yourself. I’m not going to do as _you_\ntell me, so there! besides, all the prisoners have been set free that\nMadame sentenced, you know that well enough?”\n\n“Yah! Down with him, down with Crocodiles; down with pale-blue\nWallypugs and hatless men; down with fishes of all sorts. Down with\neverybody and everything; down with——.”\n\nWe did not stop to hear any more of her ravings, but passed through and\nup into the Doctor-in-Law’s old rooms.\n\nWe found him looking very weak and ill, but he recognized us all, and\nheld out his hand to the Wallypug, who told him encouragingly that he\nwould soon be well again.\n\n“Yes, ad thed I’ll teach you elocutiod for dothig,” promised A. Fish,\nEsq.\n\nThe Doctor-in-Law smiled faintly, and whispered that what was keeping\nhim back most was the thought of the heavy doctor’s bill which he would\nhave to pay when he got better.\n\nThe good-natured little Wallypug made him very happy by promising to\npay this amount for him, and we left the little man looking very much\nbrighter than when we entered.\n\n[We found the Doctor-in-Law looking very weak and ill,\nbut he recognized us all and held out his hand to the Wallypug.—Page\n158.\n  _Wallypugland._]\n\nThe rest of the morning was spent in his Majesty’s private apartments,\ndiscussing all sorts of plans for the future, for, as the Wallypug very\nproperly remarked, now that the Mother-in-Law had gone he should have a\nfreer hand in the administration of affairs.\n\nA. Fish, Esq., busied himself in preparing an elaborate lecture,\nwhich he said he would deliver in public on the morrow, on the\n“Unreasonableness of Misunderstandability,” and which would, he hoped,\nclearly explain away the mistake which had been made, in accusing his\nMajesty of treason, in connection with his unfortunate recitation of “A\nhorse, a horse, my kingdom for a horse!”\n\nWhile we were thus busily engaged there came an impatient\ntap-tap-tapping at the door, and on opening it we beheld the Crow\nlooking more disreputably untidy than ever. He carried a large bundle\nof papers and a quill pen. “Ahem!” he began importantly, “I call on\nbehalf of the _Daily Whyer_ a new paper which I have just established,\nand which I am happy to say has already an enormous circulation in Why.\nIt is very cheap (four copies for a penny), and contains an enormous\namount of totally unreliable information; besides which there is a page\ndevoted to domestic matters, highly interesting to ladies, and includes\nreceipts for artistically furnishing your house with old tea chests\nand soap boxes, painted with enamel and draped with art muslin; there\nare also several poems weekly on the subject of ‘Baby’s Little Socks,’\nwhich are immensely popular with some people, here is one of them,” he\ncried, turning to the back page of his paper, a copy of which he had\nwith him.\n\n    “Oh! the baby’s little socks,\n    Darling baby’s little socks;\n  When the kettle’s softly steaming,\n  When the firelight’s glow is gleaming,\n  And I’m sitting idly dreaming,\n    Whisper gently, ‘baby’s socks.’\n\n    “Oh the darling little socks;\n    Baby’s _baby’s_ little socks;\n  Toys that baby fingers scatter,\n  Little feet that pitter-patter,\n  Tittle tongues—but there—no matter,\n    Let’s get back to baby’s socks.”\n\n“There,” he concluded triumphantly, “what do you think of that?”\n\n“Well, I don’t wish to be rude,” I remarked, “but I certainly think\nit’s the greatest rubbish I’ve ever heard in all my life.”\n\n“Rubbish!” he exclaimed, “Why all the ladies who read the _Daily Whyer_\nthink it _beautiful_. I have to get the same gentleman to write verses\nlike that nearly every day.”\n\n“Do you mean to tell me,” I replied, “that a man writes such twaddle as\nthat.”\n\n“Oh! you’re jealous, that’s what’s the matter with you. A man write\nthem? of course he does.”\n\n“And do you pay him for these precious contributions,” I exclaimed in\nsurprise.\n\n“I _promise_ to pay him ever so much a year,” said the Crow,\n“but—er—ahem—I have a very bad memory. I have several contributors\nwhom I pay on the same system, it’s a very _cheap_ way,” he sniffled.\n“I’ve copied it from a contemporary.”\n\n“Well, we’re very busy just dow,” said A. Fish, Esq., “would you bind\ntelling us your busidess ad goig, because we wandt to ged to work\nagaid.”\n\n“Oh! to tell you the truth,” said the Crow, “I wanted to know if the\nWallypug would let me print an interview with him in to-morrow’s paper.\nYou have just returned from Wer-har-wei, I believe, haven’t you; I was\nsitting on the signal post at the station just now and saw you arrive.\nI think my readers would be very interested in hearing your impressions\nof the country.”\n\nI took his Majesty aside and pointed out to him that very possibly an\ninterview with him appearing in the paper would have a good effect on\nhis people, and he could use it as a means of advertising the reforms\nhe intended making in the government of the land; and his Majesty\nagreeing with me on the point, he seated himself comfortably in his own\nparticular chair, and the Crow, perching on the back of another, the\ninterview began.\n\n“Let’s see,” said the Crow, making a great spluttering with his pen,\nwhich was cross-nibbed and broken. “When were you born?”\n\n“Well, really,” said his Majesty, “I, er—was so young at the time that\nI scarcely remember.”\n\n“Oh, well, I’ll put it down as Y. D. 987; that will do as well as any\nother date.”\n\n“Why Y. D.?” I inquired, curiously.\n\n“Year of disgrace,” was the prompt reply. “Bless me! this must be a\nPost Office pen,” he went on, as the pen scattered the ink about in all\ndirections. “They are always bad, you know.” Then, having asked the\nWallypug no end of questions, not only about our journey, but on all\nsorts of private matters also, the wretched-looking bird gathered up\nhis papers, which were covered with unintelligible blots and scratches\nand scattered in all parts of the room, and, tucking them under his\nwing, departed, to have the matter set up in print.\n\n[“THIS MUST BE A POST OFFICE PEN,” SAID THE CROW.]\n\n\n\n\nCHAPTER XIV. “GOOD FOR THE COMPLEXION.”\n\n\nTHE Crow had scarcely left the room when there was another knock, and\nwithout waiting for a reply the Cockatoo burst into the room in a fine\nfluster. She was followed by the Kangaroo and Oom Hi.\n\n“Look at them! _Look at them!_” she blurted out, “did you ever see such\nobjects in all your life. What a color!”\n\n“Hm! Eggshell blue,” said the Kangaroo, examining the Wallypug\ncritically. “Very extraordinary tint. Never seen a face that shade\nbefore.”\n\n“The other one is worse,” declared the Cockatoo, pointing at me\nderisively. “I always knew he was something disreputable. I believe,”\nshe added, sinking her voice into a hoarse whisper, “I believe he has\nlet himself out as an advertisement for Stephen’s Blue-black Ink, or\nRicket’s Paris Blue. What depravity. Down with him! Duck him in the\npond! Scrub him with sandpaper! Boil him!” and so she went on.\n\n“What’s all this bother about?” I exclaimed. “Don’t you see that his\nMajesty is engaged. If you don’t immediately go about your business I\nwill have you put out of the room.”\n\n“Oh! will you indeed,” exclaimed the Cockatoo excitedly, “I should like\nto see you attempt it. It strikes me that _you_ are the one that will\nbe put out. We can stand a good deal down here, but a hatless object\nwith a _blue_ face. Ough!”\n\n“Here, come and do your duty,” she shouted, going to the door, and the\ntwo Crocodiles entered and caught hold of me roughly by the collar.\n“Bring them out into the courtyard,” shouted the infuriated bird, and\nbefore I could protest I was bundled unceremoniously out of the house\nby the Crocodiles, the Kangaroo and Oom Hi following with the Wallypug.\n\n[“Ough! ough!” spluttered his Majesty. “You’re putting it\nall in my eyes. Oh, ach! do-o-n’t! Stop! I say, _do_ leave off.”—Page\n167.\n  _Wallypugland._]\n\n“Now then,” said the Cockatoo, stopping before a large tub of water\nwhich stood on the ground, “see what soap and water will do.”\n\nThe Kangaroo rummaged about and discovered a small hard piece of yellow\nsoap, and Oom Hi brought forth a good sized sponge, and together they\ngave the poor little Wallypug such a scrubbing as I should think he had\nnever had before in all his life.\n\n“Ough! ough!” spluttered his Majesty. “You’re putting it all in my\neyes. Oh, ach! do-o-on’t! Stop! I say, _do_ leave off. Ough!”\n\nThe poor little fellow was nearly choked.\n\nOom Hi sponged the soap away and the Cockatoo stared critically at the\npoor Wallypug, who stood there with the water streaming from his face\nand the tips of his fingers.\n\n“Hasn’t done the slightest good,” she declared; “better scrape him with\na putty knife, I think.”\n\n“Stop a minute!” said the Kangaroo, “I have it,” and he went up and\nwhispered something in Oom Hi’s ear.\n\n“Capital! capital! go and fetch a bottle,” cried Oom Hi, and the\nKangaroo rushed off, returning a minute later with a large bottle\nmarked Vimbril.\n\n“Oh! don’t! don’t!” cried the poor Wallypug. “I’m not going to take any\nof that stuff. It killed the lady who called herself my Sister-in-Law\nyou know, and it made the Doctor-in-Law ill. Take it away.”\n\n“Of course you are not going to take any, Wallypug,” said Oom Hi\nsoothingly, “but there will be no harm in trying the effect upon your\ncomplexion. It _might_ make you the proper color again you know, and\nin that case I could alter the name and call it ‘Wallypug’s Blush,’ and\nadvertise it well; no doubt it would be a great success. Put some on\nthe sponge,” he continued, holding it out to the Kangaroo, who poured\nout some of the nasty looking stuff.\n\n“No! no! don’t. Ough!” shuddered his Majesty, but despite his protests\nhis face was well rubbed with the fluid.\n\n“Worse than ever, he’s light brown now,” said the Cockatoo.\n\n“Oh! wipe it off! wipe it off,” implored the Wallypug.\n\n“No!” said Oom Hi, who seemed very greatly disappointed at the\nnon-success of his experiment, “let it dry on.”\n\n“We had better put him in the stocks,” he declared, “to prevent him\nfrom rubbing it off.” So the poor little Wallypug was led off to the\nstocks and securely fastened in, with his hands spread out to dry, and\nwith strict injunctions not to move till he was told.\n\n[HIS MAJESTY IN THE STOCKS.]\n\nThe last view that I had of his Majesty was of the poor little fellow,\nutterly worn out with his exertions, meekly sitting in the stocks and\nfalling into an uneasy slumber, from which, however, he was frequently\nawakened by the bees and flies, which, attracted by the sticky stuff on\nhis face and hands, flocked around him as though he were a pot of jam.\n\n“We might keep _this_ as a curiosity,” said the Cockatoo, turning her\nattention to me next. “Put in a cage with a large label, ‘Blue-faced\nand hatless man, Dangerous!’ he ought to be an attraction to our\nmenagerie. I think that’s what we’ll do with him,” and despite\nmy struggles and protests I was ignominiously marched off by the\nCrocodiles, who continued to make rude and personal remarks about my\nappearance all the way to the dungeon, where it appeared I was to spend\nmy time till a cage could be prepared for me.\n\nOf course I was terribly indignant at my treatment, but was absolutely\npowerless to prevent it And the only thing that I could do when the\nCrocodiles had left me alone, after a few parting jeers, was to\nconsider the best way of effecting my escape.\n\n[MADE RUDE AND PERSONAL REMARKS ABOUT MY APPEARANCE.]\n\nI was pondering seriously upon this question, when suddenly I\nremembered the Gombobble with which the little blue people had\npresented me when I left Wer-har-wei. Taking it from my pocket I idly\nwondered if it were good to eat or not. It felt soft and looked\nsomething like a huge blue orange or a melon; getting out my penknife\nI plunged it in and cut the fruit open. Inside was a white juicy pulp\nwhich looked very tempting, so trusting to its being good to eat I took\na bite.\n\nIt was delicious!\n\nI took another bite, and then, happening to look at my hands, I\ndiscovered to my great delight that they were regaining their proper\ncolor.\n\n“Come, this is better,” I cried, tackling a third piece; and then\nsuddenly remembering the poor Wallypug, I carefully cut the Gombobble\nin half and put part of it aside for his Majesty, and was just about to\neat another little piece myself, when, happening to look up, I caught\nsight of Mr. Nobody from Nowhere, squeezing through the bars of my\ndungeon window.\n\nHe was as smiling and happy as ever, and made me an elaborate bow with\nan elegant flourish, and then looked so very knowing that I felt sure\nthat he had something important to communicate.\n\n\n\n\nCHAPTER XV. “WALLYPUG’S BLUSH LIMITED.”\n\n\n“HOW do you do?” I began.\n\nThe little fellow bowed and smiled and brought forth a scrap of paper\nand a pencil.\n\nOn the paper he wrote, “Quite well thanks, how are you?” and added the\nwords, “Can I be of any service to you?”\n\nI pondered a moment, and then recollected that he would be a capital\nmedium of communication between the Wallypug and myself.\n\n“Do you know where the stocks are?” I inquired.\n\nMr. Nobody nodded vigorously.\n\n“His Majesty the Wallypug is there,” I ventured.\n\nMr. Nobody nodded again very energetically, and I could see that he\nknew all about it. Moreover he wrote on his paper, “Poor Wallypug!” and\nlooked most sympathetic.\n\n“Would you like to help him?” I inquired.\n\nThe little man nodded again, and seemed quite delighted at the prospect.\n\nHanding him the half of the Gombobble which I had reserved for his\nMajesty, I said, “Take this to the Wallypug immediately and, _if he is\nquite alone_, tell him to eat it all, and on no account to tell any one\nhow he became possessed of it.”\n\nMr. Nobody nodded to show that he understood, and, taking the piece\nof Gombobble, he squeezed through the bars of my cell, and was soon\nrunning off in the direction of the stocks.\n\nI awaited his return with some anxiety, and was delighted to see when\nhe did come back, that his face was beaming with delight.\n\n[MR. NOBODY NODDED.]\n\n“His Majesty has regained his complexion, and is very grateful to you,”\nhe wrote hurriedly, clapping his hands and capering about.\n\n“Now go and tell Oom Hi and the Kangaroo, and if they come to the\nconclusion that his Majesty’s complexion has been restored through\nusing the stuff they call ‘Wallypug’s Blush,’ don’t say anything to the\ncontrary; it will put them into a good temper and perhaps make them\nkinder to his Majesty.”\n\nMr. Nobody seemed quite to understand and hurried off again. He did not\ncome back, but about half an hour afterwards there was a noise at the\ndoor of my cell, and after a great deal of fumbling at the lock, Oom Hi\nand the Kangaroo entered.\n\nOom Hi carried a basin and the Kangaroo a bottle of Vimbril, or\nWallypug’s Blush, as it was now called.\n\nThey looked very amiable, and after some kind remarks about the weather\nOom Hi cleared his throat and said in a sort of apologetic voice:\n\n[OOM HI CARRIED A BASIN, AND THE KANGAROO A BOTTLE OF\nVIMBRIL.]\n\n“Er, we didn’t mean to be _too_ severe, you know, and what we have\ndone has been all for the best. You will be pleased to hear that my\ninvaluable preparation, ‘Wallypug’s Blush,’ has proved perfectly\nsatisfactory, and his Majesty the Wallypug is a living testimony to\nits worth. His beautiful complexion has entirely returned, and I have\nno doubt if we could persuade you to use it too it would be equally\nsuccessful in your case. You will try it, won’t you?” he pleaded\nearnestly.\n\n“Of course if my complexion, such as it is, is restored, I shall be\nreleased from here?” I hazarded.\n\n“Oh! certainly,” said both animals at once, and so after\nsurreptitiously devouring the remainder of the Gombobble, I permitted\nthe creatures to smear my face over with their precious rubbish on the\ndistinct understanding that I should be allowed to have a good wash\nafterwards.\n\nThe Gombobble acted perfectly, and the animals were delighted when they\nsaw the result, as they of course put it down to the effect of their\n“Wallypug’s Blush.”\n\n“Go and fetch the Cockatoo,” said Oom Hi, “she shall judge for\nherself.”\n\nSo the Kangaroo went off to fetch her.\n\n“Wonderful preparation, isn’t it?” said Oom Hi, gazing affectionately\nat his bottle of “Wallypug’s Blush.”\n\n“Very!” I remarked.\n\n“I _knew_ it must be good for something or another,” he went on, “but\nof course we could not tell exactly what till we had tried. It _very\nnearly_ cured a cold once, you know, when I called it Broncho, though I\nam bound to admit that it was not exactly a success as Vimbril. Do you\nthink ‘Wallypug’s Blush’ a good title,” he asked anxiously.\n\n“It’s a very striking one,” I admitted.\n\n“I shall advertise it well in the _Daily Whyer_, you know, and—Oh!\nhere comes the Cockatoo,” he added, as that bird came bustling into the\ncell.\n\n“Now then, what’s this I hear?” she began, giving me a keen glance;\n“‘Wallypug’s Blush’ restored your complexion. Why so it has, though I\ncannot say much for it even now. However, since you have no longer a\nblue face you are scarcely likely to be valuable as a curiosity, so you\nhad better get about your business,” and, flinging open the door, the\nCockatoo motioned me out with her crutched stick.\n\nYou may be sure I was not long in availing myself of my liberty and\nhurrying to the spot where I had last seen his Majesty.\n\nThe stocks were empty, but a little further off I found A. Fish, Esq.,\nwho seemed delighted to see me.\n\n“Well I dever!” he exclaimed; “I heard you were going to be exhibited\nas a freak. What stories people do tell, to be sure.”\n\nI briefly explained what had happened and inquired if he knew where the\nWallypug was.\n\n“Oh yes, he’s gode back to the Palace,” said A. Fish, Esq. “He’s id a\nrare way aboudt you.”\n\nSo I thought it best, in order to relieve his Majesty’s anxiety, to\nseek him there.\n\nIt was now getting dusk, and seeing a light in his Majesty’s private\napartments, I went up and knocked at the door.\n\n“Come in!” cried a voice which I had no difficulty in recognizing, and\non opening the door I found the good little man pacing to and fro in a\nstate of great agitation.\n\n“Oh! it’s you,” he exclaimed in a relieved voice, and came forward to\nwelcome me eagerly. “I was just wondering how on earth I could get you\nout of the Cockatoo’s clutches; she’s a wretched creature, isn’t she?”\n\n“Well she is a trial, certainly,” I agreed, “and I think if I were\nyou I should adopt some very strong measures for preventing her from\ninterfering as she does.”\n\n“Hm! yes,” said his Majesty, “let’s go and hear what the Doctor-in-Law\nhas to say about it; he may be able to advise us as to the best way of\nputting her down, and though he will probably charge pretty stiffly for\nit, his advice _is_ worth having sometimes.”\n\nSo we went together to the Doctor-in-Law’s room.\n\nWe were surprised to hear several voices talking excitedly within, and\nwhen in reply to a rather impatient “Come in!” we opened the door,\nwe were astonished to see the Doctor-in-Law in his dressing-gown and\nslippers, in busy consultation with Oom Hi, the Kangaroo, and the\nCockatoo.\n\n“I’ve been greatly interested in hearing of the success of ‘Wallypug’s\nBlush,’” said the little man, “and am just helping Oom Hi (ahem, for a\nconsideration) to draw up a prospectus for turning it into a Limited\nCompany. In consideration of the payment to me of several thousands\nof pounds, I am about to become a director, and am to be paid several\nthousands more for persuading the Cockatoo to join the board too.”\n\n[We were astonished to see the Doctor-in-Law in his\ndressing-gown and slippers, in busy consultation with Oom-Hi, the\nKangaroo, and the Cockatoo.—Page 184.\n  _Wallypugland._]\n\n“But,” I objected, “what do you claim that ‘Wallypug’s Blush’ does?”\n\n“Oh, it restores people with blue complexions to their natural color,\nyou know.”\n\n“But surely there will be a very limited sale,” I said; “there cannot\nbe very many people with blue faces, you know.”\n\n“Oh, _of course_, you must try and spoil everything with your absurd\nobjections,” said the Cockatoo crossly.\n\n“Yes, I really don’t see that your contention has much weight,” said\nthe Doctor-in-Law. “Provided it is only advertised enough, the public\nwill buy _any_ rubbish, whether it does what it professes to do or not.\nAnd we shall simply call it ‘Wallypug’s Blush _for the complexion_,’\nyou know; besides, even if it doesn’t answer, we can turn it into\nsomething else, Boot Polish or Hair Wash, you know.”\n\nAnd so seeing them so busily and enthusiastically engaged in the\nbusiness of drawing up the prospectus, we said good-night and retired\nto our rooms.\n\n\n\n\nCHAPTER XVI. “AU REVOIR.”\n\n\nTHE next morning all was excitement at the palace. The news of our\nreturn had spread abroad, and in the morning copy of the _Daily Whyer_,\nwhich his Majesty found on the breakfast-table when we went down, a\nfull and, I must say, surprisingly accurate account of the interview\nappeared, together with the information that his Majesty would attend\nParliament in state in the afternoon, and that an address from the\nthrone would be read, in which certain changes in the Government would\nbe suggested. There was also a paragraph about A. Fish, Esquire’s,\nlecture upon the “Unreasonableness of ability,” which the editor\nadvised everybody to try and hear.\n\nHis Majesty was in quite a fluster, and we spent several hours in\npreparing an elaborate written speech which he was to read out in\nthe afternoon; and then, having settled this and other matters to\nour satisfaction, we took Kis-Smee out for a little walk just before\nluncheon.\n\nOne of the first persons we met was the Crocodile at the Lodge. He\nlooked once or twice at his Majesty, as if in doubt, and then at\nKis-Smee.\n\nOn seeing the latter his eyes sparkled, and he came up and spoke at\nonce.\n\n“Hullo, Wallypug!” he began unceremoniously.\n\nHis Majesty bowed, a little distantly I thought.\n\n“_What_ a fine fat dog!” exclaimed the Crocodile, pointing to Kis-Smee.\n“Is he for sale?”\n\n“Certainly not,” said the Wallypug.\n\nThe Crocodile sighed. “Just my luck,” he remarked, “I love dogs and I\nshould so enjoy taking this one home to tea with me. Perhaps you will\nlet him visit me sometimes. What’s his name?”\n\n[“OH! REALLY, WALLYPUG, THIS IS SO SUDDEN.”]\n\n“Kis-Smee,” said his Majesty.\n\n“Oh! really Wallypug, this is so sudden,” said the Crocodile, smirking,\n“I’d no idea you were so affectionate. I’m so bashful, too. I couldn’t\nreally think of kissing you in public.”\n\n“No, no!” explained his Majesty hastily—“Kis-Smee is the dog’s name;\nyou asked me what his name was, you know.”\n\n“Oh!” said the Crocodile, looking greatly disappointed. “I\nmisunderstood you. Very sorry, I’m sure. Well, what are you going to do\nnow?”\n\nHis Majesty told him of the meeting in the afternoon, and the Crocodile\npromised to come.\n\n“That is,” he added, “if I may bring my invalid with me.”\n\n“Who is that?” asked the Wallypug.\n\n“Oh! a very feeble old joke I’ve got staying with me,” said the\nCrocodile. “I could bring him in the perambulator, you know—the one I\nused to wheel the weak cup of tea about in—he’s such a nice old man.”\n\n“What is he, did you say?” asked his Majesty.\n\n“An old joke,” repeated the Crocodile, “his name is Joe Miller, and\nhe eats nothing but chestnuts, and even they have to be very ancient\nbefore he can digest them. Oh! he’s a character, I can tell you. Make\nyou die of laughing the _first_ time you meet him; but as he always\nsays the same thing over and over again—for hours and hours, he is\nrather trying at times. However, I will bring him along, and you can\njudge for yourself.”\n\nWe left the Crocodile then and went back to luncheon—after which we\nset out for the House of Words.\n\nWe found that quite a lot of Creatures were waiting in the lobby for\nthe doors to open.\n\nThere was the Doctor-in-Law, telling a funny story to the Pig,\nfor which he afterwards made a charge of one pound nineteen and\nelevenpence, describing it as _Professional Attendance_—and wording\nthe bill as follows:\n\n  To One pig, one guinea (guinea-pig),   £1  1  0\n  “Laugh and grow fat,” one joke,         0  6  8\n                                         ————————\n                                         £1 19 11\n\nAnd to the Mole, who happened to overhear the joke, he made another\ncharge; but the Mole got out of paying for it on the plea that he\n_couldn’t see it_; but whether he meant the bill or the joke I could\nnever find out, Moles are notoriously blind.\n\nOom-Hi was there and the Turtle too, and A. Fish, Esq., listened,\nopen-mouthed, while they discussed the state of affairs.\n\nThe Cockatoo, irrepressible as ever, held forth on the subject of\nSocialism to an interested audience, consisting of the Crocodile\nand the Rabbit. While the Crow filled in a few spare moments by\ninterviewing the Pelican. The Creatures stood aside very politely to\nallow his Majesty and myself to enter, Kis-Smee growling ominously at\nthe Cockatoo, who screamed, “Down with domestic animals,” as he passed.\nThis remark of hers gave offense to the Pig also, who demanded to know\nif she was referring to him.\n\n[Oom-Hi was there and the Turtle too, and A. Fish,\nEsq., listened, open-mouthed, while they discussed the state of\naffairs.—Page 192.\n  _Wallypugland._]\n\n“Of course not,” replied the Cockatoo; “you’re not a domestic animal,\nare you?”\n\n“Sure an I am that same in me own counthry,” said the Pig, who was\nevidently of Irish descent.\n\n“Och down with the dirthy landlords thin,” screamed the Cockatoo, which\ncaused the Pig to laugh and put him in a good temper again.\n\n“I couldn’t bring the old joke along after all,” whispered the\nCrocodile to me, as we squeezed through the door; “he is more feeble\nthan ever.” “How’s Kis-Smee?”\n\n“Quite well, I think, thank you,” I replied.\n\n“Isn’t he delightfully fat,” whispered the Crocodile, smacking his\nlips. “About three nice large mouthfuls, I should say,” he concluded\nmysteriously, winking one eye at me.\n\nI haven’t the remotest idea what he meant, and besides I hadn’t time to\nthink about it then, for the meeting was about to commence.\n\nWe all found seats, and A. Fish, Esq., being called upon to\nopen the proceedings, he commenced his learned treatise upon the\n“Unreasonableness of Misunderstandability.”\n\nWhat it was all about I haven’t the remotest idea, for what with his\nextraordinary way of talking, and the continual interruptions of the\nanimals, who would keep shouting, “Hear! hear!” “Question!” “Withdraw!”\n“Order! order!” etc., at all kinds of odd moments, I could not hear\na word that was being said. Moreover, the hall was unaccountably hot\nand stuffy, and for some time I had the greatest difficulty in keeping\nawake; and at last my head sank down and I dozed off, awaking at\nintervals when the Cockatoo was unusually energetic; but at last even\nher voice was silenced, and I remember no more till I awoke with a\nstart, and found myself, to my great dismay, back again in my own study\nin London.\n\nI have addressed several letters to “His Majesty the Wallypug, The\nRoyal Palace, Why,” as I am very anxious to know how affairs are going\non there; but I am sorry to say they have always been returned through\nthe post, marked in blue pencil, “_Not known. Insufficient address._”\n\n[RETURNED THROUGH THE POST.]\n\n\n\n\nTHE BLUE DWARFS:\n\nAN ADVENTURE IN THURINGEN.\n\n  “And then on the top of the Caldon Low\n  There was no one left but me.”\n\n  MARY HOWITT.\n\n\n“I LIKED the blue dwarfs the best—far, far the best of anything,” said\nOlive.\n\n“‘The blue dwarfs!’” repeated Rex. “What _do_ you mean? Why can’t you\nsay what you mean plainly? Girls have such a stupid way of talking!”\n\n“What can be plainer than _the blue dwarfs_?” said Olive rather\nsnappishly, though, it must be allowed, with some reason. “We were\ntalking about the things we liked best at the china place. _You_ said\nthe stags’ heads and the inkstands, and _I_ say the blue dwarfs.”\n\n“But I didn’t see any dwarfs,” persisted Rex.\n\n“Well, I can’t help it if you didn’t. You had just as much chance of\nseeing them as I had. They were in a corner by themselves—little\nfigures about two inches high, all with blue coats on. There were about\ntwelve of them, all different, but all little dwarfs or gnomes. One was\nsitting on a barrel, one was turning head-over-heels, one was cuddling\nhis knees—all funny ways like that. Oh, they were lovely!”\n\n“I wish I had seen them better,” said Rex regretfully. “I do remember\nseeing a tray full of little blue-looking dolls, but I didn’t notice\nwhat they were.”\n\nOlive did not at once answer. Her eyes were fixed on something she\nsaw passing before the window. It was a very, very little man. He was\nnot exactly humpbacked, but his figure was somewhat deformed, and he\nwas so small that but for the sight of his rather wizened old face\none could hardly have believed he was a full-grown man. His eyes were\nbright and beady-looking, like those of a good-natured little weasel,\nif there be such a thing, and his face lighted up with a smile as he\ncaught sight of the two, to him, strange-looking children at the open\nwindow of the little village inn.\n\n“Guten Tag,” he said, nodding to them; and “Guten Tag,” replied the\nchildren, as they had learnt to do by this time to everybody they met.\nFor in these remote villages it would be thought the greatest breach of\ncourtesy to pass any one without this friendly greeting.\n\nRex drew a long breath when the dwarf had passed.\n\n“Olive——” he began, but Olive interrupted him.\n\n“Rex,” she said eagerly, “that’s _exactly_ like them—like the blue\ndwarfs, I mean. Only, of course, their faces were prettier—nice\nlittle china faces, rather crumply looking, but quite nice; and then\ntheir coats were such a pretty nice blue. I think,” she went on\nconsideringly—“I think if I had that little man and washed his face\n_very_ well, and got him a bright blue coat, he would look just like\none of the blue dwarfs grown big.”\n\nRex looked at Olive with a queer expression.\n\n“Olive,” he said in rather an awe-struck tone; “Olive, do you think\nperhaps they’re _real_? Do you think perhaps somewhere in this\ncountry—in those queer dark woods, perhaps—that there are real blue\ndwarfs, and that somebody must have seen them and made the little china\nones like them? Perhaps,” and his voice dropped and grew still more\nsolemn; “_perhaps_, Olive, that little man’s one of them, and they may\nhave to take off their blue coats when they’re walking about. Do you\nknow, I think it’s a little, just a very little frightening? Don’t you,\nOlive?”\n\n“No, of course I don’t,” said Olive, and, to do her justice, her rather\nsharp answer was meant as much to reassure her little brother as to\nexpress any feeling of impatience. Rex was quite a little fellow, only\neight, and Olive, who was nearly twelve, remembered that when she was\nas little as that, she used sometimes to feel frightened about things\nwhich she now couldn’t see anything the least frightening in. And she\nremembered how once or twice some of her big cousins had laughed at\nher, and amused themselves by telling her all sorts of nonsense, which\nstill seemed terrible to her when she was alone in her room in the dark\nat night. “Of course there’s nothing frightening in it,” she said. “It\nwould be rather a funny idea, I think. Of course it can’t be, you know,\nRex. There are no dwarfs, and gnomes, and fairies now.”\n\n“But that little man was a dwarf,” said Rex.\n\n“Yes, but a dwarf needn’t be a fairy sort of person,” explained Olive.\n“He’s just a common little man, only he’s never grown as big as other\npeople. Perhaps he had a bad fall when he was a baby—that might stop\nhis growing.”\n\n“Would it?” said Rex. “I didn’t know that. I hope I hadn’t a bad fall\nwhen I was a baby. Everybody says I’m very small for my age.” And Rex\nlooked with concern at his short but sturdy legs.\n\nOlive laughed outright.\n\n“Oh, Rex, what a funny boy you are! No, certainly, you are not a dwarf.\nYou’re as straight and strong as you can be.”\n\n“Well, but,” said Rex, returning to the first subject, “I do think it’s\nvery queer about that little dwarf man coming up the street just as\nyou were telling me about the blue dwarfs. And he _did_ look at us in\na funny way, Olive, whatever you say, just as if he had heard what we\nwere talking about.”\n\n“All the people look at us in a funny way here,” said Olive. “We must\nlook very queer to them. Your sailor suit, Rex, and my ‘Bolero’ hat\nmust look to them quite as queer as the women’s purple skirts, with\nbright green aprons, look to us.”\n\n“Or the bullock-carts,” said Rex. “Do you remember how queer we\nthought them at first? _Now_ we’ve got quite used to seeing queer\nthings, haven’t we, Olive? Oh! now do look there—at the top of the\nstreet—there, Olive, did you ever see such a load as that woman is\ncarrying in the basket on her back? Why, it’s as big as a house!”\n\nHe seemed to have forgotten about the dwarfs, and Olive was rather glad\nof it. These two children were traveling with their uncle and aunt in\na rather out-of-the-way part of Germany. Out-of-the-way, that is to\nsay, to most of the regular summer tourists from other countries,\nwho prefer going where they are more sure of finding the comforts\nand luxuries they are accustomed to at home. But it was by no means\nout-of-the-way in the sense of being dull or deserted. It is a very\nbusy part of the world indeed. You would be amazed if I were to tell\nyou some of the beautiful things that are made in these bare homely\nlittle German cottages. For all about in the neighborhood there are\ngreat manufactories and warehouses for china and glass, and many other\nthings; and some parts of the work are done by the people at home in\ntheir own houses. The morning of the day of which I am telling you\nhad been spent by the children and their friends in visiting a very\nlarge china manufactory, and their heads were full of the pretty and\nwonderful things they had seen.\n\nAnd now they were waiting in the best parlor of the village inn while\ntheir uncle arranged about a carriage to take them all on to the small\ntown where they were to stay a few days. Their aunt was tired, and was\nresting a little on the sofa, and they had planted themselves on the\nbroad window-sill, and were looking out with amusement at all that\npassed.\n\n“What have you been chattering about all this time?” said their aunt,\nsuddenly looking up. “I think I must have been asleep a little, but I\nhave heard your voices going on like two birds twittering.”\n\n“Have we disturbed you, Auntie?” asked Olive, with concern.\n\n“Oh no, not a bit; but come here and tell me what you have been talking\nabout.”\n\nInstantly Rex’s mind went back to the dwarfs.\n\n“Auntie,” he said seriously, “perhaps you can tell me better than Olive\ncan. Are there really countries of dwarfs, and are they a kind of\nfairies, Auntie?”\n\nAuntie looked rather puzzled.\n\n“Dwarfs, Rex?” she said; “countries of dwarfs! How do you mean?”\n\nOlive hastened to explain. Auntie was very much amused.\n\n“Certainly,” she said, “we have already seen so many strange things in\nour travels that it is better not to be too sure what we may not see.\nBut any way, Rex, you may be quite easy in your mind, that if ever you\ncome across any of the dwarfs, you will find them very good-natured and\namiable, only you must be very respectful—always say ‘Sir,’ or ‘My\nlord,’ or something like that to them, and bow a great deal. And you\nmust never seem to think anything they do the least odd, not even if\nthey propose to you to walk on your head, or to eat roast fir-cones for\ndinner, for instance.”\n\nAuntie was quite young—not so very much older than Olive—and very\nmerry. Olive’s rather “grown-up” tones and manners used sometimes to\ntempt her to make fun of the little girl, which, to tell the truth,\nOlive did not always take quite in good part. And it must for Olive\nbe allowed, that Auntie did sometimes allow her spirits and love of\nfun to run away with her a little too far, just like pretty unruly\nponies, excited by the fresh air and sunshine, who toss their heads and\ngallop off. It is great fun at first and very nice to see, but one is\nsometimes afraid they may do some mischief on the way—without meaning\nit, of course; and, besides, it is not always so easy to pull them up\nas it was to start them.\n\nJust as Auntie finished speaking the door opened and their uncle came\nin. He was Auntie’s elder brother—a good deal older—and very kind\nand sensible. At once all thoughts of the dwarfs or what Auntie had\nbeen saying danced out of Rex’s curly head. Like a true boy he flew\noff to his uncle, besieging him with questions as to what sort of a\ncarriage they were to go on in—_was_ it an ox-cart; oh, mightn’t they\n_for once_ go in an ox-cart? and might he—oh, might he sit beside the\ndriver in front?\n\nHis uncle laughed and replied to his questions, but Olive stayed beside\nthe sofa, staring gravely at her aunt.\n\n“Auntie,” she said, “you’re not _in earnest_, are you, about there\nbeing really a country of dwarfs?”\n\nOlive was twelve. Perhaps you will think her very silly to have\nimagined for a moment that her aunt’s joke could be anything but a\njoke, especially as she had been so sensible about not letting Rex get\nanything into his head which could frighten him. But I am not sure that\nshe was so very silly after all. She had read in her geography about\nthe Lapps and Finns, the tiny little men of the north, whom one might\nvery well describe as dwarfs; there might be dwarfs in these strange\nThüringian forests, which were little spoken of in geography books;\nAuntie knew more of such things than she did, for she had traveled in\nthis country before. Then with her own eyes Olive had seen a dwarf, and\nthough she had said to Rex that he was just an odd dwarf by himself as\nit were, not one of a race, how could she tell but what he might be\none of a number of such queer little people? And even the blue dwarfs\nthemselves—the little figures in the china manufactory—rather went to\nprove it than not.\n\n“They may have taken the idea of dwarfs from the real ones, as Rex\nsaid,” thought Olive. “Any way I shall look well about me if we go\nthrough any of these forests again. They must live in the forests, for\nAuntie said they eat roast fir-cones for dinner.”\n\nAll these thoughts were crowding through her mind as she stared up into\nAuntie’s face and asked solemnly—\n\n“Auntie, were you in earnest?”\n\nAuntie’s blue eyes sparkled.\n\n“In earnest, Olive?” she said. “Of course! Why shouldn’t I be in\nearnest? But come, quick, we must get our things together. Your uncle\nmust have got a carriage.”\n\n“Yes,” said he, “I have. _Not_ an ox-cart, Rex. I’m sorry for your\nsake, but for no one else’s; for I don’t think there would be much\nleft of us by the end of the journey if we were to be jogged along the\nforest roads in an ox-cart. No! I have got quite a respectable vehicle;\nbut we must stop an hour or two on the way, to rest the horses and give\nthem a feed, otherwise we could not get through to-night.”\n\n“Where shall we stop?” said Auntie, as with the bundles of shawls and\nbags they followed the children’s uncle to the door.\n\n“There is a little place in the forest, where they can look after the\nhorses,” said he; “and I daresay we can get some coffee there for\nourselves, if we want it. It is a pretty little nook. I remember it\nlong ago, and I shall be glad to see it again.”\n\nOlive had pricked up her ears. “A little place in the forest!” she said\nto herself; “that may be near where the dwarfs live: it is most likely\nnot far from here, because of the one we saw.” She would have liked to\nask her uncle about it, but something in the look of her aunt’s eyes\nkept her from doing so.\n\n“Perhaps she _was_ joking,” thought Olive to herself. “But perhaps she\ndoesn’t know; _she_ didn’t see the real dwarf. It would be rather nice\nif I did find them, _then_ Auntie couldn’t laugh at me any more.”\n\nThey were soon comfortably settled in the carriage, and set off. The\nfirst part of the drive was not particularly interesting; and it was so\nhot, though already afternoon, that they were all—Olive especially,\nyou may be sure—delighted to exchange the open country for the\npleasant shade of a grand pine forest, through which their road now lay.\n\n“Is it a very large forest, Uncle?” said Olive.\n\n“Yes, very large,” he replied rather sleepily, to tell the truth: for\nboth he and Auntie had been nodding a little, and Rex had once or twice\nbeen fairly asleep. But Olive’s imagination was far too hard at work to\nlet her sleep.\n\n“The largest in Europe?” she went on, without giving much thought to\npoor Uncle’s sleepiness.\n\n“Oh yes, by far,” he replied, for he had not heard clearly what she\nsaid, and fancied it was “the largest hereabouts.”\n\n“Dear me!” thought Olive, looking round her with awe and satisfaction.\n“If there are dwarfs anywhere, then it must be here.”\n\nAnd she was just beginning another. “And please, Uncle, is——?” when\nher aunt looked up and said lazily—\n\n“Oh, my dear child, do be quiet! Can’t you go to sleep yourself a\nlittle! We shall have more than enough of the forest before we are out\nof it?” Which offended Olive so much that she relapsed into silence.\n\nAuntie was a truer prophet than she knew; for when they got to the\nlittle hamlet in the wood, where they were to rest, something proved to\nbe wrong with one of the horse’s shoes; _so_ wrong, indeed, that after\na prolonged examination, at which all the inhabitants turned out to\nassist, it was decided that the horse must be re-shod before he could\ngo any farther; and this made it impossible for the party who had come\nin the carriage to go any farther either. For the nearest smithy was\ntwo miles off; the horse must be led there and back by the driver,\nwhich would take at least two, if not three, hours. It was now past\nsix, and they had come barely half way. The driver shook his head, and\nsaid he would not like to go on to the town till morning. The horse\nhad pricked his foot; it might cause inflammation to drive him farther\nwithout a rest, and the carriage was far too heavy for the other horse\nalone, which had suddenly struck the children’s uncle as a brilliant\nidea.\n\n“There would be no difficulty about the harnessing, any way,” he said\nto Auntie, laughing; “for all the vehicles hereabouts drawn by one\nhorse have the animal at one side of a pole, instead of between shafts.”\n\nBut Auntie thought it better to give in.\n\n“It really doesn’t much matter,” she said; “we can stay here well\nenough. There are two bedrooms, and no doubt they can give us something\nto eat; beer and sausages, and brown bread any way.”\n\nAnd so it was settled greatly to Olive’s satisfaction; it would give\nher capital opportunities for a dwarf hunt! though as to this she kept\nher own counsel.\n\nThe landlady of the little post-house where they had stopped was\naccustomed to occasional visits of this kind from benighted or\ndistressed travelers. She thought nothing of turning her two daughters\nout of their bedroom, which, it must be owned, was very clean, for\nAuntie and Olive, and a second room on the ground-floor was prepared\nfor Rex and his uncle. She had coffee ready in five minutes, and\npromised them a comfortable supper before bedtime. Altogether,\neverything seemed very satisfactory, and when they felt a little\nrefreshed, Auntie proposed a walk—“a good long walk,” she said, “would\ndo us good. And the landlady says we get out of the forest up there\nbehind the house, where the ground rises, and that there is a lovely\nview. It will be rather a climb, but it isn’t more than three quarters\nof an hour from here, and we have not walked all day.”\n\nUncle thought it a good idea, and Rex was ready to start at once; but\nOlive looked less pleased.\n\n“Don’t you want to come, Olive?” said Auntie. “Are you tired? You\ndidn’t take a nap like the rest of us.”\n\n“I am a little tired,” said Olive, which was true in one sense, though\nnot in another, for she was quite fit for a walk. It struck her that\nher excuse was not quite an honest one, so she added, “If you don’t\nmind, I would rather stay about here. I don’t mind being alone, and I\nhave my book. And I do so like the forest.”\n\n“Very well,” said her uncle; “only don’t lose yourself. She is\nperfectly safe,” he added, turning to her aunt; “there are neither\nwolves, nor bears, nor robbers nowadays, in these peaceful forests.”\n\nSo the three set off, leaving Olive to her own devices. She waited till\nthey were out of sight, then she made her preparations.\n\n“I’d better take my purse,” she said to herself, “in case I meet the\ndwarfs. Auntie told me to be very polite, and perhaps they would like\nsome of these tiny pieces; they just look as if they were meant for\nthem.” So she chose out a few one-pfennig copper coins, which are much\nsmaller than our farthings, and one or two silver pieces, worth about\ntwopence-halfpenny each, still smaller. Then she put in her pocket half\na slice of the brown bread they had had with their coffee, and arming\nherself, more for appearance’-sake than anything else, with her parasol\nand the book she had with her in her traveling bag, she set off on her\nsolitary ramble.\n\nIt was still hot—though the forest trees made a pleasant shade. Olive\nwalked some way, farther and farther, as far as she could make out,\ninto the heart of the forest, but in her inexperience she took no\nsort of care to notice the way she went, or to make for herself any\nkind of landmarks. She just wandered on and on, tempted first by some\nmysterious little path, and then by another, her mind full of the\nidea of the discoveries she was perhaps about to make. Now and then a\nsquirrel darted across from one tree to another, disappearing among the\nbranches almost before Olive could be sure she had seen it, or some\nwild wood birds, less familiar to the little foreigner, would startle\nher with a shrill, strange note. There were here and there lovely\nflowers growing among the moss, and more than once she heard the sound\nof not far off trickling water. It was all strangely beautiful, and she\nwould greatly have enjoyed and admired it had not her mind been so full\nof the queer fascinating idea of the blue dwarfs.\n\nAt last—she had wandered about for some time—Olive began to feel\ntired.\n\n“I may as well sit down a little,” she thought; “I have lots of time\nto get back. This seems the very heart of the forest. They are just as\nlikely to be seen here as anywhere else.”\n\nSo Olive ensconced herself in a comfortable corner, her back against\nthe root of a tree, which seemed hollowed out on purpose to serve as\nan armchair. She thought at first she would read a little, but the\nlight was already slightly waning, and the tree shadows made it still\nfainter. Besides, Olive had plenty to think of—she did not require any\namusement. Queer little noises now and then made themselves heard—once\nor twice it really sounded as if small feet were pattering along, or as\nif shrill little voices were laughing in the distance; and with each\nsound, Olive’s heart beat faster with excitement—not with fear.\n\n“If I sit very still,” she thought, “who knows what I may see? Of\ncourse, it would be much nicer and prettier if the dwarfs were quite\ntiny—not like the little man we saw in the street at that place—I\nforget the name—for he was not pretty at all—but like the blue dwarfs\nat the manufactory. But that, I suppose, is impossible, for they would\nbe really like fairies. But they might be something between: not so big\nas the little man, and yet bigger than the blue dwarfs.”\n\nAnd then Olive grew a little confused in trying to settle in her mind\nhow big, or how small rather, it was possible or impossible for a\nnation of dwarfs to be. She thought it over till she hardly seemed\nsure what she was trying to decide. She kept saying to herself, “Any\nway, they could not but be a good deal bigger than my thumb! What does\nthat mean? Perhaps it means more in German measures than in English,\nperhaps——”\n\nBut what was that that suddenly hit her on the nose! Olive looked up, a\nvery little inclined to be offended; it is not a pleasant thing to be\nhit on the nose; could it be Rex come behind her suddenly, and playing\nher a trick? Just as she was thinking this, a second smart tap on the\nnose startled her still more, and this time there was no mistake about\nit; it came from above, and it was a fir-cone! Had it come of itself?\nSomehow the words, “Roast fir-cones for dinner,” kept running in her\nhead, and she took up the fir-cone in her fingers to examine it, but\nquickly dropped it again, for it was as hot as a coal.\n\n“It has a very roasty smell,” thought Olive; “where can it have come\nfrom?”\n\nAnd hardly had she asked herself the question, when a sudden noise all\nround her made her again look up. They were sliding down the branches\nof the tree in all directions. At first, to her dazzled eyes, they\nseemed a whole army, but as they touched the ground one by one, and\nshe was able to distinguish them better, she saw that after all there\nwere not so _very_ many. One, two, three, she began quickly counting\nto herself, not aloud, of course—that would not have been polite—one,\ntwo, three, up to twelve, then thirteen, fourteen and so on up to—yes,\nthere were just twenty-four of them.\n\n“Two of each,” said Olive to herself; “a double set of the blue dwarfs.”\n\nFor they were the blue dwarfs, and no mistake! Two of each, as Olive\nhad seen at once. And immediately they settled themselves in twos—two\nsquatted on the ground embracing their knees, two strode across a\nbarrel which they had somehow or other brought with them, two began\nturning head-over-heels, two knelt down with their heads and queer\nlittle grinning faces looking over their shoulders, twos and twos of\nthem in every funny position you could imagine, all arranged on the\nmossy ground in front of where Olive sat, and all dressed in the same\nbright blue coats as the toy dwarfs at the china manufactory.\n\nOlive sat still and looked at them. Somehow she did not feel surprised.\n\n“How big are they?” she said to herself. “Bigger than my thumb? Oh yes,\na good deal. I should think they are about as tall as my arm would be\nif it was standing on the ground. I should think they would come up\nabove my knee. I should like to stand up and measure, but perhaps it is\nbetter for me not to speak to them till they speak to me.”\n\nShe had not long to wait. In another moment two little blue figures\nseparated themselves from the crowd, and made their way up to her. But\nwhen they were close to her feet they gave a sudden jump in the air,\nand came down, not on their feet, but on their heads! And then again\nsome of her aunt’s words came back to her, “If they should ask you to\nstand on your head, for instance.”\n\n“Dear me,” thought Olive, “how did Auntie know so much about them? But\nI do hope they won’t ask me to stand on _my_ head.”\n\nHer fears were somewhat relieved when the dwarfs gave another spring\nand came down this time in a respectable manner on their feet. Then,\nwith a good many bows and flourishes, they began a speech.\n\n“We are afraid,” said the first.\n\n“That the fir-cones,” said the second.\n\n“Were rather underdone,” finished up the first.\n\nOlive really did not know what to say. She was dreadfully afraid that\nit would seem so very rude of her not even to have _tasted_ the cones.\nBut naturally she had not had the slightest idea that they had been\nintended for her to eat.\n\n“I am very sorry,” she said, “Mr.——, sir! my lord! I beg your pardon.\nI don’t quite know what I should call you.”\n\n“With all respect,” said the first.\n\n“And considering the circumstances,” went on the second.\n\nThen just as Olive supposed they were going to tell her their names,\nthey stopped short and looked at her.\n\n“I beg your pardon,” she began again, after waiting a minute or two to\nsee if they had nothing else to say; “I don’t quite understand.”\n\n“Nor do we,” they replied promptly, speaking for the first time both\ntogether.\n\n“Do you mean you don’t know what _my_ name is?” said she. “It’s Olive,\n_Olive_” for the dwarfs stood staring as if they had not heard her.\n“OLIVE!” she repeated for the third time.\n\n“Green?” asked the first.\n\n“No!” said Olive. “Of course not! _Green_ is a very common name—at\nleast——”\n\n“But you called us ‘blue,’” said the second; and it really was a relief\nto hear him finish a sentence comfortably by himself, only Olive felt\nvery puzzled by what he said.\n\n“How do you know?” she said. “How could you tell I called you the blue\ndwarfs?” and then another thought suddenly struck her. How very odd\nit was that the dwarf spoke such good English! “I thought you were\nGerman,” she said.\n\n“How very amusing!” said the dwarfs, this time again speaking together.\n\nOlive could not see that it was very amusing, but she was afraid of\nsaying so, for fear it should be rude.\n\n“And about the fir-cones,” went on the first dwarf. “It is distressing\nto think they were so underdone. But we have come, all of us,” waving\nhis hand in the direction of the others, “to invite you to supper in\nour village. There you will find them done to perfection.”\n\nOlive felt more and more uncomfortable.\n\n“You are very kind,” she said. “I should like to come very much if it\nisn’t too far; but I am afraid I couldn’t eat any supper. Indeed, I’m\nnot hungry.” And then a bright thought struck her. “See here,” she went\non, drawing the half slice of bread out of her pocket, “I had to put\nthis in my pocket, for I couldn’t finish it at our afternoon coffee.”\n\nThe two dwarfs came close and examined the piece of bread with the\ngreatest attention. They pinched and smelt it, and one of them put out\nhis queer little pointed tongue and licked it.\n\n“Not good!” he said, looking up at Olive and rolling about his eyes in\na very queer way.\n\n“I don’t know,” said Olive; “I don’t think it can be bad. It is the\nregular bread of the country. I should have thought you would be\naccustomed to it, as you live here.”\n\nThe two dwarfs took no notice of what she said, but suddenly turned\nround, and standing with their backs to Olive called out shrilly,\n“Gueton Tag.” Immediately all the other dwarfs replied in the same\ntone and the same words, and to Olive’s great surprise they all began\nto move towards her, but without altering their attitudes—those on\nthe barrel rolled towards her without getting off it; the two who were\nhugging their knees continued to hug them, while they came on by means\nof jerking themselves; the turning head-over-heels ones span along like\nwheels, and so on till the whole assemblage were at her feet. Then she\nsaw unfolded before her, hanging on the branches of the tree, a large\nmantle, just the shape of her aunt’s travelling dust-cloak, which she\nalways spread over Olive in a carriage, only, instead of being drab\nor fawn-colored, it was, like the dwarfs’ jackets, bright blue. And\nwithout any one telling her, Olive seemed to know of herself that she\nwas to put it on.\n\nShe got up and reached the cloak easily; it seemed to put itself on,\nand Olive felt very happy and triumphant as she said to herself, “Now\nI’m really going to have some adventures.”\n\nThe dwarfs marched—no! one cannot call it marching, for they had about\na dozen different ways of proceeding—they moved on, and Olive in the\nmiddle, her blue cloak floating majestically on her shoulders. No one\nspoke a word. It grew darker and darker among the trees, but Olive\ndid not feel frightened. On they went, till at last she saw twinkling\nbefore them a very small but bright blue light. It looked scarcely\nlarger than the lamp of a glow-worm, but it shone out very distinct in\nthe darkness. Immediately they saw it the dwarfs set up a shout, and\nas it died away, to Olive’s surprise, they began to sing. And what do\nyou think they sang? Olive at first could hardly believe her ears as\nthey listened to the thoroughly English song of “Home, sweet Home.”\nAnd the queerest thing was that they sang it very prettily, and that\nit sounded exactly like her aunt’s voice! And though they were walking\nclose beside her, their voices when they left off singing did not so\nmuch seem to stop as to move off, to die away into the distance, which\nstruck Olive as very odd.\n\nThey had now arrived at the trunk of a large tree, half way up which\nhung the little lamp—at least Olive supposed it must be a lamp—from\nwhich came the bright blue light.\n\n“Here we are,” said one of the dwarfs, she did not see which, “at the\nentrance to our village.” And thereupon all the dwarfs began climbing\nup the tree, swarming about it like a hive of bees, till they got some\nway up, when one after another they suddenly disappeared. Olive could\nsee all they did by the blue light. She was beginning to wonder if she\nwould be left standing there alone, when a shout made her look up, and\nshe saw two dwarfs standing on a branch holding a rope ladder, which\nthey had just thrown down, and making signs to her to mount up by it.\nIt was quite easy; up went Olive, step by step, and when she reached\nthe place where the two dwarfs were standing, she saw how it was that\nthey had all disappeared. The tree trunk was hollow, and there were\nsteps cut in it like a stair, down which the dwarfs signed to her that\nshe was to go. She did not need to be twice told, so eager was she to\nsee what was to come. The stair was rather difficult for her to get\ndown without falling, for the steps were too small, being intended for\nthe dwarfs, but Olive managed pretty well, only slipping now and then.\nThe stair seemed very long, and as she went farther it grew darker,\ntill at last it was quite dark; by which time, fortunately, however,\nshe felt herself again on level ground, and after waiting half a minute\na door seemed to open, and she found herself standing outside the tree\nstair, with the prettiest sight before her eyes that she had ever seen\nor even imagined.\n\nIt was the dwarf village! Rows and rows of tiny houses—none of them\nmore than about twice as high as Olive herself, for that was quite big\nenough for a dwarf cottage, each with a sweet little garden in front,\nlike what one sees in English villages, though the houses themselves\nwere like Swiss châlets. It was not dark down here, there was a soft\nlight about as bright as we have it at summer twilight; and besides\nthis each little house had a twinkling blue light hanging above the\nfront door, like a sign-post. And at the door of each cottage stood\none of the dwarfs, with a little dwarf wife beside him; only, instead\nof blue, each little woman was dressed in brown, so that they were\nrather less showy than their husbands. They all began bowing as Olive\nappeared, and all the little women curtseying, and Olive seemed to\nunderstand, without being told, that she was to walk up the village\nstreet to see all there was to be seen. So on she marched, her blue\ncloak floating about her, so that sometimes it reached the roofs of the\nhouses on each side at the same time.\n\nOlive felt herself rather clumsy. Her feet, which in general she was\naccustomed to consider rather neat, and by no means too large for her\nage, seemed such great awkward things. If she had put one of them in at\nthe window of a dwarf house, it would have knocked everything out of\nits place.\n\n“Dear me!” thought Olive, “I had no idea _I_ could seem clumsy! I feel\nlike a great plowman. I wish I were not so big.”\n\n“Yes,” said a voice beside her, “it has its disadvantages;” and\nOlive, looking down to see who spoke—she had to look down for\neverything—caught sight of one of the two dwarfs with whom she had\nfirst spoken. She felt a little ruffled. She did not like this trick\nof the dwarf hearing what she thought before she said it.\n\n“Everything has its disadvantages,” she replied. “Don’t you find\nyourself very inconveniently small when you are up in _our_ world?”\n\n“Exactly so,” said the dwarf; but he did not seem the least put out.\n\n“They are certainly very good-tempered,” said Olive to herself. Then\nsuddenly a thought struck her.\n\n“Your village is very neat and pretty,” she said; “though, perhaps—I\ndon’t mean to be rude, not on any account——”\n\n“No,” interrupted the dwarf; “Auntie told you on no account to be rude.”\n\n“Auntie!” repeated Olive, in astonishment; “she is not _your_ auntie!”\n\n“On no account,” said the dwarf, in the same calm tone, but without\nseeming to take in that Olive meant to reprove him.\n\n“It’s no use trying to make them understand,” said Olive to herself.\n\n“Not the least,” said the dwarf; at which Olive felt so provoked that\nshe could have stamped her feet with irritation. But as _thinking_\ncrossly seemed in this country to be quite as bad as _speaking_\ncrossly, she had to try to swallow down her vexation as well as she\ncould.\n\n“I was going to say,” she went on quietly, “that to my taste the\nvillage would be prettier if there was a little variety. Not all the\nhouses just the same, you know. And all of _you_ are so like each\nother, and all your little brown wives too. Are there no _children_\ndwarfs?”\n\n“Doubtless. Any quantity,” was the answer.\n\n“Then where are they all?” said Olive. “Are they all asleep?” She put\nthe last question rather sarcastically, but the sarcasm seemed to be\nlost on the little man.\n\n“Yes, all asleep,” he replied; “all asleep, and dreaming. Children\nare very fond of dreaming,” he went on, looking up at Olive with such\na queer expression, and such a queer tone in his voice too, that\nOlive got a queer feeling herself, as if he meant more than his words\nactually said. Could he mean to hint that _she_ was dreaming? But a\nremark from the dwarf distracted her thoughts.\n\n“Supper is ready,” he said. “They are all waiting.” And turning round,\nOlive saw before her a cottage a good deal larger than the others; in\nfact, it was almost high enough for her, with considerable stooping, to\nget in at the door. And through the windows she saw a long table neatly\ncovered with a bright blue table-cloth, and spread with numbers of\ntiny plates, and beside each plate a knife and fork and a little blue\nglass cup. Two great dishes stood on the table, one at each end. Steam\nwas rising from each, and a delicious smell came out through the open\nwindows.\n\n“I did not know I was so hungry,” thought Olive; “but I do _hope_ it\nisn’t fir-cones.”\n\n“Yes,” said the dwarf; “they’ll be better done this time.”\n\nThen he gave a sort of sharp, sudden cry or whistle, and immediately\nall the dwarfs of the village appeared as if by magic, and began\nhurrying into the house, but as soon as they were in the middle of\nthe passage they fell back at each side, leaving a clear space in the\nmiddle.\n\n“For you,” said the first dwarf, bowing politely.\n\n“Do you always have supper here altogether like that?” said Olive. “How\nfunny!”\n\n“Not at all.” said the dwarf; “it’s a table d’hôte. Be so good as to\ntake your place.”\n\nOlive bent her head cautiously in preparation for passing through the\ndoor, when again the same sharp cry startled her, and lifting her head\nsuddenly she bumped it against the lintel. The pain of the blow was\nrather severe.\n\n“What did you do that for?” she exclaimed angrily. “Why did you scream\nout like that? I——” But she said no more. The cry was repeated, and\nthis time it did its work effectually, for Olive awoke. Awoke—was it\nwaking?—to find herself all in the dark, stiff and cold, and her head\naching with the bump she had given it against the old tree-trunk, while\nfarther off now she heard the same shrill hoot or cry of some early\nastir night-bird, which had sounded before in her dreams.\n\n“Oh dear! oh dear!” she sobbed, “what shall I do? Where am I? How\ncan I ever find my way in the dark? I believe it was all a trick of\nthose nasty blue dwarfs. I don’t believe I _was_ dreaming. They must\nbe spiteful goblins. I wish I had not gone with them to see their\nvillage.” And so for some minutes, half asleep and half awake, Olive\nstayed crouching by the tree, which seemed her only protector. But\nby degrees, as her senses—her common sense particularly—came back\nto her, she began to realize that it was worse than useless to sit\nthere crying. Dark as it was, she must try to find her way back to\nthe little inn, where, doubtless, Auntie and the others were in the\ngreatest distress about her, the thought of which nearly made her burst\nout crying again; and poor Olive stumbled up to her feet as best she\ncould, fortunately not forgetting to feel for her book and parasol\nwhich were lying beside her and slowly and tremblingly made her way\non a few steps, hoping that perhaps if she could manage to get out of\nthe shadow of the trees it might not be quite so dark farther on. She\nwas not altogether disappointed. It certainly grew a very little less\nblack, but that it was a very dark night there was no denying. And,\nindeed, though it had not been dark, she would have had the greatest\ndifficulty in finding her way out of the wood, into which she had so\nthoughtlessly penetrated. Terrifying thoughts, too, began to crowd\ninto her mind, though, as I think I have shown you, she was not at\nall a timid child. But a forest on a dark night, and so far away from\neverywhere—it was enough to shake her nerves. She hoped and trusted\nthere was no fear of wolves in summer-time; but bears!—ah! as to bears\nthere was no telling. Even the hooting cries of the birds which she now\nand then again heard in the distance frightened her, and she felt that\na bat flapping against her would send her nearly out of her mind. And\nafter a while she began to lose heart—it was not quite so dark, but\nshe had not the very least idea where she was going. She kept bumping\nand knocking herself against the trunks; she was evidently not in a\npath, but wandering farther and farther among the forest trees. That\nwas about all she could feel sure of, and after two or three more vain\nefforts Olive fairly gave up, and, sinking down on the ground, again\nburst into tears.\n\n“If I but had a mariner’s compass,” she thought, her fancy wandering\noff to all the stories of lost people she had ever heard of. Then she\nfurther reflected that a compass would do her very little good if it\nwas too dark to see it, and still more as she had not the slightest\nidea whether her road lay north, south, east, or west. “If the stars\nwere out!” was her next idea; but then, I am ashamed to say, Olive’s\nideas of astronomy were limited. She could have perhaps recognized\nthe Plow and the Pole star, but she could not remember which way they\npointed. Besides, she did not feel quite sure that in Thüringen one\nwould see the same stars as in England or Paris; and, after all, as\nthere were none visible, it was no good puzzling about it, only if they\n_had_ been there it would not have seemed so lonely. Suddenly—what\nwas that in the distance? A light, a tiny light, bobbing in and out\nof sight among the trees? Could it be a star come out of its way to\ntake pity on her? Much more likely a Will-o’-the-wisp; for she did\nnot stop to reflect that a dry pine forest in summer-time is not one\nof Will-o’-the-wisp’s favorite playgrounds. It was a light, as to\nthat there was no doubt, and it was coming nearer. Whether she was\nmore frightened or glad Olive scarcely knew. Still, almost anything\nwas better than to sit there to be eaten up by bears, or to die of\nstarvation; and she eagerly watched the light now steadily approaching\nher, till it came near enough for her to see that it was a lantern\ncarried by some person not high above the ground. A boy perhaps; could\nit be—oh, joyful thought!—could it be Rex? But no; even if they\nwere all looking for her it was not likely that they would let Rex be\nrunning about alone to get lost too. Still, it must _be_ a boy, and\nwithout waiting to think more Olive called out—\n\n“Oh, please come and help me! I’m lost in the wood!” she cried,\nthinking nothing of German or anything but her sore distress.\n\nThe lantern moved about undecidedly for a moment or two, then the light\nflashed towards her and came still nearer.\n\n“_Ach Gott!_” exclaimed an unfamiliar voice, and Olive, peering\nforward, thought for half a second she was again dreaming. He was not,\ncertainly, dressed in blue, and he was a good deal taller than up to\nher knee; but still he was—there was no doubt about it—he was a\ndwarf! And another gaze at his queer little figure and bright sparkling\neyes told Olive that it was the very same little man who had smiled at\nRex and her when he saw them leaning out of the inn window that very\nafternoon.\n\nShe didn’t feel frightened; he looked so good-natured and so sorry for\nher. And somehow Olive’s faith in the possible existence of a nation of\ndwarfs had received a shock; she was much more inclined to take things\nprosaically. But it was very difficult to explain matters. I think the\ndwarf at the first moment was more inclined to take _her_ for something\nsupernatural than she was now to imagine him a brownie or a gnome.\nFor she was a pretty little girl, with a mass of golden fair hair and\nEnglish blue eyes; and with her hat half fallen off, and her cheeks\nflushed, she might have sat for a picture of a fairy who had strayed\nfrom her home.\n\nHer German seemed all to go out of her head. But she managed to\nremember the name of the village where they had been that afternoon,\nand a sudden recollection seemed to come over the dwarf. He poured out\na flood of words and exclamations, amidst which all that Olive could\nunderstand was the name of the village and the words “_verirrt_,”\n“_armes Kind_,” which she knew meant “lost” and “poor child.” Then\nhe went on to tell that he too was on his way from the same village\nto somewhere; that he came by the woods, because it was shorter, and\nlifting high his lantern, gave Olive to understand that he could now\nshow her the way.\n\nSo off she set under his guidance, and, only fancy! a walk of not more\nthan ten minutes brought them to the little inn! Olive’s wanderings\nand straying had, after all, drawn her very near her friends if she\nhad known it. Poor Auntie and Rex were running about in front of the\nhouse in great distress. Uncle and the landlord and the coachman had\nset off with lanterns, and the landlady was trying to persuade Auntie\nthat there was not _really_ anything to be afraid of; neither bears,\nnor wolves, nor evilly-disposed people about: the little young lady\nhad, doubtless, fallen asleep in the wood with the heat and fatigue of\nthe day; which, as you know, was a very good guess, though the landlady\nlittle imagined what queer places and people Olive had been visiting in\nher sleep.\n\nThe dwarf was a well-known person thereabouts, and a very harmless,\nkindly little man. A present of a couple of marks sent him off to\nhis cottage near by very happy indeed, and when Uncle returned a few\nminutes later to see if the wanderer had been heard of, you can imagine\nhow thankful he was to find her. It was not so _very_ late after all,\nnot above half-past ten o’clock, but a thunderstorm which came on not\nlong after explained the unusual darkness of the cloud-covered sky.\n\n“_What_ a good thing you were safe before the storm came on!” said\nAuntie, with a shudder at the thought of the dangers her darling had\nescaped. “I will take care never again to carry my jokes too far,”\nshe resolved, when Olive had confided to her the real motive of her\nwanderings in the wood. And Olive, for her part, decided that she would\nbe content with fairies and dwarfs in books and fancy, without trying\nto find them in reality.\n\n“Though all the same,” she said to herself, “I should have liked to\ntaste the roast fir-cones. They did smell so good!” “And, Auntie,” she\nsaid aloud, “were you singing in the wood on your way home with Uncle\nand Rex?”\n\n“Yes,” said Auntie, “they begged me to sing ‘Home, sweet Home.’ Why do\nyou ask me?”\n\nOlive explained. “So it was _your_ voice I heard when I thought it was\nthe dwarfs,” she said, smiling.\n\nAnd Auntie gave her still another kiss.\n\n\n                               THE END.\n\n\n",
  "version": {
    "clic": "v2.1.2",
    "clic-import": "v2.0.3-beta2",
    "corpora": "2a3a120"
  },
  "data": [
    [
      "chapter.title",
      163,
      171,
      1
    ],
    [
      "chapter.title",
      2407,
      2436,
      2
    ],
    [
      "chapter.title",
      13773,
      13803,
      3
    ],
    [
      "chapter.title",
      21064,
      21094,
      4
    ],
    [
      "chapter.title",
      28453,
      28484,
      5
    ],
    [
      "chapter.title",
      36969,
      36990,
      6
    ],
    [
      "chapter.title",
      45076,
      45111,
      7
    ],
    [
      "chapter.title",
      51903,
      51923,
      8
    ],
    [
      "chapter.title",
      59290,
      59327,
      9
    ],
    [
      "chapter.title",
      65322,
      65366,
      10
    ],
    [
      "chapter.title",
      74422,
      74452,
      11
    ],
    [
      "chapter.title",
      85389,
      85433,
      12
    ],
    [
      "chapter.title",
      96270,
      96301,
      13
    ],
    [
      "chapter.title",
      102956,
      102993,
      14
    ],
    [
      "chapter.title",
      110472,
      110511,
      15
    ],
    [
      "chapter.title",
      117032,
      117071,
      16
    ],
    [
      "chapter.title",
      124995,
      125020,
      17
    ]
  ]
}